
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录6 比特币白皮书 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appdx-segwit.html" />
    
    
    <link rel="prev" href="appdx-scriptops.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >附录6 比特币白皮书</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9644;&#x5F55;1&#x3001;&#x6BD4;&#x7279;&#x5E01;&#x767D;&#x76AE;&#x4E66;&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x767D;&#x76AE;&#x4E66;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;">&#x9644;&#x5F55;1&#x3001;&#x6BD4;&#x7279;&#x5E01;&#x767D;&#x76AE;&#x4E66;&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x767D;&#x76AE;&#x4E66;&#xFF1A;&#x4E00;&#x79CD;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;</h1>
<p><strong>&#x539F;&#x6587;&#x4F5C;&#x8005;&#xFF1A;&#x4E2D;&#x672C;&#x806A;&#xFF08;Satoshi Nakamoto&#xFF09;</strong></p>
<p><strong>&#x4F5C;&#x8005;&#x90AE;&#x7BB1;&#xFF1A;Satoshin@gmx.com</strong></p>
<p><strong>&#x6267;&#x884C;&#x7FFB;&#x8BD1;&#xFF1A;8btc.com  &#x5DF4;&#x6BD4;&#x7279; QQagent</strong></p>
<blockquote>
<p>[&#x6458;&#x8981;]&#xFF1A;&#x672C;&#x6587;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x5B8C;&#x5168;&#x901A;&#x8FC7;&#x70B9;&#x5BF9;&#x70B9;&#x6280;&#x672F;&#x5B9E;&#x73B0;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4F7F;&#x5F97;&#x5728;&#x7EBF;&#x652F;&#x4ED8;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x7531;&#x4E00;&#x65B9;&#x53D1;&#x8D77;&#x5E76;&#x652F;&#x4ED8;&#x7ED9;&#x53E6;&#x5916;&#x4E00;&#x65B9;&#xFF0C;&#x4E2D;&#x95F4;&#x4E0D;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x4EFB;&#x4F55;&#x7684;&#x91D1;&#x878D;&#x673A;&#x6784;&#x3002;&#x867D;&#x7136;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF08;Digital signatures&#xFF09;&#x90E8;&#x5206;&#x89E3;&#x51B3;&#x4E86;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4ECD;&#x7136;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x65B9;&#x7684;&#x652F;&#x6301;&#x624D;&#x80FD;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#xFF08;double-spending&#xFF09;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x4E5F;&#x5C31;&#x5931;&#x53BB;&#x4E86;&#x5B58;&#x5728;&#x7684;&#x4EF7;&#x503C;&#x3002;&#x6211;&#x4EEC;(we)&#x5728;&#x6B64;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x4F7F;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;&#x5728;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x73AF;&#x5883;&#x4E0B;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#x3002;&#x8BE5;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x968F;&#x673A;&#x6563;&#x5217;&#xFF08;hashing&#xFF09;&#x5BF9;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x52A0;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#xFF08;timestamps&#xFF09;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x5408;&#x5E76;&#x5165;&#x4E00;&#x4E2A;&#x4E0D;&#x65AD;&#x5EF6;&#x4F38;&#x7684;&#x57FA;&#x4E8E;&#x968F;&#x673A;&#x6563;&#x5217;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;proof-of-work&#xFF09;&#x7684;&#x94FE;&#x6761;&#x4F5C;&#x4E3A;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#xFF0C;&#x9664;&#x975E;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x5168;&#x90E8;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x5F62;&#x6210;&#x7684;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x5C06;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#x3002;&#x6700;&#x957F;&#x7684;&#x94FE;&#x6761;&#x4E0D;&#x4EC5;&#x5C06;&#x4F5C;&#x4E3A;&#x88AB;&#x89C2;&#x5BDF;&#x5230;&#x7684;&#x4E8B;&#x4EF6;&#x5E8F;&#x5217;&#xFF08;sequence&#xFF09;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x800C;&#x4E14;&#x88AB;&#x770B;&#x505A;&#x662F;&#x6765;&#x81EA;CPU&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x6700;&#x5927;&#x7684;&#x6C60;&#xFF08;pool&#xFF09;&#x3002;&#x53EA;&#x8981;&#x5927;&#x591A;&#x6570;&#x7684;CPU&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x90FD;&#x6CA1;&#x6709;&#x6253;&#x7B97;&#x5408;&#x4F5C;&#x8D77;&#x6765;&#x5BF9;&#x5168;&#x7F51;&#x8FDB;&#x884C;&#x653B;&#x51FB;&#xFF0C;&#x90A3;&#x4E48;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x751F;&#x6210;&#x6700;&#x957F;&#x7684;&#x3001;&#x8D85;&#x8FC7;&#x653B;&#x51FB;&#x8005;&#x7684;&#x94FE;&#x6761;&#x3002;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x672C;&#x8EAB;&#x9700;&#x8981;&#x7684;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x975E;&#x5E38;&#x5C11;&#x3002;&#x4FE1;&#x606F;&#x5C3D;&#x6700;&#x5927;&#x52AA;&#x529B;&#x5728;&#x5168;&#x7F51;&#x4F20;&#x64AD;&#x5373;&#x53EF;&#xFF0C;&#x8282;&#x70B9;(nodes)&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x79BB;&#x5F00;&#x548C;&#x91CD;&#x65B0;&#x52A0;&#x5165;&#x7F51;&#x7EDC;&#xFF0C;&#x5E76;&#x5C06;&#x6700;&#x957F;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x94FE;&#x6761;&#x4F5C;&#x4E3A;&#x5728;&#x8BE5;&#x8282;&#x70B9;&#x79BB;&#x7EBF;&#x671F;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x7684;&#x8BC1;&#x660E;&#x3002;</p>
</blockquote>
<h2 id="1-&#x7B80;&#x4ECB;">1. &#x7B80;&#x4ECB;</h2>
<p>&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x8D38;&#x6613;&#xFF0C;&#x51E0;&#x4E4E;&#x90FD;&#x9700;&#x8981;&#x501F;&#x52A9;&#x91D1;&#x878D;&#x673A;&#x6784;&#x4F5C;&#x4E3A;&#x53EF;&#x8D44;&#x4FE1;&#x8D56;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6765;&#x5904;&#x7406;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x4FE1;&#x606F;&#x3002;&#x867D;&#x7136;&#x8FD9;&#x7C7B;&#x7CFB;&#x7EDF;&#x5728;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#x90FD;&#x8FD0;&#x4F5C;&#x826F;&#x597D;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x7C7B;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x5185;&#x751F;&#x6027;&#x5730;&#x53D7;&#x5236;&#x4E8E;&#x201C;&#x57FA;&#x4E8E;&#x4FE1;&#x7528;&#x7684;&#x6A21;&#x5F0F;&#x201D;(trust based model)&#x7684;&#x5F31;&#x70B9;&#x3002;&#x6211;&#x4EEC;&#x65E0;&#x6CD5;&#x5B9E;&#x73B0;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x91D1;&#x878D;&#x673A;&#x6784;&#x603B;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x5730;&#x4F1A;&#x51FA;&#x9762;&#x534F;&#x8C03;&#x4E89;&#x7AEF;&#x3002;&#x800C;&#x91D1;&#x878D;&#x4E2D;&#x4ECB;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E5F;&#x4F1A;&#x589E;&#x52A0;&#x4EA4;&#x6613;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x9650;&#x5236;&#x4E86;&#x5B9E;&#x9645;&#x53EF;&#x884C;&#x7684;&#x6700;&#x5C0F;&#x4EA4;&#x6613;&#x89C4;&#x6A21;&#xFF0C;&#x4E5F;&#x9650;&#x5236;&#x4E86;&#x65E5;&#x5E38;&#x7684;&#x5C0F;&#x989D;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x3002;&#x5E76;&#x4E14;&#x6F5C;&#x5728;&#x7684;&#x635F;&#x5931;&#x8FD8;&#x5728;&#x4E8E;&#xFF0C;&#x5F88;&#x591A;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x672C;&#x8EAB;&#x662F;&#x65E0;&#x6CD5;&#x9000;&#x8D27;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x7F3A;&#x4E4F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#x652F;&#x4ED8;&#x624B;&#x6BB5;&#xFF0C;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x8D38;&#x6613;&#x5C31;&#x5927;&#x5927;&#x53D7;&#x9650;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x6F5C;&#x5728;&#x7684;&#x9000;&#x6B3E;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x5C31;&#x9700;&#x8981;&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x62E5;&#x6709;&#x4FE1;&#x4EFB;&#x3002;&#x800C;&#x5546;&#x5BB6;&#x4E5F;&#x5FC5;&#x987B;&#x63D0;&#x9632;&#x81EA;&#x5DF1;&#x7684;&#x5BA2;&#x6237;&#xFF0C;&#x56E0;&#x6B64;&#x4F1A;&#x5411;&#x5BA2;&#x6237;&#x7D22;&#x53D6;&#x5B8C;&#x5168;&#x4E0D;&#x5FC5;&#x8981;&#x7684;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#x3002;&#x800C;&#x5B9E;&#x9645;&#x7684;&#x5546;&#x4E1A;&#x884C;&#x4E3A;&#x4E2D;&#xFF0C;&#x4E00;&#x5B9A;&#x6BD4;&#x4F8B;&#x7684;&#x6B3A;&#x8BC8;&#x6027;&#x5BA2;&#x6237;&#x4E5F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x76F8;&#x5173;&#x635F;&#x5931;&#x89C6;&#x4F5C;&#x9500;&#x552E;&#x8D39;&#x7528;&#x5904;&#x7406;&#x3002;&#x800C;&#x5728;&#x4F7F;&#x7528;&#x7269;&#x7406;&#x73B0;&#x91D1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x9500;&#x552E;&#x8D39;&#x7528;&#x548C;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#x4E0A;&#x7684;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x5374;&#x662F;&#x53EF;&#x4EE5;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x6B64;&#x65F6;&#x6CA1;&#x6709;&#x7B2C;&#x4E09;&#x65B9;&#x4FE1;&#x7528;&#x4E2D;&#x4ECB;&#x7684;&#x5B58;&#x5728;&#x3002;
&#x6240;&#x4EE5;&#xFF0C;&#x6211;&#x4EEC;&#x975E;&#x5E38;&#x9700;&#x8981;&#x8FD9;&#x6837;&#x4E00;&#x79CD;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x57FA;&#x4E8E;&#x5BC6;&#x7801;&#x5B66;&#x539F;&#x7406;&#x800C;&#x4E0D;&#x57FA;&#x4E8E;&#x4FE1;&#x7528;&#xFF0C;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x53CC;&#x65B9;&#xFF0C;&#x80FD;&#x591F;&#x76F4;&#x63A5;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#xFF0C;&#x4ECE;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x7B2C;&#x4E09;&#x65B9;&#x4E2D;&#x4ECB;&#x7684;&#x53C2;&#x4E0E;&#x3002;&#x675C;&#x7EDD;&#x56DE;&#x6EDA;(reverse)&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x8FD9;&#x5C31;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x7279;&#x5B9A;&#x7684;&#x5356;&#x5BB6;&#x514D;&#x4E8E;&#x6B3A;&#x8BC8;&#xFF1B;&#x800C;&#x5BF9;&#x4E8E;&#x60F3;&#x8981;&#x4FDD;&#x62A4;&#x4E70;&#x5BB6;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x5728;&#x6B64;&#x73AF;&#x5883;&#x4E0B;&#x8BBE;&#x7ACB;&#x901A;&#x5E38;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x62C5;&#x4FDD;&#x673A;&#x5236;&#x4E5F;&#x53EF;&#x8C13;&#x8F7B;&#x677E;&#x52A0;&#x6109;&#x5FEB;&#x3002;&#x5728;&#x8FD9;&#x7BC7;&#x8BBA;&#x6587;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;(we)&#x5C06;&#x63D0;&#x51FA;&#x4E00;&#x79CD;&#x901A;&#x8FC7;&#x70B9;&#x5BF9;&#x70B9;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x6765;&#x751F;&#x6210;&#x4F9D;&#x7167;&#x65F6;&#x95F4;&#x524D;&#x540E;&#x6392;&#x5217;&#x5E76;&#x52A0;&#x4EE5;&#x8BB0;&#x5F55;&#x7684;&#x7535;&#x5B50;&#x4EA4;&#x6613;&#x8BC1;&#x660E;&#xFF0C;&#x4ECE;&#x800C;&#x89E3;&#x51B3;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#x3002;&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x6240;&#x63A7;&#x5236;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x5927;&#x4E8E;&#x6709;&#x5408;&#x4F5C;&#x5173;&#x7CFB;&#x7684;(cooperating)&#x653B;&#x51FB;&#x8005;&#x7684;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x8BE5;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<h2 id="2-&#x4EA4;&#x6613;transactions">2. &#x4EA4;&#x6613;(Transactions)</h2>
<p>&#x6211;&#x4EEC;&#x5B9A;&#x4E49;&#xFF0C;&#x4E00;&#x679A;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#xFF08;an electronic coin&#xFF09;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E32;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF1A;&#x6BCF;&#x4E00;&#x4F4D;&#x6240;&#x6709;&#x8005;&#x901A;&#x8FC7;&#x5BF9;&#x524D;&#x4E00;&#x6B21;&#x4EA4;&#x6613;&#x548C;&#x4E0B;&#x4E00;&#x4F4D;&#x62E5;&#x6709;&#x8005;&#x7684;&#x516C;&#x94A5;(Public key) &#x7B7E;&#x7F72;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6563;&#x5217;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x5E76;&#x5C06;&#x8FD9;&#x4E2A;&#x7B7E;&#x540D;&#x9644;&#x52A0;&#x5728;&#x8FD9;&#x679A;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x5C31;&#x53D1;&#x9001;&#x7ED9;&#x4E86;&#x4E0B;&#x4E00;&#x4F4D;&#x6240;&#x6709;&#x8005;&#x3002;&#x800C;&#x6536;&#x6B3E;&#x4EBA;&#x901A;&#x8FC7;&#x5BF9;&#x7B7E;&#x540D;&#x8FDB;&#x884C;&#x68C0;&#x9A8C;&#xFF0C;&#x5C31;&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x8BE5;&#x94FE;&#x6761;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/11.png" alt="1"></p>
<p>&#x8BE5;&#x8FC7;&#x7A0B;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x6536;&#x6B3E;&#x4EBA;&#x5C06;&#x96BE;&#x4EE5;&#x68C0;&#x9A8C;&#xFF0C;&#x4E4B;&#x524D;&#x7684;&#x67D0;&#x4F4D;&#x6240;&#x6709;&#x8005;&#xFF0C;&#x662F;&#x5426;&#x5BF9;&#x8FD9;&#x679A;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x8FDB;&#x884C;&#x4E86;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x901A;&#x5E38;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x5C31;&#x662F;&#x5F15;&#x5165;&#x4FE1;&#x5F97;&#x8FC7;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x6743;&#x5A01;&#xFF0C;&#x6216;&#x8005;&#x7C7B;&#x4F3C;&#x4E8E;&#x9020;&#x5E01;&#x5382;(mint)&#x7684;&#x673A;&#x6784;&#xFF0C;&#x6765;&#x5BF9;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x68C0;&#x9A8C;&#xFF0C;&#x4EE5;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x5728;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7ED3;&#x675F;&#x540E;&#xFF0C;&#x8FD9;&#x679A;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x5C31;&#x8981;&#x88AB;&#x9020;&#x5E01;&#x5382;&#x56DE;&#x6536;&#xFF0C;&#x800C;&#x9020;&#x5E01;&#x5382;&#x5C06;&#x53D1;&#x884C;&#x4E00;&#x679A;&#x65B0;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#xFF1B;&#x800C;&#x53EA;&#x6709;&#x9020;&#x5E01;&#x5382;&#x76F4;&#x63A5;&#x53D1;&#x884C;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#xFF0C;&#x624D;&#x7B97;&#x4F5C;&#x6709;&#x6548;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x80FD;&#x591F;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x53EF;&#x662F;&#x8BE5;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x95EE;&#x9898;&#x5728;&#x4E8E;&#xFF0C;&#x6574;&#x4E2A;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x547D;&#x8FD0;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD0;&#x4F5C;&#x9020;&#x5E01;&#x5382;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x90FD;&#x8981;&#x7ECF;&#x8FC7;&#x8BE5;&#x9020;&#x5E01;&#x5382;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x800C;&#x8BE5;&#x9020;&#x5E01;&#x5382;&#x5C31;&#x597D;&#x6BD4;&#x662F;&#x4E00;&#x5BB6;&#x94F6;&#x884C;&#x3002;
&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6536;&#x6B3E;&#x4EBA;&#x6709;&#x67D0;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x80FD;&#x591F;&#x786E;&#x4FDD;&#x4E4B;&#x524D;&#x7684;&#x6240;&#x6709;&#x8005;&#x6CA1;&#x6709;&#x5BF9;&#x66F4;&#x65E9;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x5B9E;&#x65BD;&#x7B7E;&#x540D;&#x3002;&#x4ECE;&#x903B;&#x8F91;&#x4E0A;&#x770B;&#xFF0C;&#x4E3A;&#x4E86;&#x8FBE;&#x5230;&#x76EE;&#x7684;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x7684;&#x53EA;&#x662F;&#x4E8E;&#x672C;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5173;&#x6CE8;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#x4E4B;&#x540E;&#x662F;&#x5426;&#x4F1A;&#x6709;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x7684;&#x5C1D;&#x8BD5;&#x3002;&#x4E3A;&#x4E86;&#x786E;&#x4FDD;&#x67D0;&#x4E00;&#x6B21;&#x4EA4;&#x6613;&#x662F;&#x4E0D;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x552F;&#x4E00;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x83B7;&#x6089;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x8FC7;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x9020;&#x5E01;&#x5382;&#x6A21;&#x578B;&#x91CC;&#x9762;&#xFF0C;&#x9020;&#x5E01;&#x5382;&#x83B7;&#x6089;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x51B3;&#x5B9A;&#x4E86;&#x4EA4;&#x6613;&#x5B8C;&#x6210;&#x7684;&#x5148;&#x540E;&#x987A;&#x5E8F;&#x3002;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5728;&#x7535;&#x5B50;&#x7CFB;&#x7EDF;&#x4E2D;&#x6392;&#x9664;&#x7B2C;&#x4E09;&#x65B9;&#x4E2D;&#x4ECB;&#x673A;&#x6784;&#xFF0C;&#x90A3;&#x4E48;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x5C31;&#x5E94;&#x5F53;&#x88AB;&#x516C;&#x5F00;&#x5BA3;&#x5E03;&#xFF08;publicly announced&#xFF09;<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-1" target="_blank">[1]</a> &#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5185;&#x7684;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x90FD;&#x6709;&#x552F;&#x4E00;&#x516C;&#x8BA4;&#x7684;&#x5386;&#x53F2;&#x4EA4;&#x6613;&#x5E8F;&#x5217;&#x3002;&#x6536;&#x6B3E;&#x4EBA;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x5728;&#x4EA4;&#x6613;&#x671F;&#x95F4;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x8BA4;&#x540C;&#x8BE5;&#x4EA4;&#x6613;&#x662F;&#x9996;&#x6B21;&#x51FA;&#x73B0;&#x3002;</p>
<h2 id="3-&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;timestamp-server">3. &#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;(Timestamp server)</h2>
<p>&#x672C;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x9996;&#x5148;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x201C;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x201D;&#x3002;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x5BF9;&#x4EE5;&#x533A;&#x5757;(block)&#x5F62;&#x5F0F;&#x5B58;&#x5728;&#x7684;&#x4E00;&#x7EC4;&#x6570;&#x636E;&#x5B9E;&#x65BD;&#x968F;&#x673A;&#x6563;&#x5217;&#x800C;&#x52A0;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x5E76;&#x5C06;&#x8BE5;&#x968F;&#x673A;&#x6563;&#x5217;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x65B0;&#x95FB;&#x6216;&#x4E16;&#x754C;&#x6027;&#x65B0;&#x95FB;&#x7EC4;&#x7F51;&#x7EDC;&#xFF08;Usenet&#xFF09;&#x7684;&#x53D1;&#x5E16;&#x4E00;&#x6837;<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-2" target="_blank">[2]</a><a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-3" target="_blank">[3]</a><a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-4" target="_blank">[4]</a><a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-5" target="_blank">[5]</a> &#x3002;&#x663E;&#x7136;&#xFF0C;&#x8BE5;&#x65F6;&#x95F4;&#x6233;&#x80FD;&#x591F;&#x8BC1;&#x5B9E;&#x7279;&#x5B9A;&#x6570;&#x636E;&#x5FC5;&#x7136;&#x4E8E;&#x67D0;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x662F;&#x7684;&#x786E;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x5728;&#x8BE5;&#x65F6;&#x523B;&#x5B58;&#x5728;&#x4E86;&#x624D;&#x80FD;&#x83B7;&#x53D6;&#x76F8;&#x5E94;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x3002;&#x6BCF;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x5E94;&#x5F53;&#x5C06;&#x524D;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x7EB3;&#x5165;&#x5176;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x968F;&#x540E;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x90FD;&#x5BF9;&#x4E4B;&#x524D;&#x7684;&#x4E00;&#x4E2A;&#x65F6;&#x95F4;&#x6233;&#x8FDB;&#x884C;&#x589E;&#x5F3A;(reinforcing)&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x94FE;&#x6761;&#xFF08;Chain&#xFF09;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/21.png" alt="2"></p>
<h2 id="4-&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;proof-of-work&#xFF09;">4. &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;Proof-of-Work&#xFF09;</h2>
<p>&#x4E3A;&#x4E86;&#x5728;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x6784;&#x5EFA;&#x4E00;&#x7EC4;&#x5206;&#x6563;&#x5316;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x4EC5;&#x4EC5;&#x50CF;&#x62A5;&#x7EB8;&#x6216;&#x4E16;&#x754C;&#x6027;&#x65B0;&#x95FB;&#x7F51;&#x7EDC;&#x7EC4;&#x4E00;&#x6837;&#x5DE5;&#x4F5C;&#x662F;&#x4E0D;&#x591F;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x8FD8;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E9A;&#x5F53;&#x2022;&#x67CF;&#x514B;&#xFF08;Adam Back&#xFF09;&#x63D0;&#x51FA;&#x7684;&#x54C8;&#x5E0C;&#x73B0;&#x91D1;&#xFF08;Hashcash&#xFF09;<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-6" target="_blank">[6]</a> &#x3002;&#x5728;&#x8FDB;&#x884C;&#x968F;&#x673A;&#x6563;&#x5217;&#x8FD0;&#x7B97;&#x65F6;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x5F15;&#x5165;&#x4E86;&#x5BF9;&#x67D0;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x503C;&#x7684;&#x626B;&#x63CF;&#x5DE5;&#x4F5C;&#xFF0C;&#x6BD4;&#x65B9;&#x8BF4;SHA-256&#x4E0B;&#xFF0C;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x4EE5;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;0&#x5F00;&#x59CB;&#x3002;&#x90A3;&#x4E48;&#x968F;&#x7740;0&#x7684;&#x6570;&#x76EE;&#x7684;&#x4E0A;&#x5347;, &#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x89E3;&#x6240;&#x9700;&#x8981;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5C06;&#x5448;&#x6307;&#x6570;&#x589E;&#x957F;&#xFF0C;&#x800C;&#x5BF9;&#x7ED3;&#x679C;&#x8FDB;&#x884C;&#x68C0;&#x9A8C;&#x5219;&#x4EC5;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x968F;&#x673A;&#x6563;&#x5217;&#x8FD0;&#x7B97;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x8865;&#x589E;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;(Nonce)&#xFF0C;&#x8FD9;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x8981;&#x4F7F;&#x5F97;&#x8BE5;&#x7ED9;&#x5B9A;&#x533A;&#x5757;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x51FA;&#x73B0;&#x4E86;&#x6240;&#x9700;&#x7684;&#x90A3;&#x4E48;&#x591A;&#x4E2A;0&#x3002;&#x6211;&#x4EEC;&#x901A;&#x8FC7;&#x53CD;&#x590D;&#x5C1D;&#x8BD5;&#x6765;&#x627E;&#x5230;&#x8FD9;&#x4E2A;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E3A;&#x6B62;&#xFF0C;&#x8FD9;&#x6837;&#x6211;&#x4EEC;&#x5C31;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x3002;&#x53EA;&#x8981;&#x8BE5;CPU&#x8017;&#x8D39;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x8BE5;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x9664;&#x975E;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x76F8;&#x5F53;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x4FE1;&#x606F;&#x5C31;&#x4E0D;&#x53EF;&#x66F4;&#x6539;&#x3002;&#x7531;&#x4E8E;&#x4E4B;&#x540E;&#x7684;&#x533A;&#x5757;&#x662F;&#x94FE;&#x63A5;&#x5728;&#x8BE5;&#x533A;&#x5757;&#x4E4B;&#x540E;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x60F3;&#x8981;&#x66F4;&#x6539;&#x8BE5;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x5C31;&#x8FD8;&#x9700;&#x8981;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x4E4B;&#x540E;&#x6240;&#x6709;&#x533A;&#x5757;&#x7684;&#x5168;&#x90E8;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/31.png" alt="3"></p>
<p>&#x540C;&#x65F6;&#xFF0C;&#x8BE5;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x8FD8;&#x89E3;&#x51B3;&#x4E86;&#x5728;&#x96C6;&#x4F53;&#x6295;&#x7968;&#x8868;&#x51B3;&#x65F6;&#xFF0C;&#x8C01;&#x662F;&#x5927;&#x591A;&#x6570;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5982;&#x679C;&#x51B3;&#x5B9A;&#x5927;&#x591A;&#x6570;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x57FA;&#x4E8E;IP&#x5730;&#x5740;&#x7684;&#xFF0C;&#x4E00;IP&#x5730;&#x5740;&#x4E00;&#x7968;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x62E5;&#x6709;&#x5206;&#x914D;&#x5927;&#x91CF;IP&#x5730;&#x5740;&#x7684;&#x6743;&#x529B;&#xFF0C;&#x5219;&#x8BE5;&#x673A;&#x5236;&#x5C31;&#x88AB;&#x7834;&#x574F;&#x4E86;&#x3002;&#x800C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x7684;&#x672C;&#x8D28;&#x5219;&#x662F;&#x4E00;CPU&#x4E00;&#x7968;&#x3002;&#x201C;&#x5927;&#x591A;&#x6570;&#x201D;&#x7684;&#x51B3;&#x5B9A;&#x8868;&#x8FBE;&#x4E3A;&#x6700;&#x957F;&#x7684;&#x94FE;&#xFF0C;&#x56E0;&#x4E3A;&#x6700;&#x957F;&#x7684;&#x94FE;&#x5305;&#x542B;&#x4E86;&#x6700;&#x5927;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x5982;&#x679C;&#x5927;&#x591A;&#x6570;&#x7684;CPU&#x4E3A;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x63A7;&#x5236;&#xFF0C;&#x90A3;&#x4E48;&#x8BDA;&#x5B9E;&#x7684;&#x94FE;&#x6761;&#x5C06;&#x4EE5;&#x6700;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x5EF6;&#x957F;&#xFF0C;&#x5E76;&#x8D85;&#x8D8A;&#x5176;&#x4ED6;&#x7684;&#x7ADE;&#x4E89;&#x94FE;&#x6761;&#x3002;&#x5982;&#x679C;&#x60F3;&#x8981;&#x5BF9;&#x4E1A;&#x5DF2;&#x51FA;&#x73B0;&#x7684;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x4FEE;&#x6539;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5FC5;&#x987B;&#x91CD;&#x65B0;&#x5B8C;&#x6210;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5916;&#x52A0;&#x8BE5;&#x533A;&#x5757;&#x4E4B;&#x540E;&#x6240;&#x6709;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x8D76;&#x4E0A;&#x548C;&#x8D85;&#x8D8A;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x540E;&#x6587;&#x8BC1;&#x660E;&#xFF0C;&#x8BBE;&#x60F3;&#x4E00;&#x4E2A;&#x8F83;&#x6162;&#x7684;&#x653B;&#x51FB;&#x8005;&#x8BD5;&#x56FE;&#x8D76;&#x4E0A;&#x968F;&#x540E;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x6210;&#x529F;&#x6982;&#x7387;&#x5C06;&#x5448;&#x6307;&#x6570;&#x5316;&#x9012;&#x51CF;&#x3002;
&#x53E6;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x786C;&#x4EF6;&#x7684;&#x8FD0;&#x7B97;&#x901F;&#x5EA6;&#x5728;&#x9AD8;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x800C;&#x8282;&#x70B9;&#x53C2;&#x4E0E;&#x7F51;&#x7EDC;&#x7684;&#x7A0B;&#x5EA6;&#x5219;&#x4F1A;&#x6709;&#x6240;&#x8D77;&#x4F0F;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x96BE;&#x5EA6;(the proof-of-work difficulty)&#x5C06;&#x91C7;&#x7528;&#x79FB;&#x52A8;&#x5E73;&#x5747;&#x76EE;&#x6807;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x786E;&#x5B9A;&#xFF0C;&#x5373;&#x4EE4;&#x96BE;&#x5EA6;&#x6307;&#x5411;&#x4EE4;&#x6BCF;&#x5C0F;&#x65F6;&#x751F;&#x6210;&#x533A;&#x5757;&#x7684;&#x901F;&#x5EA6;&#x4E3A;&#x67D0;&#x4E00;&#x4E2A;&#x9884;&#x5B9A;&#x7684;&#x5E73;&#x5747;&#x6570;&#x3002;&#x5982;&#x679C;&#x533A;&#x5757;&#x751F;&#x6210;&#x7684;&#x901F;&#x5EA6;&#x8FC7;&#x5FEB;&#xFF0C;&#x90A3;&#x4E48;&#x96BE;&#x5EA6;&#x5C31;&#x4F1A;&#x63D0;&#x9AD8;&#x3002;</p>
<h2 id="5-&#x7F51;&#x7EDC;">5. &#x7F51;&#x7EDC;</h2>
<p>&#x8FD0;&#x884C;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x6B65;&#x9AA4;&#x5982;&#x4E0B;&#xFF1A;</p>
<ul>
<li>1) &#x65B0;&#x7684;&#x4EA4;&#x6613;&#x5411;&#x5168;&#x7F51;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF1B;</li>
<li>2) &#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5C06;&#x6536;&#x5230;&#x7684;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7EB3;&#x5165;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#xFF1B;</li>
<li>3) &#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x5C1D;&#x8BD5;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x96BE;&#x5EA6;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF1B;</li>
<li>4) &#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x5B83;&#x5C31;&#x5411;&#x5168;&#x7F51;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF1B;</li>
<li>5) &#x5F53;&#x4E14;&#x4EC5;&#x5F53;&#x5305;&#x542B;&#x5728;&#x8BE5;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#x4E14;&#x4E4B;&#x524D;&#x672A;&#x5B58;&#x5728;&#x8FC7;&#x7684;&#xFF0C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x624D;&#x8BA4;&#x540C;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF1B;</li>
<li>6) &#x5176;&#x4ED6;&#x8282;&#x70B9;&#x8868;&#x793A;&#x4ED6;&#x4EEC;&#x63A5;&#x53D7;&#x8BE5;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x8868;&#x793A;&#x63A5;&#x53D7;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5219;&#x662F;&#x5728;&#x8DDF;&#x968F;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x672B;&#x5C3E;&#xFF0C;&#x5236;&#x9020;&#x65B0;&#x7684;&#x533A;&#x5757;&#x4EE5;&#x5EF6;&#x957F;&#x8BE5;&#x94FE;&#x6761;&#xFF0C;&#x800C;&#x5C06;&#x88AB;&#x63A5;&#x53D7;&#x533A;&#x5757;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x89C6;&#x4E3A;&#x5148;&#x4E8E;&#x65B0;&#x533A;&#x5FEB;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x3002;</li>
</ul>
<p>&#x8282;&#x70B9;&#x59CB;&#x7EC8;&#x90FD;&#x5C06;&#x6700;&#x957F;&#x7684;&#x94FE;&#x6761;&#x89C6;&#x4E3A;&#x6B63;&#x786E;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x5E76;&#x6301;&#x7EED;&#x5DE5;&#x4F5C;&#x548C;&#x5EF6;&#x957F;&#x5B83;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E24;&#x4E2A;&#x8282;&#x70B9;&#x540C;&#x65F6;&#x5E7F;&#x64AD;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x6536;&#x5230;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x4E0A;&#x5C06;&#x5B58;&#x5728;&#x5148;&#x540E;&#x5DEE;&#x522B;&#x3002;&#x5F53;&#x6B64;&#x60C5;&#x5F62;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x5728;&#x7387;&#x5148;&#x6536;&#x5230;&#x7684;&#x533A;&#x5757;&#x57FA;&#x7840;&#x4E0A;&#x8FDB;&#x884C;&#x5DE5;&#x4F5C;&#xFF0C;&#x4F46;&#x4E5F;&#x4F1A;&#x4FDD;&#x7559;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x94FE;&#x6761;&#xFF0C;&#x4EE5;&#x9632;&#x540E;&#x8005;&#x53D8;&#x6210;&#x6700;&#x957F;&#x7684;&#x94FE;&#x6761;&#x3002;&#x8BE5;&#x50F5;&#x5C40;&#xFF08;tie&#xFF09;&#x7684;&#x6253;&#x7834;&#x8981;&#x7B49;&#x5230;&#x4E0B;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x88AB;&#x53D1;&#x73B0;&#xFF0C;&#x800C;&#x5176;&#x4E2D;&#x7684;&#x4E00;&#x6761;&#x94FE;&#x6761;&#x88AB;&#x8BC1;&#x5B9E;&#x4E3A;&#x662F;&#x8F83;&#x957F;&#x7684;&#x4E00;&#x6761;&#xFF0C;&#x90A3;&#x4E48;&#x5728;&#x53E6;&#x4E00;&#x6761;&#x5206;&#x652F;&#x94FE;&#x6761;&#x4E0A;&#x5DE5;&#x4F5C;&#x7684;&#x8282;&#x70B9;&#x5C06;&#x8F6C;&#x6362;&#x9635;&#x8425;&#xFF0C;&#x5F00;&#x59CB;&#x5728;&#x8F83;&#x957F;&#x7684;&#x94FE;&#x6761;&#x4E0A;&#x5DE5;&#x4F5C;&#x3002;
&#x6240;&#x8C13;&#x201C;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x8981;&#x5E7F;&#x64AD;&#x201D;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x4E0D;&#x9700;&#x8981;&#x62B5;&#x8FBE;&#x5168;&#x90E8;&#x7684;&#x8282;&#x70B9;&#x3002;&#x53EA;&#x8981;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x80FD;&#x591F;&#x62B5;&#x8FBE;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x5C06;&#x5F88;&#x5FEB;&#x88AB;&#x6574;&#x5408;&#x8FDB;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x3002;&#x800C;&#x533A;&#x5757;&#x7684;&#x5E7F;&#x64AD;&#x5BF9;&#x88AB;&#x4E22;&#x5F03;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x5177;&#x6709;&#x5BB9;&#x9519;&#x80FD;&#x529B;&#x7684;&#x3002;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x67D0;&#x7279;&#x5B9A;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x8BE5;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7F3A;&#x5931;&#x4E86;&#x67D0;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x4E5F;&#x5C31;&#x53EF;&#x4EE5;&#x63D0;&#x51FA;&#x81EA;&#x5DF1;&#x4E0B;&#x8F7D;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x8BF7;&#x6C42;&#x3002;</p>
<h2 id="6-&#x6FC0;&#x52B1;">6. &#x6FC0;&#x52B1;</h2>
<p>&#x6211;&#x4EEC;&#x7EA6;&#x5B9A;&#x5982;&#x6B64;&#xFF1A;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x7279;&#x6B8A;&#x5316;&#x5904;&#x7406;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x4EA7;&#x751F;&#x4E00;&#x679A;&#x7531;&#x8BE5;&#x533A;&#x5757;&#x521B;&#x9020;&#x8005;&#x62E5;&#x6709;&#x7684;&#x65B0;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x589E;&#x52A0;&#x4E86;&#x8282;&#x70B9;&#x652F;&#x6301;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x6FC0;&#x52B1;&#xFF0C;&#x5E76;&#x5728;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x673A;&#x6784;&#x53D1;&#x884C;&#x8D27;&#x5E01;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x5C06;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x5206;&#x914D;&#x5230;&#x6D41;&#x901A;&#x9886;&#x57DF;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x79CD;&#x5C06;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x65B0;&#x8D27;&#x5E01;&#x6301;&#x7EED;&#x589E;&#x6DFB;&#x5230;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;&#x8017;&#x8D39;&#x8D44;&#x6E90;&#x53BB;&#x6316;&#x6398;&#x91D1;&#x77FF;&#x5E76;&#x5C06;&#x9EC4;&#x91D1;&#x6CE8;&#x5165;&#x5230;&#x6D41;&#x901A;&#x9886;&#x57DF;&#x3002;&#x6B64;&#x65F6;&#xFF0C;CPU&#x7684;&#x65F6;&#x95F4;&#x548C;&#x7535;&#x529B;&#x6D88;&#x8017;&#x5C31;&#x662F;&#x6D88;&#x8017;&#x7684;&#x8D44;&#x6E90;&#x3002;
&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x6FC0;&#x52B1;&#x7684;&#x6765;&#x6E90;&#x5219;&#x662F;&#x4EA4;&#x6613;&#x8D39;&#xFF08;transaction fees&#xFF09;&#x3002;&#x5982;&#x679C;&#x67D0;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x503C;&#x5C0F;&#x4E8E;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x90A3;&#x4E48;&#x5DEE;&#x989D;&#x5C31;&#x662F;&#x4EA4;&#x6613;&#x8D39;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x8D39;&#x5C06;&#x88AB;&#x589E;&#x52A0;&#x5230;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x6FC0;&#x52B1;&#x4E2D;&#x3002;&#x53EA;&#x8981;&#x65E2;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x5DF2;&#x7ECF;&#x8FDB;&#x5165;&#x6D41;&#x901A;&#xFF0C;&#x90A3;&#x4E48;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x5C31;&#x53EF;&#x4EE5;&#x9010;&#x6E10;&#x8F6C;&#x6362;&#x4E3A;&#x5B8C;&#x5168;&#x4F9D;&#x9760;&#x4EA4;&#x6613;&#x8D39;&#xFF0C;&#x90A3;&#x4E48;&#x672C;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x5C31;&#x80FD;&#x591F;&#x514D;&#x4E8E;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x3002;
&#x6FC0;&#x52B1;&#x7CFB;&#x7EDF;&#x4E5F;&#x6709;&#x52A9;&#x4E8E;&#x9F13;&#x52B1;&#x8282;&#x70B9;&#x4FDD;&#x6301;&#x8BDA;&#x5B9E;&#x3002;&#x5982;&#x679C;&#x6709;&#x4E00;&#x4E2A;&#x8D2A;&#x5A6A;&#x7684;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x8C03;&#x96C6;&#x6BD4;&#x6240;&#x6709;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x52A0;&#x8D77;&#x6765;&#x8FD8;&#x8981;&#x591A;&#x7684;CPU&#x8BA1;&#x7B97;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x9762;&#x4E34;&#x4E00;&#x4E2A;&#x9009;&#x62E9;&#xFF1A;&#x8981;&#x4E48;&#x5C06;&#x5176;&#x7528;&#x4E8E;&#x8BDA;&#x5B9E;&#x5DE5;&#x4F5C;&#x4EA7;&#x751F;&#x65B0;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x5176;&#x7528;&#x4E8E;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x652F;&#x4ED8;&#x653B;&#x51FB;&#x3002;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x4F1A;&#x53D1;&#x73B0;&#xFF0C;&#x6309;&#x7167;&#x89C4;&#x5219;&#x884C;&#x4E8B;&#x3001;&#x8BDA;&#x5B9E;&#x5DE5;&#x4F5C;&#x662F;&#x66F4;&#x6709;&#x5229;&#x53EF;&#x56FE;&#x7684;&#x3002;&#x56E0;&#x4E3A;&#x8BE5;&#x7B49;&#x89C4;&#x5219;&#x4F7F;&#x5F97;&#x4ED6;&#x80FD;&#x591F;&#x62E5;&#x6709;&#x66F4;&#x591A;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7834;&#x574F;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F7F;&#x5F97;&#x5176;&#x81EA;&#x8EAB;&#x8D22;&#x5BCC;&#x7684;&#x6709;&#x6548;&#x6027;&#x53D7;&#x635F;&#x3002;</p>
<h2 id="7-&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;">7. &#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;</h2>
<p>&#x5982;&#x679C;&#x6700;&#x8FD1;&#x7684;&#x4EA4;&#x6613;&#x5DF2;&#x7ECF;&#x88AB;&#x7EB3;&#x5165;&#x4E86;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x533A;&#x5757;&#x4E4B;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x4E22;&#x5F03;&#x8BE5;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4EE5;&#x56DE;&#x6536;&#x786C;&#x76D8;&#x7A7A;&#x95F4;&#x3002;&#x4E3A;&#x4E86;&#x540C;&#x65F6;&#x786E;&#x4FDD;&#x4E0D;&#x635F;&#x5BB3;&#x533A;&#x5757;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#xFF0C;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x88AB;&#x968F;&#x673A;&#x6563;&#x5217;&#x65F6;&#xFF0C;&#x88AB;&#x6784;&#x5EFA;&#x6210;&#x4E00;&#x79CD;Merkle&#x6811;&#xFF08;Merkle tree&#xFF09;<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-7" target="_blank">[7]</a> &#x7684;&#x5F62;&#x6001;&#xFF0C;&#x4F7F;&#x5F97;&#x53EA;&#x6709;&#x6839;(root)&#x88AB;&#x7EB3;&#x5165;&#x4E86;&#x533A;&#x5757;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x8BE5;&#x6811;&#xFF08;tree&#xFF09;&#x7684;&#x5206;&#x652F;&#x62D4;&#x9664;&#xFF08;stubbing&#xFF09;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8001;&#x533A;&#x5757;&#x5C31;&#x80FD;&#x88AB;&#x538B;&#x7F29;&#x3002;&#x800C;&#x5185;&#x90E8;&#x7684;&#x968F;&#x673A;&#x6563;&#x5217;&#x503C;&#x662F;&#x4E0D;&#x5FC5;&#x4FDD;&#x5B58;&#x7684;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/41.png" alt="4"></p>
<p>&#x4E0D;&#x542B;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x533A;&#x5757;&#x5934;&#xFF08;Block header&#xFF09;&#x5927;&#x5C0F;&#x4EC5;&#x6709;80&#x5B57;&#x8282;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x8BBE;&#x5B9A;&#x533A;&#x5757;&#x751F;&#x6210;&#x7684;&#x901F;&#x7387;&#x4E3A;&#x6BCF;10&#x5206;&#x949F;&#x4E00;&#x4E2A;&#xFF0C;&#x90A3;&#x4E48;&#x6BCF;&#x4E00;&#x5E74;&#x4EA7;&#x751F;&#x7684;&#x6570;&#x636E;&#x4F4D;4.2MB&#x3002;&#xFF08;80 bytes <em> 6 </em> 24 * 365 = 4.2MB&#xFF09;&#x3002;2008&#x5E74;&#xFF0C;PC&#x7CFB;&#x7EDF;&#x901A;&#x5E38;&#x7684;&#x5185;&#x5B58;&#x5BB9;&#x91CF;&#x4E3A;2GB&#xFF0C;&#x6309;&#x7167;&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#x7684;&#x9884;&#x8A00;&#xFF0C;&#x5373;&#x4F7F;&#x5C06;&#x5168;&#x90E8;&#x7684;&#x533A;&#x5757;&#x5934;&#x5B58;&#x50A8;&#x4E8E;&#x5185;&#x5B58;&#x4E4B;&#x4E2D;&#x90FD;&#x4E0D;&#x662F;&#x95EE;&#x9898;&#x3002;</p>
<h2 id="8-&#x7B80;&#x5316;&#x7684;&#x652F;&#x4ED8;&#x786E;&#x8BA4;&#xFF08;simplified-payment-verification&#xFF09;">8. &#x7B80;&#x5316;&#x7684;&#x652F;&#x4ED8;&#x786E;&#x8BA4;&#xFF08;Simplified Payment Verification&#xFF09;</h2>
<p>&#x5728;&#x4E0D;&#x8FD0;&#x884C;&#x5B8C;&#x6574;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x80FD;&#x591F;&#x5BF9;&#x652F;&#x4ED8;&#x8FDB;&#x884C;&#x68C0;&#x9A8C;&#x3002;&#x4E00;&#x4E2A;&#x7528;&#x6237;&#x9700;&#x8981;&#x4FDD;&#x7559;&#x6700;&#x957F;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x94FE;&#x6761;&#x7684;&#x533A;&#x5757;&#x5934;&#x7684;&#x62F7;&#x8D1D;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x4E0D;&#x65AD;&#x5411;&#x7F51;&#x7EDC;&#x53D1;&#x8D77;&#x8BE2;&#x95EE;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x786E;&#x4FE1;&#x81EA;&#x5DF1;&#x62E5;&#x6709;&#x6700;&#x957F;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x901A;&#x8FC7;merkle&#x7684;&#x5206;&#x652F;&#x901A;&#x5411;&#x5B83;&#x88AB;&#x52A0;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#x5E76;&#x7EB3;&#x5165;&#x533A;&#x5757;&#x7684;&#x90A3;&#x6B21;&#x4EA4;&#x6613;&#x3002;&#x8282;&#x70B9;&#x60F3;&#x8981;&#x81EA;&#x884C;&#x68C0;&#x9A8C;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x6709;&#x6548;&#x6027;&#x539F;&#x672C;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x4F46;&#x901A;&#x8FC7;&#x8FFD;&#x6EAF;&#x5230;&#x94FE;&#x6761;&#x7684;&#x67D0;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5B83;&#x5C31;&#x80FD;&#x770B;&#x5230;&#x67D0;&#x4E2A;&#x8282;&#x70B9;&#x66FE;&#x7ECF;&#x63A5;&#x53D7;&#x8FC7;&#x5B83;&#xFF0C;&#x5E76;&#x4E14;&#x4E8E;&#x5176;&#x540E;&#x8FFD;&#x52A0;&#x7684;&#x533A;&#x5757;&#x4E5F;&#x8FDB;&#x4E00;&#x6B65;&#x8BC1;&#x660E;&#x5168;&#x7F51;&#x66FE;&#x7ECF;&#x63A5;&#x53D7;&#x4E86;&#x5B83;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/5.png" alt="5"></p>
<p>&#x5F53;&#x6B64;&#x60C5;&#x5F62;&#xFF0C;&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x63A7;&#x5236;&#x4E86;&#x7F51;&#x7EDC;&#xFF0C;&#x68C0;&#x9A8C;&#x673A;&#x5236;&#x5C31;&#x662F;&#x53EF;&#x9760;&#x7684;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5F53;&#x5168;&#x7F51;&#x88AB;&#x4E00;&#x4E2A;&#x8BA1;&#x7B97;&#x529B;&#x5360;&#x4F18;&#x7684;&#x653B;&#x51FB;&#x8005;&#x653B;&#x51FB;&#x65F6;&#xFF0C;&#x5C06;&#x53D8;&#x5F97;&#x8F83;&#x4E3A;&#x8106;&#x5F31;&#x3002;&#x56E0;&#x4E3A;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x81EA;&#x884C;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x7684;&#x6709;&#x6548;&#x6027;&#xFF0C;&#x53EA;&#x8981;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x591F;&#x6301;&#x7EED;&#x5730;&#x4FDD;&#x6301;&#x8BA1;&#x7B97;&#x529B;&#x4F18;&#x52BF;&#xFF0C;&#x7B80;&#x5316;&#x7684;&#x673A;&#x5236;&#x4F1A;&#x88AB;&#x653B;&#x51FB;&#x8005;&#x710A;&#x63A5;&#x7684;&#xFF08;fabricated&#xFF09;&#x4EA4;&#x6613;&#x6B3A;&#x9A97;&#x3002;&#x90A3;&#x4E48;&#x4E00;&#x4E2A;&#x53EF;&#x884C;&#x7684;&#x7B56;&#x7565;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x4ED6;&#x4EEC;&#x53D1;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x65E0;&#x6548;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5C31;&#x7ACB;&#x523B;&#x53D1;&#x51FA;&#x8B66;&#x62A5;&#xFF0C;&#x6536;&#x5230;&#x8B66;&#x62A5;&#x7684;&#x7528;&#x6237;&#x5C06;&#x7ACB;&#x523B;&#x5F00;&#x59CB;&#x4E0B;&#x8F7D;&#x88AB;&#x8B66;&#x544A;&#x6709;&#x95EE;&#x9898;&#x7684;&#x533A;&#x5757;&#x6216;&#x4EA4;&#x6613;&#x7684;&#x5B8C;&#x6574;&#x4FE1;&#x606F;&#xFF0C;&#x4EE5;&#x4FBF;&#x5BF9;&#x4FE1;&#x606F;&#x7684;&#x4E0D;&#x4E00;&#x81F4;&#x8FDB;&#x884C;&#x5224;&#x5B9A;&#x3002;&#x5BF9;&#x4E8E;&#x65E5;&#x5E38;&#x4F1A;&#x53D1;&#x751F;&#x5927;&#x91CF;&#x6536;&#x4ED8;&#x7684;&#x5546;&#x4E1A;&#x673A;&#x6784;&#xFF0C;&#x53EF;&#x80FD;&#x4ECD;&#x4F1A;&#x5E0C;&#x671B;&#x8FD0;&#x884C;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x8F83;&#x5927;&#x7684;&#x72EC;&#x7ACB;&#x5B8C;&#x5168;&#x6027;&#x548C;&#x68C0;&#x9A8C;&#x7684;&#x5FEB;&#x901F;&#x6027;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/7.png" alt="7"></p>
<h2 id="9-&#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;&#xFF08;combining-and-splitting-value&#xFF09;">9. &#x4EF7;&#x503C;&#x7684;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;&#xFF08;Combining and Splitting Value&#xFF09;</h2>
<p>&#x867D;&#x7136;&#x53EF;&#x4EE5;&#x5355;&#x4E2A;&#x5355;&#x4E2A;&#x5730;&#x5BF9;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x8FDB;&#x884C;&#x5904;&#x7406;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x679A;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x5355;&#x72EC;&#x53D1;&#x8D77;&#x4E00;&#x6B21;&#x4EA4;&#x6613;&#x5C06;&#x662F;&#x4E00;&#x79CD;&#x7B28;&#x62D9;&#x7684;&#x529E;&#x6CD5;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x5F97;&#x4EF7;&#x503C;&#x6613;&#x4E8E;&#x7EC4;&#x5408;&#x4E0E;&#x5206;&#x5272;&#xFF0C;&#x4EA4;&#x6613;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x53EF;&#x4EE5;&#x7EB3;&#x5165;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;&#x4E00;&#x822C;&#x800C;&#x8A00;&#x662F;&#x67D0;&#x6B21;&#x4EF7;&#x503C;&#x8F83;&#x5927;&#x7684;&#x524D;&#x6B21;&#x4EA4;&#x6613;&#x6784;&#x6210;&#x7684;&#x5355;&#x4E00;&#x8F93;&#x5165;&#xFF0C;&#x6216;&#x8005;&#x7531;&#x67D0;&#x51E0;&#x4E2A;&#x4EF7;&#x503C;&#x8F83;&#x5C0F;&#x7684;&#x524D;&#x6B21;&#x4EA4;&#x6613;&#x5171;&#x540C;&#x6784;&#x6210;&#x7684;&#x5E76;&#x884C;&#x8F93;&#x5165;&#xFF0C;&#x4F46;&#x662F;&#x8F93;&#x51FA;&#x6700;&#x591A;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x652F;&#x4ED8;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x627E;&#x96F6;&#xFF08;&#x5982;&#x6709;&#xFF09;&#x3002;
&#x9700;&#x8981;&#x6307;&#x51FA;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x4F9D;&#x8D56;&#x4E8E;&#x4E4B;&#x524D;&#x7684;&#x591A;&#x7B14;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x53C8;&#x5404;&#x81EA;&#x4F9D;&#x8D56;&#x4E8E;&#x591A;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x95EE;&#x9898;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x5C55;&#x5F00;&#x68C0;&#x9A8C;&#x4E4B;&#x524D;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x5386;&#x53F2;&#x3002;</p>
<h2 id="10-&#x9690;&#x79C1;&#xFF08;privacy&#xFF09;">10. &#x9690;&#x79C1;&#xFF08;Privacy&#xFF09;</h2>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/6.png" alt="6"></p>
<p>&#x4F20;&#x7EDF;&#x7684;&#x9020;&#x5E01;&#x5382;&#x6A21;&#x578B;&#x4E3A;&#x4EA4;&#x6613;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x7684;&#x9690;&#x79C1;&#x4FDD;&#x62A4;&#xFF0C;&#x56E0;&#x4E3A;&#x8BD5;&#x56FE;&#x5411;&#x53EF;&#x4FE1;&#x4EFB;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x7D22;&#x53D6;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x662F;&#x4E25;&#x683C;&#x53D7;&#x9650;&#x7684;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x5C06;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x5411;&#x5168;&#x7F51;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#xFF0C;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5931;&#x6548;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x9690;&#x79C1;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4FDD;&#x62A4;&#xFF1A;&#x5C06;&#x516C;&#x94A5;&#x4FDD;&#x6301;&#x4E3A;&#x533F;&#x540D;&#x3002;&#x516C;&#x4F17;&#x5F97;&#x77E5;&#x7684;&#x4FE1;&#x606F;&#x4EC5;&#x4EC5;&#x662F;&#x6709;&#x67D0;&#x4E2A;&#x4EBA;&#x5C06;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8D27;&#x5E01;&#x53D1;&#x6240;&#x7ED9;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x4EBA;&#xFF0C;&#x4F46;&#x662F;&#x96BE;&#x4EE5;&#x5C06;&#x8BE5;&#x4EA4;&#x6613;&#x540C;&#x7279;&#x5B9A;&#x7684;&#x4EBA;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x516C;&#x4F17;&#x96BE;&#x4EE5;&#x786E;&#x4FE1;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x7A76;&#x7ADF;&#x662F;&#x8C01;&#x3002;&#x8FD9;&#x540C;&#x80A1;&#x7968;&#x4EA4;&#x6613;&#x6240;&#x53D1;&#x5E03;&#x7684;&#x4FE1;&#x606F;&#x662F;&#x7C7B;&#x4F3C;&#x7684;&#xFF0C;&#x80A1;&#x7968;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#x7684;&#x65F6;&#x95F4;&#x3001;&#x4EA4;&#x6613;&#x91CF;&#x662F;&#x8BB0;&#x5F55;&#x5728;&#x6848;&#x4E14;&#x53EF;&#x4F9B;&#x67E5;&#x8BE2;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x5374;&#x4E0D;&#x4E88;&#x900F;&#x9732;&#x3002;
&#x4F5C;&#x4E3A;&#x989D;&#x5916;&#x7684;&#x9884;&#x9632;&#x63AA;&#x65BD;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x8BA9;&#x6BCF;&#x6B21;&#x4EA4;&#x6613;&#x90FD;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x4E0D;&#x88AB;&#x8FFD;&#x6EAF;&#x5230;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;&#x4F46;&#x662F;&#x7531;&#x4E8E;&#x5E76;&#x884C;&#x8F93;&#x5165;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x4E00;&#x5B9A;&#x7A0B;&#x5EA6;&#x4E0A;&#x7684;&#x8FFD;&#x6EAF;&#x8FD8;&#x662F;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5E76;&#x884C;&#x8F93;&#x5165;&#x8868;&#x660E;&#x8FD9;&#x4E9B;&#x8D27;&#x5E01;&#x90FD;&#x5C5E;&#x4E8E;&#x540C;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x8005;&#x3002;&#x6B64;&#x65F6;&#x7684;&#x98CE;&#x9669;&#x5728;&#x4E8E;&#xFF0C;&#x5982;&#x679C;&#x67D0;&#x4E2A;&#x4EBA;&#x7684;&#x67D0;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x88AB;&#x786E;&#x8BA4;&#x5C5E;&#x4E8E;&#x4ED6;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x51FA;&#x6B64;&#x4EBA;&#x7684;&#x5176;&#x5B83;&#x5F88;&#x591A;&#x4EA4;&#x6613;&#x3002;</p>
<h2 id="11-&#x8BA1;&#x7B97;">11. &#x8BA1;&#x7B97;</h2>
<p>&#x8BBE;&#x60F3;&#x5982;&#x4E0B;&#x573A;&#x666F;&#xFF1A;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x8BD5;&#x56FE;&#x6BD4;&#x8BDA;&#x5B9E;&#x8282;&#x70B9;&#x4EA7;&#x751F;&#x94FE;&#x6761;&#x66F4;&#x5FEB;&#x5730;&#x5236;&#x9020;&#x66FF;&#x4EE3;&#x6027;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5373;&#x4FBF;&#x5B83;&#x8FBE;&#x5230;&#x4E86;&#x8FD9;&#x4E00;&#x76EE;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E5F;&#x5E76;&#x975E;&#x5C31;&#x6B64;&#x5B8C;&#x5168;&#x53D7;&#x5236;&#x4E8E;&#x653B;&#x51FB;&#x8005;&#x7684;&#x72EC;&#x65AD;&#x610F;&#x5FD7;&#x4E86;&#xFF0C;&#x6BD4;&#x65B9;&#x8BF4;&#x51ED;&#x7A7A;&#x521B;&#x9020;&#x4EF7;&#x503C;&#xFF0C;&#x6216;&#x8005;&#x63A0;&#x593A;&#x672C;&#x4E0D;&#x5C5E;&#x4E8E;&#x653B;&#x51FB;&#x8005;&#x7684;&#x8D27;&#x5E01;&#x3002;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8282;&#x70B9;&#x5C06;&#x4E0D;&#x4F1A;&#x63A5;&#x53D7;&#x65E0;&#x6548;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x63A5;&#x53D7;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E86;&#x65E0;&#x6548;&#x4FE1;&#x606F;&#x7684;&#x533A;&#x5757;&#x3002;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x80FD;&#x505A;&#x7684;&#xFF0C;&#x6700;&#x591A;&#x662F;&#x66F4;&#x6539;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x8BD5;&#x56FE;&#x62FF;&#x56DE;&#x4ED6;&#x521A;&#x521A;&#x4ED8;&#x7ED9;&#x522B;&#x4EBA;&#x7684;&#x94B1;&#x3002;
&#x8BDA;&#x5B9E;&#x94FE;&#x6761;&#x548C;&#x653B;&#x51FB;&#x8005;&#x94FE;&#x6761;&#x4E4B;&#x95F4;&#x7684;&#x7ADE;&#x8D5B;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x4E8C;&#x53C9;&#x6811;&#x968F;&#x673A;&#x6F2B;&#x6B65;&#xFF08;Binomial Random Walk)&#x6765;&#x63CF;&#x8FF0;&#x3002;&#x6210;&#x529F;&#x4E8B;&#x4EF6;&#x5B9A;&#x4E49;&#x4E3A;&#x8BDA;&#x5B9E;&#x94FE;&#x6761;&#x5EF6;&#x957F;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x4F7F;&#x5176;&#x9886;&#x5148;&#x6027;+1&#xFF0C;&#x800C;&#x5931;&#x8D25;&#x4E8B;&#x4EF6;&#x5219;&#x662F;&#x653B;&#x51FB;&#x8005;&#x7684;&#x94FE;&#x6761;&#x88AB;&#x5EF6;&#x957F;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x4F7F;&#x5F97;&#x5DEE;&#x8DDD;-1&#x3002;
&#x653B;&#x51FB;&#x8005;&#x6210;&#x529F;&#x586B;&#x8865;&#x67D0;&#x4E00;&#x65E2;&#x5B9A;&#x5DEE;&#x8DDD;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x53EF;&#x4EE5;&#x8FD1;&#x4F3C;&#x5730;&#x770B;&#x505A;&#x8D4C;&#x5F92;&#x7834;&#x4EA7;&#x95EE;&#x9898;&#xFF08;Gambler&#x2019;s Ruin problem&#xFF09;&#x3002;&#x5047;&#x5B9A;&#x4E00;&#x4E2A;&#x8D4C;&#x5F92;&#x62E5;&#x6709;&#x65E0;&#x9650;&#x7684;&#x900F;&#x652F;&#x4FE1;&#x7528;&#xFF0C;&#x7136;&#x540E;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x6F5C;&#x5728;&#x6B21;&#x6570;&#x4E3A;&#x65E0;&#x7A77;&#x7684;&#x8D4C;&#x535A;&#xFF0C;&#x8BD5;&#x56FE;&#x586B;&#x8865;&#x4E0A;&#x81EA;&#x5DF1;&#x7684;&#x4E8F;&#x7A7A;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BA1;&#x7B97;&#x4ED6;&#x586B;&#x8865;&#x4E0A;&#x4E8F;&#x7A7A;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BE5;&#x653B;&#x51FB;&#x8005;&#x8D76;&#x4E0A;&#x8BDA;&#x5B9E;&#x94FE;&#x6761;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#footnote-8" target="_blank">[8]</a> &#xFF1A;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/pq.png" alt="pq"></p>
<p>&#x5047;&#x5B9A;p&gt;q&#xFF0C;&#x90A3;&#x4E48;&#x653B;&#x51FB;&#x6210;&#x529F;&#x7684;&#x6982;&#x7387;&#x5C31;&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x6570;&#x7684;&#x589E;&#x957F;&#x800C;&#x5448;&#x73B0;&#x6307;&#x6570;&#x5316;&#x4E0B;&#x964D;&#x3002;&#x7531;&#x4E8E;&#x6982;&#x7387;&#x662F;&#x653B;&#x51FB;&#x8005;&#x7684;&#x654C;&#x4EBA;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4E0D;&#x80FD;&#x5E78;&#x8FD0;&#x4E14;&#x5FEB;&#x901F;&#x5730;&#x83B7;&#x5F97;&#x6210;&#x529F;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x83B7;&#x5F97;&#x6210;&#x529F;&#x7684;&#x673A;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x6D41;&#x901D;&#x5C31;&#x53D8;&#x5F97;&#x6108;&#x53D1;&#x6E3A;&#x832B;&#x3002;&#x90A3;&#x4E48;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x4E00;&#x4E2A;&#x6536;&#x6B3E;&#x4EBA;&#x9700;&#x8981;&#x7B49;&#x5F85;&#x591A;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x624D;&#x80FD;&#x8DB3;&#x591F;&#x786E;&#x4FE1;&#x4ED8;&#x6B3E;&#x4EBA;&#x5DF2;&#x7ECF;&#x96BE;&#x4EE5;&#x66F4;&#x6539;&#x4EA4;&#x6613;&#x4E86;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4ED8;&#x6B3E;&#x4EBA;&#x662F;&#x4E00;&#x4E2A;&#x652F;&#x4ED8;&#x653B;&#x51FB;&#x8005;&#xFF0C;&#x5E0C;&#x671B;&#x8BA9;&#x6536;&#x6B3E;&#x4EBA;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x76F8;&#x4FE1;&#x4ED6;&#x5DF2;&#x7ECF;&#x4ED8;&#x8FC7;&#x6B3E;&#x4E86;&#xFF0C;&#x7136;&#x540E;&#x7ACB;&#x5373;&#x5C06;&#x652F;&#x4ED8;&#x7684;&#x6B3E;&#x9879;&#x91CD;&#x65B0;&#x652F;&#x4ED8;&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x867D;&#x7136;&#x6536;&#x6B3E;&#x4EBA;&#x5C4A;&#x65F6;&#x4F1A;&#x53D1;&#x73B0;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x4E3A;&#x65F6;&#x5DF2;&#x665A;&#x3002;
&#x6536;&#x6B3E;&#x4EBA;&#x751F;&#x6210;&#x4E86;&#x65B0;&#x7684;&#x4E00;&#x5BF9;&#x5BC6;&#x94A5;&#x7EC4;&#x5408;&#xFF0C;&#x7136;&#x540E;&#x53EA;&#x9884;&#x7559;&#x4E00;&#x4E2A;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x5C06;&#x516C;&#x94A5;&#x53D1;&#x9001;&#x7ED9;&#x4ED8;&#x6B3E;&#x4EBA;&#x3002;&#x8FD9;&#x5C06;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4EE5;&#x4E0B;&#x60C5;&#x51B5;&#xFF1A;&#x4ED8;&#x6B3E;&#x4EBA;&#x9884;&#x5148;&#x51C6;&#x5907;&#x597D;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7136;&#x540E;&#x6301;&#x7EED;&#x5730;&#x5BF9;&#x6B64;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#xFF0C;&#x76F4;&#x5230;&#x8FD0;&#x6C14;&#x8BA9;&#x4ED6;&#x7684;&#x533A;&#x5757;&#x94FE;&#x8D85;&#x8D8A;&#x4E86;&#x8BDA;&#x5B9E;&#x94FE;&#x6761;&#xFF0C;&#x65B9;&#x624D;&#x7ACB;&#x5373;&#x6267;&#x884C;&#x652F;&#x4ED8;&#x3002;&#x5F53;&#x6B64;&#x60C5;&#x5F62;&#xFF0C;&#x53EA;&#x8981;&#x4EA4;&#x6613;&#x4E00;&#x65E6;&#x53D1;&#x51FA;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5C31;&#x5F00;&#x59CB;&#x79D8;&#x5BC6;&#x5730;&#x51C6;&#x5907;&#x4E00;&#x6761;&#x5305;&#x542B;&#x4E86;&#x8BE5;&#x4EA4;&#x6613;&#x66FF;&#x4EE3;&#x7248;&#x672C;&#x7684;&#x5E73;&#x884C;&#x94FE;&#x6761;&#x3002;
&#x7136;&#x540E;&#x6536;&#x6B3E;&#x4EBA;&#x5C06;&#x7B49;&#x5F85;&#x4EA4;&#x6613;&#x51FA;&#x73B0;&#x5728;&#x9996;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x7B49;&#x5230;z&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x63A5;&#x5176;&#x540E;&#x3002;&#x6B64;&#x65F6;&#xFF0C;&#x4ED6;&#x4ECD;&#x7136;&#x4E0D;&#x80FD;&#x786E;&#x5207;&#x77E5;&#x9053;&#x653B;&#x51FB;&#x8005;&#x5DF2;&#x7ECF;&#x8FDB;&#x5C55;&#x4E86;&#x591A;&#x5C11;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x4F46;&#x662F;&#x5047;&#x8BBE;&#x8BDA;&#x5B9E;&#x533A;&#x5757;&#x5C06;&#x8017;&#x8D39;&#x5E73;&#x5747;&#x9884;&#x671F;&#x65F6;&#x95F4;&#x4EE5;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x653B;&#x51FB;&#x8005;&#x7684;&#x6F5C;&#x5728;&#x8FDB;&#x5C55;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6CCA;&#x677E;&#x5206;&#x5E03;&#xFF0C;&#x5206;&#x5E03;&#x7684;&#x671F;&#x671B;&#x503C;&#x4E3A;&#xFF1A;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/image022.png" alt="image022"></p>
<p>&#x5F53;&#x6B64;&#x60C5;&#x5F62;&#xFF0C;&#x4E3A;&#x4E86;&#x8BA1;&#x7B97;&#x653B;&#x51FB;&#x8005;&#x8FFD;&#x8D76;&#x4E0A;&#x7684;&#x6982;&#x7387;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x653B;&#x51FB;&#x8005;&#x53D6;&#x5F97;&#x8FDB;&#x5C55;&#x533A;&#x5757;&#x6570;&#x91CF;&#x7684;&#x6CCA;&#x677E;&#x5206;&#x5E03;&#x7684;&#x6982;&#x7387;&#x5BC6;&#x5EA6;&#xFF0C;&#x4E58;&#x4EE5;&#x5728;&#x8BE5;&#x6570;&#x91CF;&#x4E0B;&#x653B;&#x51FB;&#x8005;&#x4F9D;&#x7136;&#x80FD;&#x591F;&#x8FFD;&#x8D76;&#x4E0A;&#x7684;&#x6982;&#x7387;&#x3002;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/pq2.png" alt="pq2"></p>
<p>&#x5316;&#x4E3A;&#x5982;&#x4E0B;&#x5F62;&#x5F0F;&#xFF0C;&#x907F;&#x514D;&#x5BF9;&#x65E0;&#x9650;&#x6570;&#x5217;&#x6C42;&#x548C;&#xFF1A;</p>
<p><img src="http://7fvhfe.com1.z0.glb.clouddn.com/wp-content/uploads/2013/11/pq3.png" alt="pq3"></p>
<p>&#x5199;&#x4E3A;&#x5982;&#x4E0B;C&#x8BED;&#x8A00;&#x4EE3;&#x7801;&#xFF1A;</p>
<p><code>#include double AttackerSuccessProbability(double q, int z){double p = 1.0 - q;double lambda = z * (q / p);double sum = 1.0;int i, k;for (k = 0; k &lt;= z; k++){double poisson = exp(-lambda);for (i = 1; i &lt;= k; i++)poisson *= lambda / i;sum -= poisson * (1 - pow(q / p, z - k));}return sum;}</code>
&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x5982;&#x4E0B;&#x7684;&#x6982;&#x7387;&#x7ED3;&#x679C;&#xFF0C;&#x53D1;&#x73B0;&#x6982;&#x7387;&#x5BF9;z&#x503C;&#x5448;&#x6307;&#x6570;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x5F53;q=0.1&#x65F6;
z=0 P=1.0000000
z=1 P=0.2045873
z=2 P=0.0509779
z=3 P=0.0131722
z=4 P=0.0034552
z=5 P=0.0009137
z=6 P=0.0002428
z=7 P=0.0000647
z=8 P=0.0000173
z=9 P=0.0000046
z=10 P=0.0000012</p>
<p>&#x5F53;q=0.3&#x65F6;
z=0 P=1.0000000
z=5 P=0.1773523
z=10 P=0.0416605
z=15 P=0.0101008
z=20 P=0.0024804
z=25 P=0.0006132
z=30 P=0.0001522
z=35 P=0.0000379
z=40 P=0.0000095
z=45 P=0.0000024
z=50 P=0.0000006</p>
<p>&#x6C42;&#x89E3;&#x4EE4;P&lt;0.1%&#x7684;z&#x503C;&#xFF1A;</p>
<p>&#x4E3A;&#x4F7F;P&lt;0.001&#xFF0C;&#x5219;
q=0.10 z=5
q=0.15 z=8
q=0.20 z=11
q=0.25 z=15
q=0.30 z=24
q=0.35 z=41
q=0.40 z=89
q=0.45 z=340</p>
<h2 id="12&#x7ED3;&#x8BBA;">12.&#x7ED3;&#x8BBA;</h2>
<p>&#x6211;&#x4EEC;&#x5728;&#x6B64;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x4E0D;&#x9700;&#x8981;&#x4FE1;&#x7528;&#x4E2D;&#x4ECB;&#x7684;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x3002;&#x6211;&#x4EEC;&#x9996;&#x5148;&#x8BA8;&#x8BBA;&#x4E86;&#x901A;&#x5E38;&#x7684;&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x7684;&#x7535;&#x5B50;&#x7B7E;&#x540D;&#x539F;&#x7406;&#xFF0C;&#x867D;&#x7136;&#x8FD9;&#x79CD;&#x7CFB;&#x7EDF;&#x4E3A;&#x6240;&#x6709;&#x6743;&#x63D0;&#x4F9B;&#x4E86;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x63A7;&#x5236;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8DB3;&#x4EE5;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x4EEC;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x91C7;&#x7528;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x6765;&#x8BB0;&#x5F55;&#x4EA4;&#x6613;&#x7684;&#x516C;&#x5F00;&#x4FE1;&#x606F;&#xFF0C;&#x53EA;&#x8981;&#x8BDA;&#x5B9E;&#x7684;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x63A7;&#x5236;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;CPU&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#xFF0C;&#x5C31;&#x80FD;&#x4F7F;&#x5F97;&#x653B;&#x51FB;&#x8005;&#x4E8B;&#x5B9E;&#x4E0A;&#x96BE;&#x4EE5;&#x6539;&#x53D8;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x3002;&#x8BE5;&#x7F51;&#x7EDC;&#x7684;&#x5F3A;&#x5065;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x5B83;&#x7ED3;&#x6784;&#x4E0A;&#x7684;&#x7B80;&#x6D01;&#x6027;&#x3002;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x5DE5;&#x4F5C;&#x5927;&#x90E8;&#x5206;&#x662F;&#x5F7C;&#x6B64;&#x72EC;&#x7ACB;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x5F88;&#x5C11;&#x7684;&#x534F;&#x540C;&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x660E;&#x786E;&#x81EA;&#x5DF1;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x7531;&#x4E8E;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x6D41;&#x52A8;&#x8DEF;&#x5F84;&#x5E76;&#x65E0;&#x4EFB;&#x4F55;&#x8981;&#x6C42;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x9700;&#x8981;&#x5C3D;&#x5176;&#x6700;&#x5927;&#x52AA;&#x529B;&#x4F20;&#x64AD;&#x5373;&#x53EF;&#x3002;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x79BB;&#x5F00;&#x7F51;&#x7EDC;&#xFF0C;&#x800C;&#x60F3;&#x91CD;&#x65B0;&#x52A0;&#x5165;&#x7F51;&#x7EDC;&#x4E5F;&#x975E;&#x5E38;&#x5BB9;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x9700;&#x8981;&#x8865;&#x5145;&#x63A5;&#x6536;&#x79BB;&#x5F00;&#x671F;&#x95F4;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x94FE;&#x6761;&#x5373;&#x53EF;&#x3002;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x81EA;&#x5DF1;&#x7684;CPU&#x8BA1;&#x7B97;&#x529B;&#x8FDB;&#x884C;&#x6295;&#x7968;&#xFF0C;&#x8868;&#x51B3;&#x4ED6;&#x4EEC;&#x5BF9;&#x6709;&#x6548;&#x533A;&#x5757;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x65AD;&#x5EF6;&#x957F;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6765;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x5E76;&#x62D2;&#x7EDD;&#x5728;&#x65E0;&#x6548;&#x7684;&#x533A;&#x5757;&#x4E4B;&#x540E;&#x5EF6;&#x957F;&#x533A;&#x5757;&#x4EE5;&#x8868;&#x793A;&#x62D2;&#x7EDD;&#x3002;&#x672C;&#x6846;&#x67B6;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;P2P&#x7535;&#x5B50;&#x8D27;&#x5E01;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x8981;&#x7684;&#x5168;&#x90E8;&#x89C4;&#x5219;&#x548C;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#x3002;</p>
<p>&#x6CE8;&#x91CA; </p>
<ol>
<li>W Dai&#xFF08;&#x6234;&#x4F1F;&#xFF09;,a scheme for a group of untraceable digital pseudonyms to pay each other with money and to enforce contracts amongst themselves without outside help&#xFF08;&#x4E00;&#x79CD;&#x80FD;&#x591F;&#x501F;&#x52A9;&#x7535;&#x5B50;&#x5047;&#x540D;&#x5728;&#x7FA4;&#x4F53;&#x5185;&#x90E8;&#x76F8;&#x4E92;&#x652F;&#x4ED8;&#x5E76;&#x8FEB;&#x4F7F;&#x4E2A;&#x4F53;&#x9075;&#x5B88;&#x89C4;&#x5219;&#x4E14;&#x4E0D;&#x9700;&#x8981;&#x5916;&#x754C;&#x534F;&#x52A9;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x673A;&#x5236;&#xFF09;, &#x201C;B-money&#x201D;, <a href="http://www.weidai.com/bmoney.txt" target="_blank">http://www.weidai.com/bmoney.txt</a>, 1998<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-1" target="_blank">&#x21B5;</a></li>
<li>H. Massias, X.S. Avila, and J.-J. Quisquater, &#x201C;Design of a secure timestamping service with minimal trust requirements,&#x201D;&#xFF08;&#x5728;&#x6700;&#x5C0F;&#x5316;&#x4FE1;&#x4EFB;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#xFF09; In 20th Symposium on Information Theory in the Benelux, May 1999.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-2" target="_blank">&#x21B5;</a></li>
<li>S. Haber, W.S. Stornetta, &#x201C;How to time-stamp a digital document,&#x201D; &#xFF08;&#x600E;&#x6837;&#x4E3A;&#x7535;&#x5B50;&#x6587;&#x4EF6;&#x6DFB;&#x52A0;&#x65F6;&#x95F4;&#x6233;&#xFF09;In Journal of Cryptology, vol 3, No.2, pages 99-111, 1991.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-3" target="_blank">&#x21B5;</a></li>
<li>D. Bayer, S. Haber, W.S. Stornetta, &#x201C;Improving the efficiency and reliability of digital time-stamping,&#x201D;&#xFF08;&#x63D0;&#x5347;&#x7535;&#x5B50;&#x65F6;&#x95F4;&#x6233;&#x7684;&#x6548;&#x7387;&#x548C;&#x53EF;&#x9760;&#x6027;&#xFF09; In Sequences II: Methods in Communication, Security and Computer Science, pages 329-334, 1993.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-4" target="_blank">&#x21B5;</a></li>
<li>S. Haber, W.S. Stornetta, &#x201C;Secure names for bit-strings,&#x201D;&#xFF08;&#x6BD4;&#x7279;&#x5B57;&#x4E32;&#x7684;&#x5B89;&#x5168;&#x547D;&#x540D;&#xFF09; In Proceedings of the 4th ACM Conference on Computer and Communications Security, pages 28-35, April 1997. on Computer and Communications Security, pages 28-35, April 1997.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-5" target="_blank">&#x21B5;</a></li>
<li>A. Back, &#x201C;Hashcash &#x2013; a denial of service counter-measure,&#x201D;&#xFF08;&#x54C8;&#x5E0C;&#x73B0;&#x91D1;&#x2014;&#x2014;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x5F0F;&#x653B;&#x51FB;&#x7684;&#x514B;&#x5236;&#x65B9;&#x6CD5;&#xFF09;<a href="http://www.hashcash.org/papers/hashcash.pdf" target="_blank">http://www.hashcash.org/papers/hashcash.pdf</a>, 2002.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-6" target="_blank">&#x21B5;</a></li>
<li>R.C. Merkle, &#x201C;Protocols for public key cryptosystems,&#x201D; &#xFF08;&#x516C;&#x94A5;&#x5BC6;&#x7801;&#x7CFB;&#x7EDF;&#x7684;&#x534F;&#x8BAE;&#xFF09;In Proc. 1980 Symposium on Security and Privacy, IEEE Computer Society, pages 122-133, April 1980.
S. Haber, W.S. Stornetta, &#x201C;Secure names for bit-strings,&#x201D;&#xFF08;&#x6BD4;&#x7279;&#x5B57;&#x4E32;&#x5B89;&#x5168;&#x547D;&#x540D;&#xFF09; In Proceedings of the 4th ACM Conference on Computer and Communications Security, pages 28-35, April 1997. on Computer and Communications Security, pages 28-35, April 1997.
H. Massias, X.S. Avila, and J.-J. Quisquater, &#x201C;Design of a secure timestamping service with minimal trust requirements,&#x201D;&#xFF08;&#x5728;&#x6700;&#x5C0F;&#x5316;&#x4FE1;&#x4EFB;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x8BBE;&#x8BA1;&#x4E00;&#x79CD;&#x65F6;&#x95F4;&#x6233;&#x670D;&#x52A1;&#x5668;&#xFF09; In 20th Symposium on Information Theory in the Benelux, May 1999.<a href="http://www.8btc.com/wiki/bitcoin-a-peer-to-peer-electronic-cash-system#refmark-7" target="_blank">&#x21B5;</a></li>
<li>W. Feller, &#x201C;An introduction to probability theory and its applications,&#x201D; &#xFF08;&#x6982;&#x7387;&#x5B66;&#x7406;&#x8BBA;&#x4E0E;&#x5E94;&#x7528;&#x5BFC;&#x8BBA;&#xFF09;1957</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="appdx-scriptops.html" class="navigation navigation-prev " aria-label="Previous page: 附录5 交易脚本的操作符、常量和符号">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appdx-segwit.html" class="navigation navigation-next " aria-label="Next page: 附录7 隔离见证">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"附录6 比特币白皮书","level":"1.24","depth":1,"next":{"title":"附录7 隔离见证","level":"1.25","depth":1,"path":"appdx-segwit.md","ref":"appdx-segwit.md","articles":[]},"previous":{"title":"附录5 交易脚本的操作符、常量和符号","level":"1.23","depth":1,"path":"appdx-scriptops.md","ref":"appdx-scriptops.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"appdx-bitcoinwhitepaper.md","mtime":"2018-12-14T06:26:05.574Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

