
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录7 隔离见证 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appdx-colored_coins.html" />
    
    
    <link rel="prev" href="appdx-bitcoinwhitepaper.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >附录7 隔离见证</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9644;&#x5F55;4&#x3001;&#x9694;&#x79BB;&#x89C1;&#x8BC1;">&#x9644;&#x5F55;4&#x3001;&#x9694;&#x79BB;&#x89C1;&#x8BC1;</h1>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF08;segwit&#xFF09;&#x662F;&#x4E00;&#x6B21;&#x6BD4;&#x7279;&#x5E01;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x548C;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x5176;&#x63D0;&#x8BAE;&#x548C;&#x5B9E;&#x65BD;&#x5C06;&#x57FA;&#x4E8E;BIP-9 &#x8F6F;&#x5206;&#x53C9;&#x65B9;&#x6848;&#xFF0C;&#x76EE;&#x524D;&#x5C1A;&#x5F85;&#x6FC0;&#x6D3B;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;2017&#x5E74;8&#x6708;24&#x65E5;&#xFF0C;&#x533A;&#x5757;&#x9AD8;&#x5EA6;481,824&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x6B63;&#x5F0F;&#x6FC0;&#x6D3B;&#xFF09;&#x3002;</p>
<p>&#x5728;&#x5BC6;&#x7801;&#x5B66;&#x4E2D;&#xFF0C;&#x672F;&#x8BED;&#x201C;&#x89C1;&#x8BC1;&#x201D;&#xFF08;witness&#xFF09;&#x88AB;&#x7528;&#x4E8E;&#x5F62;&#x5BB9;&#x4E00;&#x4E2A;&#x52A0;&#x5BC6;&#x96BE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x201C;&#x89C1;&#x8BC1;&#x201D;&#x6EE1;&#x8DB3;&#x4E86;&#x4E00;&#x79CD;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x4E00;&#x4E2A;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF08;unspent transaction output, UTXO&#xFF09;&#x4E0A;&#x7684;&#x52A0;&#x5BC6;&#x6761;&#x4EF6;&#x3002;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x8BED;&#x5883;&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x201C;&#x89C1;&#x8BC1;&#x201D;&#xFF08;one type of witness&#xFF09;&#x3002;&#x4F46;&#x201C;&#x89C1;&#x8BC1;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x4E3A;&#x5E7F;&#x6CDB;&#x7684;&#x4EFB;&#x610F;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x80FD;&#x591F;&#x6EE1;&#x8DB3;&#x52A0;&#x8BF8;&#x4E8E;&#x4E00;&#x4E2A;UTXO&#x7684;&#x6761;&#x4EF6;&#xFF0C;&#x4F7F;UTXO&#x89E3;&#x9501;&#x540E;&#x53EF;&#x88AB;&#x82B1;&#x8D39;&#x3002;&#x672F;&#x8BED;&#x201C;&#x89C1;&#x8BC1;&#x201D;&#x4E00;&#x8BCD;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x666E;&#x904D;&#x7528;&#x4E8E;&#x201C;&#x89E3;&#x9501;&#x811A;&#x672C;&#x201D;&#xFF08;&#x6216;scriptSig&#xFF09;&#x7684;&#x672F;&#x8BED;&#x3002;</p>
<p>&#x5728;&#x5F15;&#x5165;&#x201C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x201D;&#x4E4B;&#x524D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x540E;&#x9762;&#x90FD;&#x8DDF;&#x7740;&#x7528;&#x6765;&#x5BF9;&#x5176;&#x89E3;&#x9501;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#xFF0C;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x88AB;&#x5185;&#x5D4C;&#x5176;&#x4E2D;&#x3002;&#x672F;&#x8BED;&#x201C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x201D;&#xFF08; segregated witness&#xFF09;&#xFF0C;&#x6216;&#x7B80;&#x79F0;&#x4E3A;&#x201C;segwit&#x201D;&#xFF0C;&#x7B80;&#x5355;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x5C06;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x8F93;&#x51FA;&#x7684;&#x7B7E;&#x540D;&#x5206;&#x79BB;&#x5F00;&#xFF0C;&#x6216;&#x5C06;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x8F93;&#x5165;&#x7684;&#x811A;&#x672C;&#x8FDB;&#x884C;&#x89E3;&#x9501;&#x3002;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x5F62;&#x5F0F;&#x6765;&#x7406;&#x89E3;&#x5C31;&#x662F;&#x201C;&#x5206;&#x79BB;&#x89E3;&#x9501;&#x811A;&#x672C;&#x201D;&#xFF08;separate scriptSig&#xFF09;&#xFF0C;&#x6216;&#x201C;&#x5206;&#x79BB;&#x7B7E;&#x540D;&#x201D;&#xFF08;separate signature&#xFF09;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5C31;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E00;&#x79CD;&#x7ED3;&#x6784;&#x6027;&#x8C03;&#x6574;&#xFF0C;&#x65E8;&#x5728;&#x5C06;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x90E8;&#x5206;&#x4ECE;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;scriptSig&#xFF08;&#x89E3;&#x9501;&#x811A;&#x672C;&#xFF09;&#x5B57;&#x6BB5;&#x79FB;&#x51FA;&#x81F3;&#x4E00;&#x4E2A;&#x4F34;&#x968F;&#x4EA4;&#x6613;&#x7684;&#x5355;&#x72EC;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5BA2;&#x6237;&#x7AEF;&#x8BF7;&#x6C42;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x65F6;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x8981;&#x6216;&#x4E0D;&#x8981;&#x8BE5;&#x90E8;&#x5206;&#x4F34;&#x968F;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x7AE0;&#x8282;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x4E00;&#x4E9B;&#x597D;&#x5904;&#xFF0C;&#x63CF;&#x8FF0;&#x7528;&#x4E8E;&#x90E8;&#x7F72;&#x548C;&#x5B9E;&#x65BD;&#x8BE5;&#x7ED3;&#x6784;&#x6027;&#x8C03;&#x6574;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x5C55;&#x793A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5728;&#x4EA4;&#x6613;&#x548C;&#x5730;&#x5740;&#x4E2D;&#x7684;&#x8FD0;&#x7528;&#x3002;</p>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7531;&#x4EE5;&#x4E0B;BIPs&#x5B9A;&#x4E49;&#xFF1A;</p>
<p>BIP-141&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x4E3B;&#x8981;&#x5B9A;&#x4E49;</p>
<p> BIP-143&#x7248;&#x672C;0&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7684;&#x4EA4;&#x6613;&#x7B7E;&#x540D;&#x9A8C;&#x8BC1; </p>
<p>BIP-144&#x5BF9;&#x7B49;&#x670D;&#x52A1;&#x2014;&#x2014;&#x65B0;&#x7684;&#x7F51;&#x7EDC;&#x6D88;&#x606F;&#x548C;&#x5E8F;&#x5217;&#x5316;&#x683C;&#x5F0F; </p>
<p>BIP-145&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF08;&#x5BF9;&#x4E8E;&#x77FF;&#x5DE5;&#xFF09;&#x7684; getblocktemplate &#x5347;&#x7EA7;</p>
<h2 id="41&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF1F;">4.1&#x4E3A;&#x4EC0;&#x4E48;&#x9700;&#x8981;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF1F;</h2>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x662F;&#x4E00;&#x4E2A;&#x5C06;&#x5728;&#x591A;&#x65B9;&#x9762;&#x4EA7;&#x751F;&#x5F71;&#x54CD;&#x7684;&#x7ED3;&#x6784;&#x6027;&#x8C03;&#x6574;&#x2014;&#x2014;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3001;&#x5B89;&#x5168;&#x6027;&#x3001;&#x7ECF;&#x6D4E;&#x523A;&#x6FC0;&#x4EE5;&#x53CA;&#x6BD4;&#x7279;&#x5E01;&#x6574;&#x4F53;&#x6027;&#x80FD;&#xFF1A;</p>
<p>&#x4EA4;&#x6613;&#x5EF6;&#x5C55;&#x6027;</p>
<p>&#x5C06;&#x89C1;&#x8BC1;&#x79FB;&#x51FA;&#x4EA4;&#x6613;&#x540E;&#xFF0C;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#x7B26;&#x7684;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x4E0D;&#x518D;&#x5305;&#x542B;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;&#x56E0;&#x4E3A;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x662F;&#x4EA4;&#x6613;&#x4E2D;&#x552F;&#x4E00;&#x53EF;&#x88AB;&#x7B2C;&#x4E09;&#x65B9;&#x4FEE;&#x6539;&#xFF08;&#x53C2;&#x89C1; &#x4EA4;&#x6613;&#x8BC6;&#x522B;&#x7B26; &#x7AE0;&#x8282;&#xFF09;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x79FB;&#x9664;&#x5B83;&#x7684;&#x540C;&#x65F6;&#x4E5F;&#x79FB;&#x9664;&#x4E86;&#x4EA4;&#x6613;&#x5EF6;&#x5C55;&#x6027;&#x653B;&#x51FB;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF0C;&#x4EA4;&#x6613;&#x53D8;&#x5F97;&#x5BF9;&#x4EFB;&#x4F55;&#x4EBA;&#xFF08;&#x521B;&#x5EFA;&#x8005;&#x672C;&#x4EBA;&#x9664;&#x5916;&#xFF09;&#x90FD;&#x4E0D;&#x53EF;&#x53D8;&#xFF0C;&#x8FD9;&#x6781;&#x5927;&#x5730;&#x63D0;&#x9AD8;&#x4E86;&#x8BB8;&#x591A;&#x5176;&#x5B83;&#x4F9D;&#x8D56;&#x4E8E;&#x9AD8;&#x7EA7;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x67B6;&#x6784;&#x7684;&#x534F;&#x8BAE;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6027;&#x3002;&#x6BD4;&#x5982;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3001;&#x8DE8;&#x8FDE;&#x4EA4;&#x6613;&#x548C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x811A;&#x672C;&#x7248;&#x672C;&#x7BA1;&#x7406;</p>
<p>&#x5728;&#x5F15;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x811A;&#x672C;&#x540E;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x4EA4;&#x6613;&#x548C;&#x533A;&#x5757;&#x90FD;&#x6709;&#x5176;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x524D;&#x4E5F;&#x90FD;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x7248;&#x672C;&#x53F7;&#x3002;&#x811A;&#x672C;&#x7248;&#x672C;&#x53F7;&#x7684;&#x6761;&#x4EF6;&#x5141;&#x8BB8;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x7528;&#x4E00;&#x79CD;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x65B9;&#x5F0F;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;&#xFF09;&#x5347;&#x7EA7;&#xFF0C;&#x4EE5;&#x5F15;&#x5165;&#x65B0;&#x7684;&#x811A;&#x672C;&#x64CD;&#x4F5C;&#x6570;&#x3001;&#x8BED;&#x6CD5;&#x6216;&#x8BED;&#x4E49;&#x3002;&#x975E;&#x7834;&#x574F;&#x6027;&#x5347;&#x7EA7;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x7684;&#x80FD;&#x529B;&#x5C06;&#x6781;&#x5927;&#x5730;&#x52A0;&#x5FEB;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x521B;&#x65B0;&#x901F;&#x5EA6;&#x3002;</p>
<p>&#x7F51;&#x7EDC;&#x548C;&#x5B58;&#x50A8;&#x6269;&#x5C55;</p>
<p>&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x901A;&#x5E38;&#x662F;&#x4EA4;&#x6613;&#x603B;&#x4F53;&#x79EF;&#x7684;&#x91CD;&#x8981;&#x8D21;&#x732E;&#x8005;&#x3002;&#x66F4;&#x590D;&#x6742;&#x7684;&#x811A;&#x672C;&#x901A;&#x5E38;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x6BD4;&#x5982;&#x90A3;&#x4E9B;&#x7528;&#x4E8E;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x6216;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x811A;&#x672C;&#x3002;&#x6709;&#x65F6;&#x5019;&#x8FD9;&#x4E9B;&#x811A;&#x672C;&#x5360;&#x636E;&#x4E86;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5927;&#x90E8;&#x5206;&#xFF08;&#x8D85;&#x8FC7;75%&#xFF09;&#x7A7A;&#x95F4;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x79FB;&#x51FA;&#x4EA4;&#x6613;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x63D0;&#x5347;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53EF;&#x6269;&#x5C55;&#x6027;&#x3002;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x5728;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x540E;&#x53BB;&#x9664;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#xFF0C;&#x6216;&#x5728;&#x4F5C;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#x65F6;&#x6574;&#x4E2A;&#x5FFD;&#x7565;&#x5B83;&#x3002;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x53D1;&#x9001;&#x81F3;&#x6240;&#x6709;&#x8282;&#x70B9;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5B58;&#x50A8;&#x5728;&#x786C;&#x76D8;&#x4E2D;&#x3002;</p>
<p>&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x4F18;&#x5316;</p>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5347;&#x7EA7;&#x7B7E;&#x540D;&#x51FD;&#x6570;&#xFF08;CHECKSIG, CHECKMULTISIG, &#x7B49;&#xFF09;&#x51CF;&#x5C11;&#x4E86;&#x7B97;&#x6CD5;&#x7684;&#x8BA1;&#x7B97;&#x590D;&#x6742;&#x6027;&#x3002;&#x5F15;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x524D;&#xFF0C;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x7B7E;&#x540D;&#x7684;&#x7B97;&#x6CD5;&#x9700;&#x8981;&#x5927;&#x91CF;&#x7684;&#x54C8;&#x5E0C;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x4E0E;&#x4EA4;&#x6613;&#x7684;&#x5927;&#x5C0F;&#x6210;&#x6B63;&#x6BD4;&#x3002;&#x5728;O(n2)&#x4E2D;&#x5173;&#x4E8E;&#x7B7E;&#x540D;&#x64CD;&#x4F5C;&#x6570;&#x91CF;&#x65B9;&#x9762;&#xFF0C;&#x6570;&#x636E;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x589E;&#x52A0;&#xFF0C;&#x5728;&#x6240;&#x6709;&#x8282;&#x70B9;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x4E0A;&#x5F15;&#x5165;&#x4E86;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x8D1F;&#x62C5;&#x3002;&#x5F15;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x540E;&#xFF0C;&#x7B97;&#x6CD5;&#x66F4;&#x6539;&#x51CF;&#x5C11;&#x4E86;O(n2)&#x7684;&#x590D;&#x6742;&#x6027;&#x3002;</p>
<p>&#x79BB;&#x7EBF;&#x7B7E;&#x540D;&#x6539;&#x8FDB;</p>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7B7E;&#x540D;&#x5305;&#x542B;&#x4E86;&#x5728;&#x88AB;&#x7B7E;&#x540D;&#x7684;&#x54C8;&#x5E0C;&#x6563;&#x5217;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x6240;&#x5F15;&#x7528;&#x7684;&#x503C;&#xFF08;&#x6570;&#x91CF;&#xFF09;&#x3002;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#xFF0C;&#x4E00;&#x4E2A;&#x79BB;&#x7EBF;&#x7B7E;&#x540D;&#x88C5;&#x7F6E;&#xFF0C;&#x6BD4;&#x5982;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x524D;&#x9A8C;&#x8BC1;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x6570;&#x91CF;&#x3002;&#x8FD9;&#x901A;&#x5E38;&#x662F;&#x901A;&#x8FC7;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x6D41;&#x6765;&#x5B8C;&#x6210;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x662F;&#x5173;&#x4E8E;&#x4EE5;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x88AB;&#x5F15;&#x7528;&#x4F5C;&#x4E3A;&#x8F93;&#x5165;&#x7684;&#x3002;&#x7531;&#x4E8E;&#x8BE5;&#x6570;&#x91CF;&#x73B0;&#x5728;&#x662F;&#x5DF2;&#x7B7E;&#x540D;&#x7684;&#x627F;&#x8BFA;&#x54C8;&#x5E0C;&#x6563;&#x5217;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x6B64;&#x79BB;&#x7EBF;&#x88C5;&#x7F6E;&#x4E0D;&#x9700;&#x8981;&#x4EE5;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x6570;&#x91CF;&#x4E0D;&#x5339;&#x914D;&#xFF08;&#x88AB;&#x4E00;&#x4E2A;&#x6298;&#x4E2D;&#x7684;&#x5728;&#x7EBF;&#x7CFB;&#x7EDF;&#x8BEF;&#x62A5;&#xFF09;&#xFF0C;&#x5219;&#x7B7E;&#x540D;&#x65E0;&#x6548;&#x3002;</p>
<h2 id="42&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;">4.2&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;</h2>
<p>&#x4E4D;&#x4E00;&#x770B;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4F3C;&#x4E4E;&#x662F;&#x5BF9;&#x4EA4;&#x6613;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x56E0;&#x6B64;&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5C42;&#x9762;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x4F46;&#x4E8B;&#x5B9E;&#x5E76;&#x975E;&#x5982;&#x6B64;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E5F;&#x66F4;&#x6539;&#x4E86;&#x5355;&#x4E2A;UTXO&#x5982;&#x4F55;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5C42;&#x9762;&#x7684;&#x7279;&#x6027;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x5F15;&#x7528;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x6216;&#x4F20;&#x7EDF;&#xFF08;&#x5185;&#x8054;&#x89C1;&#x8BC1;&#xFF09;&#x8F93;&#x51FA;&#xFF0C;&#x6216;&#x8005;&#x4E24;&#x8005;&#x7686;&#x53EF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x628A;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x79F0;&#x4F5C;&#x201C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EA4;&#x6613;&#x201D;&#x662F;&#x6CA1;&#x6709;&#x610F;&#x4E49;&#x7684;&#x3002;&#x4F46;&#x662F;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x628A;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x53EB;&#x505A;&#x201C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x201D;&#x3002;</p>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5F15;&#x7528;&#x4E00;&#x4E2A;UTXO&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;&#x89C1;&#x8BC1;&#x3002;&#x5982;&#x679C;&#x662F;&#x4F20;&#x7EDF;&#x7684;UTXO&#xFF0C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5728;&#x5F15;&#x7528;&#x5B83;&#x65F6;&#xFF0C;UTXO&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x8981;&#x6C42;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x5728;&#x8BE5;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x90E8;&#x5206;&#x4E2D;&#x4EE5;&#x201C;&#x5185;&#x8054;&#x201D;&#xFF08;inline&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x88AB;&#x63D0;&#x4F9B;&#x3002;&#x4F46;&#x9694;&#x79BB;&#x89C1;&#x8BC1;UTXO&#x6307;&#x5B9A;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x5374;&#x80FD;&#x6EE1;&#x8DB3;&#x5904;&#x4E8E;&#x8F93;&#x5165;&#x4E4B;&#x5916;&#xFF08;&#x88AB;&#x9694;&#x79BB;&#xFF09;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;</p>
<h2 id="43&#x8F6F;&#x5206;&#x53C9;&#xFF08;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF09;">4.3&#x8F6F;&#x5206;&#x53C9;&#xFF08;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x6027;&#xFF09;</h2>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5BF9;&#x4E8E;&#x8F93;&#x51FA;&#x548C;&#x4EA4;&#x6613;&#x7684;&#x6784;&#x5EFA;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x5341;&#x5206;&#x91CD;&#x5927;&#x7684;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x6539;&#x53D8;&#x5C06;&#x901A;&#x5E38;&#x9700;&#x8981;&#x6BCF;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x548C;&#x94B1;&#x5305;&#x540C;&#x65F6;&#x53D1;&#x751F;&#xFF0C;&#x4EE5;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x2014;&#x2014;&#x5373;&#x6240;&#x8C13;&#x7684;&#x201C;&#x786C;&#x5206;&#x53C9;&#x201D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x66F4;&#x5C11;&#x7834;&#x574F;&#x6027;&#x7684;&#x6539;&#x53D8;&#x5F15;&#x5165;&#xFF0C;&#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x80FD;&#x5411;&#x540E;&#x517C;&#x5BB9;&#xFF0C;&#x88AB;&#x79F0;&#x4F5C;&#x201C;&#x8F6F;&#x5206;&#x53C9;&#x201D;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5347;&#x7EA7;&#x5141;&#x8BB8;&#x672A;&#x5347;&#x7EA7;&#x7684;&#x8F6F;&#x4EF6;&#x53BB;&#x5FFD;&#x7565;&#x90A3;&#x4E9B;&#x6539;&#x53D8;&#x7136;&#x540E;&#x7EE7;&#x7EED;&#x53BB;&#x64CD;&#x4F5C;&#x907F;&#x514D;&#x4EFB;&#x4F55;&#x5206;&#x88C2;&#x3002;</p>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x88AB;&#x8BBE;&#x8BA1;&#x6210;&#x8001;&#x7684;&#x201C;&#x975E;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x201D;&#x7CFB;&#x7EDF;&#x4ECD;&#x7136;&#x80FD;&#x591F;&#x9A8C;&#x8BC1;&#x5B83;&#x4EEC;&#xFF0C;&#x5BF9;&#x4E8E;&#x8001;&#x7684;&#x94B1;&#x5305;&#x6216;&#x8282;&#x70B9;&#x6765;&#x8BF4;&#xFF0C;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x201C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x82B1;&#x8D39;&#x201D;&#xFF08;anyone can spend&#xFF09;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8F93;&#x51FA;&#x80FD;&#x88AB;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x7B7E;&#x540D;&#x82B1;&#x8D39;&#xFF0C;&#x56E0;&#x6B64;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x91CC;&#x9762;&#x6CA1;&#x6709;&#x7B7E;&#x540D;&#xFF08;&#x7B7E;&#x540D;&#x88AB;&#x9694;&#x79BB;&#xFF09;&#x7684;&#x4E8B;&#x5B9E;&#x4E5F;&#x5E76;&#x4E0D;&#x4F1A;&#x5BFC;&#x81F4;&#x8BE5;&#x4EA4;&#x6613;&#x4E0D;&#x88AB;&#x9A8C;&#x8BC1;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x94B1;&#x5305;&#x548C;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x770B;&#x5230;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x671F;&#x671B;&#x5728;&#x4EA4;&#x6613;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4E2D;&#x4E3A;&#x8BE5;&#x8F93;&#x51FA;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x89C1;&#x8BC1;&#x3002;</p>
<h2 id="44&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x548C;&#x4EA4;&#x6613;&#x793A;&#x4F8B;">4.4&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x548C;&#x4EA4;&#x6613;&#x793A;&#x4F8B;</h2>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E9B;&#x4EA4;&#x6613;&#x793A;&#x4F8B;&#xFF0C;&#x770B;&#x770B;&#x4ED6;&#x4EEC;&#x662F;&#x5982;&#x4F55;&#x968F;&#x7740;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x800C;&#x6539;&#x53D8;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x5148;&#x770B;&#x770B;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5982;&#x4F55;&#x88AB;&#x6539;&#x53D8;&#x4E00;&#x4E2A;&#x201C;&#x652F;&#x4ED8;&#x7ED9;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x201D;&#xFF08;Pay-to-Public-Key-Hash &#xFF0C;P2PKH&#xFF09;&#x7684;&#x652F;&#x4ED8;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x518D;&#x770B;&#x540C;&#x6837;&#x7684;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5982;&#x4F55;&#x4F5C;&#x7528;&#x4E8E;&#x201C;&#x652F;&#x4ED8;&#x7ED9;&#x811A;&#x672C;&#x516C;&#x94A5;&#x201D;&#xFF08;Pay-to-Script-Hash &#xFF0C;P2SH&#xFF09;&#x811A;&#x672C;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4F1A;&#x770B;&#x770B;&#x4EE5;&#x4E0A;&#x4E24;&#x79CD;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x5982;&#x4F55;&#x53EF;&#x4EE5;&#x88AB;&#x5185;&#x5D4C;&#x5165;&#x4E00;&#x4E2A; P2SH &#x811A;&#x672C;&#x3002;</p>
<h3 id="441pay-to-witness-public-key-hash-p2wpkh">4.4.1Pay-to-Witness-Public-Key-Hash (P2WPKH)</h3>
<p>&#x5728;&#x3010;&#x4E00;&#x676F;&#x5496;&#x5561;&#x3011;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Alice&#x4E3A;&#x4E00;&#x676F;&#x5496;&#x5561;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x53BB;&#x4ED8;&#x6B3E;&#x7ED9;Bob&#xFF0C;&#x8BE5;&#x7B14;&#x4EA4;&#x6613;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4EF7;&#x503C;0.015BTC&#x7684; P2PKH &#x8F93;&#x51FA;&#xFF08;Bob&#x53EF;&#x7528;&#x6765;&#x82B1;&#x8D39;&#xFF09;&#xFF0C;&#x8BE5;&#x8F93;&#x51FA;&#x811A;&#x672C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p>P2PKH &#x8F93;&#x51FA;&#x811A;&#x672C;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><code>DUP HASH160 ab68025513c3dbd2f7b92a94e0581f5d50f654e7 EQUALVERIFY CHECKSIG</code></p>
<p>&#x5982;&#x679C;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF0C;Alice&#x5C06;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x201C;&#x652F;&#x4ED8;&#x7ED9;&#x89C1;&#x8BC1;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x201D;&#xFF08;P2WPKH&#xFF09;&#x811A;&#x672C;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x662F;&#x8FD9;&#x6837;&#x7684;&#xFF1A;</p>
<p>P2WPKH &#x8F93;&#x51FA;&#x811A;&#x672C;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><code>0 ab68025513c3dbd2f7b92a94e0581f5d50f654e7</code></p>
<p>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x76F8;&#x5BF9;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x8F93;&#x51FA;&#x660E;&#x663E;&#x5927;&#x4E3A;&#x7B80;&#x5316;&#x3002;&#x5B83;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x503C;&#xFF0C;&#x8FD9;&#x4E9B;&#x503C;&#x88AB;&#x63A8;&#x9001;&#x5230;&#x811A;&#x672C;&#x8BC4;&#x4F30;&#x5806;&#x6808;&#x4E2D;&#x3002;&#x5BF9;&#x4E8E;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#xFF08;&#x975E;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF09;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x63A8;&#x9001;&#x503C;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x82B1;&#x8D39;&#x7684;&#x8F93;&#x51FA;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x7B7E;&#x540D;&#xFF08;&#x6216;&#x8005;&#x66F4;&#x786E;&#x5207;&#x7684;&#x8BF4;&#xFF0C;&#x80FD;&#x88AB;&#x7A7A;&#x7684;&#x7B7E;&#x540D;&#x4F7F;&#x7528;&#xFF09;&#x3002;&#x800C;&#x5BF9;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x7684;&#x3001;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5BA2;&#x6237;&#x7AEF;&#x6765;&#x8BF4;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF08;0&#xFF09;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#x53F7;&#xFF08;&#x89C1;&#x8BC1;&#x7248;&#x672C;&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#xFF08;20&#x5B57;&#x8282;&#xFF09;&#x76F8;&#x5F53;&#x4E8E;&#x4E00;&#x4E2A;&#x9501;&#x5B9A;&#x811A;&#x672C;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x201D;&#xFF08; witness program&#xFF09;&#x3002;&#x8FD9;20&#x5B57;&#x8282;&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x5373;&#x662F;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5C31;&#x50CF;&#x5728; P2PKH &#x811A;&#x672C;&#x4E2D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;Bob&#x7528;&#x6765;&#x53BB;&#x82B1;&#x8D39;&#x8FD9;&#x4E2A;&#x8F93;&#x51FA;&#x76F8;&#x5E94;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5BF9;&#x4E8E;&#x521D;&#x59CB;&#x811A;&#x672C;&#xFF08;&#x975E;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF09;&#xFF0C;Bob&#x7684;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x7B7E;&#x540D;&#x5728;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x4E2D;&#xFF1A;</p>
<p>&#x4EE5;&#x4E0B;&#x88AB;&#x89E3;&#x7801;&#x7684;&#x4EA4;&#x6613;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A; P2PKH &#x8F93;&#x51FA;&#x88AB;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x4F7F;&#x7528;&#xFF1A;</p>
<p><code>[...]&#x201C;Vin&#x201D; : [&quot;txid&quot;: &quot;0627052b6f28912f2703066a912ea577f2ce4da4caa5a5fbd8a57286c345c2f2&quot;,&quot;vout&quot;: 0,          &quot;scriptSig&quot;: &#x201C;&lt;Bob&#x2019;s scriptSig&gt;&#x201D;,][...]</code></p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x8F93;&#x51FA;&#x65F6;&#xFF0C;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x5185;&#x4E0D;&#x5B58;&#x5728;&#x7B7E;&#x540D;&#x3002;&#x66FF;&#x4EE3;&#x7684;&#xFF0C;Bob&#x7684;&#x4EA4;&#x6613;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7A7A;&#x7684; scriptSig &#xFF0C;&#x5E76;&#x5728;&#x4EA4;&#x6613;&#x672C;&#x8EAB;&#x4E4B;&#x5916;&#x5305;&#x542B;&#x4E86;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF1A;</p>
<p>&#x4EE5;&#x4E0B;&#x88AB;&#x89E3;&#x7801;&#x7684;&#x4EA4;&#x6613;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;&#x88AB;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4F7F;&#x7528;&#x7684; P2WPKH &#x8F93;&#x51FA;&#xFF1A;</p>
<p><code>[...]&#x201C;Vin&#x201D; : [&quot;txid&quot;: &quot;0627052b6f28912f2703066a912ea577f2ce4da4caa5a5fbd8a57286c345c2f2&quot;,&quot;vout&quot;: 0,          &quot;scriptSig&quot;: &#x201C;&#x201D;,][...]&#x201C;witness&#x201D;: &#x201C;&lt;Bob&#x2019;s witness data&gt;&#x201D;[...]</code></p>
<h3 id="442&#x94B1;&#x5305;&#x7684;p2wpkh-pay-to-witness-script-hash&#x6784;&#x9020;">4.4.2&#x94B1;&#x5305;&#x7684;P2WPKH (Pay-to-Witness-Script-Hash)&#x6784;&#x9020;</h3>
<p>&#x5C24;&#x5176;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;P2WPKH &#x5E94;&#x8BE5;&#x53EA;&#x6709;&#x6536;&#x6B3E;&#x4EBA;&#xFF08;&#x63A5;&#x6536;&#x65B9;&#xFF09;&#x521B;&#x5EFA;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7531;&#x53D1;&#x9001;&#x8005;&#x4ECE;&#x5DF2;&#x77E5;&#x7684;&#x516C;&#x94A5;&#x3001;P2PKH &#x811A;&#x672C;&#x6216;&#x5730;&#x5740;&#x8FDB;&#x884C;&#x8F6C;&#x6362;&#x3002;&#x53D1;&#x9001;&#x65B9;&#x65E0;&#x4ECE;&#x77E5;&#x9053;&#x63A5;&#x6536;&#x8005;&#x7684;&#x94B1;&#x5305;&#x662F;&#x5426;&#x5177;&#x6709;&#x80FD;&#x529B;&#x6784;&#x5EFA;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4F7F;&#x7528; P2WPKH &#x8F93;&#x51FA;&#x3002;</p>
<p>&#x53E6;&#x5916;&#xFF0C;P2WPKH &#x8F93;&#x51FA;&#x5FC5;&#x987B;&#x4ECE;&#x88AB;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E2D;&#x521B;&#x5EFA;&#x3002;&#x672A;&#x538B;&#x7F29;&#x516C;&#x94A5;&#x5728;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E2D;&#x662F;&#x975E;&#x6807;&#x51C6;&#x7684;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x5C06;&#x6765;&#x7684;&#x8F6F;&#x5206;&#x53C9;&#x660E;&#x786E;&#x7981;&#x7528;&#x3002;&#x5982;&#x679C;&#x5728; P2WPKH &#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x6765;&#x81EA;&#x672A;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x53EF;&#x80FD;&#x4E0D;&#x53EF;&#x7528;&#xFF0C;&#x60A8;&#x5C06;&#x53EF;&#x80FD;&#x4E22;&#x5931;&#x8D44;&#x91D1;&#x3002;P2WPKH &#x8F93;&#x51FA;&#x5E94;&#x8BE5;&#x7531;&#x6536;&#x6B3E;&#x4EBA;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x901A;&#x8FC7;&#x4ECE;&#x94B1;&#x5305;&#x79C1;&#x94A5;&#x4E2D;&#x83B7;&#x53D6;&#x538B;&#x7F29;&#x516C;&#x94A5;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x3002;</p>
<p><strong>&#x8B66;&#x544A;</strong>  P2WPKH &#x5E94;&#x8BE5;&#x7531;&#x6536;&#x6B3E;&#x4EBA;&#xFF08;&#x63A5;&#x6536;&#x8005;&#xFF09;&#x901A;&#x8FC7;&#x5C06;&#x88AB;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x8F6C;&#x6362;&#x6210;P2WPKH&#x54C8;&#x5E0C;&#x503C;&#x8FDB;&#x884C;&#x521B;&#x5EFA;&#x3002;&#x4F60;&#x7EDD;&#x4E0D;&#x5E94;&#x8BE5;&#x5C06;P2PKH&#x811A;&#x672C;&#x3001;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x6216;&#x672A;&#x538B;&#x7F29;&#x516C;&#x94A5;&#x8F6C;&#x6362;&#x6210;P2WPKH&#x89C1;&#x8BC1;&#x811A;&#x672C;&#x3002;</p>
<h3 id="443pay-to-witness-script-hash-p2wsh">4.4.3Pay-to-Witness-Script-Hash (P2WSH)</h3>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x68C0;&#x8BC1;&#x7A0B;&#x5E8F;&#x5BF9;&#x5E94;&#x4E00;&#x4E2A;&#x201C;&#x652F;&#x4ED8;&#x7ED9;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x201D;&#xFF08; Pay-to-Script-Hash , P2SH&#xFF09;&#x811A;&#x672C;&#x3002;&#x6211;&#x4EEC;&#x5728;[p2sh]&#x8FD9;&#x7AE0;&#x4E2D;&#x89C1;&#x8FC7;&#x3002;&#x5728;&#x54EA;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x4F7F;&#x7528;&#x4E86;P2SH &#x6765;&#x8868;&#x8FBE;&#x4E00;&#x4E2A;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x3002;&#x5BF9;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x7684;&#x652F;&#x4ED8;&#x88AB;&#x7F16;&#x7801;&#x6210;&#x4E00;&#x4E2A;&#x8FD9;&#x6837;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#xFF1A;</p>
<p>P2SH &#x8F93;&#x51FA;&#x811A;&#x672C;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><code>HASH160 54c557e07dde5bb6cb791c7a540e0a4796f5e97e EQUAL</code></p>
<p>&#x8FD9;&#x4E2A;P2SH&#x811A;&#x672C;&#x5F15;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#xFF08; redeem script &#xFF09;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x6539;&#x811A;&#x672C;&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x201C;2 of 3&#x201D;&#x7684;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x9700;&#x6C42;&#x6765;&#x4F7F;&#x7528;&#x8D44;&#x91D1;&#x3002;&#x4E3A;&#x4E86;&#x4F7F;&#x7528;&#x8BE5;&#x8F93;&#x51FA;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x5C06;&#x63D0;&#x4F9B;&#x8FD9;&#x4E2A;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#xFF08;&#x5176;&#x54C8;&#x5E0C;&#x503C;&#x4E0E;P2SH &#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x503C;&#x5339;&#x914D;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x6EE1;&#x8DB3;&#x8BE5;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x6240;&#x9700;&#x7684;&#x7B7E;&#x540D;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x5728;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x4E2D;&#xFF1A;</p>
<p>&#x663E;&#x793A;&#x4E00;&#x4E2A;P2SH&#x8F93;&#x51FA;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x89E3;&#x7801;&#x4EA4;&#x6613;&#xFF1A;</p>
<p><code>[...]&#x201C;Vin&#x201D; : [&quot;txid&quot;: &quot;abcdef12345...&quot;,&quot;vout&quot;: 0,          &quot;scriptSig&quot;: &#x201C;&lt;SigA&gt; &lt;SigB&gt; &lt;2 PubA PubB PubC PubD PubE 5 CHECKMULTISIG&gt;&#x201D;,]</code></p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x6574;&#x4E2A;&#x793A;&#x4F8B;&#x5982;&#x4F55;&#x5347;&#x7EA7;&#x6210;&#x4E3A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x3002;&#x5982;&#x679C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x5BA2;&#x6237;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x4F1A;&#x4ED8;&#x6B3E;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x201C;&#x652F;&#x4ED8;&#x7ED9;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x201D;(P2WSH)&#x8F93;&#x51FA;&#xFF0C;&#x770B;&#x8D77;&#x6765;&#x5C31;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<p>P2WSH &#x8F93;&#x51FA;&#x811A;&#x672C;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><code>0 9592d601848d04b172905e0ddb0adde59f1590f1e553ffc81ddc4b0ed927dd73</code></p>
<p>&#x518D;&#x4E00;&#x6B21;&#xFF0C;&#x5C31;&#x50CF;P2WPKH&#x7684;&#x4F8B;&#x5B50;&#x4E00;&#x6837;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7B49;&#x540C;&#x811A;&#x672C;&#x8981;&#x7B80;&#x5355;&#x5F97;&#x591A;&#xFF0C;&#x7701;&#x7565;&#x4E86;&#x5404;&#x79CD;&#x4F60;&#x5728;P2SH&#x811A;&#x672C;&#x4E2D;&#x89C1;&#x5230;&#x7684;&#x811A;&#x672C;&#x64CD;&#x4F5C;&#x7B26;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x4EC5;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x63A8;&#x9001;&#x5230;&#x5806;&#x6808;&#x7684;&#x503C;&#xFF1A;&#x4E00;&#x4E2A;&#x89C1;&#x8BC1;&#x7248;&#x672C;&#xFF08;0&#xFF09;&#x548C;&#x4E00;&#x4E2A;32&#x5B57;&#x8282;&#x7684;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>    &#x5F53;P2SH&#x4F7F;&#x7528;20&#x5B57;&#x8282;&#x7684;RIPEMD160(SHA256(script)) &#x54C8;&#x5E0C;&#x503C;&#x65F6;&#xFF0C;P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;32&#x5B57;&#x8282;&#x7684;SHA256&#xFF08;&#x811A;&#x672C;&#xFF09;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x5728;&#x9009;&#x62E9;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x65F6;&#xFF0C;&#x8FD9;&#x4E00;&#x5DEE;&#x5F02;&#x662F;&#x6709;&#x610F;&#x4E3A;&#x4E4B;&#xFF0C;&#x88AB;&#x7528;&#x4E8E;&#x901A;&#x8FC7;&#x54C8;&#x5E0C;&#x503C;&#x957F;&#x5EA6;&#x6765;&#x533A;&#x5206;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF08;P2WPKH and P2WSH&#xFF09;&#xFF0C;&#x5E76;&#x4E3A;P2WSH&#xFF08;128&#x4F4D; &#x800C;&#x4E0D;&#x662F; 80 &#x4F4D;P2SH&#xFF09;&#x63D0;&#x4F9B;&#x66F4;&#x5F3A;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x548C;&#x8DB3;&#x591F;&#x7684;&#x7B7E;&#x540D;&#x6EE1;&#x8DB3;&#x5E76;&#x82B1;&#x51FA;P2WSH&#x8F93;&#x51FA;&#x3002;&#x4F5C;&#x4E3A;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x548C;&#x7B7E;&#x540D;&#x88AB;&#x9694;&#x79BB;&#x5728;&#x6B64;&#x652F;&#x51FA;&#x4EA4;&#x6613;&#x4E4B;&#x5916;&#x3002;&#x5728;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x5185;&#x90E8;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x94B1;&#x5305;&#x4F1A;&#x9632;&#x6B62;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;scriptSig&#xFF1A;</p>
<p>&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;P2WSH&#x8F93;&#x51FA;&#x88AB;&#x7528;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x82B1;&#x51FA;&#x7684;&#x89E3;&#x7801;&#x4EA4;&#x6613;&#xFF1A;</p>
<p><code>[...]&#x201C;Vin&#x201D; : [&quot;txid&quot;: &quot;abcdef12345...&quot;,&quot;vout&quot;: 0,          &quot;scriptSig&quot;: &#x201C;&#x201D;,][...]&#x201C;witness&#x201D;: &#x201C;&lt;SigA&gt; &lt;SigB&gt; &lt;2 PubA PubB PubC PubD PubE 5 CHECKMULTISIG&gt;&#x201D;[...]</code></p>
<h3 id="444&#x533A;&#x5206;p2wpkh&#x548C;p2wsh">4.4.4&#x533A;&#x5206;P2WPKH&#x548C;P2WSH</h3>
<p>&#x5728;&#x524D;&#x9762;&#x7684;&#x4E24;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C55;&#x793A;&#x4E86;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x68C0;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF1A;&#x652F;&#x4ED8;&#x7ED9;&#x89C1;&#x8BC1;&#x516C;&#x94A5;&#x54C8;&#x5E0C; (P2WPKH)&#x548C; &#x652F;&#x4ED8;&#x7ED9;&#x89C1;&#x8BC1;&#x811A;&#x672C;&#x54C8;&#x5E0C;(P2WSH) &#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x68C0;&#x8BC1;&#x7A0B;&#x5E8F;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x7248;&#x672C;&#x53F7;&#x548C;&#x4E00;&#x4E2A;&#x8DDF;&#x968F;&#x5176;&#x540E;&#x7684;&#x66F4;&#x957F;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x7EC4;&#x6210;&#x3002;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x975E;&#x5E38;&#x76F8;&#x4F3C;&#xFF0C;&#x4F46;&#x662F;&#x88AB;&#x89E3;&#x91CA;&#x5F97;&#x975E;&#x5E38;&#x4E0D;&#x540C;&#xFF1A;&#x4E00;&#x4E2A;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5B83;&#x88AB;&#x4E00;&#x4E2A;&#x7B7E;&#x540D;&#x6240;&#x6EE1;&#x8DB3;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x4E00;&#x4E2A;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5B83;&#x88AB;&#x4E00;&#x4E2A;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x6240;&#x6EE1;&#x8DB3;&#x3002;&#x4ED6;&#x4EEC;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x952E;&#x533A;&#x522B;&#x662F;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x957F;&#x5EA6;&#xFF1A;</p>
<ul>
<li>P2WPKH&#x4E2D;&#x7684;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x503C;&#x662F;20&#x5B57;&#x8282;&#x3002;</li>
<li>P2WSH&#x4E2D;&#x7684;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x503C;&#x662F;32&#x5B57;&#x8282;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E2A;&#x533A;&#x522B;&#x4F7F;&#x5F97;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5BF9;&#x8FD9;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x533A;&#x5206;&#x3002;&#x901A;&#x8FC7;&#x67E5;&#x770B;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x5B83;&#x662F;&#x4EC0;&#x4E48;&#x7C7B;&#x578B;&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF0C;P2WPKH &#x6216;&#x8005; P2WSH&#x3002;</p>
<h2 id="45&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5347;&#x7EA7;">4.5&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5347;&#x7EA7;</h2>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x770B;&#x5230;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x5347;&#x7EA7;&#x9700;&#x8981;&#x7ECF;&#x8FC7;&#x4E24;&#x6B65;&#x8FC7;&#x7A0B;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x94B1;&#x5305;&#x5FC5;&#x987B;&#x521B;&#x5EFA;&#x7279;&#x6B8A;&#x7684;&#x9694;&#x79BB;&#x578B;&#x8F93;&#x51FA;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x88AB;&#x77E5;&#x9053;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EA4;&#x6613;&#x7684;&#x94B1;&#x5305;&#x82B1;&#x8D39;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Alice&#x7684;&#x94B1;&#x5305;&#x662F;segwit&#x610F;&#x8BC6;&#x5230;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x4F7F;&#x7528;Segregated Witness&#x811A;&#x672C;&#x521B;&#x5EFA;&#x7279;&#x6B8A;&#x8F93;&#x51FA;&#x3002;Bob&#x7684;&#x94B1;&#x5305;&#x4E5F;&#x662F;segwit&#x610F;&#x8BC6;&#x5230;&#xFF0C;&#x5E76;&#x80FD;&#x591F;&#x82B1;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x53EF;&#x80FD;&#x4E0D;&#x660E;&#x663E;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;Alice&#x7684;&#x94B1;&#x5305;&#x9700;&#x8981;&#x77E5;&#x9053;Bob&#x4F7F;&#x7528;&#x4E86;&#x4E00;&#x4E2A;&#x652F;&#x6301;segwit&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x5982;&#x679C;Bob&#x7684;&#x94B1;&#x5305;&#x6CA1;&#x6709;&#x5347;&#x7EA7;&#xFF0C;&#x5E76;&#x4E14;Alice&#x8BD5;&#x56FE;&#x5BF9;Bob&#x8FDB;&#x884C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4ED8;&#x6B3E;&#xFF0C;&#x90A3;&#x4E48;Bob&#x7684;&#x94B1;&#x5305;&#x5C06;&#x65E0;&#x6CD5;&#x68C0;&#x6D4B;&#x5230;&#x8FD9;&#x4E9B;&#x4ED8;&#x6B3E;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x5BF9;&#x4E8E;P2WPKH&#x548C;P2WSH&#x4ED8;&#x6B3E;&#x7C7B;&#x578B;&#xFF0C;&#x53D1;&#x4EF6;&#x4EBA;&#x548C;&#x6536;&#x4EF6;&#x4EBA;&#x94B1;&#x5305;&#x90FD;&#x9700;&#x8981;&#x5347;&#x7EA7;&#x624D;&#x80FD;&#x4F7F;&#x7528;segwit&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x53D1;&#x4EF6;&#x4EBA;&#x7684;&#x94B1;&#x5305;&#x9700;&#x8981;&#x77E5;&#x9053;&#x6536;&#x4EF6;&#x4EBA;&#x7684;&#x94B1;&#x5305;&#x662F;&#x5426;&#x5177;&#x6709;&#x9694;&#x79BB;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E0D;&#x4F1A;&#x5728;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x540C;&#x65F6;&#x5B9E;&#x65BD;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x88AB;&#x5B9E;&#x65BD;&#x4E3A;&#x5411;&#x540E;&#x517C;&#x5BB9;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x5176;&#x4E2D;&#x65B0;&#x8001;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x5171;&#x5B58;&#x3002;&#x94B1;&#x5305;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x5C06;&#x72EC;&#x7ACB;&#x5347;&#x7EA7;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x4EE5;&#x6DFB;&#x52A0;&#x9694;&#x79BB;&#x533A;&#x529F;&#x80FD;&#x3002;&#x5F53;&#x53D1;&#x4EF6;&#x4EBA;&#x548C;&#x6536;&#x4EF6;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x611F;&#x77E5;&#x5230;&#x7F51;&#x5FD7;&#x65F6;&#xFF0C;&#x4F7F;&#x7528;P2WPKH&#x548C;P2WSH&#x4ED8;&#x6B3E;&#x7C7B;&#x578B;&#x3002;&#x4F20;&#x7EDF;&#x7684;P2PKH&#x548C;P2SH&#x5C06;&#x7EE7;&#x7EED;&#x4E3A;&#x975E;&#x5347;&#x7EA7;&#x7684;&#x94B1;&#x5305;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x7559;&#x4E0B;&#x4E86;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x60C5;&#x51B5;&#xFF0C;&#x4E0B;&#x4E00;&#x8282;&#x5C06;&#x8BA8;&#x8BBA;&#x8FD9;&#x4E2A;&#x60C5;&#x51B5;&#xFF1A;</p>
<ul>
<li>&#x53D1;&#x4EF6;&#x4EBA;&#x7684;&#x94B1;&#x5305;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x4E0D;&#x662F;&#x517C;&#x5BB9;segwit&#x5230;&#x4ED8;&#x6B3E;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x53EF;&#x4EE5;&#x5904;&#x7406;segwit&#x4EA4;&#x6613;&#x3002;</li>
<li>&#x5177;&#x6709;&#x9694;&#x79BB;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#x7684;&#x53D1;&#x4EF6;&#x4EBA;&#x94B1;&#x5305;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x548C;&#x533A;&#x5206;&#x5177;&#x6709;&#x9694;&#x79BB;&#x8BC6;&#x522B;&#x529F;&#x80FD;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x548C;&#x4E0D;&#x662F;&#x4ED6;&#x4EEC;&#x5730;&#x5740;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x3002;</li>
</ul>
<h3 id="451&#x5728;p2sh&#x4E2D;&#x5D4C;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;">4.5.1&#x5728;P2SH&#x4E2D;&#x5D4C;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;</h3>
<p>&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x5047;&#x8BBE;Alice&#x7684;&#x94B1;&#x5305;&#x6CA1;&#x6709;&#x5347;&#x7EA7;&#x5230;segwit&#xFF0C;&#x4F46;&#x662F;Bob&#x7684;&#x94B1;&#x5305;&#x5DF2;&#x7ECF;&#x5347;&#x7EA7;&#xFF0C;&#x53EF;&#x4EE5;&#x5904;&#x7406;segwit&#x4EA4;&#x6613;&#x3002;Alice&#x548C;Bob&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x201C;&#x65E7;&#x201D;&#x975E;segwit&#x4EA4;&#x6613;&#x3002;&#x4F46;&#x662F;Bob&#x5F88;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;segwit&#x6765;&#x964D;&#x4F4E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x5229;&#x7528;&#x9002;&#x7528;&#x4E8E;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6298;&#x6263;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Bob&#x7684;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E00;&#x4E2A;segwit&#x811A;&#x672C;&#x7684;P2SH&#x5730;&#x5740;&#x3002;Alice&#x7684;&#x94B1;&#x5305;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x201C;&#x6B63;&#x5E38;&#x7684;&#x201D;P2SH&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;segwit&#x7684;&#x77E5;&#x8BC6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4ED8;&#x6B3E;&#x3002;&#x7136;&#x540E;&#xFF0C;Bob&#x7684;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x9694;&#x79BB;&#x4EA4;&#x6613;&#x6765;&#x652F;&#x4ED8;&#x8FD9;&#x7B14;&#x6B3E;&#x9879;&#xFF0C;&#x5145;&#x5206;&#x5229;&#x7528;&#x9694;&#x79BB;&#x4EA4;&#x6613;&#x5E76;&#x964D;&#x4F4E;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;</p>
<p>&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x89C1;&#x8BC1;&#x811A;&#x672C;P2PKH&#x548C;P2WSH&#x90FD;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5230;P2SH&#x5730;&#x5740;&#x4E2D;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x662F;P2SH&#xFF08;P2PKH&#xFF09;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x662F;P2SH&#xFF08;P2WSH&#xFF09;&#x3002;</p>
<h3 id="452&#x5728;-p2sh-&#x4E2D;&#x7684;-p2wpkh">4.5.2&#x5728; P2SH &#x4E2D;&#x7684; P2WPKH</h3>
<p>&#x89C1;&#x8BC1;&#x811A;&#x672C;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x662F;P2SH&#xFF08;P2WPKH&#xFF09;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;Pay-to-Witness-Public-Key-Hash&#x8BC1;&#x660E;&#x7A0B;&#x5E8F;&#xFF0C;&#x5D4C;&#x5165;&#x5728;Pay-to-Script-Hash&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x4E0D;&#x77E5;&#x9053;segwit&#x7684;&#x94B1;&#x5305;&#x4F7F;&#x7528;&#x3002;</p>
<p>Bob&#x7684;&#x94B1;&#x5305;&#x7528;Bob&#x7684;&#x516C;&#x94A5;&#x6784;&#x9020;&#x4E86;&#x4E00;&#x4E2A;P2WPKH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7136;&#x540E;&#x88AB;&#x6563;&#x5217;&#xFF0C;&#x7ED3;&#x679C;&#x6563;&#x5217;&#x88AB;&#x7F16;&#x7801;&#x4E3A;P2SH&#x811A;&#x672C;&#x3002;P2SH&#x811A;&#x672C;&#x88AB;&#x8F6C;&#x6362;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x4E00;&#x4E2A;&#x4EE5;&#x201C;3&#x201D;&#x5F00;&#x59CB;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;[P2SH]&#x90E8;&#x5206;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#x3002;</p>
<p>Bob&#x7684;&#x94B1;&#x5305;&#x4ECE;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;P2WPKH &#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x5F00;&#x59CB;&#xFF1A;</p>
<p>Bob&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF1A;</p>
<p><code>0 ab68025513c3dbd2f7b92a94e0581f5d50f654e7</code></p>
<p>P2WPKH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7531;&#x89C1;&#x8BC1;&#x7248;&#x672C;&#x548C;Bob&#x7684;20&#x5B57;&#x8282;&#x516C;&#x94A5;&#x6563;&#x5217;&#x7EC4;&#x6210;&#x3002;</p>
<p>Bob&#x7684;&#x94B1;&#x5305;&#x7136;&#x540E;&#x6563;&#x5217;&#x4E4B;&#x524D;&#x7684;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5148;&#x7528;SHA256&#xFF0C;&#x7136;&#x540E;&#x7528;RIPEMD160&#xFF0C;&#x4EA7;&#x751F;&#x53E6;&#x4E00;&#x4E2A;20&#x5B57;&#x8282;&#x7684;&#x6563;&#x5217;&#xFF1A;</p>
<p>P2WPKH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7684;HASH160</p>
<p><code>3e0547268b3b19288b3adef9719ec8659f4b2b0b</code></p>
<p>&#x7136;&#x540E;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7684;hash&#x5D4C;&#x5165;&#x5230;P2SH&#x811A;&#x672C;&#x4E2D;&#xFF1A;</p>
<p><code>HASH160 3e0547268b3b19288b3adef9719ec8659f4b2b0b EQUAL</code></p>
<p>&#x6700;&#x540E;&#xFF0C;P2SH&#x811A;&#x672C;&#x8F6C;&#x6362;&#x4E3A;P2SH&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF1A;</p>
<p><code>37Lx99uaGn5avKBxiW26HjedQE3LrDCZru</code></p>
<p>&#x73B0;&#x5728;&#xFF0C;Bob&#x53EF;&#x4EE5;&#x663E;&#x793A;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7ED9;&#x987E;&#x5BA2;&#x4ED8;&#x94B1;&#x4E70;&#x5496;&#x5561;&#x3002;Alice&#x7684;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x652F;&#x4ED8;&#x7ED9;&#x4E0D;&#x652F;&#x6301;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x50CF;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E00;&#x6837;&#x3002;&#x5C3D;&#x7BA1;Alice&#x7684;&#x94B1;&#x5305;&#x4E0D;&#x652F;&#x6301;segwit&#xFF0C;&#x4F46;&#x5B83;&#x521B;&#x5EFA;&#x7684;&#x4ED8;&#x6B3E;&#x53EF;&#x4EE5;&#x7531;Bob&#x4F7F;&#x7528;segwit&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#x3002;</p>
<h3 id="453p2sh&#x5185;&#x7684;p2wsh">4.5.3P2SH&#x5185;&#x7684;P2WSH</h3>
<p>&#x540C;&#x6837;&#xFF0C;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;multisig&#x811A;&#x672C;&#x6216;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x811A;&#x672C;&#x7684;P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x53EF;&#x4EE5;&#x5D4C;&#x5165;&#x5230;P2SH&#x811A;&#x672C;&#x548C;&#x5730;&#x5740;&#x4E2D;&#xFF0C;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x94B1;&#x5305;&#x90FD;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x4E0E;segwit&#x517C;&#x5BB9;&#x7684;&#x652F;&#x4ED8;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;<a href="https://github.com/bitcoinbook/bitcoinbook/blob/second_edition/appdx-segwit.asciidoc#p2wsh" target="_blank">Pay-to-Witness-Script-Hash&#xFF08;P2WSH&#xFF09;</a>&#x4E2D;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5BF9;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x7684;&#x4ED8;&#x6B3E;&#x3002;&#x4E3A;&#x4E86;&#x8BA9;&#x4EFB;&#x4F55;&#x5BA2;&#x6237;&#x652F;&#x4ED8;&#x4ED6;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x65E0;&#x8BBA;&#x4ED6;&#x4EEC;&#x7684;&#x94B1;&#x5305;&#x662F;&#x5426;&#x5347;&#x7EA7;&#x4E3A;&#x9694;&#x79BB;&#x5F00;&#x5173;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x94B1;&#x5305;&#x90FD;&#x53EF;&#x4EE5;&#x5728;P2SH&#x811A;&#x672C;&#x4E2D;&#x5D4C;&#x5165;P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x94B1;&#x5305;&#x521B;&#x5EFA;&#x4E0E;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x5BF9;&#x5E94;&#x7684;P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x7528;SHA256&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x5904;&#x7406;&#xFF1A;</p>
<p>&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x94B1;&#x5305;&#x521B;&#x5EFA;&#x4E86;P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;</p>
<p><code>0 9592d601848d04b172905e0ddb0adde59f1590f1e553ffc81ddc4b0ed927dd73</code></p>
<p>&#x7136;&#x540E;&#xFF0C;&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x672C;&#x8EAB;&#x7528;SHA256&#x548C;RIPEMD160&#x6563;&#x5217;&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x7684;20&#x5B57;&#x8282;&#x6563;&#x5217;&#xFF0C;&#x5982;&#x4F20;&#x7EDF;&#x7684;P2SH&#x6240;&#x4F7F;&#x7528;&#x7684;&#x6563;&#x5217;&#xFF1A;</p>
<p>P2WSH&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#x7684;HASH160</p>
<p><code>86762607e8fe87c0c37740cddee880988b9455b2</code>    </p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x94B1;&#x5305;&#x5C06;&#x54C8;&#x5E0C;&#x7801;&#x653E;&#x5165;P2SH&#x811A;&#x672C;&#x4E2D;&#xFF1A;</p>
<p><code>HASH160 86762607e8fe87c0c37740cddee880988b9455b2 EQUAL</code></p>
<p>&#x6700;&#x540E;&#xFF0C;&#x94B1;&#x5305;&#x4ECE;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF1A;</p>
<pre><code>3Dwz1MXhM6EfFoJChHCxh1jWHb8GQqRenG
</code></pre><p>&#x73B0;&#x5728;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x4ED8;&#x6B3E;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x652F;&#x6301;segwit&#x3002;&#x7136;&#x540E;&#xFF0C;&#x7A46;&#x7F55;&#x9ED8;&#x5FB7;&#x7684;&#x516C;&#x53F8;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x9694;&#x79BB;&#x4EA4;&#x6613;&#x6765;&#x652F;&#x4ED8;&#x8FD9;&#x4E9B;&#x6B3E;&#x9879;&#xFF0C;&#x5229;&#x7528;&#x5305;&#x62EC;&#x8F83;&#x4F4E;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x5728;&#x5185;&#x7684;&#x9694;&#x79BB;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="454&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5730;&#x5740;">4.5.4&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5730;&#x5740;</h3>
<p>&#x5728;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x90E8;&#x7F72;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E4B;&#x540E;&#xFF0C;&#x94B1;&#x5305;&#x5347;&#x7EA7;&#x4E4B;&#x524D;&#x9700;&#x8981;&#x4E00;&#x4E9B;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5F88;&#x53EF;&#x80FD;&#x50CF;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x4E00;&#x8282;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;segwit&#x5C06;&#x4E3B;&#x8981;&#x7528;&#x4E8E;&#x5D4C;&#x5165;&#x5230;P2SH&#x4E2D;&#xFF0C;&#x81F3;&#x5C11;&#x51E0;&#x4E2A;&#x6708;&#x3002;</p>
<p>&#x4F46;&#x662F;&#xFF0C;&#x6700;&#x7EC8;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x7684;&#x94B1;&#x5305;&#x90FD;&#x80FD;&#x591F;&#x652F;&#x6301;&#x9694;&#x79BB;&#x652F;&#x4ED8;&#x3002;&#x90A3;&#x65F6;&#x5C31;&#x4E0D;&#x518D;&#x9700;&#x8981;&#x5728;P2SH&#x4E2D;&#x5D4C;&#x5165;segwit&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x521B;&#x5EFA;&#x4E00;&#x79CD;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5F62;&#x5F0F;&#xFF0C;&#x8868;&#x660E;&#x63A5;&#x6536;&#x8005;&#x662F;&#x5177;&#x6709;&#x9694;&#x79BB;&#x610F;&#x8BC6;&#x7684;&#xFF0C;&#x5E76;&#x76F4;&#x63A5;&#x5BF9;&#x8BC1;&#x4EBA;&#x7A0B;&#x5E8F;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#x3002;&#x6709;&#x5173;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EBA;&#x5730;&#x5740;&#x8BA1;&#x5212;&#x7684;&#x5EFA;&#x8BAE;&#x6709;&#x5F88;&#x591A;&#xFF0C;&#x4F46;&#x6CA1;&#x6709;&#x4E00;&#x4E2A;&#x88AB;&#x79EF;&#x6781;&#x63A8;&#x884C;&#x3002;</p>
<h3 id="455&#x4EA4;&#x6613;&#x6807;&#x8BC6;&#x7B26;">4.5.5&#x4EA4;&#x6613;&#x6807;&#x8BC6;&#x7B26;</h3>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x6700;&#x5927;&#x597D;&#x5904;&#x4E4B;&#x4E00;&#x5C31;&#x662F;&#x6D88;&#x9664;&#x4E86;&#x7B2C;&#x4E09;&#x65B9;&#x4EA4;&#x6613;&#x5EF6;&#x5C55;&#x6027;&#x3002;</p>
<p>&#x5728;segwit&#x4E4B;&#x524D;&#xFF0C;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x5FAE;&#x5999;&#x5730;&#x4FEE;&#x6539;&#x5176;&#x7B7E;&#x540D;&#xFF0C;&#x5728;&#x4E0D;&#x6539;&#x53D8;&#x4EFB;&#x4F55;&#x57FA;&#x672C;&#x5C5E;&#x6027;&#xFF08;&#x8F93;&#x5165;&#xFF0C;&#x8F93;&#x51FA;&#xFF0C;&#x91D1;&#x989D;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x66F4;&#x6539;&#x5176;&#x4EA4;&#x6613;ID&#xFF08;&#x6563;&#x5217;&#xFF09;&#x3002;&#x8FD9;&#x4E3A;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x521B;&#x9020;&#x4E86;&#x673A;&#x4F1A;&#xFF0C;&#x4EE5;&#x53CA;&#x653B;&#x51FB;&#x4E86;&#x7F16;&#x5199;&#x4E0D;&#x597D;&#x7684;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x5047;&#x5B9A;&#x672A;&#x7ECF;&#x8BC1;&#x5B9E;&#x7684;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x662F;&#x4E0D;&#x53EF;&#x53D8;&#x7684;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5F15;&#x5165;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF0C;&#x4EA4;&#x6613;&#x6709;&#x4E24;&#x4E2A;&#x6807;&#x8BC6;&#x7B26;txid&#x548C;wtxid&#x3002;&#x4F20;&#x7EDF;&#x7684;&#x4EA4;&#x6613;ID txid&#x662F;&#x5E8F;&#x5217;&#x5316;&#x4EA4;&#x6613;&#x7684;&#x53CC;SHA256&#x6563;&#x5217;&#xFF0C;&#x6CA1;&#x6709;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;&#x4EA4;&#x6613;wtxid&#x662F;&#x5177;&#x6709;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4EA4;&#x6613;&#x7684;&#x65B0;&#x5E8F;&#x5217;&#x5316;&#x683C;&#x5F0F;&#x7684;&#x53CC;SHA256&#x6563;&#x5217;&#x3002;</p>
<p>&#x4F20;&#x7EDF;txid&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x4E0E;nonsegwit&#x4EA4;&#x6613;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7531;&#x4E8E;segwit&#x4EA4;&#x6613;&#x5728;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x4E2D;&#x90FD;&#x6709;&#x7A7A;&#x7684;scriptSigs&#xFF0C;&#x56E0;&#x6B64;&#x6CA1;&#x6709;&#x53EF;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x4FEE;&#x6539;&#x7684;&#x90E8;&#x5206;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5728;&#x9694;&#x79BB;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x5373;&#x4F7F;&#x4EA4;&#x6613;&#x672A;&#x7ECF;&#x786E;&#x8BA4;&#xFF0C;txid&#x4E5F;&#x662F;&#x7B2C;&#x4E09;&#x65B9;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x7684;&#x3002;</p>
<p>wtxid&#x5C31;&#x50CF;&#x4E00;&#x4E2A;&#x201C;&#x6269;&#x5C55;&#x7684;&#x201D;ID&#xFF0C;&#x56E0;&#x4E3A;hash&#x4E5F;&#x5305;&#x542B;&#x4E86;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x6CA1;&#x6709;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4F20;&#x8F93;&#xFF0C;&#x5219;wtxid&#x548C;txid&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x7531;&#x4E8E;wtxid&#x5305;&#x542B;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#xFF08;&#x7B7E;&#x540D;&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x7531;&#x4E8E;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x5EF6;&#x5C55;&#x6027;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#xFF0C;wtxid&#x5E94;&#x8BE5;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x53EF;&#x5EF6;&#x5C55;&#x7684;&#x3002;&#x53EA;&#x6709;&#x5F53;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x662F;segwit&#x8F93;&#x5165;&#x65F6;&#xFF0C;&#x7B2C;&#x4E09;&#x65B9;&#x624D;&#x53EF;&#x4EE5;&#x8BA4;&#x5B9A;segwit&#x4EA4;&#x6613;&#x7684;txid&#x4E0D;&#x53EF;&#x53D8;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EA4;&#x6613;&#x6709;&#x4E24;&#x4E2A;ID&#xFF1A;txid&#x548C;wtxid&#x3002;txid&#x662F;&#x6CA1;&#x6709;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x4EA4;&#x6613;&#x7684;&#x6563;&#x5217;&#xFF0C;wtxid&#x662F;&#x5305;&#x542B;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x7684;&#x6563;&#x5217;&#x3002;&#x6240;&#x6709;&#x8F93;&#x5165;&#x4E3A;&#x9694;&#x79BB;&#x5F00;&#x5173;&#x8F93;&#x5165;&#x7684;&#x4EA4;&#x6613;&#x4E0D;&#x53D7;&#x7B2C;&#x4E09;&#x65B9;&#x4EA4;&#x6613;&#x5EF6;&#x5C55;&#x6027;&#x5F71;&#x54CD;&#x3002;</p>
<h2 id="46&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x65B0;&#x7684;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;">4.6&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x65B0;&#x7684;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;</h2>
<p>&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4FEE;&#x6539;&#x4E86;&#x56DB;&#x4E2A;&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x51FD;&#x6570;&#xFF08;CHECKSIG&#xFF0C;CHECKSIGVERIFY&#xFF0C;CHECKMULTISIG&#x548C;CHECKMULTISIGVERIFY&#xFF09;&#x7684;&#x8BED;&#x4E49;&#xFF0C;&#x6539;&#x53D8;&#x4E86;&#x4EA4;&#x6613;&#x627F;&#x8BFA;&#x6563;&#x5217;&#x7684;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x5E94;&#x7528;&#x4E8E;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#xFF0C;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x8BA1;&#x7B97;&#xFF0C;&#x9501;&#x5B9A;&#x6570;&#x636E;&#x7684;&#x7279;&#x5B9A;&#x90E8;&#x5206;&#xFF0C;&#x8868;&#x660E;&#x7B7E;&#x540D;&#x8005;&#x5BF9;&#x8FD9;&#x4E9B;&#x503C;&#x7684;&#x627F;&#x8BFA;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7B80;&#x5355;&#x7684;SIGHASH_ALL&#x7C7B;&#x578B;&#x7B7E;&#x540D;&#x4E2D;&#xFF0C;&#x627F;&#x8BFA;&#x54C8;&#x5E0C;&#x5305;&#x62EC;&#x6240;&#x6709;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8BA1;&#x7B97;&#x627F;&#x8BFA;&#x54C8;&#x5E0C;&#x7684;&#x65B9;&#x5F0F;&#x5F15;&#x5165;&#x4E86;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x7684;&#x8282;&#x70B9;&#x53EF;&#x80FD;&#x88AB;&#x8FEB;&#x6267;&#x884C;&#x5927;&#x91CF;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;&#x5177;&#x4F53;&#x800C;&#x8A00;&#xFF0C;&#x6563;&#x5217;&#x8FD0;&#x7B97;&#x76F8;&#x5BF9;&#x4E8E;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x91CF;&#x589E;&#x52A0;O&#xFF08;n^2&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5927;&#x91CF;&#x7684;&#x7B7E;&#x540D;&#x64CD;&#x4F5C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x5BFC;&#x81F4;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0D;&#x5F97;&#x4E0D;&#x6267;&#x884C;&#x6570;&#x767E;&#x6216;&#x6570;&#x5343;&#x4E2A;&#x54C8;&#x5E0C;&#x64CD;&#x4F5C;&#x6765;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x3002;</p>
<p>Segwit&#x4EE3;&#x8868;&#x4E86;&#x901A;&#x8FC7;&#x6539;&#x53D8;&#x627F;&#x8BFA;&#x6563;&#x5217;&#x8BA1;&#x7B97;&#x65B9;&#x5F0F;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x5BF9;&#x4E8E;segwit&#x7248;&#x672C;0&#x89C1;&#x8BC1;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F7F;&#x7528;BIP-143&#x4E2D;&#x89C4;&#x5B9A;&#x7684;&#x6539;&#x8FDB;&#x7684;&#x627F;&#x8BFA;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x7B7E;&#x540D;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x65B0;&#x7B97;&#x6CD5;&#x5B9E;&#x73B0;&#x4E86;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x76EE;&#x6807;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6563;&#x5217;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x91CF;&#x6BD4;&#x7B7E;&#x540D;&#x64CD;&#x4F5C;&#x7684;&#x6570;&#x91CF;&#x589E;&#x52A0;&#x4E86;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x6E10;&#x8FDB;&#x7684;O&#xFF08;n&#xFF09;&#xFF0C;&#x51CF;&#x5C11;&#x4E86;&#x7528;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7684;&#x4EA4;&#x6613;&#x521B;&#x5EFA;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x5176;&#x6B21;&#xFF0C;&#x627F;&#x8BFA;&#x6563;&#x5217;&#x73B0;&#x5728;&#x8FD8;&#x5305;&#x62EC;&#x4F5C;&#x4E3A;&#x627F;&#x8BFA;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x6BCF;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x503C;&#xFF08;&#x91D1;&#x989D;&#xFF09;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x7B7E;&#x540D;&#x8005;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x7279;&#x5B9A;&#x7684;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x201C;&#x83B7;&#x53D6;&#x201D;&#x5E76;&#x68C0;&#x67E5;&#x8F93;&#x5165;&#x5F15;&#x7528;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x79BB;&#x7EBF;&#x8BBE;&#x5907;&#xFF08;&#x5982;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x6781;&#x5927;&#x5730;&#x7B80;&#x5316;&#x4E86;&#x4E3B;&#x673A;&#x4E0E;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#xFF0C;&#x6D88;&#x9664;&#x4E86;&#x5BF9;&#x4EE5;&#x524D;&#x7684;&#x4EA4;&#x6613;&#x6D41;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x7684;&#x9700;&#x8981;&#x3002;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x63A5;&#x53D7;&#x4E0D;&#x53EF;&#x4FE1;&#x4E3B;&#x673A;&#x201C;&#x8F93;&#x5165;&#x201D;&#x7684;&#x8F93;&#x5165;&#x503C;&#x3002;&#x7531;&#x4E8E;&#x7B7E;&#x540D;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x5982;&#x679C;&#x8F93;&#x5165;&#x503C;&#x4E0D;&#x6B63;&#x786E;&#xFF0C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x5728;&#x7B7E;&#x540D;&#x8F93;&#x5165;&#x4E4B;&#x524D;&#x4E0D;&#x9700;&#x8981;&#x9A8C;&#x8BC1;&#x8BE5;&#x503C;&#x3002;</p>
<h2 id="47&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x7ECF;&#x6D4E;&#x6FC0;&#x52B1;">4.7&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7684;&#x7ECF;&#x6D4E;&#x6FC0;&#x52B1;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x6398;&#x8282;&#x70B9;&#x548C;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x4F1A;&#x4EA7;&#x751F;&#x7528;&#x4E8E;&#x652F;&#x6301;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x548C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x8D44;&#x6E90;&#x7684;&#x6210;&#x672C;&#x3002;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x91CF;&#x7684;&#x589E;&#x52A0;&#xFF0C;&#x8D44;&#x6E90;&#x6210;&#x672C;&#xFF08;CPU&#xFF0C;&#x7F51;&#x7EDC;&#x5E26;&#x5BBD;&#xFF0C;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#xFF0C;&#x5185;&#x5B58;&#xFF09;&#x4E5F;&#x5728;&#x589E;&#x52A0;&#x3002;&#x77FF;&#x5DE5;&#x901A;&#x8FC7;&#x4E0E;&#x6BCF;&#x6B21;&#x4EA4;&#x6613;&#x7684;&#x5927;&#x5C0F;&#xFF08;&#x5B57;&#x8282;&#xFF09;&#x6210;&#x6BD4;&#x4F8B;&#x7684;&#x8D39;&#x7528;&#x6765;&#x8865;&#x507F;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#x3002;&#x4E0D;&#x6316;&#x77FF;&#x7684;&#x5B8C;&#x6574;&#x7684;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5F97;&#x5230;&#x8865;&#x507F;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x627F;&#x62C5;&#x8FD9;&#x4E9B;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x6743;&#x5A01;&#x7684;&#x5145;&#x5206;&#x9A8C;&#x8BC1;&#x5168;&#x7D22;&#x5F15;&#x8282;&#x70B9;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x4F7F;&#x7528;&#x8282;&#x70B9;&#x64CD;&#x4F5C;&#x6BD4;&#x7279;&#x5E01;&#x4E1A;&#x52A1;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6570;&#x636E;&#x7684;&#x589E;&#x957F;&#x53EF;&#x80FD;&#x4F1A;&#x5927;&#x5E45;&#x589E;&#x52A0;&#x3002;&#x8D39;&#x7528;&#x65E8;&#x5728;&#x901A;&#x8FC7;&#x57FA;&#x4E8E;&#x5E02;&#x573A;&#x7684;&#x4EF7;&#x683C;&#x53D1;&#x73B0;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x7684;&#x9700;&#x6C42;&#x4E0E;&#x4EA4;&#x6613;&#x5BF9;&#x7F51;&#x7EDC;&#x5E26;&#x6765;&#x7684;&#x8D1F;&#x62C5;&#x76F8;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x57FA;&#x4E8E;&#x4EA4;&#x6613;&#x89C4;&#x6A21;&#x7684;&#x8D39;&#x7528;&#x8BA1;&#x7B97;&#x5C06;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x89C6;&#x4E3A;&#x76F8;&#x540C;&#x7684;&#x6210;&#x672C;&#x3002;&#x4F46;&#x662F;&#x4ECE;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x548C;&#x77FF;&#x5DE5;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4EA4;&#x6613;&#x7684;&#x67D0;&#x4E9B;&#x90E8;&#x5206;&#x7684;&#x6210;&#x672C;&#x8981;&#x9AD8;&#x5F97;&#x591A;&#x3002;&#x52A0;&#x5165;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x5F71;&#x54CD;&#x8282;&#x70B9;&#x4E0A;&#x56DB;&#x79CD;&#x8D44;&#x6E90;&#x7684;&#x6D88;&#x8017;&#xFF1A;</p>
<ul>
<li>&#x78C1;&#x76D8;&#x7A7A;&#x95F4;</li>
</ul>
<p>&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x5E76;&#x6DFB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x94FE;&#x7684;&#x603B;&#x5927;&#x5C0F;&#x4E2D;&#x3002;&#x533A;&#x5757;&#x94FE;&#x5B58;&#x50A8;&#x5728;&#x78C1;&#x76D8;&#x4E0A;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x201C;&#x4FEE;&#x526A;&#x201D;&#x8F83;&#x65E7;&#x7684;&#x4EA4;&#x6613;&#x6765;&#x4F18;&#x5316;&#x5B58;&#x50A8;&#x3002;</p>
<ul>
<li>CPU</li>
</ul>
<p>&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x90FD;&#x5FC5;&#x987B;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#xFF0C;&#x8FD9;&#x9700;&#x8981;CPU&#x65F6;&#x95F4;&#x3002;</p>
<ul>
<li>&#x5E26;&#x5BBD;</li>
</ul>
<p>&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x81F3;&#x5C11;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x4E00;&#x6B21;&#xFF08;&#x901A;&#x8FC7;&#x6CDB;&#x6D2A;&#x4F20;&#x64AD;&#xFF09;&#x3002;&#x5982;&#x679C;&#x5728;&#x5757;&#x4F20;&#x64AD;&#x534F;&#x8BAE;&#x4E2D;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4F18;&#x5316;&#xFF0C;&#x4EA4;&#x6613;&#x5C06;&#x4F5C;&#x4E3A;&#x5757;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x518D;&#x6B21;&#x4F20;&#x8F93;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x5BF9;&#x7F51;&#x7EDC;&#x5BB9;&#x91CF;&#x7684;&#x5F71;&#x54CD;&#x52A0;&#x500D;&#x3002;</p>
<ul>
<li>&#x5185;&#x5B58;</li>
</ul>
<p>&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x7684;&#x8282;&#x70B9;&#x5C06;UTXO&#x7D22;&#x5F15;&#x6216;&#x6574;&#x4E2A;UTXO&#x8BBE;&#x7F6E;&#x5728;&#x5185;&#x5B58;&#x4E2D;&#xFF0C;&#x4EE5;&#x52A0;&#x901F;&#x9A8C;&#x8BC1;&#x3002;&#x7531;&#x4E8E;&#x5185;&#x5B58;&#x81F3;&#x5C11;&#x6BD4;&#x78C1;&#x76D8;&#x8D35;&#x4E00;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#xFF0C;&#x6240;&#x4EE5;UTXO&#x96C6;&#x7684;&#x589E;&#x957F;&#x5BF9;&#x8FD0;&#x884C;&#x8282;&#x70B9;&#x7684;&#x6210;&#x672C;&#x8D21;&#x732E;&#x4E0D;&#x6210;&#x6BD4;&#x4F8B;&#x3002;</p>
<p>&#x4ECE;&#x5217;&#x8868;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x4EA4;&#x6613;&#x7684;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x90FD;&#x5BF9;&#x8FD0;&#x884C;&#x8282;&#x70B9;&#x7684;&#x6210;&#x672C;&#x6216;&#x8005;&#x6BD4;&#x7279;&#x5E01;&#x652F;&#x6301;&#x66F4;&#x591A;&#x4EA4;&#x6613;&#x7684;&#x80FD;&#x529B;&#x4EA7;&#x751F;&#x540C;&#x7B49;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x4EA4;&#x6613;&#x4E2D;&#x6700;&#x6602;&#x8D35;&#x7684;&#x90E8;&#x5206;&#x662F;&#x65B0;&#x521B;&#x5EFA;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x5185;&#x5B58;&#x4E2D;&#x7684;UTXO&#x96C6;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x7B7E;&#x540D;&#xFF08;&#x53C8;&#x540D;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#xFF09;&#x4E3A;&#x7F51;&#x7EDC;&#x589E;&#x52A0;&#x4E86;&#x6700;&#x5C0F;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x5E76;&#x4E14;&#x8282;&#x7701;&#x4E86;&#x8FD0;&#x884C;&#x8282;&#x70B9;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x56E0;&#x4E3A;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x53EA;&#x88AB;&#x9A8C;&#x8BC1;&#x4E00;&#x6B21;&#xFF0C;&#x4E4B;&#x540E;&#x53C8;&#x4E0D;&#x518D;&#x4F7F;&#x7528;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5728;&#x6536;&#x5230;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x5E76;&#x9A8C;&#x8BC1;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x4E4B;&#x540E;&#xFF0C;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x4E22;&#x5F03;&#x8BE5;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x3002;&#x5982;&#x679C;&#x6309;&#x7167;&#x4EA4;&#x6613;&#x89C4;&#x6A21;&#x8BA1;&#x7B97;&#x8D39;&#x7528;&#xFF0C;&#x800C;&#x4E0D;&#x533A;&#x5206;&#x8FD9;&#x4E24;&#x79CD;&#x6570;&#x636E;&#xFF0C;&#x90A3;&#x4E48;&#x5E02;&#x573A;&#x4E0A;&#x7684;&#x6536;&#x8D39;&#x6FC0;&#x52B1;&#x5C31;&#x4E0D;&#x7B26;&#x5408;&#x4EA4;&#x6613;&#x5B9E;&#x9645;&#x6210;&#x672C;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x76EE;&#x524D;&#x7684;&#x8D39;&#x7528;&#x7ED3;&#x6784;&#x5B9E;&#x9645;&#x4E0A;&#x9F13;&#x52B1;&#x4E86;&#x76F8;&#x53CD;&#x7684;&#x884C;&#x4E3A;&#xFF0C;&#x56E0;&#x4E3A;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x662F;&#x4EA4;&#x6613;&#x7684;&#x6700;&#x5927;&#x90E8;&#x5206;&#x3002;</p>
<p>&#x8D39;&#x7528;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x6FC0;&#x52B1;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5F71;&#x54CD;&#x94B1;&#x5305;&#x7684;&#x884C;&#x4E3A;&#x3002;&#x6240;&#x6709;&#x7684;&#x94B1;&#x5305;&#x90FD;&#x5FC5;&#x987B;&#x5B9E;&#x884C;&#x4E00;&#x4E9B;&#x7B56;&#x7565;&#x6765;&#x7EC4;&#x5408;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B56;&#x7565;&#x8981;&#x8003;&#x8651;&#x5230;&#x9690;&#x79C1;&#xFF08;&#x51CF;&#x5C11;&#x5730;&#x5740;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#xFF09;&#xFF0C;&#x788E;&#x7247;&#x5316;&#xFF08;&#x5927;&#x91CF;&#x677E;&#x52A8;&#xFF09;&#x4EE5;&#x53CA;&#x6536;&#x8D39;&#x7B49;&#x56E0;&#x7D20;&#x3002;&#x5982;&#x679C;&#x8D39;&#x7528;&#x538B;&#x5012;&#x6027;&#x5730;&#x4FC3;&#x4F7F;&#x94B1;&#x5305;&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#x4F7F;&#x7528;&#x5C3D;&#x53EF;&#x80FD;&#x5C11;&#x7684;&#x6295;&#x5165;&#xFF0C;&#x8FD9;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;UTXO&#x9009;&#x62E9;&#x548C;&#x6539;&#x53D8;&#x5730;&#x5740;&#x7B56;&#x7565;&#xFF0C;&#x4ECE;&#x800C;&#x4E0D;&#x7ECF;&#x610F;&#x5730;&#x81A8;&#x80C0;UTXO&#x96C6;&#x5408;&#x3002;</p>
<p>&#x4EA4;&#x6613;&#x5728;&#x5176;&#x8F93;&#x5165;&#x4E2D;&#x6D88;&#x8017;UTXO&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x8F93;&#x51FA;&#x521B;&#x5EFA;&#x65B0;&#x7684;UTXO&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x6BD4;&#x8F93;&#x51FA;&#x591A;&#x5C06;&#x5BFC;&#x81F4;UTXO&#x96C6;&#x5408;&#x7684;&#x51CF;&#x5C11;&#xFF0C;&#x800C;&#x8F93;&#x51FA;&#x591A;&#x4E8E;&#x8F93;&#x5165;&#x7684;&#x4EA4;&#x6613;&#x5C06;&#x5BFC;&#x81F4;UTXO&#x96C6;&#x5408;&#x7684;&#x589E;&#x52A0;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x8003;&#x8651;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x5F02;&#xFF0C;&#x5E76;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;Net-new-UTXO&#x201D;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x6307;&#x6807;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x544A;&#x8BC9;&#x6211;&#x4EEC;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5BF9;&#x6700;&#x6602;&#x8D35;&#x7684;&#x5168;&#x7F51;&#x8D44;&#x6E90;&#xFF0C;&#x5185;&#x5B58; UTXO&#x8BBE;&#x7F6E;&#x3002;&#x6B63;&#x503C;Net-new-UTXO&#x4EA4;&#x6613;&#x589E;&#x52A0;&#x4E86;&#x8FD9;&#x4E00;&#x8D1F;&#x62C5;&#x3002;&#x8D1F;&#x503C;Net-new-UTXO&#x4EA4;&#x6613;&#x51CF;&#x8F7B;&#x4E86;&#x8D1F;&#x62C5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5E0C;&#x671B;&#x9F13;&#x52B1;&#x4EA4;&#x6613;&#x662F;&#x8D1F;Net-new-UTXO&#x6216;&#x96F6;Net-new-UTXO&#x7684;&#x4E2D;&#x503C;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8BF4;&#x660E;&#x6709;&#x65E0;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x8BA1;&#x7B97;&#x4EA7;&#x751F;&#x4E86;&#x54EA;&#x4E9B;&#x6FC0;&#x52B1;&#x63AA;&#x65BD;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x4EA4;&#x6613;A&#x662F;3&#x8F93;&#x5165;&#xFF0C;2&#x8F93;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x5177;&#x6709;-1&#x7684;&#x51C0;&#x65B0;UTXO&#x5EA6;&#x91CF;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x6D88;&#x8017;&#x6BD4;&#x5B83;&#x521B;&#x5EFA;&#x7684;&#x591A;&#x4E00;&#x4E2A;UTXO&#xFF0C;&#x5C06;UTXO&#x51CF;1&#x3002;&#x4EA4;&#x6613;B&#x662F;2&#x8F93;&#x5165;3&#x8F93;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x5177;&#x6709;1&#x7684;&#x51C0;&#x65B0;UTXO&#x5EA6;&#x91CF;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x5411;UTXO&#x96C6;&#x589E;&#x52A0;&#x4E00;&#x4E2A;UTXO&#xFF0C;&#x5BF9;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x65BD;&#x52A0;&#x989D;&#x5916;&#x7684;&#x6210;&#x672C;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x90FD;&#x4F7F;&#x7528;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#xFF08;2/3&#xFF09;&#x811A;&#x672C;&#x6765;&#x6F14;&#x793A;&#x590D;&#x6742;&#x811A;&#x672C;&#x5982;&#x4F55;&#x589E;&#x52A0;&#x9694;&#x79BB;&#x8BC1;&#x4EBA;&#x5BF9;&#x8D39;&#x7528;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4EA4;&#x6613;&#x8D39;&#x4E3A;&#x6BCF;&#x5B57;&#x8282;30 satoshi&#xFF0C;&#x8BC1;&#x636E;&#x6570;&#x636E;&#x4E3A;75&#xFF05;&#x7684;&#x6298;&#x6263;&#x8D39;&#x7528;&#xFF1A;</p>
<ul>
<li><p>&#x672A;&#x4F7F;&#x7528;&#x9694;&#x79BB;&#x89C1;&#x8BC1;</p>
<p>&#x4EA4;&#x6613;&#x8D39;&#x7528;&#xFF1A;25,710 satoshi &#x4EA4;&#x6613;B&#x8D39;&#x7528;&#xFF1A;18,990 satoshi</p>
</li>
<li><p>&#x4F7F;&#x7528;&#x9694;&#x79BB;&#x89C1;&#x8BC1;</p>
<p>&#x4EA4;&#x6613;&#x624B;&#x7EED;&#x8D39;&#xFF1A;8,130 satoshi &#x4EA4;&#x6613;B&#x624B;&#x7EED;&#x8D39;&#xFF1A;12,045 satoshi</p>
</li>
</ul>
<p>&#x5F53;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5B9E;&#x65BD;&#x65F6;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x90FD;&#x8F83;&#x4E3A;&#x4FBF;&#x5B9C;&#x3002;&#x4F46;&#x662F;&#x6BD4;&#x8F83;&#x8FD9;&#x4E24;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x53D1;&#x73B0;&#x5728;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E4B;&#x524D;&#xFF0C;&#x4EA4;&#x6613;&#x51C0;&#x6536;&#x76CA;&#x4E3A;&#x8D1F;&#x7684;&#x51C0;&#x65B0;UTXO&#x7684;&#x6536;&#x8D39;&#x66F4;&#x9AD8;&#x3002;&#x5728;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x4E4B;&#x540E;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x4E0E;&#x6700;&#x5C0F;&#x5316;&#x65B0;&#x7684;UTXO&#x521B;&#x9020;&#x7684;&#x6FC0;&#x52B1;&#x76F8;&#x4E00;&#x81F4;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x65E0;&#x610F;&#x4E2D;&#x60E9;&#x7F5A;&#x8BB8;&#x591A;&#x8F93;&#x5165;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x652F;&#x4ED8;&#x7684;&#x8D39;&#x7528;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x9996;&#x5148;&#xFF0C;segwit&#x901A;&#x8FC7;&#x6298;&#x6263;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x548C;&#x589E;&#x52A0;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7684;&#x80FD;&#x529B;&#x6765;&#x964D;&#x4F4E;&#x4EA4;&#x6613;&#x7684;&#x603B;&#x4F53;&#x6210;&#x672C;&#x3002;&#x5176;&#x6B21;&#xFF0C;segwit&#x5BF9;&#x8BC1;&#x4EBA;&#x6570;&#x636E;&#x7684;&#x6298;&#x6263;&#x7EA0;&#x6B63;&#x4E86;&#x53EF;&#x80FD;&#x65E0;&#x610F;&#x4E2D;&#x5728;UTXO&#x96C6;&#x5408;&#x4E2D;&#x4EA7;&#x751F;&#x66F4;&#x591A;&#x81A8;&#x80C0;&#x7684;&#x6FC0;&#x52B1;&#x7684;&#x9519;&#x4F4D;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="appdx-bitcoinwhitepaper.html" class="navigation navigation-prev " aria-label="Previous page: 附录6 比特币白皮书">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appdx-colored_coins.html" class="navigation navigation-next " aria-label="Next page: 附录8 染色币">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"附录7 隔离见证","level":"1.25","depth":1,"next":{"title":"附录8 染色币","level":"1.26","depth":1,"path":"appdx-colored_coins.md","ref":"appdx-colored_coins.md","articles":[]},"previous":{"title":"附录6 比特币白皮书","level":"1.24","depth":1,"path":"appdx-bitcoinwhitepaper.md","ref":"appdx-bitcoinwhitepaper.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"appdx-segwit.md","mtime":"2018-12-14T06:26:05.576Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

