
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>附录8 染色币 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    
    <link rel="prev" href="appdx-segwit.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >附录8 染色币</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x9644;&#x5F55;8&#x3001;&#x67D3;&#x8272;&#x5E01;">&#x9644;&#x5F55;8&#x3001;&#x67D3;&#x8272;&#x5E01;</h1>
<p>&#x672F;&#x8BED;&#x67D3;&#x8272;&#x5E01;&#x662F;&#x6307;&#x4E00;&#x7EC4;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x6BD4;&#x7279;&#x5E01;&#x4EE5;&#x5916;&#x7684;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x6240;&#x6709;&#x6743;&#x548C;&#x8F6C;&#x8BA9;&#x7684;&#x7C7B;&#x4F3C;&#x6280;&#x672F;&#x3002;&#x201C;&#x5916;&#x5728;&#x201D;&#x662F;&#x6307;&#x4E0D;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x8D44;&#x4EA7;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x672C;&#x8EAB;&#xFF0C;&#x8FD9;&#x662F;&#x533A;&#x5757;&#x94FE;&#x56FA;&#x6709;&#x7684;&#x8D44;&#x4EA7;&#x3002;</p>
<p> &#x67D3;&#x8272;&#x5E01;&#x7528;&#x4E8E;&#x8FFD;&#x8E2A;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x4EE5;&#x53CA;&#x7B2C;&#x4E09;&#x65B9;&#x6301;&#x6709;&#x7684;&#x6709;&#x5F62;&#x8D44;&#x4EA7;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x67D3;&#x8272;&#x5E01;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x6743;&#x4EA4;&#x6613;&#x3002;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x67D3;&#x8272;&#x5E01;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x65E0;&#x5F62;&#x8D44;&#x4EA7;&#xFF0C;&#x5982;&#x80A1;&#x7968;&#x8BC1;&#x4E66;&#xFF0C;&#x8BB8;&#x53EF;&#x8BC1;&#xFF0C;&#x865A;&#x62DF;&#x8D22;&#x4EA7;&#xFF08;&#x6E38;&#x620F;&#x7269;&#x54C1;&#xFF09;&#xFF0C;&#x6216;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x8BB8;&#x53EF;&#x77E5;&#x8BC6;&#x4EA7;&#x6743;&#xFF08;&#x5546;&#x6807;&#xFF0C;&#x7248;&#x6743;&#x7B49;&#xFF09;&#x3002;&#x6709;&#x5F62;&#x8D44;&#x4EA7;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x5546;&#x54C1;&#xFF08;&#x91D1;&#xFF0C;&#x94F6;&#xFF0C;&#x6CB9;&#xFF09;&#xFF0C;&#x571F;&#x5730;&#x6240;&#x6709;&#x6743;&#xFF0C;&#x6C7D;&#x8F66;&#xFF0C;&#x8239;&#x53EA;&#xFF0C;&#x98DE;&#x673A;&#x7B49;&#x7684;&#x6240;&#x6709;&#x6743;&#x8BC1;&#x4E66;&#x3002;</p>
<p> &#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x6E90;&#x4E8E;&#x201C;&#x7740;&#x8272;&#x201D;&#x6216;&#x6807;&#x8BB0;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x540D;&#x4E49;&#x6570;&#x91CF;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#x5355;&#x4E2A;satoshi&#xFF0C;&#x4EE3;&#x8868;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x503C;&#x672C;&#x8EAB;&#x4E4B;&#x5916;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x7C7B;&#x6BD4;&#xFF0C;&#x8003;&#x8651;&#x5728;$ 1&#x949E;&#x7968;&#x4E0A;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF4;&#x660E;&#x201C;&#x8FD9;&#x662F;ACME&#x7684;&#x80A1;&#x7968;&#x8BC1;&#x4E66;&#x201D;&#x6216;&#x8005;&#x201C;&#x8FD9;&#x4E2A;&#x7968;&#x636E;&#x53EF;&#x4EE5;&#x5151;&#x6362;&#x6210;1&#x76CE;&#x53F8;&#x767D;&#x94F6;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x4EA4;&#x6613;$ 1&#x7968;&#x636E;&#x4F5C;&#x4E3A;&#x8FD9;&#x4E2A;&#x5176;&#x4ED6;&#x8D44;&#x4EA7;&#x7684;&#x6240;&#x6709;&#x6743;&#x8BC1;&#x4E66;&#x3002;&#x7B2C;&#x4E00;&#x6B21;&#x5B9E;&#x65BD;&#x67D3;&#x8272;&#x5E01;&#xFF0C;&#x540D;&#x4E3A;&#x589E;&#x5F3A;&#x578B;&#x57FA;&#x4E8E;&#x8BA2;&#x5355;&#x7684;&#x7740;&#x8272;&#x6216;EPOBC&#xFF0C;&#x5C06;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x5206;&#x914D;&#x7ED9;1&#x4E2A;&#x6EE1;&#x5206;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x201C;&#x67D3;&#x8272;&#x5E01;&#x201D;&#x3002;</p>
<p> &#x5728;EPOBC&#x4E4B;&#x540E;&#xFF0C;&#x66F4;&#x65B0;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x5B9E;&#x73B0;&#x4F7F;&#x7528;OP_RETURN&#x811A;&#x672C;&#x6765;&#x5B58;&#x50A8;&#x5173;&#x4E8E;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;&#x4ECE;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x4E0D;&#x662F;&#x771F;&#x6B63;&#x7684;&#x67D3;&#x8272;&#x5E01;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x786C;&#x5E01;&#x88AB;&#x201C;&#x7740;&#x8272;&#x201D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x4F7F;&#x7528;OP_RETURN&#x5143;&#x6570;&#x636E;&#x7684;&#x4EA4;&#x6613;&#x7528;&#x4E8E;&#x521B;&#x5EFA;&#x548C;&#x8DDF;&#x8E2A;&#x5C06;&#x5143;&#x6570;&#x636E;&#x5173;&#x8054;&#x5230;&#x7279;&#x5B9A;&#x8D44;&#x4EA7;&#x7684;&#x5916;&#x90E8;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7684;&#x6240;&#x6709;&#x6743;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x67D3;&#x8272;&#x5E01;&#x7684;&#x4E24;&#x4E2A;&#x6700;&#x7A81;&#x51FA;&#x7684;&#x5B9E;&#x73B0;&#x662F;Colu&#x7684;Open Assets&#x548C;Coloured Coins&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x5BF9;&#x67D3;&#x8272;&#x5E01;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x517C;&#x5BB9;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x4E0D;&#x80FD;&#x5728;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x4E2D;&#x770B;&#x5230;&#x6216;&#x4F7F;&#x7528;&#x3002;</p>
<h2 id="1&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;">1.&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;</h2>
<p> &#x67D3;&#x8272;&#x5E01;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x8F6C;&#x79FB;&#x5E76;&#x901A;&#x5E38;&#x5728;&#x7279;&#x6B8A;&#x7684;&#x94B1;&#x5305;&#x4E2D;&#x67E5;&#x770B;&#xFF0C;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x9644;&#x52A0;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E0A;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x5143;&#x6570;&#x636E;&#x3002;&#x5FC5;&#x987B;&#x7279;&#x522B;&#x5C0F;&#x5FC3;&#xFF0C;&#x907F;&#x514D;&#x5728;&#x666E;&#x901A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E2D;&#x4F7F;&#x7528;&#x4E0E;&#x67D3;&#x8272;&#x5E01;&#x76F8;&#x5173;&#x7684;&#x94A5;&#x5319;&#xFF0C;&#x56E0;&#x4E3A;&#x6B63;&#x5E38;&#x7684;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x7834;&#x574F;&#x5143;&#x6570;&#x636E;&#x3002;&#x540C;&#x6837;&#xFF0C;&#x4E0D;&#x5E94;&#x5C06;&#x6709;&#x989C;&#x8272;&#x7684;&#x786C;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x7531;&#x666E;&#x901A;&#x94B1;&#x5305;&#x7BA1;&#x7406;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x53EA;&#x53D1;&#x9001;&#x5230;&#x7531;&#x53EF;&#x8BC6;&#x522B;&#x786C;&#x5E01;&#x7684;&#x94B1;&#x5305;&#x7BA1;&#x7406;&#x7684;&#x5730;&#x5740;&#x3002; Colu&#x548C;Open Assets&#x7CFB;&#x7EDF;&#x90FD;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x5730;&#x5740;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x67D3;&#x8272;&#x5E01;&#x4E0D;&#x4F1A;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#x94B1;&#x5305;&#x3002;</p>
<p> &#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570;&#x901A;&#x7528;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x8BF4;&#xFF0C;&#x67D3;&#x8272;&#x5E01;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x89E3;&#x91CA;&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;</p>
<p> Am Open Assets&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#x4EE5;&#x4E0B;&#x4F4D;&#x7F6E;&#x627E;&#x5230;&#xFF1A;</p>
<p> coinprism&#xFF1A;<a href="https://www.coinprism.info" target="_blank">https://www.coinprism.info</a></p>
<p> &#x4E00;&#x4E2A;Colu&#x5F69;&#x8272;&#x94B1;&#x5E01;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x5728;&#xFF1A;</p>
<p> &#x533A;&#x5757;&#x94FE;&#x8D44;&#x6E90;&#x7BA1;&#x7406;&#x5668;&#xFF1A;<a href="http://coloredcoins.org/explorer/" target="_blank">http://coloredcoins.org/explorer/</a></p>
<p> Copay&#x94B1;&#x5305;&#x63D2;&#x4EF6;&#xFF1A;<a href="http://coloredcoins.org/colored-coins-copay-addon/" target="_blank">http://coloredcoins.org/colored-coins-copay-addon/</a></p>
<h2 id="2&#x521B;&#x9020;&#x67D3;&#x8272;&#x5E01;">2.&#x521B;&#x9020;&#x67D3;&#x8272;&#x5E01;</h2>
<p> &#x6BCF;&#x4E2A;&#x67D3;&#x8272;&#x5E01;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x67D3;&#x8272;&#x5E01;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x4EEC;&#x90FD;&#x63D0;&#x4F9B;&#x4E86;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x521B;&#x5EFA;&#x67D3;&#x8272;&#x5E01;&#x8D44;&#x4EA7;&#x7684;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;&#x53D1;&#x884C;&#x3002;&#x521D;&#x59CB;&#x4EA4;&#x6613;&#xFF0C;&#x53D1;&#x884C;&#x4EA4;&#x6613;&#x5C06;&#x8D44;&#x4EA7;&#x6CE8;&#x518C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x7528;&#x4E8E;&#x53C2;&#x8003;&#x8D44;&#x4EA7;&#x7684;&#x8D44;&#x4EA7;ID&#x3002;&#x4E00;&#x65E6;&#x53D1;&#x5E03;&#xFF0C;&#x8D44;&#x4EA7;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8F6C;&#x79FB;&#x4EA4;&#x6613;&#x5728;&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x8F6C;&#x79FB;&#x3002;</p>
<p> &#x4F5C;&#x4E3A;&#x67D3;&#x8272;&#x5E01;&#x53D1;&#x884C;&#x7684;&#x8D44;&#x4EA7;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x4E2A;&#x5C5E;&#x6027;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x662F;&#x53EF;&#x5206;&#x5272;&#x7684;&#x6216;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F20;&#x8F93;&#x4E2D;&#x8D44;&#x4EA7;&#x7684;&#x6570;&#x91CF;&#x53EF;&#x4EE5;&#x662F;&#x6574;&#x6570;&#xFF08;&#x4F8B;&#x5982;5&#xFF09;&#x6216;&#x8005;&#x5177;&#x6709;&#x5C0F;&#x6570;&#x7EC6;&#x5206;&#xFF08;&#x4F8B;&#x5982;4.321&#xFF09;&#x3002;&#x8D44;&#x4EA7;&#x4E5F;&#x53EF;&#x4EE5;&#x6709;&#x56FA;&#x5B9A;&#x53D1;&#x884C;&#xFF0C;&#x5373;&#x4E00;&#x6B21;&#x6027;&#x53D1;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x91CD;&#x65B0;&#x53D1;&#x884C;&#xFF0C;&#x5373;&#x521D;&#x59CB;&#x53D1;&#x884C;&#x540E;&#x53EF;&#x4EE5;&#x7531;&#x539F;&#x53D1;&#x884C;&#x4EBA;&#x53D1;&#x884C;&#x65B0;&#x7684;&#x8D44;&#x4EA7;&#x5355;&#x4F4D;&#x3002;</p>
<p> &#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x67D3;&#x8272;&#x5E01;&#x80FD;&#x591F;&#x53D1;&#x884C;&#x80A1;&#x606F;&#xFF0C;&#x5141;&#x8BB8;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4ED8;&#x6B3E;&#x7ED9;&#x6240;&#x6709;&#x6743;&#x6BD4;&#x4F8B;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x8D44;&#x4EA7;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="appdx-segwit.html" class="navigation navigation-prev navigation-unique" aria-label="Previous page: 附录7 隔离见证">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"附录8 染色币","level":"1.26","depth":1,"previous":{"title":"附录7 隔离见证","level":"1.25","depth":1,"path":"appdx-segwit.md","ref":"appdx-segwit.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"appdx-colored_coins.md","mtime":"2018-12-14T06:26:05.575Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

