
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第一章介绍 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch02.html" />
    
    
    <link rel="prev" href="glossary.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第一章介绍</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="11&#x4EC0;&#x4E48;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#xFF1F;">1.1&#x4EC0;&#x4E48;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#xFF1F;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x6784;&#x6210;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x57FA;&#x7840;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x6280;&#x672F;&#x7684;&#x96C6;&#x5408;&#x3002;&#x79F0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#x7528;&#x4E8E;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x9012;&#x4EF7;&#x503C;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x4E3B;&#x8981;&#x901A;&#x8FC7;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x8FDB;&#x884C;&#x901A;&#x4FE1;&#xFF0C;&#x5C3D;&#x7BA1;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x4F20;&#x8F93;&#x7F51;&#x7EDC;&#x3002;&#x4F5C;&#x4E3A;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x6808;&#x53EF;&#x4EE5;&#x5728;&#x5404;&#x79CD;&#x8BA1;&#x7B97;&#x8BBE;&#x5907;&#xFF08;&#x5305;&#x62EC;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x548C;&#x667A;&#x80FD;&#x624B;&#x673A;&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x8BE5;&#x6280;&#x672F;&#x6613;&#x4E8E;&#x8BBF;&#x95EE;&#x3002;</p>
<p>&#x7528;&#x6237;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x5E38;&#x89C4;&#x8D27;&#x5E01;&#x505A;&#x5230;&#x7684;&#x4EFB;&#x4F55;&#x4E8B;&#x60C5;&#xFF0C;&#x5305;&#x62EC;&#x4E70;&#x5356;&#x5546;&#x54C1;&#xFF0C;&#x6C47;&#x6B3E;&#x7ED9;&#x522B;&#x4EBA;&#x6216;&#x7EC4;&#x7EC7;&#xFF0C;&#x6216;&#x8005;&#x6269;&#x5927;&#x4FE1;&#x7528;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x53EF;&#x4EE5;&#x5728;&#x4E13;&#x95E8;&#x7684;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x8D2D;&#x4E70;&#xFF0C;&#x51FA;&#x552E;&#x548C;&#x5151;&#x6362;&#x5176;&#x4ED6;&#x8D27;&#x5E01;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#x662F;&#x4E92;&#x8054;&#x7F51;&#x8D27;&#x5E01;&#x7684;&#x5B8C;&#x7F8E;&#x5F62;&#x5F0F;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5FEB;&#x901F;&#xFF0C;&#x5B89;&#x5168;&#x548C;&#x65E0;&#x5730;&#x57DF;&#x8FB9;&#x754C;&#x9650;&#x5236;&#x3002;</p>
<p>&#x4E0E;&#x4F20;&#x7EDF;&#x8D27;&#x5E01;&#x4E0D;&#x540C;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5B8C;&#x5168;&#x662F;&#x865A;&#x62DF;&#x7684;&#x3002;&#x6CA1;&#x6709;&#x7269;&#x7406;&#x786C;&#x5E01;&#xFF0C;&#x751A;&#x81F3;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x672C;&#x8EAB;&#x3002;&#x8FD9;&#x79CD;&#x5E01;&#x9690;&#x542B;&#x5728;&#x4ECE;&#x53D1;&#x9001;&#x65B9;&#x5230;&#x63A5;&#x6536;&#x65B9;&#x8F6C;&#x79FB;&#x4EF7;&#x503C;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x3002; &#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x8BC1;&#x660E;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6240;&#x6709;&#x6743;&#x3002;&#x51ED;&#x501F;&#x8FD9;&#x4E9B;&#x5BC6;&#x94A5;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x4EE5;&#x89E3;&#x9501;&#x4EF7;&#x503C;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x79FB;&#x7ED9;&#x65B0;&#x7684;&#x6240;&#x6709;&#x8005;&#x5B9E;&#x73B0;&#x6D88;&#x8D39;&#x3002;&#x94A5;&#x5319;&#x901A;&#x5E38;&#x5B58;&#x50A8;&#x5728;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x6216;&#x667A;&#x80FD;&#x624B;&#x673A;&#x4E0A;&#x7684;&#x6570;&#x5B57;&#x94B1;&#x5305;&#x4E2D;&#x3002;&#x62E5;&#x6709;&#x53EF;&#x4EE5;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x7684;&#x5BC6;&#x94A5;&#x662F;&#x6D88;&#x8D39;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x552F;&#x4E00;&#x5148;&#x51B3;&#x6761;&#x4EF6;&#xFF0C;&#x5C06;&#x5B8C;&#x5168;&#x63A7;&#x5236;&#x6743;&#x4EA4;&#x7ED9;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x81EA;&#x5DF1;&#x638C;&#x63E1;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7CFB;&#x7EDF;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6CA1;&#x6709;&#x201C;&#x4E2D;&#x592E;&#x201D;&#x670D;&#x52A1;&#x5668;&#x6216;&#x63A7;&#x5236;&#x70B9;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x901A;&#x8FC7;&#x79F0;&#x4E3A;&#x201C;&#x6316;&#x77FF;&#x201D;&#x7684;&#x8FC7;&#x7A0B;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5728;&#x5904;&#x7406;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x5F15;&#x5165;&#x7ADE;&#x4E89;&#x7684;&#x673A;&#x5236;&#x6765;&#x53D1;&#x73B0;&#x7279;&#x5B9A;&#x6570;&#x5B66;&#x95EE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x53C2;&#x4E0E;&#x8005;&#xFF08;&#x5373;&#xFF0C;&#x4F7F;&#x7528;&#x8FD0;&#x884C;&#x5B8C;&#x6574;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x6808;&#x7684;&#x8BBE;&#x5907;&#x7684;&#x4EFB;&#x4F55;&#x4EBA;&#xFF09;&#x90FD;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x77FF;&#x5DE5;&#x4F7F;&#x7528;&#x5176;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#x6765;&#x9A8C;&#x8BC1;&#x548C;&#x8BB0;&#x5F55;&#x4EA4;&#x6613;&#x3002;&#x5E73;&#x5747;&#x6BCF;10&#x5206;&#x949F;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x8FC7;&#x53BB;10&#x5206;&#x949F;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x5168;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5956;&#x52B1;&#x3002;&#x57FA;&#x672C;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x5206;&#x6563;&#x4E86;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x7684;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x548C;&#x7ED3;&#x7B97;&#x529F;&#x80FD;&#xFF0C;&#x53D6;&#x4EE3;&#x4E86;&#x4EFB;&#x4F55;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x5305;&#x62EC;&#x5185;&#x7F6E;&#x7684;&#x7B97;&#x6CD5;&#xFF0C;&#x7528;&#x4E8E;&#x8C03;&#x6574;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x91C7;&#x77FF;&#x529F;&#x80FD;&#x3002;&#x5E73;&#x5747;&#x800C;&#x8A00;&#xFF0C;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x65E0;&#x8BBA;&#x591A;&#x5C11;&#x77FF;&#x5DE5;&#xFF08;&#x4EE5;&#x53CA;&#x591A;&#x5927;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF09;&#x53C2;&#x4E0E;&#x7ADE;&#x4E89;&#xFF0C;&#x77FF;&#x5DE5;&#x5FC5;&#x987B;&#x6267;&#x884C;&#x7684;&#x5904;&#x7406;&#x4EFB;&#x52A1;&#x96BE;&#x5EA6;&#x5B9E;&#x73B0;&#x52A8;&#x6001;&#x8C03;&#x6574;&#xFF0C;&#x4FDD;&#x8BC1;&#x6BCF;10&#x5206;&#x949F;&#x5C31;&#x53EF;&#x4EE5;&#x6316;&#x77FF;&#x6210;&#x529F;&#x3002;&#x8BE5;&#x534F;&#x8BAE;&#x8FD8;&#x5C06;&#x6BCF;4&#x5E74;&#x53D1;&#x884C;&#x65B0;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6BD4;&#x4F8B;&#x964D;&#x4F4E;&#x4E00;&#x534A;&#xFF0C;&#x5E76;&#x5C06;&#x5C06;&#x53D1;&#x884C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x603B;&#x6570;&#x9650;&#x5236;&#x5728;&#x4F4E;&#x4E8E;2100&#x4E07;&#x786C;&#x5E01;&#x7684;&#x56FA;&#x5B9A;&#x603B;&#x91CF;&#x3002;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x6D41;&#x901A;&#x4E2D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6570;&#x91CF;&#x7D27;&#x968F;&#x5176;&#x540E;&#x7684;&#x4E00;&#x4E2A;&#x5BB9;&#x6613;&#x9884;&#x6D4B;&#x7684;&#x66F2;&#x7EBF;&#xFF0C;&#x5230;2140&#x5E74;&#x5C06;&#x8FBE;&#x5230;2100&#x4E07;&#x3002;&#x7531;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53D1;&#x884C;&#x7387;&#x4E0B;&#x964D;&#xFF0C;&#x957F;&#x671F;&#x6765;&#x770B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x8D27;&#x5E01;&#x662F;&#x901A;&#x8D27;&#x7D27;&#x7F29;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x80FD;&#x901A;&#x8FC7;&#x201C;&#x6253;&#x5370;&#x201D;&#x8D85;&#x8FC7;&#x9884;&#x671F;&#x53D1;&#x884C;&#x7387;&#x7684;&#x65B0;&#x8D27;&#x5E01;&#x6765;&#x81A8;&#x80C0;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#xFF08;bitcoin&#xFF09;&#x4E5F;&#x662F;&#x534F;&#x8BAE;&#xFF0C;&#x5BF9;&#x7B49;&#x7F51;&#x7EDC;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x521B;&#x65B0;&#x7684;&#x4EE3;&#x540D;&#x8BCD;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x8D27;&#x5E01;&#x771F;&#x7684;&#x53EA;&#x662F;&#x672C;&#x53D1;&#x660E;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4EE3;&#x8868;&#x4E86;&#x6570;&#x5341;&#x5E74;&#x5BC6;&#x7801;&#x5B66;&#x548C;&#x5206;&#x5E03;&#x5F0F;&#x7CFB;&#x7EDF;&#x7814;&#x7A76;&#x7684;&#x9AD8;&#x6F6E;&#xFF0C;&#x5305;&#x62EC;&#x56DB;&#x4E2A;&#x5173;&#x952E;&#x521B;&#x65B0;&#xFF0C;&#x8FD9;&#x56DB;&#x4E2A;&#x521B;&#x65B0;&#x4EE5;&#x72EC;&#x7279;&#x548C;&#x5F3A;&#x5927;&#x7684;&#x7EC4;&#x5408;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x56DB;&#x4E2A;&#x521B;&#x65B0;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li><p>&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5BF9;&#x7B49;&#x7F51;&#x7EDC;&#xFF08;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#xFF09;</p>
</li>
<li><p>&#x516C;&#x5171;&#x4EA4;&#x6613;&#x603B;&#x5E10;&#xFF08;&#x533A;&#x5757;&#x94FE;&#xFF09;</p>
</li>
<li><p>&#x72EC;&#x7ACB;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x548C;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x7684;&#x4E00;&#x5957;&#x89C4;&#x5219;&#xFF08;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#xFF09;</p>
</li>
<li><p>&#x5B9E;&#x73B0;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5168;&#x7403;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x7684;&#x673A;&#x5236;&#xFF08;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#xFF09;</p>
</li>
</ul>
<p>&#x4F5C;&#x4E3A;&#x4E00;&#x540D;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#xFF0C;&#x6211;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x89C6;&#x4E3A;&#x8D27;&#x5E01;&#x4E92;&#x8054;&#x7F51;&#xFF0C;&#x901A;&#x8FC7;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x4F20;&#x64AD;&#x4EF7;&#x503C;&#x548C;&#x786E;&#x4FDD;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x6240;&#x6709;&#x6743;&#x7684;&#x7F51;&#x7EDC;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x8FD8;&#x6709;&#x5F88;&#x591A;&#x6BD4;&#x8D77;&#x7B2C;&#x4E00;&#x773C;&#x770B;&#x5230;&#x7684;&#x66F4;&#x591A;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x4E3B;&#x8981;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;&#xFF0C;&#x83B7;&#x5F97;&#x5FC5;&#x8981;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x8FDB;&#x884C;&#x7B80;&#x5355;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F00;&#x59CB;&#x5C55;&#x5F00;&#x4F7F;&#x6BD4;&#x7279;&#x5E01;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x7684;&#x6280;&#x672F;&#x5C42;&#x6B21;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x548C;&#x534F;&#x8BAE;&#x7684;&#x5185;&#x90E8;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;&#x4E4B;&#x524D;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;</strong></p>
<p>&#x53EF;&#x884C;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x7684;&#x51FA;&#x73B0;&#x4E0E;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x53D1;&#x5C55;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x771F;&#x6B63;&#x7684;&#x6311;&#x6218;&#x662F;&#x5F53;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x6765;&#x4EE3;&#x8868;&#x53EF;&#x4EE5;&#x4EA4;&#x6362;&#x5546;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x7684;&#x4EF7;&#x503C;&#x5374;&#x4E0D;&#x4EE5;&#x4E3A;&#x5947;&#x3002;&#x63A5;&#x53D7;&#x6570;&#x5B57;&#x91D1;&#x94B1;&#x7684;&#x4EBA;&#x7684;&#x4E09;&#x4E2A;&#x57FA;&#x672C;&#x95EE;&#x9898;&#x662F;&#xFF1A;</p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x76F8;&#x4FE1;&#x94B1;&#x662F;&#x771F;&#x5B9E;&#x7684;&#xFF0C;&#x4E0D;&#x662F;&#x5047;&#x7684;&#x5417;&#xFF1F;</p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x76F8;&#x4FE1;&#x6570;&#x5B57;&#x91D1;&#x94B1;&#x53EA;&#x80FD;&#x82B1;&#x4E00;&#x6B21;&#xFF08;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#xFF09;&#x5417;&#xFF1F;</p>
<p>&#x6211;&#x53EF;&#x4EE5;&#x786E;&#x5B9A;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x591F;&#x58F0;&#x79F0;&#x8FD9;&#x7B14;&#x94B1;&#x5C5E;&#x4E8E;&#x4ED6;&#x4EEC;&#x800C;&#x4E0D;&#x662F;&#x6211;&#x5417;&#xFF1F;</p>
<p>&#x7EB8;&#x5E01;&#x53D1;&#x884C;&#x5546;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#x7684;&#x7EB8;&#x5F20;&#x548C;&#x5370;&#x5237;&#x6280;&#x672F;&#x4E0D;&#x65AD;&#x6253;&#x51FB;&#x5047;&#x5192;&#x95EE;&#x9898;&#x3002;&#x7269;&#x7406;&#x94B1;&#x5BB9;&#x6613;&#x89E3;&#x51B3;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x95EE;&#x9898;&#xFF0C;&#x56E0;&#x4E3A;&#x540C;&#x4E00;&#x7EB8;&#x5E01;&#x4E0D;&#x80FD;&#x540C;&#x65F6;&#x5728;&#x4E24;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x5F53;&#x7136;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x94B1;&#x4E5F;&#x7ECF;&#x5E38;&#x4EE5;&#x6570;&#x5B57;&#x65B9;&#x5F0F;&#x5B58;&#x50A8;&#x548C;&#x4F20;&#x9001;&#x3002;&#x5728;&#x8FD9;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5047;&#x5192;&#x548C;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x95EE;&#x9898;&#x662F;&#x901A;&#x8FC7;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x673A;&#x6784;&#x6E05;&#x7B97;&#x6240;&#x6709;&#x7535;&#x5B50;&#x4EA4;&#x6613;&#x6765;&#x5904;&#x7406;&#x7684;&#xFF0C;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x673A;&#x6784;&#x62E5;&#x6709;&#x9762;&#x5411;&#x5168;&#x7403;&#x7684;&#x8D27;&#x5E01;&#x89C6;&#x89D2;&#x3002;&#x5BF9;&#x4E8E;&#x4E0D;&#x80FD;&#x5229;&#x7528;&#x6DF1;&#x5965;&#x6CB9;&#x58A8;&#x6280;&#x672F;&#x6216;&#x5168;&#x606F;&#x6761;&#x7801;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#xFF0C;&#x5BC6;&#x7801;&#x5B66;&#x4E3A;&#x4FE1;&#x4EFB;&#x7528;&#x6237;&#x58F0;&#x79F0;&#x4EF7;&#x503C;&#x7684;&#x5408;&#x6CD5;&#x6027;&#x63D0;&#x4F9B;&#x4E86;&#x4F9D;&#x636E;&#x3002;&#x5177;&#x4F53;&#x6765;&#x8BF4;&#xFF0C;&#x52A0;&#x5BC6;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4F7F;&#x7528;&#x6237;&#x80FD;&#x591F;&#x7B7E;&#x7F72;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x6216;&#x8BC1;&#x660E;&#x8BE5;&#x8D44;&#x4EA7;&#x6240;&#x6709;&#x6743;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x901A;&#x8FC7;&#x9002;&#x5F53;&#x7684;&#x67B6;&#x6784;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x89E3;&#x51B3;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5F53;&#x52A0;&#x5BC6;&#x5728;20&#x4E16;&#x7EAA;80&#x5E74;&#x4EE3;&#x672B;&#x5F00;&#x59CB;&#x53D8;&#x5F97;&#x66F4;&#x5E7F;&#x6CDB;&#x53EF;&#x7528;&#x5E76;&#x88AB;&#x7406;&#x89E3;&#x65F6;&#xFF0C;&#x8BB8;&#x591A;&#x7814;&#x7A76;&#x4EBA;&#x5458;&#x5F00;&#x59CB;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x52A0;&#x5BC6;&#x6280;&#x672F;&#x6784;&#x5EFA;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x3002;&#x8FD9;&#x4E9B;&#x65E9;&#x671F;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x9879;&#x76EE;&#x53D1;&#x884C;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#xFF0C;&#x901A;&#x5E38;&#x7531;&#x56FD;&#x5BB6;&#x8D27;&#x5E01;&#x6216;&#x8D35;&#x91D1;&#x5C5E;&#xFF08;&#x5982;&#x9EC4;&#x91D1;&#xFF09;&#x652F;&#x6301;&#x3002;</p>
<p>&#x867D;&#x7136;&#x8FD9;&#x4E9B;&#x65E9;&#x671F;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x662F;&#x96C6;&#x4E2D;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x5BB9;&#x6613;&#x88AB;&#x653F;&#x5E9C;&#x548C;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x3002;&#x65E9;&#x671F;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x4F7F;&#x7528;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7968;&#x636E;&#x4EA4;&#x6613;&#x6240;&#x5B9A;&#x671F;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x5C31;&#x50CF;&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x4E00;&#x6837;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B0;&#x5174;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x6210;&#x4E3A;&#x4E86;&#x653F;&#x5E9C;&#x62C5;&#x5FE7;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x6700;&#x7EC8;&#x4ECE;&#x6CD5;&#x5F8B;&#x7A0B;&#x5E8F;&#x4E0A;&#x6D88;&#x5931;&#x4E86;&#x3002;&#x8FD8;&#x6709;&#x4E9B;&#x7531;&#x4E8E;&#x5F53;&#x6BCD;&#x516C;&#x53F8;&#x7A81;&#x7136;&#x6E05;&#x76D8;&#x5C31;&#x5931;&#x8D25;&#x4E86;&#x3002;&#x4E3A;&#x4E86;&#x575A;&#x5B9A;&#x7684;&#x62B5;&#x5236;&#x5BF9;&#x624B;&#x7684;&#x4ECB;&#x5165;&#xFF0C;&#x65E0;&#x8BBA;&#x8FD9;&#x4E9B;&#x5BF9;&#x624B;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x653F;&#x5E9C;&#x6216;&#x662F;&#x72AF;&#x7F6A;&#x5206;&#x5B50;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x9700;&#x8981;&#x7684;&#x662F;&#x907F;&#x514D;&#x5355;&#x8282;&#x70B9;&#x653B;&#x51FB;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5C31;&#x662F;&#x4E00;&#x79CD;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#xFF0C;&#x901A;&#x8FC7;&#x8BBE;&#x8BA1;&#x5B9E;&#x73B0;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x53D7;&#x5236;&#x4E8E;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x88AB;&#x653B;&#x51FB;&#x6216;&#x635F;&#x574F;&#x7684;&#x4E2D;&#x592E;&#x6743;&#x5A01;&#x6216;&#x63A7;&#x5236;&#x70B9;&#x3002;</p>
<h1 id="12&#x6BD4;&#x7279;&#x5E01;&#x5386;&#x53F2;">1.2&#x6BD4;&#x7279;&#x5E01;&#x5386;&#x53F2;</h1>
<p>Bitcoin&#x662F;&#x5728;2008&#x5E74;&#x7531;&#x7F72;&#x540D;Satoshi Nakamoto&#x7684;&#x725B;&#x4EBA;&#x53D1;&#x660E;&#x7684;&#xFF0C;&#x4ED6;&#x51FA;&#x7248;&#x4E86;&#x4E00;&#x7BC7;&#x9898;&#x4E3A;&#x201C;Bitcoin&#xFF1A;A Peer-to-Peer Electronic Cash System&#x201D;&#x7684;&#x6587;&#x7AE0;[1]&#x3002; Nakamoto&#x7ED3;&#x5408;&#x4E86;&#x8BF8;&#x5982;b-money&#x548C;HashCash&#x7B49;&#x5148;&#x524D;&#x7684;&#x53D1;&#x660E;&#xFF0C;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7535;&#x5B50;&#x73B0;&#x91D1;&#x7CFB;&#x7EDF;&#xFF0C;&#x5B83;&#x4E0D;&#x4F9D;&#x8D56;&#x4E2D;&#x592E;&#x673A;&#x6784;&#x8FDB;&#x884C;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x6216;&#x7ED3;&#x7B97;&#x548C;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x3002;&#x5173;&#x952E;&#x7684;&#x521B;&#x65B0;&#x662F;&#x4F7F;&#x7528;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x7CFB;&#x7EDF;&#xFF08;&#x79F0;&#x4E3A;&#x201C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x201D;&#x7B97;&#x6CD5;&#xFF09;&#x6BCF;10&#x5206;&#x949F;&#x8FDB;&#x884C;&#x4E00;&#x6B21;&#x5168;&#x7403;&#x6027;&#x7684;&#x201C;&#x9009;&#x4E3E;&#x201D;&#xFF0C;&#x4ECE;&#x800C;&#x5141;&#x8BB8;&#x5206;&#x5E03;&#x5F0F;&#x7F51;&#x7EDC;&#x8FBE;&#x6210;&#x5173;&#x4E8E;&#x4EA4;&#x6613;&#x72B6;&#x6001;&#x7684;&#x5171;&#x8BC6;&#x3002;&#x8FD9;&#x4F18;&#x96C5;&#x5730;&#x89E3;&#x51B3;&#x4E86;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#x53EF;&#x4EE5;&#x82B1;&#x8D39;&#x4E24;&#x6B21;&#x3002;&#x4EE5;&#x524D;&#xFF0C;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x95EE;&#x9898;&#x662F;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x7684;&#x5F31;&#x70B9;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7968;&#x636E;&#x4EA4;&#x6362;&#x6240;&#x6E05;&#x7B97;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x6765;&#x89E3;&#x51B3;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x59CB;&#x4E8E;2009&#x5E74;&#xFF0C;&#x57FA;&#x4E8E;&#x4E2D;&#x672C;&#x806A;&#x53D1;&#x5E03;&#x7684;&#x53C2;&#x8003;&#x5B9E;&#x65BD;&#x6307;&#x5357;&#xFF0C;&#x4E4B;&#x540E;&#x7531;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x7A0B;&#x5E8F;&#x5458;&#x8FDB;&#x884C;&#x4FEE;&#x8BA2;&#x3002;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x6027;&#x548C;&#x5F39;&#x6027;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#xFF08;&#x6316;&#x6398;&#xFF09;&#x7684;&#x5B9E;&#x65BD;&#x4EE5;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#xFF0C;&#x73B0;&#x5728;&#x8D85;&#x8FC7;&#x4E86;&#x4E16;&#x754C;&#x9876;&#x7EA7;&#x8D85;&#x7EA7;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x7EC4;&#x5408;&#x5904;&#x7406;&#x80FD;&#x529B;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x603B;&#x5E02;&#x503C;&#x6709;&#x65F6;&#x8D85;&#x8FC7;200&#x4EBF;&#x7F8E;&#x5143;&#xFF0C;&#x8FD9;&#x53D6;&#x51B3;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x5151;&#x7F8E;&#x5143;&#x7684;&#x6C47;&#x7387;&#x3002;&#x5230;&#x76EE;&#x524D;&#x4E3A;&#x6B62;&#xFF0C;&#x7F51;&#x7EDC;&#x5904;&#x7406;&#x6700;&#x5927;&#x7684;&#x4EA4;&#x6613;&#x662F;1.5&#x4EBF;&#x7F8E;&#x5143;&#xFF0C;&#x5373;&#x65F6;&#x4F20;&#x8F93;&#xFF0C;&#x65E0;&#x9700;&#x4EFB;&#x4F55;&#x8D39;&#x7528;&#x5904;&#x7406;&#x3002;</p>
<p>Satoshi Nakamoto&#x4E8E;2011&#x5E74;4&#x6708;&#x9000;&#x51FA;&#x516C;&#x4F17;&#x89C6;&#x7EBF;&#xFF0C;&#x5C06;&#x4EE3;&#x7801;&#x548C;&#x7F51;&#x7EDC;&#x7684;&#x8D23;&#x4EFB;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x84EC;&#x52C3;&#x53D1;&#x5C55;&#x7684;&#x5FD7;&#x613F;&#x8005;&#x5C0F;&#x7EC4;&#x8EAB;&#x4E0A;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x80CC;&#x540E;&#x7684;&#x8FD9;&#x4E2A;&#x4EBA;&#x8EAB;&#x4EFD;&#x4ECD;&#x7136;&#x672A;&#x77E5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E2D;&#x672C;&#x806A;&#x548C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x6CA1;&#x6709;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x8FDB;&#x884C;&#x4E2A;&#x4EBA;&#x63A7;&#x5236;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x57FA;&#x4E8E;&#x5B8C;&#x5168;&#x900F;&#x660E;&#x7684;&#x6570;&#x5B66;&#x539F;&#x7406;&#xFF0C;&#x5F00;&#x653E;&#x6E90;&#x4EE3;&#x7801;&#x548C;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x5171;&#x8BC6;&#x6301;&#x7EED;&#x8FD0;&#x884C;&#x3002;&#x672C;&#x53D1;&#x660E;&#x672C;&#x8EAB;&#x5177;&#x6709;&#x5F00;&#x521B;&#x6027;&#xFF0C;&#x5DF2;&#x7ECF;&#x5EF6;&#x4F38;&#x5230;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#xFF0C;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;&#x8BA1;&#x91CF;&#x7ECF;&#x6D4E;&#x5B66;&#x9886;&#x57DF;&#x3002;</p>
<p>&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;Satoshi Nakamoto&#x7684;&#x53D1;&#x660E;&#x4E5F;&#x662F;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x5F53;&#x4E2D;&#x4E00;&#x4E2A;&#x53E4;&#x8001;&#x95EE;&#x9898;&#x7684;&#x5B9E;&#x7528;&#x548C;&#x65B0;&#x9896;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#xFF0C;&#x8FD9;&#x5C31;&#x662F; &#x201C;&#x62DC;&#x5360;&#x5EAD;&#x5F0F;&#x5C06;&#x519B;&#x201D;&#x95EE;&#x9898;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x5305;&#x62EC;&#x901A;&#x8FC7;&#x5728;&#x4E0D;&#x53EF;&#x9760;&#x548C;&#x6F5C;&#x5728;&#x7684;&#x59A5;&#x534F;&#x7F51;&#x7EDC;&#x4E0A;&#x4EA4;&#x6362;&#x4FE1;&#x606F;&#x6765;&#x5C1D;&#x8BD5;&#x5546;&#x5B9A;&#x4E00;&#x4E2A;&#x884C;&#x52A8;&#x65B9;&#x6848;&#x6216;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x72B6;&#x6001;&#x3002; Satoshi Nakamoto&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x4F7F;&#x7528;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x4FE1;&#x4EFB;&#x673A;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x5171;&#x8BC6;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x5206;&#x5E03;&#x5F0F;&#x8BA1;&#x7B97;&#x7684;&#x7A81;&#x7834;&#xFF0C;&#x5E76;&#x5177;&#x6709;&#x8D85;&#x8D8A;&#x8D27;&#x5E01;&#x7684;&#x5E7F;&#x6CDB;&#x9002;&#x7528;&#x6027;&#x3002;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x5206;&#x6743;&#x7F51;&#x7EDC;&#xFF0C;&#x6BD4;&#x5982;&#x5F69;&#x7968;&#xFF0C;&#x8D44;&#x4EA7;&#x767B;&#x8BB0;&#xFF0C;&#x6570;&#x5B57;&#x516C;&#x8BC1;&#x7B49;&#x7B49;&#x4EE5;&#x8BC1;&#x660E;&#x9009;&#x4E3E;&#x7684;&#x516C;&#x5E73;&#x6027;&#x3002;</p>
<h1 id="13&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x6545;&#x4E8B;">1.3&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x6545;&#x4E8B;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x53E4;&#x8001;&#x7684;&#x6280;&#x672F;&#x201C;&#x94B1;&#x201D;&#x7684;&#x521B;&#x65B0;&#x3002;&#x5176;&#x6838;&#x5FC3;&#x5728;&#x4E8E;&#x94B1;&#x65B9;&#x4FBF;&#x4E86;&#x4EBA;&#x4E0E;&#x4EBA;&#x4E4B;&#x95F4;&#x7684;&#x4EF7;&#x503C;&#x4EA4;&#x6D41;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x5145;&#x5206;&#x4E86;&#x89E3;&#x6BD4;&#x7279;&#x5E01;&#x53CA;&#x5176;&#x7528;&#x9014;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x4EBA;&#x7684;&#x89D2;&#x5EA6;&#x5BA1;&#x89C6;&#x5B83;&#x3002;&#x8FD9;&#x91CC;&#x5217;&#x51FA;&#x7684;&#x6BCF;&#x4E2A;&#x4EBA;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x6545;&#x4E8B;&#x90FD;&#x8BF4;&#x660E;&#x4E86;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x7528;&#x4F8B;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x6574;&#x672C;&#x4E66;&#x4E2D;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#xFF1A;</p>
<p><strong>&#x5317;&#x7F8E;&#x4F4E;&#x4EF7;&#x503C;&#x96F6;&#x552E;&#x4E1A;</strong></p>
<p>Alice&#x4F4F;&#x5728;&#x5317;&#x52A0;&#x5DDE;&#x6E7E;&#x533A;&#x3002;&#x5979;&#x542C;&#x5979;&#x7684;&#x4ECE;&#x4E8B;&#x6280;&#x672F;&#x5DE5;&#x4F5C;&#x7684;&#x670B;&#x53CB;&#x8BF4;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x56E0;&#x6B64;&#x60F3;&#x8981;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5B83;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x8DDF;&#x968F;&#x5979;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x5728;&#x5979;&#x5B66;&#x4E60;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x8D2D;&#x4E70;&#x4E00;&#x4E9B;&#xFF0C;&#x7136;&#x540E;&#x82B1;&#x8D39;&#x4E00;&#x4E9B;&#x5979;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5728;&#x5E15;&#x6D1B;&#x963F;&#x5C14;&#x6258;&#x7684;Bob&#x5496;&#x5561;&#x5385;&#x4E70;&#x4E00;&#x676F;&#x5496;&#x5561;&#x65F6;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x4ECE;&#x96F6;&#x552E;&#x6D88;&#x8D39;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x5411;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x8F6F;&#x4EF6;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#x548C;&#x57FA;&#x672C;&#x4EA4;&#x6613;&#x3002;</p>
<p><strong>&#x5317;&#x7F8E;&#x9AD8;&#x9644;&#x52A0;&#x503C;&#x96F6;&#x552E;</strong></p>
<p>Carol&#x662F;&#x65E7;&#x91D1;&#x5C71;&#x7684;&#x827A;&#x672F;&#x753B;&#x5ECA;&#x8001;&#x677F;&#x3002;&#x5979;&#x5356;&#x6602;&#x8D35;&#x7684;&#x7ED8;&#x753B;&#x6362;&#x53D6;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x4ECB;&#x7ECD;&#x9AD8;&#x4EF7;&#x503C;&#x7269;&#x54C1;&#x96F6;&#x552E;&#x5546;&#x201C;51&#xFF05;&#x201D;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x7684;&#x98CE;&#x9669;&#x3002;</p>
<p><strong>&#x79BB;&#x5CB8;&#x5408;&#x540C;&#x670D;&#x52A1;</strong></p>
<p>Bob&#xFF0C;&#x5E15;&#x6D1B;&#x963F;&#x5C14;&#x6258;&#x7684;&#x5496;&#x5561;&#x5E97;&#x8001;&#x677F;&#xFF0C;&#x6B63;&#x5728;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7F51;&#x7AD9;&#x3002;&#x4ED6;&#x4E0E;&#x5370;&#x5EA6;&#x7684;&#x7F51;&#x7EDC;&#x5F00;&#x53D1;&#x5546;Gopesh&#x7B7E;&#x7EA6;&#xFF0C;&#x540E;&#x8005;&#x5728;&#x5370;&#x5EA6;&#x73ED;&#x52A0;&#x7F57;&#x5C14;&#x5C45;&#x4F4F;&#x3002; Gopesh&#x540C;&#x610F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x652F;&#x4ED8;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x7814;&#x7A76;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x8FDB;&#x884C;&#x5916;&#x5305;&#xFF0C;&#x5408;&#x540C;&#x670D;&#x52A1;&#x548C;&#x56FD;&#x9645;&#x7535;&#x6C47;&#x3002;</p>
<p><strong>&#x7F51;&#x4E0A;&#x5546;&#x5E97;</strong></p>
<p>Gabriel&#x662F;&#x91CC;&#x7EA6;&#x70ED;&#x5185;&#x5362;&#x7684;&#x4E00;&#x4E2A;&#x6709;&#x8FDB;&#x53D6;&#x5FC3;&#x7684;&#x5E74;&#x8F7B;&#x9752;&#x5C11;&#x5E74;&#xFF0C;&#x7ECF;&#x8425;&#x7740;&#x4E00;&#x5BB6;&#x5C0F;&#x578B;&#x7F51;&#x5E97;&#xFF0C;&#x9500;&#x552E;&#x6BD4;&#x7279;&#x5E01;&#x54C1;&#x724C;&#x7684;T&#x6064;&#xFF0C;&#x5496;&#x5561;&#x676F;&#x548C;&#x8D34;&#x7EB8;&#x3002;Gabriel&#x592A;&#x5E74;&#x8F7B;&#xFF0C;&#x6CA1;&#x6709;&#x94F6;&#x884C;&#x8D26;&#x6237;&#xFF0C;&#x4F46;&#x4ED6;&#x7684;&#x7236;&#x6BCD;&#x9F13;&#x52B1;&#x4ED6;&#x7684;&#x4F01;&#x4E1A;&#x7CBE;&#x795E;&#x3002;</p>
<p><strong>&#x6148;&#x5584;&#x6350;&#x6B3E;</strong></p>
<p>Eugenia&#x662F;&#x83F2;&#x5F8B;&#x5BBE;&#x513F;&#x7AE5;&#x6148;&#x5584;&#x673A;&#x6784;&#x7684;&#x4E3B;&#x4EFB;&#x3002;&#x6700;&#x8FD1;&#x5979;&#x5DF2;&#x7ECF;&#x53D1;&#x73B0;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x5229;&#x7528;&#x5B83;&#x6765;&#x63A5;&#x89E6;&#x65B0;&#x7684;&#x56FD;&#x5185;&#x5916;&#x6350;&#x52A9;&#x8005;&#xFF0C;&#x4E3A;&#x5979;&#x7684;&#x6148;&#x5584;&#x7B79;&#x6B3E;&#x3002;&#x5979;&#x8FD8;&#x5728;&#x8C03;&#x67E5;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x5FEB;&#x901F;&#x5C06;&#x8D44;&#x91D1;&#x5206;&#x914D;&#x7ED9;&#x9700;&#x8981;&#x7684;&#x5730;&#x533A;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x5C55;&#x793A;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x6765;&#x8DE8;&#x5E01;&#x79CD;&#x548C;&#x8DE8;&#x56FD;&#x754C;&#x7684;&#x5168;&#x7403;&#x7B79;&#x6B3E;&#x6D3B;&#x52A8;&#xFF0C;&#x4EE5;&#x53CA;&#x5728;&#x6148;&#x5584;&#x7EC4;&#x7EC7;&#x4E2D;&#x4F7F;&#x7528;&#x5F00;&#x653E;&#x900F;&#x660E;&#x7684;&#x5206;&#x7C7B;&#x8D26;&#x7C3F;&#x3002;</p>
<p><strong>&#x8FDB;&#x51FA;&#x53E3;</strong></p>
<p>Mohammed&#x662F;&#x8FEA;&#x62DC;&#x7684;&#x7535;&#x5B50;&#x8FDB;&#x53E3;&#x5546;&#x3002;&#x4ED6;&#x6B63;&#x5728;&#x5C1D;&#x8BD5;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x4ECE;&#x7F8E;&#x56FD;&#x548C;&#x4E2D;&#x56FD;&#x8D2D;&#x4E70;&#x7535;&#x5B50;&#x4EA7;&#x54C1;&#xFF0C;&#x8FDB;&#x53E3;&#x5230;&#x963F;&#x8054;&#x914B;&#xFF0C;&#x4EE5;&#x52A0;&#x901F;&#x8FDB;&#x53E3;&#x4ED8;&#x6B3E;&#x8FC7;&#x7A0B;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x5C55;&#x793A;&#x5982;&#x4F55;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x4E8E;&#x4E0E;&#x7269;&#x7406;&#x5546;&#x54C1;&#x76F8;&#x5173;&#x7684;&#x5927;&#x578B;&#x4F01;&#x4E1A;&#x4E4B;&#x95F4;&#x7684;&#x56FD;&#x9645;&#x652F;&#x4ED8;&#x3002;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;</strong></p>
<p>Jing&#x662F;&#x4E0A;&#x6D77;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x4E13;&#x4E1A;&#x5B66;&#x751F;&#x3002;&#x4ED6;&#x5DF2;&#x7ECF;&#x4F7F;&#x7528;&#x4ED6;&#x7684;&#x5DE5;&#x7A0B;&#x6280;&#x672F;&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x201C;&#x91C7;&#x77FF;&#x201D;&#x77FF;&#x673A;&#x6765;&#x6316;&#x6398;&#x6BD4;&#x7279;&#x5E01;&#x6765;&#x589E;&#x52A0;&#x4ED6;&#x7684;&#x6536;&#x5165;&#x3002;&#x8FD9;&#x4E2A;&#x6545;&#x4E8B;&#x5C06;&#x7814;&#x7A76;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x201C;&#x5DE5;&#x4E1A;&#x201D;&#x57FA;&#x7840;&#xFF1A;&#x7528;&#x4E8E;&#x786E;&#x4FDD;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x548C;&#x53D1;&#x884C;&#x65B0;&#x8D27;&#x5E01;&#x7684;&#x4E13;&#x95E8;&#x8BBE;&#x5907;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6545;&#x4E8B;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x90FD;&#x662F;&#x57FA;&#x4E8E;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x771F;&#x5B9E;&#x4EBA;&#x7269;&#x548C;&#x5B9E;&#x9645;&#x884C;&#x4E1A;&#xFF0C;&#x4E3A;&#x5168;&#x7403;&#x7ECF;&#x6D4E;&#x95EE;&#x9898;&#x521B;&#x9020;&#x65B0;&#x7684;&#x5E02;&#x573A;&#xFF0C;&#x65B0;&#x7684;&#x884C;&#x4E1A;&#x548C;&#x521B;&#x65B0;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<h1 id="14&#x5165;&#x95E8;">1.4&#x5165;&#x95E8;</h1>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x534F;&#x8BAE;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x8BBF;&#x95EE;&#x7684;&#x534F;&#x8BAE;&#x3002; &#x201C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x201D;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#xFF0C;&#x5C31;&#x50CF;Web&#x6D4F;&#x89C8;&#x5668;&#x662F;HTTP&#x534F;&#x8BAE;&#x6700;&#x5E38;&#x7528;&#x7684;&#x7528;&#x6237;&#x754C;&#x9762;&#x4E00;&#x6837;&#x3002;&#x6709;&#x5F88;&#x591A;&#x5B9E;&#x65BD;&#x548C;&#x54C1;&#x724C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF0C;&#x5C31;&#x50CF;&#x6709;&#x8BB8;&#x591A;&#x54C1;&#x724C;&#x7684;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;Chrome&#xFF0C;Safari&#xFF0C;Firefox&#x548C;Internet Explorer&#xFF09;&#x3002;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x90FD;&#x6709;&#x6211;&#x4EEC;&#x6700;&#x559C;&#x6B22;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#xFF08;Mozilla Firefox&#xFF0C;Yay&#xFF01;&#xFF09;&#x548C;&#x6211;&#x4EEC;&#x4E0D;&#x559C;&#x6B22;&#x7684;&#xFF08;Internet Explorer&#xFF0C;Yuck&#xFF01;&#xFF09;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x7684;&#x8D28;&#x91CF;&#xFF0C;&#x6027;&#x80FD;&#xFF0C;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x9690;&#x79C1;&#x548C;&#x53EF;&#x9760;&#x6027;&#x5404;&#x4E0D;&#x76F8;&#x540C;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x7684;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#xFF0C;&#x5176;&#x5305;&#x62EC;&#x88AB;&#x79F0;&#x4E3A;&#x201C;Satoshi&#x5BA2;&#x6237;&#x7AEF;&#x201D;&#x6216;&#x201C;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x201D;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x8BE5;&#x94B1;&#x5305;&#x6E90;&#x4E8E;&#x7531;Satoshi Nakamoto&#x64B0;&#x5199;&#x7684;&#x521D;&#x59CB;&#x5BA2;&#x6237;&#x7AEF;&#x3002;</p>
<h2 id="141&#x9009;&#x62E9;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;">1.4.1&#x9009;&#x62E9;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x4E2D;&#x6700;&#x6D3B;&#x8DC3;&#x7684;&#x5F00;&#x53D1;&#x7684;&#x5E94;&#x7528;&#x4E4B;&#x4E00;&#x3002;&#x8FD9;&#x91CC;&#x7ADE;&#x4E89;&#x6FC0;&#x70C8;&#xFF0C;&#x76EE;&#x524D;&#x5B58;&#x5728;&#x53EF;&#x80FD;&#x6B63;&#x5728;&#x5F00;&#x53D1;&#x65B0;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x53BB;&#x5E74;&#x7684;&#x51E0;&#x4E2A;&#x94B1;&#x5305;&#x5DF2;&#x4E0D;&#x518D;&#x79EF;&#x6781;&#x7EF4;&#x62A4;&#x3002;&#x8BB8;&#x591A;&#x94B1;&#x5305;&#x4E13;&#x6CE8;&#x4E8E;&#x7279;&#x5B9A;&#x7684;&#x5E73;&#x53F0;&#x6216;&#x5177;&#x4F53;&#x7528;&#x9014;&#xFF0C;&#x4E00;&#x4E9B;&#x66F4;&#x9002;&#x5408;&#x521D;&#x5B66;&#x8005;&#xFF0C;&#x800C;&#x5176;&#x4ED6;&#x7684;&#x94B1;&#x5305;&#x5219;&#x4E3A;&#x9AD8;&#x7EA7;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x529F;&#x80FD;&#x3002;&#x9009;&#x62E9;&#x94B1;&#x5305;&#x662F;&#x975E;&#x5E38;&#x4E3B;&#x89C2;&#x7684;&#xFF0C;&#x53D6;&#x51B3;&#x4E8E;&#x4F7F;&#x7528;&#x548C;&#x7528;&#x6237;&#x7684;&#x4E13;&#x4E1A;&#x77E5;&#x8BC6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E0D;&#x53EF;&#x80FD;&#x63A8;&#x8350;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x94B1;&#x5305;&#x54C1;&#x724C;&#x6216;&#x9879;&#x76EE;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x5176;&#x5E73;&#x53F0;&#x548C;&#x529F;&#x80FD;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x94B1;&#x5305;&#x7684;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x3002;&#x66F4;&#x597D;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x79FB;&#x52A8;&#x94B1;&#x662F;&#x5BB9;&#x6613;&#xFF0C;&#x4FBF;&#x5B9C;&#x548C;&#x5FEB;&#x901F;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x503C;&#x5F97;&#x5C1D;&#x8BD5;&#x51E0;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x7B26;&#x5408;&#x60A8;&#x9700;&#x6C42;&#x7684;&#x94B1;&#x5305;&#x3002;</p>
<p>&#x6839;&#x636E;&#x5E73;&#x53F0;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5206;&#x7C7B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p><strong>&#x684C;&#x9762;&#x94B1;&#x5305;</strong></p>
<p>&#x684C;&#x9762;&#x94B1;&#x5305;&#x662F;&#x4F5C;&#x4E3A;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#x521B;&#x5EFA;&#x7684;&#x7B2C;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF0C;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x8FD0;&#x884C;&#x684C;&#x9762;&#x94B1;&#x5305;&#x4EE5;&#x5B9E;&#x73B0;&#x5176;&#x529F;&#x80FD;&#xFF0C;&#x81EA;&#x4E3B;&#x6027;&#x548C;&#x63A7;&#x5236;&#x6743;&#x3002;&#x5728;&#x901A;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Windows&#x548C;Mac OS&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#x5177;&#x6709;&#x4E00;&#x5B9A;&#x7684;&#x5B89;&#x5168;&#x9690;&#x60A3;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5E73;&#x53F0;&#x5F80;&#x5F80;&#x4E0D;&#x5B89;&#x5168;&#xFF0C;&#x914D;&#x7F6E;&#x4E0D;&#x5F53;&#x3002;</p>
<p><strong>&#x624B;&#x673A;&#x94B1;&#x5305;</strong></p>
<p>&#x624B;&#x673A;&#x94B1;&#x5305;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x5728;&#x667A;&#x80FD;&#x624B;&#x673A;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Apple iOS&#x548C;Android&#xFF09;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x8FD9;&#x4E9B;&#x94B1;&#x5305;&#x901A;&#x5E38;&#x662F;&#x65B0;&#x7528;&#x6237;&#x7684;&#x7EDD;&#x4F73;&#x9009;&#x62E9;&#x3002;&#x8BB8;&#x591A;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x6613;&#x7528;&#x800C;&#x8BBE;&#x8BA1;&#x7684;&#xFF0C;&#x4F46;&#x4E5F;&#x6709;&#x529F;&#x80FD;&#x5F3A;&#x5927;&#x7684;&#x7528;&#x6237;&#x7684;&#x5168;&#x529F;&#x80FD;&#x79FB;&#x52A8;&#x94B1;&#x5305;&#x3002;</p>
<p><strong>&#x5728;&#x7EBF;&#x94B1;&#x5305;</strong></p>
<p>Web&#x94B1;&#x5305;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x8BBF;&#x95EE;&#xFF0C;&#x5E76;&#x5C06;&#x7528;&#x6237;&#x7684;&#x94B1;&#x5305;&#x5B58;&#x50A8;&#x5728;&#x7531;&#x7B2C;&#x4E09;&#x65B9;&#x62E5;&#x6709;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;webmail&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5B8C;&#x5168;&#x4F9D;&#x8D56;&#x4E8E;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E9B;&#x670D;&#x52A1;&#x4F7F;&#x7528;&#x5728;&#x7528;&#x6237;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#xFF0C;&#x8BE5;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x63A7;&#x5236;&#x7528;&#x6237;&#x624B;&#x4E2D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x9700;&#x8981;&#x5728;&#x5B89;&#x5168;&#x548C;&#x65B9;&#x4FBF;&#x6027;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x59A5;&#x534F;&#x3002;&#x5728;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x4E0A;&#x5B58;&#x50A8;&#x5927;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x4E0D;&#x5408;&#x9002;&#x7684;&#x3002;</p>
<p><strong>&#x786C;&#x4EF6;&#x94B1;&#x5305;</strong></p>
<p>&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x662F;&#x5728;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#x4E0A;&#x72EC;&#x7ACB;&#x64CD;&#x4F5C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x7684;&#x8BBE;&#x5907;&#x3002;&#x5B83;&#x4EEC;&#x901A;&#x8FC7;USB&#x4E0E;&#x684C;&#x9762;&#x7F51;&#x7EDC;&#x6D4F;&#x89C8;&#x5668;&#x6216;&#x901A;&#x8FC7;&#x79FB;&#x52A8;&#x8BBE;&#x5907;&#x4E0A;&#x7684;&#x8FD1;&#x573A;&#x901A;&#x4FE1;&#xFF08;NFC&#xFF09;&#x8FDB;&#x884C;&#x64CD;&#x4F5C;&#x3002;&#x901A;&#x8FC7;&#x4E13;&#x7528;&#x786C;&#x4EF6;&#x8FDB;&#x884C;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x5173;&#x64CD;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E9B;&#x94B1;&#x5305;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x975E;&#x5E38;&#x5B89;&#x5168;&#x7684;&#xFF0C;&#x9002;&#x5408;&#x5B58;&#x50A8;&#x5927;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p><strong>&#x7EB8;&#x94B1;&#x5305;</strong></p>
<p>&#x63A7;&#x5236;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5BC6;&#x94A5;&#x4E5F;&#x53EF;&#x4EE5;&#x6253;&#x5370;&#x957F;&#x671F;&#x5B58;&#x50A8;&#x3002;&#x5373;&#x4F7F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x6750;&#x6599;&#xFF08;&#x6728;&#x6750;&#xFF0C;&#x91D1;&#x5C5E;&#x7B49;&#xFF09;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x7EB8;&#x94B1;&#x5305;&#x3002;&#x7EB8;&#x94B1;&#x5305;&#x63D0;&#x4F9B;&#x4F4E;&#x6280;&#x672F;&#x4F46;&#x9AD8;&#x5EA6;&#x5B89;&#x5168;&#x7684;&#x957F;&#x671F;&#x5B58;&#x50A8;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8131;&#x673A;&#x5B58;&#x50A8;&#x4E5F;&#x7ECF;&#x5E38;&#x88AB;&#x79F0;&#x4E3A;&#x51B7;&#x5B58;&#x50A8;&#x3002;</p>
<p>&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x8FDB;&#x884C;&#x5206;&#x7C7B;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x4ED6;&#x4EEC;&#x7684;&#x81EA;&#x4E3B;&#x7A0B;&#x5EA6;&#x4EE5;&#x53CA;&#x5B83;&#x4EEC;&#x5982;&#x4F55;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#xFF1A;</p>
<p><strong>&#x5168;&#x8282;&#x70B9;&#x5BA2;&#x6237;&#x7AEF;</strong></p>
<p>&#x5B8C;&#x6574;&#x5BA2;&#x6237;&#x7AEF;&#x6216;&#x201C;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x201D;&#x662F;&#x5B58;&#x50A8;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x5168;&#x90E8;&#x5386;&#x53F2;&#xFF08;&#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x6BCF;&#x6B21;&#x4EA4;&#x6613;&#xFF09;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x7BA1;&#x7406;&#x7528;&#x6237;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x542F;&#x52A8;&#x4EA4;&#x6613;&#x3002;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x5904;&#x7406;&#x534F;&#x8BAE;&#x7684;&#x6240;&#x6709;&#x65B9;&#x9762;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x9A8C;&#x8BC1;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x548C;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x3002;&#x5168;&#x8282;&#x70B9;&#x5BA2;&#x6237;&#x7AEF;&#x6D88;&#x8017;&#x5927;&#x91CF;&#x8BA1;&#x7B97;&#x673A;&#x8D44;&#x6E90;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;&#x8D85;&#x8FC7;125 GB&#x7684;&#x78C1;&#x76D8;&#xFF0C;2 GB&#x7684;RAM&#xFF09;&#xFF0C;&#x4F46;&#x63D0;&#x4F9B;&#x5B8C;&#x5168;&#x81EA;&#x4E3B;&#x548C;&#x72EC;&#x7ACB;&#x7684;&#x4EA4;&#x6613;&#x9A8C;&#x8BC1;&#x3002;</p>
<p><strong>&#x8F7B;&#x91CF;&#x7EA7;&#x5BA2;&#x6237;&#x7AEF;</strong></p>
<p>&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#xFF08;SPV&#xFF09;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8FDE;&#x63A5;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#xFF08;&#x524D;&#x9762;&#x63D0;&#x5230;&#x8FC7;&#x7684;&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x8BBF;&#x95EE;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x672C;&#x5730;&#x5B58;&#x50A8;&#x7528;&#x6237;&#x94B1;&#x5305;&#xFF0C;&#x5E76;&#x72EC;&#x7ACB;&#x5730;&#x521B;&#x5EFA;&#xFF0C;&#x9A8C;&#x8BC1;&#x548C;&#x4F20;&#x8F93;&#x4EA4;&#x6613;&#x3002;&#x8F7B;&#x91CF;&#x7EA7;&#x5BA2;&#x6237;&#x7AEF;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x76F4;&#x63A5;&#x4EA4;&#x4E92;&#xFF0C;&#x65E0;&#x9700;&#x4E2D;&#x4ECB;&#x3002;</p>
<p><strong>&#x7B2C;&#x4E09;&#x65B9;API&#x5BA2;&#x6237;&#x7AEF;</strong></p>
<p>&#x7B2C;&#x4E09;&#x65B9;API&#x5BA2;&#x6237;&#x7AEF;&#x662F;&#x901A;&#x8FC7;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#xFF08;API&#xFF09;&#x7684;&#x7B2C;&#x4E09;&#x65B9;&#x7CFB;&#x7EDF;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x4E92;&#x7684;API&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x76F4;&#x63A5;&#x8FDE;&#x63A5;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x3002; &#x8FD9;&#x65F6;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x7531;&#x7528;&#x6237;&#x6216;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x5668;&#x5B58;&#x50A8;&#xFF0C;&#x4F46;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x90FD;&#x9700;&#x8981;&#x901A;&#x8FC7;&#x7B2C;&#x4E09;&#x65B9;&#x3002;</p>
<p>&#x7ED3;&#x5408;&#x8FD9;&#x4E9B;&#x5206;&#x7C7B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5206;&#x4E3A;&#x51E0;&#x4E2A;&#x5C0F;&#x7EC4;&#xFF0C;&#x4E09;&#x4E2A;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5212;&#x5206;&#x662F;&#x684C;&#x9762;&#x5168;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x79FB;&#x52A8;&#x8F7B;&#x5DE7;&#x94B1;&#x5305;&#x548C;&#x7F51;&#x7EDC;&#x7B2C;&#x4E09;&#x65B9;&#x94B1;&#x5305;&#x3002;&#x4E0D;&#x540C;&#x7C7B;&#x522B;&#x4E4B;&#x95F4;&#x7684;&#x754C;&#x9650;&#x901A;&#x5E38;&#x662F;&#x6A21;&#x7CCA;&#x7684;&#xFF0C;&#x8BB8;&#x591A;&#x94B1;&#x5305;&#x5728;&#x591A;&#x4E2A;&#x5E73;&#x53F0;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x4EE5;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x4E0E;&#x7F51;&#x7EDC;&#x8FDB;&#x884C;&#x4EA4;&#x4E92;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6F14;&#x793A;&#x4F7F;&#x7528;&#x5404;&#x79CD;&#x53EF;&#x4E0B;&#x8F7D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x4ECE;&#x53C2;&#x8003;&#x5B9E;&#x73B0;&#xFF08;Bitcoin Core&#xFF09;&#x5230;&#x79FB;&#x52A8;&#x548C;&#x7F51;&#x7EDC;&#x94B1;&#x5305;&#x3002;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#x5C06;&#x9700;&#x8981;&#x4F7F;&#x7528;Bitcoin Core&#xFF0C;&#x9664;&#x4E86;&#x4F5C;&#x4E3A;&#x5B8C;&#x6574;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8FD8;&#x53EF;&#x4EE5;&#x5C06;API&#x66B4;&#x9732;&#x7ED9;&#x94B1;&#x5305;&#xFF0C;&#x7F51;&#x7EDC;&#x548C;&#x4EA4;&#x6613;&#x670D;&#x52A1;&#x3002;&#x5982;&#x679C;&#x60A8;&#x8BA1;&#x5212;&#x63A2;&#x7D22;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x7F16;&#x7A0B;&#x63A5;&#x53E3;&#xFF0C;&#x5219;&#x9700;&#x8981;&#x8FD0;&#x884C;Bitcoin Core&#x6216;&#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#xFF08;&#x53C2;&#x89C1;[alt_libraries]&#xFF09;&#x3002;</p>
<h2 id="142&#x5FEB;&#x901F;&#x5F00;&#x59CB;">1.4.2&#x5FEB;&#x901F;&#x5F00;&#x59CB;</h2>
<p>&#x6211;&#x4EEC;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#xFF0C;&#x7528;&#x6237;&#x548C;&#x4ED6;&#x4EEC;&#x7684;&#x6545;&#x4E8B;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;Alice&#x4E0D;&#x662F;&#x6280;&#x672F;&#x884C;&#x5BB6;&#xFF0C;&#x6700;&#x8FD1;&#x53EA;&#x542C;&#x5230;&#x5979;&#x7684;&#x670B;&#x53CB;Joe&#x63D0;&#x5230;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5728;&#x805A;&#x4F1A;&#x4E0A;&#xFF0C;Joe&#x518D;&#x6B21;&#x70ED;&#x70C8;&#x5730;&#x5411;&#x4ED6;&#x5468;&#x56F4;&#x89E3;&#x91CA;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x6F14;&#x793A;&#x3002;&#x6709;&#x8DA3;&#x7684;&#x662F;&#xFF0C;Alice&#x95EE;&#x5979;&#x5982;&#x4F55;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x3002;Joe&#x8BF4;&#xFF0C;&#x624B;&#x673A;&#x94B1;&#x5305;&#x6700;&#x9002;&#x5408;&#x65B0;&#x7528;&#x6237;&#xFF0C;&#x4ED6;&#x63A8;&#x8350;&#x4E86;&#x4ED6;&#x6700;&#x559C;&#x6B22;&#x7684;&#x51E0;&#x6B3E;&#x94B1;&#x5305;&#x3002;Alice&#x4E0B;&#x8F7D;Android&#x7684;&#x201C;Mycelium&#x201D;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5B89;&#x88C5;&#x5728;&#x624B;&#x673A;&#x4E0A;&#x3002;</p>
<p>&#x5F53;Alice&#x9996;&#x6B21;&#x8FD0;&#x884C;Mycelium&#x65F6;&#xFF0C;&#x4E0E;&#x8BB8;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E00;&#x6837;&#xFF0C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4F1A;&#x4E3A;&#x5979;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x94B1;&#x5305;&#x3002;Alice&#x5728;&#x5979;&#x7684;&#x5C4F;&#x5E55;&#x4E0A;&#x770B;&#x5230;&#x94B1;&#x5305;&#xFF0C;&#x5982;&#x201C;Mycelium&#x624B;&#x673A;&#x94B1;&#x5305;&#x201D;&#x5982;&#x4E0B;&#x56FE;1-1&#x6240;&#x793A;&#xFF08;&#x6CE8;&#x610F;&#xFF1A;&#x4E0D;&#x8981;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x6B64;&#x793A;&#x4F8B;&#x5730;&#x5740;&#xFF0C;&#x5B83;&#x5C06;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#xFF09;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-6ab2763645c4afa9.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240" alt=""></p>
<p>&#x56FE;1-1 Mycelium&#x79FB;&#x52A8;&#x94B1;&#x5305;</p>
<p>&#x8FD9;&#x4E2A;&#x5C4F;&#x5E55;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x662F;Alice&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002; &#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#xFF0C;&#x5B83;&#x663E;&#x793A;&#x4E3A;&#x4E00;&#x957F;&#x4E32;&#x5B57;&#x6BCD;&#x548C;&#x6570;&#x5B57;&#xFF1A;1Cdid9KFAaatwczBwBttQcwXYCpvK8h7FK&#x3002; &#x94B1;&#x5305;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x65C1;&#x8FB9;&#x662F;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#xFF0C;&#x4E00;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x6761;&#x5F62;&#x7801;&#xFF0C;&#x5305;&#x542B;&#x53EF;&#x7531;&#x667A;&#x80FD;&#x76F8;&#x673A;&#x626B;&#x63CF;&#x7684;&#x683C;&#x5F0F;&#x7684;&#x76F8;&#x540C;&#x4FE1;&#x606F;&#x3002;&#x4E8C;&#x7EF4;&#x7801;&#x662F;&#x5177;&#x6709;&#x9ED1;&#x8272;&#x548C;&#x767D;&#x8272;&#x70B9;&#x7684;&#x56FE;&#x6848;&#x7684;&#x6B63;&#x65B9;&#x5F62;&#x3002; Alice&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x70B9;&#x51FB;&#x4E8C;&#x7EF4;&#x7801;&#x6216;&#x63A5;&#x6536;&#x6309;&#x94AE;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x6216;&#x4E8C;&#x7EF4;&#x7801;&#x590D;&#x5236;&#x5230;&#x526A;&#x8D34;&#x677F;&#x4E0A;&#x3002; &#x5728;&#x5927;&#x591A;&#x6570;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x70B9;&#x51FB;&#x4E8C;&#x7EF4;&#x7801;&#x4E5F;&#x4F1A;&#x653E;&#x5927;&#xFF0C;&#x4EE5;&#x4FBF;&#x66F4;&#x5BB9;&#x6613;&#x901A;&#x8FC7;&#x667A;&#x80FD;&#x624B;&#x673A;&#x76F8;&#x673A;&#x8FDB;&#x884C;&#x626B;&#x63CF;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4EE5;1&#x6216;3&#x5F00;&#x5934;&#x3002;&#x50CF;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x4E0E;&#x5176;&#x4ED6;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x5171;&#x4EAB;&#xFF0C;&#x76F4;&#x63A5;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x60A8;&#x7684;&#x94B1;&#x5305;&#x3002; &#x4ECE;&#x5B89;&#x5168;&#x89D2;&#x5EA6;&#x770B;&#xFF0C;&#x5173;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x654F;&#x611F;&#x6027;&#x3002; &#x5B83;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x53D1;&#x5E03;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x5371;&#x53CA;&#x5E10;&#x6237;&#x7684;&#x5B89;&#x5168;&#x3002; &#x4E0E;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x5730;&#x5740;&#x4E0D;&#x540C;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x4F1A;&#x5C06;&#x8D44;&#x91D1;&#x7528;&#x4E8E;&#x60A8;&#x7684;&#x94B1;&#x5305;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x8BB8;&#x591A;&#x73B0;&#x4EE3;&#x94B1;&#x5305;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x81EA;&#x52A8;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x6700;&#x5927;&#x9650;&#x5EA6;&#x5730;&#x63D0;&#x9AD8;&#x9690;&#x79C1;&#x3002; &#x94B1;&#x5305;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x96C6;&#x5408;&#x548C;&#x89E3;&#x9501;&#x8D44;&#x91D1;&#x7684;&#x94A5;&#x5319;&#x3002;</p>
<p>Alice&#x73B0;&#x5728;&#x51C6;&#x5907;&#x597D;&#x6536;&#x5230;&#x8D44;&#x91D1;&#x3002;&#x5979;&#x7684;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x968F;&#x673A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF08;&#x5728;[private_keys]&#x4E2D;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x63CF;&#x8FF0;&#xFF09;&#x53CA;&#x5176;&#x76F8;&#x5E94;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x5979;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5BF9;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6765;&#x8BF4;&#x662F;&#x4E0D;&#x77E5;&#x9053;&#x7684;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x672A;&#x7ECF;&#x6CE8;&#x518C;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x3002;&#x5979;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5BF9;&#x5E94;&#x4E8E;&#x4E00;&#x4E2A;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8D44;&#x91D1;&#x8BBF;&#x95EE;&#x7684;&#x5BC6;&#x94A5;&#x3002;&#x5B83;&#x662F;&#x7531;&#x5979;&#x7684;&#x94B1;&#x5305;&#x72EC;&#x7ACB;&#x751F;&#x6210;&#x7684;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x53C2;&#x8003;&#x6216;&#x6CE8;&#x518C;&#x4EFB;&#x4F55;&#x670D;&#x52A1;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5728;&#x5927;&#x591A;&#x6570;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x548C;&#x4EFB;&#x4F55;&#x5916;&#x90E8;&#x53EF;&#x8BC6;&#x522B;&#x7684;&#x4FE1;&#x606F;&#xFF08;&#x5305;&#x62EC;&#x7528;&#x6237;&#x7684;&#x8EAB;&#x4EFD;&#xFF09;&#x4E4B;&#x95F4;&#x6CA1;&#x6709;&#x5173;&#x8054;&#x3002;&#x5728;&#x8BE5;&#x5730;&#x5740;&#x88AB;&#x5F15;&#x7528;&#x4F5C;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x5E10;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x63A5;&#x6536;&#x8005;&#x4E4B;&#x524D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53EA;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x6709;&#x6548;&#x7684;&#x5927;&#x91CF;&#x53EF;&#x80FD;&#x7684;&#x5730;&#x5740;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x53EA;&#x6709;&#x4E00;&#x65E6;&#x4E0E;&#x4EA4;&#x6613;&#x76F8;&#x5173;&#x8054;&#x624D;&#x80FD;&#x6210;&#x4E3A;&#x7F51;&#x7EDC;&#x4E2D;&#x5DF2;&#x77E5;&#x5730;&#x5740;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>Alice&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x5979;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E86;&#x3002;</p>
<h2 id="143&#x5F97;&#x5230;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;">1.4.3&#x5F97;&#x5230;&#x4F60;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;</h2>
<p>&#x65B0;&#x7528;&#x6237;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4E5F;&#x662F;&#x6700;&#x56F0;&#x96BE;&#x7684;&#x4EFB;&#x52A1;&#x662F;&#x83B7;&#x53D6;&#x4E00;&#x4E9B;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E0E;&#x5176;&#x4ED6;&#x5916;&#x5E01;&#x4E0D;&#x540C;&#xFF0C;&#x60A8;&#x8FD8;&#x4E0D;&#x80FD;&#x5728;&#x94F6;&#x884C;&#x6216;&#x81EA;&#x52A9;&#x673A;&#x8D2D;&#x4E70;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x3002;&#x5927;&#x591A;&#x6570;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#xFF08;&#x5982;&#x4FE1;&#x7528;&#x5361;&#xFF0C;&#x501F;&#x8BB0;&#x5361;&#xFF0C;PayPal&#x548C;&#x94F6;&#x884C;&#x5E10;&#x6237;&#x8F6C;&#x5E10;&#xFF09;&#x90FD;&#x662F;&#x53EF;&#x9006;&#x7684;&#x3002;&#x5BF9;&#x4E8E;&#x9500;&#x552E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x5F15;&#x8D77;&#x4E86;&#x5F88;&#x9AD8;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x4E70;&#x65B9;&#x5728;&#x6536;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x540E;&#x4F1A;&#x626D;&#x8F6C;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#x6B3A;&#x9A97;&#x4E86;&#x5356;&#x5BB6;&#x3002;&#x4E3A;&#x4E86;&#x51CF;&#x8F7B;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#xFF0C;&#x63A5;&#x53D7;&#x4F20;&#x7EDF;&#x7535;&#x5B50;&#x652F;&#x4ED8;&#x7684;&#x516C;&#x53F8;&#x901A;&#x5E38;&#x8981;&#x6C42;&#x4E70;&#x65B9;&#x8FDB;&#x884C;&#x8EAB;&#x4EFD;&#x9A8C;&#x8BC1;&#x548C;&#x4FE1;&#x7528;&#x9A8C;&#x8BC1;&#xFF08;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x51E0;&#x5929;&#x6216;&#x51E0;&#x5468;&#x65F6;&#x95F4;&#xFF09;&#x3002;&#x4F5C;&#x4E3A;&#x65B0;&#x7528;&#x6237;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x60A8;&#x4E0D;&#x80FD;&#x7ACB;&#x5373;&#x4F7F;&#x7528;&#x4FE1;&#x7528;&#x5361;&#x8D2D;&#x4E70;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x9700;&#x8981;&#x6709;&#x4E00;&#x70B9;&#x8010;&#x5FC3;&#x548C;&#x521B;&#x9020;&#x6027;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E0D;&#x8981;&#x7740;&#x6025;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4F5C;&#x4E3A;&#x65B0;&#x7528;&#x6237;&#x5F97;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E00;&#x4E9B;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>&#x627E;&#x4E00;&#x4E2A;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x670B;&#x53CB;&#xFF0C;&#x76F4;&#x63A5;&#x4ECE;&#x4ED6;&#x6216;&#x5979;&#x90A3;&#x91CC;&#x4E70;&#x4E00;&#x4E9B;&#x3002;&#x8BB8;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x90FD;&#x662F;&#x4EE5;&#x8FD9;&#x79CD;&#x65B9;&#x5F0F;&#x5F00;&#x59CB;&#x7684;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x662F;&#x6700;&#x4E0D;&#x590D;&#x6742;&#x7684;&#x3002;&#x627E;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x6301;&#x6709;&#x8005;&#x7684;&#x597D;&#x529E;&#x6CD5;&#x662F;&#x53C2;&#x52A0;Meetup.com&#x4E0A;&#x5217;&#x51FA;&#x7684;&#x672C;&#x5730;&#x6BD4;&#x7279;&#x5E01;&#x4F1A;&#x8BAE;&#x3002;&#xFF08;&#x5728;&#x4E2D;&#x56FD;&#x6839;&#x672C;&#x65E0;&#x9700;&#x8FD9;&#x4E48;&#x9EBB;&#x70E6;&#xFF0C;&#x52A0;&#x5FAE;&#x4FE1;&#x7FA4;&#xFF0C;&#x5728;&#x7EBF;&#x652F;&#x4ED8;&#x5C31;&#x53EF;&#x4EE5;&#xFF09;</p>
<p>&#x4F7F;&#x7528;&#x5206;&#x7C7B;&#x670D;&#x52A1;&#xFF0C;&#x5982;localbitcoins.com&#x6765;&#x67E5;&#x627E;&#x60A8;&#x6240;&#x5728;&#x5730;&#x533A;&#x7684;&#x5356;&#x5BB6;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x73B0;&#x573A;&#x4EA4;&#x6613;&#x4E2D;&#x8D2D;&#x4E70;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x5356;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x670D;&#x52A1;&#x8D5A;&#x53D6;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x7A0B;&#x5E8F;&#x5458;&#xFF0C;&#x51FA;&#x552E;&#x4F60;&#x7684;&#x7F16;&#x7A0B;&#x6280;&#x5DE7;&#x3002;&#x5982;&#x679C;&#x4F60;&#x662F;&#x7F8E;&#x53D1;&#x5E08;&#xFF0C;&#x7406;&#x53D1;&#x53EA;&#x6536;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x5728;&#x4F60;&#x7684;&#x57CE;&#x5E02;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;ATM&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x81EA;&#x52A8;&#x53D6;&#x6B3E;&#x673A;&#x662F;&#x63A5;&#x53D7;&#x73B0;&#x91D1;&#x5E76;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x667A;&#x80FD;&#x624B;&#x673A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x7684;&#x673A;&#x5668;&#x3002;&#x4F7F;&#x7528;<a href="http://coinatmradar.com/" target="_blank">Coin ATM Radar</a>&#x7684;&#x5728;&#x7EBF;&#x5730;&#x56FE;&#x627E;&#x5230;&#x9760;&#x8FD1;&#x60A8;&#x7684;&#x6BD4;&#x7279;&#x5E01;ATM&#x3002;</p>
<p>&#x4F7F;&#x7528;&#x4E0E;&#x60A8;&#x7684;&#x94F6;&#x884C;&#x5E10;&#x6237;&#x76F8;&#x5173;&#x8054;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8D27;&#x5E01;&#x5151;&#x6362;&#x3002;&#x73B0;&#x5728;&#x6709;&#x5F88;&#x591A;&#x56FD;&#x5BB6;&#x90FD;&#x6709;&#x8D27;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#xFF0C;&#x4E3A;&#x4E70;&#x5356;&#x53CC;&#x65B9;&#x4EA4;&#x6613;&#x4F7F;&#x7528;&#x5F53;&#x5730;&#x8D27;&#x5E01;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x5B9E;&#x65F6;&#x884C;&#x60C5;&#x670D;&#x52A1;&#xFF08;&#x5982;BitcoinAverage&#xFF09;&#x901A;&#x5E38;&#x4F1A;&#x663E;&#x793A;&#x6BCF;&#x79CD;&#x8D27;&#x5E01;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x5217;&#x8868;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x5176;&#x4ED6;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x7684;&#x4F18;&#x70B9;&#x4E4B;&#x4E00;&#x662F;&#xFF0C;&#x5F53;&#x6B63;&#x786E;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5B83;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x9690;&#x79C1;&#x3002; &#x83B7;&#x53D6;&#xFF0C;&#x6301;&#x6709;&#x548C;&#x652F;&#x4ED8;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x8981;&#x6C42;&#x60A8;&#x5411;&#x7B2C;&#x4E09;&#x65B9;&#x6CC4;&#x9732;&#x654F;&#x611F;&#x548C;&#x4E2A;&#x4EBA;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6BD4;&#x7279;&#x5E01;&#x6D89;&#x53CA;&#x4F20;&#x7EDF;&#x7684;&#x8D27;&#x5E01;&#x4EA4;&#x6362;&#x7CFB;&#x7EDF;&#xFF0C;&#x90A3;&#x4E48;&#x56FD;&#x5BB6;&#x6CD5;&#x5F8B;&#x548C;&#x56FD;&#x9645;&#x6CD5;&#x89C4;&#x5C31;&#x4F1A;&#x9002;&#x7528;&#x3002; &#x4E3A;&#x4E86;&#x5151;&#x6362;&#x672C;&#x5E01;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x60A8;&#x901A;&#x5E38;&#x9700;&#x8981;&#x63D0;&#x4F9B;&#x8EAB;&#x4EFD;&#x8BC1;&#x660E;&#x548C;&#x94F6;&#x884C;&#x4FE1;&#x606F;&#x3002; &#x7528;&#x6237;&#x5E94;&#x8BE5;&#x77E5;&#x9053;&#xFF0C;&#x4E00;&#x65E6;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x9644;&#x52A0;&#x5230;&#x4E00;&#x4E2A;&#x8EAB;&#x4EFD;&#xFF0C;&#x6240;&#x6709;&#x5173;&#x8054;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E5F;&#x5F88;&#x5BB9;&#x6613;&#x8BC6;&#x522B;&#x548C;&#x8DDF;&#x8E2A;&#x3002; &#x8FD9;&#x662F;&#x8BB8;&#x591A;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7EF4;&#x62A4;&#x4E13;&#x7528;&#x4EA4;&#x6613;&#x8D26;&#x6237;&#x4E0E;&#x5176;&#x94B1;&#x5305;&#x8FDB;&#x884C;&#x5206;&#x79BB;&#x7684;&#x4E00;&#x4E2A;&#x539F;&#x56E0;&#x3002;</p>
<p>Alice&#x542C;&#x670B;&#x53CB;&#x4ECB;&#x7ECD;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x6240;&#x4EE5;&#x5979;&#x6709;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x83B7;&#x5F97;&#x5979;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x5979;&#x5982;&#x4F55;&#x4ECE;&#x5979;&#x7684;&#x670B;&#x53CB;Joe &#x8D2D;&#x4E70;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4EE5;Joe &#x5982;&#x4F55;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x5979;&#x7684;&#x94B1;&#x5305;&#x3002;</p>
<h2 id="144&#x67E5;&#x627E;&#x6BD4;&#x7279;&#x5E01;&#x5F53;&#x524D;&#x4EF7;&#x683C;">1.4.4&#x67E5;&#x627E;&#x6BD4;&#x7279;&#x5E01;&#x5F53;&#x524D;&#x4EF7;&#x683C;</h2>
<p>&#x5728;Alice&#x53EF;&#x4EE5;&#x4ECE;Joe &#x8D2D;&#x4E70;&#x6BD4;&#x7279;&#x5E01;&#x4E4B;&#x524D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x540C;&#x610F;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x7F8E;&#x5143;&#x4E4B;&#x95F4;&#x7684;&#x6C47;&#x7387;&#x3002;&#x8FD9;&#x7ED9;&#x65B0;&#x5174;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5E26;&#x6765;&#x4E86;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x7684;&#x95EE;&#x9898;&#xFF1A;&#x201C;&#x8C01;&#x8BBE;&#x5B9A;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x683C;&#xFF1F;&#x201D;&#x7B80;&#x5355;&#x7684;&#x7B54;&#x6848;&#x662F;&#x4EF7;&#x683C;&#x662F;&#x7531;&#x5E02;&#x573A;&#x8BBE;&#x5B9A;&#x7684;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x5927;&#x591A;&#x6570;&#x5176;&#x4ED6;&#x8D27;&#x5E01;&#x4E00;&#x6837;&#xFF0C;&#x6709;&#x6D6E;&#x52A8;&#x6C47;&#x7387;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8D27;&#x5E01;&#x7684;&#x4EF7;&#x503C;&#x90FD;&#x4F1A;&#x6839;&#x636E;&#x4EA4;&#x6613;&#x7684;&#x5404;&#x4E2A;&#x5E02;&#x573A;&#x7684;&#x4F9B;&#x6C42;&#x60C5;&#x51B5;&#x800C;&#x6CE2;&#x52A8;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4EE5;&#x7F8E;&#x5143;&#x8BA1;&#x7B97;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x201C;&#x4EF7;&#x683C;&#x201D;&#x662F;&#x6839;&#x636E;&#x6700;&#x8FD1;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x7F8E;&#x5143;&#x4EA4;&#x6613;&#x5728;&#x6BCF;&#x4E2A;&#x5E02;&#x573A;&#x4E2D;&#x8BA1;&#x7B97;&#x7684;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4EF7;&#x683C;&#x5F80;&#x5F80;&#x6BCF;&#x79D2;&#x949F;&#x51E0;&#x6B21;&#x6CE2;&#x52A8;&#x3002;&#x5B9A;&#x4EF7;&#x670D;&#x52A1;&#x5C06;&#x6C47;&#x603B;&#x6765;&#x81EA;&#x51E0;&#x4E2A;&#x5E02;&#x573A;&#x7684;&#x4EF7;&#x683C;&#xFF0C;&#x5E76;&#x8BA1;&#x7B97;&#x4EE3;&#x8868;&#x8D27;&#x5E01;&#x5BF9;&#x7684;&#x5E7F;&#x6CDB;&#x5E02;&#x573A;&#x6C47;&#x7387;&#xFF08;&#x4F8B;&#x5982;BTC / USD&#xFF09;&#x7684;&#x6570;&#x91CF;&#x52A0;&#x6743;&#x5E73;&#x5747;&#x6570;&#x3002;</p>
<p>&#x6709;&#x6570;&#x767E;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x7F51;&#x7AD9;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5F53;&#x524D;&#x7684;&#x5E02;&#x573A;&#x5229;&#x7387;&#x3002;&#x8FD9;&#x91CC;&#x6709;&#x4E00;&#x4E9B;&#x6700;&#x53D7;&#x6B22;&#x8FCE;&#x7684;&#xFF1A;</p>
<p><a href="http://bitcoinaverage.com/" target="_blank">Bitcoin Average</a>&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x63D0;&#x4F9B;&#x6BCF;&#x79CD;&#x8D27;&#x5E01;&#x7684;&#x4F53;&#x79EF;&#x52A0;&#x6743;&#x5E73;&#x5747;&#x6570;&#x7684;&#x7B80;&#x5355;&#x89C6;&#x56FE;&#x3002;</p>
<p><a href="http://coincap.io/" target="_blank">CoinCap</a>&#x4E00;&#x9879;&#x670D;&#x52A1;&#x5217;&#x51FA;&#x4E86;&#x6570;&#x767E;&#x79CD;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#xFF08;&#x5305;&#x62EC;&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#x7684;&#x5E02;&#x503C;&#x548C;&#x6C47;&#x7387;&#x3002;</p>
<p><a href="http://bit.ly/cmebrr" target="_blank">Chicago Mercantile Exchange Bitcoin Reference Rate</a>&#x53EF;&#x7528;&#x4E8E;&#x673A;&#x6784;&#x548C;&#x5408;&#x540C;&#x53C2;&#x8003;&#x7684;&#x53C2;&#x8003;&#x503C;&#xFF0C;&#x4F5C;&#x4E3A;CME&#x6295;&#x8D44;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x63D0;&#x4F9B;&#x3002;</p>
<p>&#x9664;&#x4E86;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x7F51;&#x7AD9;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x90FD;&#x5C06;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x5176;&#x4ED6;&#x8D27;&#x5E01;&#x4E4B;&#x95F4;&#x7684;&#x5151;&#x6362;&#x6570;&#x91CF;&#x3002; &#x5728;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x7ED9;Alice&#x4E4B;&#x524D;&#xFF0C;Joe&#x5C06;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x94B1;&#x5305;&#x81EA;&#x52A8;&#x8F6C;&#x6362;&#x4EF7;&#x683C;&#x3002;</p>
<h2 id="145&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6BD4;&#x7279;&#x5E01;">1.4.5&#x53D1;&#x9001;&#x548C;&#x63A5;&#x6536;&#x6BD4;&#x7279;&#x5E01;</h2>
<p>Alice&#x51B3;&#x5B9A;&#x5C06;10&#x7F8E;&#x5143;&#x8F6C;&#x6362;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4EE5;&#x514D;&#x5BF9;&#x8FD9;&#x79CD;&#x65B0;&#x6280;&#x672F;&#x5192;&#x592A;&#x591A;&#x7684;&#x9669;&#x3002;&#x5979;&#x7ED9;Joe 10&#x7F8E;&#x5143;&#x73B0;&#x91D1;&#xFF0C;&#x6253;&#x5F00;&#x5979;&#x7684;Mycelium&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x5E76;&#x9009;&#x62E9;Receive&#x3002;&#x8FD9;&#x5C06;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x4E8C;&#x7EF4;&#x7801;&#x4E0E;Alice&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p>Joe&#x7136;&#x540E;&#x5728;&#x4ED6;&#x7684;&#x667A;&#x80FD;&#x624B;&#x673A;&#x94B1;&#x5305;&#x4E0A;&#x9009;&#x62E9;&#x53D1;&#x9001;&#xFF0C;&#x5E76;&#x663E;&#x793A;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x5C4F;&#x5E55;&#xFF1A;</p>
<p>&#x76EE;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4EE5;&#x53CA;&#x6BD4;&#x7279;&#x5E01;&#xFF08;BTC&#xFF09;&#x6216;&#x5176;&#x5F53;&#x5730;&#x8D27;&#x5E01;&#xFF08;USD&#xFF09;&#x53D1;&#x9001;&#x7684;&#x91D1;&#x989D;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x8F93;&#x5165;&#x5B57;&#x6BB5;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E8C;&#x7EF4;&#x7801;&#x7684;&#x5C0F;&#x56FE;&#x6807;&#x3002;&#x8FD9;&#x6837;Joe&#x53EF;&#x4EE5;&#x7528;&#x4ED6;&#x7684;&#x667A;&#x80FD;&#x624B;&#x673A;&#x76F8;&#x673A;&#x6765;&#x626B;&#x63CF;&#x6761;&#x5F62;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x4ED6;&#x5C31;&#x4E0D;&#x5FC5;&#x8F93;&#x5165;Alice&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x8FD9;&#x9700;&#x8981;&#x975E;&#x5E38;&#x957F;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x800C;&#x4E14;&#x5BB9;&#x6613;&#x51FA;&#x9519;&#x3002; Joe&#x70B9;&#x51FB;&#x4E8C;&#x7EF4;&#x7801;&#x56FE;&#x6807;&#x5E76;&#x6FC0;&#x6D3B;&#x667A;&#x80FD;&#x624B;&#x673A;&#x76F8;&#x673A;&#xFF0C;&#x626B;&#x63CF;Alice&#x667A;&#x80FD;&#x624B;&#x673A;&#x4E0A;&#x663E;&#x793A;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#x3002;</p>
<p>Joe&#x73B0;&#x5728;&#x5C06;Alice&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x8BBE;&#x7F6E;&#x4E3A;&#x6536;&#x4EF6;&#x4EBA;&#x3002;Joe&#x8F93;&#x5165;&#x7684;&#x91D1;&#x989D;&#x4E3A;10&#x7F8E;&#x5143;&#xFF0C;&#x4ED6;&#x7684;&#x94B1;&#x5305;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x5728;&#x7EBF;&#x670D;&#x52A1;&#x7684;&#x6700;&#x65B0;&#x6C47;&#x7387;&#x6765;&#x8F6C;&#x6362;&#x5B83;&#x3002;&#x5F53;&#x65F6;&#x7684;&#x6C47;&#x7387;&#x662F;&#x6BCF;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;$100&#x7F8E;&#x5143;&#xFF0C;&#x6240;&#x4EE5;&#x5982;Joe&#x7684;&#x94B1;&#x5305;&#xFF08;&#x89C1;&#x56FE;1-2Airbitz&#x79FB;&#x52A8;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x53D1;&#x9001;&#x5C4F;&#x5E55;&#xFF09;&#x622A;&#x56FE;&#x6240;&#x793A;&#xFF0C;10&#x7F8E;&#x5143;&#x7684;&#x4EF7;&#x503C;&#x662F;0.10&#x6BD4;&#x7279;&#x5E01;&#xFF08;BTC&#xFF09;&#x6216;100&#x6BEB;&#x6BD4;&#x94F6;&#x5E01;&#xFF08;mBTC&#xFF09;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-d429031dbda4b9da.png?imageMogr2/auto-orient/strip|imageView2/2/w/1240" alt=""></p>
<p>&#x56FE;1-2. Airbitz&#x79FB;&#x52A8;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x53D1;&#x9001;&#x5C4F;&#x5E55;</p>
<p>Joe&#x7136;&#x540E;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x4ED6;&#x5DF2;&#x7ECF;&#x8F93;&#x5165;&#x4E86;&#x6B63;&#x786E;&#x7684;&#x91D1;&#x989D;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x8981;&#x6C47;&#x6B3E;&#xFF0C;&#x9519;&#x8BEF;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x3002;&#x7ECF;&#x8FC7;&#x4ED4;&#x7EC6;&#x68C0;&#x67E5;&#x5730;&#x5740;&#x548C;&#x91D1;&#x989D;&#x540E;&#xFF0C;&#x4ED6;&#x6309;&#x53D1;&#x9001;&#x65B9;&#x5F0F;&#x4F20;&#x9001;&#x4EA4;&#x6613;&#x3002; Joe&#x7684;&#x79FB;&#x52A8;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;Joe&#x7684;&#x94B1;&#x5305;&#x5C06;0.10 BTC&#x53D1;&#x9001;&#x7ED9;Alice&#x63D0;&#x4F9B;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x7528;Joe&#x7684;&#x79C1;&#x94A5;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x544A;&#x8BC9;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#xFF0C;Joe&#x5DF2;&#x7ECF;&#x6388;&#x6743;&#x5C06;&#x8FD9;&#x7B14;&#x94B1;&#x8F6C;&#x79FB;&#x7ED9;Alice&#x7684;&#x65B0;&#x5730;&#x5740;&#x3002;&#x5F53;&#x4EA4;&#x6613;&#x901A;&#x8FC7;&#x5BF9;&#x7B49;&#x534F;&#x8BAE;&#x4F20;&#x8F93;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x5FEB;&#x901F;&#x4F20;&#x64AD;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x3002;&#x5728;&#x4E0D;&#x5230;&#x4E00;&#x79D2;&#x949F;&#x5185;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x8FDE;&#x63A5;&#x826F;&#x597D;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x9996;&#x6B21;&#x63A5;&#x6536;&#x5230;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x9996;&#x6B21;&#x770B;&#x5230;Alice&#x7684;&#x5730;&#x5740;&#x3002;</p>
<p>&#x540C;&#x65F6;&#xFF0C;Alice&#x7684;&#x94B1;&#x5305;&#x4E0D;&#x65AD;&#x5730;&#x201C;&#x503E;&#x542C;&#x201D;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x53D1;&#x5E03;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5BFB;&#x627E;&#x4E0E;&#x5979;&#x7684;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x5730;&#x5740;&#x5339;&#x914D;&#x7684;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#x3002;&#x5728;Joe&#x7684;&#x94B1;&#x5305;&#x53D1;&#x9001;&#x4EA4;&#x6613;&#x51E0;&#x79D2;&#x949F;&#x540E;&#xFF0C;Alice&#x7684;&#x94B1;&#x5305;&#x5C06;&#x663E;&#x793A;&#x5B83;&#x6B63;&#x5728;&#x63A5;&#x6536;0.10 BTC&#x3002;</p>
<p>&#x786E;&#x8BA4;&#x8D77;&#x521D;&#xFF0C;Alice&#x7684;&#x5730;&#x5740;&#x5C06;&#x628A;Joe&#x7684;&#x4EA4;&#x6613;&#x663E;&#x793A;&#x4E3A;&#x201C;&#x672A;&#x786E;&#x8BA4;&#x201D;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EA4;&#x6613;&#x5DF2;&#x4F20;&#x64AD;&#x5230;&#x7F51;&#x7EDC;&#xFF0C;&#x4F46;&#x5C1A;&#x672A;&#x8BB0;&#x5F55;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x8D26;&#x7C3F;&#x5373;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x8981;&#x786E;&#x8BA4;&#xFF0C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x5305;&#x542B;&#x5728;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x5E76;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x60C5;&#x51B5;&#x5E73;&#x5747;&#x6BCF;10&#x5206;&#x949F;&#x53D1;&#x751F;&#x4E00;&#x6B21;&#x3002;&#x5728;&#x4F20;&#x7EDF;&#x7684;&#x8D22;&#x52A1;&#x672F;&#x8BED;&#x4E2D;&#xFF0C;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x6E05;&#x7B97;&#x3002;&#x6709;&#x5173;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x4F20;&#x64AD;&#xFF0C;&#x9A8C;&#x8BC1;&#x548C;&#x6E05;&#x7B97;&#xFF08;&#x786E;&#x8BA4;&#xFF09;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x53C2;&#x9605;&#x6316;&#x77FF;&#x7AE0;&#x8282;[mining]&#x3002;</p>
<p>Alice&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x81EA;&#x8C6A;&#x5730;&#x79F0;&#x81EA;&#x5DF1;&#x662F;0.10BTC&#x7684;&#x6240;&#x6709;&#x8005;&#x4E86;&#xFF0C;&#x5979;&#x6709;&#x6743;&#x82B1;&#x8D39;&#x8FD9;&#x4E9B;&#x94B1;&#x4E86;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x9996;&#x5148;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x8FDB;&#x884C;&#x8D2D;&#x4E70;&#xFF0C;&#x5E76;&#x66F4;&#x8BE6;&#x7EC6;&#x5730;&#x7814;&#x7A76;&#x5E95;&#x5C42;&#x4EA4;&#x6613;&#x548C;&#x4F20;&#x64AD;&#x6280;&#x672F;&#x3002;</p>
<p>&#x53C2;&#x8003;&#x5185;&#x5BB9;&#xFF1A;</p>
<ol>
<li>&quot;Bitcoin: A Peer-to-Peer Electronic Cash System,&quot; Satoshi Nakamoto (<a href="https://bitcoin.org/bitcoin.pdf" target="_blank">https://bitcoin.org/bitcoin.pdf</a>).</li>
</ol>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="glossary.html" class="navigation navigation-prev " aria-label="Previous page: 词汇表">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch02.html" class="navigation navigation-next " aria-label="Next page: 第二章比特币原理">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第一章介绍","level":"1.7","depth":1,"next":{"title":"第二章比特币原理","level":"1.8","depth":1,"path":"ch02.md","ref":"ch02.md","articles":[]},"previous":{"title":"词汇表","level":"1.6","depth":1,"path":"glossary.md","ref":"glossary.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch01.md","mtime":"2018-12-14T06:26:05.576Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

