
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第四章密钥和地址 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch05.html" />
    
    
    <link rel="prev" href="ch03.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第四章密钥和地址</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8BF4;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x57FA;&#x4E8E;&#x5BC6;&#x7801;&#x5B66;&#xFF0C;&#x8FD9;&#x4E00;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5B89;&#x5168;&#x4E2D;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x5B66;&#x5206;&#x652F;&#x3002; &#x5BC6;&#x7801;&#x5B66;&#x5728;&#x5E0C;&#x814A;&#x8BED;&#x4E2D;&#x662F;&#x201C;&#x79D8;&#x5BC6;&#x5199;&#x4F5C;&#x201D;&#x7684;&#x610F;&#x601D;&#xFF0C;&#x4F46;&#x5BC6;&#x7801;&#x5B66;&#x8FD9;&#x95E8;&#x79D1;&#x5B66;&#x4E0D;&#x4EC5;&#x53EA;&#x5305;&#x542B;&#x88AB;&#x79F0;&#x4E4B;&#x4E3A;&#x79D8;&#x5BC6;&#x5199;&#x4F5C;&#x7684;&#x52A0;&#x5BC6;&#x5B66;&#x3002; &#x5BC6;&#x7801;&#x5B66;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8BC1;&#x660E;&#x79D8;&#x5BC6;&#x7684;&#x77E5;&#x8BC6;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x6CC4;&#x9732;&#x79D8;&#x5BC6;&#xFF08;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF09;&#xFF0C;&#x6216;&#x8BC1;&#x660E;&#x6570;&#x636E;&#x7684;&#x771F;&#x5B9E;&#x6027;&#xFF08;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#xFF09;&#x3002; &#x8FD9;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x52A0;&#x5BC6;&#x8BC1;&#x660E;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x5173;&#x952E;&#x7684;&#x6570;&#x5B66;&#x5DE5;&#x5177;&#x5E76;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;&#x5177;&#x6709;&#x8BBD;&#x523A;&#x610F;&#x5473;&#x7684;&#x662F;&#xFF0C;&#x52A0;&#x5BC6;&#x4E0D;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x901A;&#x4FE1;&#x548C;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x6CA1;&#x6709;&#x52A0;&#x5BC6;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x5BC6;&#x6765;&#x4FDD;&#x62A4;&#x8D44;&#x91D1;&#x3002; &#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x4E00;&#x4E9B;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7528;&#x6765;&#x63A7;&#x5236;&#x8D44;&#x91D1;&#x7684;&#x6240;&#x6709;&#x6743;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#xFF0C;&#x5305;&#x62EC;&#x5BC6;&#x94A5;&#xFF0C;&#x5730;&#x5740;&#x548C;&#x94B1;&#x5305;&#x3002;</p>
<h2 id="41&#x7B80;&#x4ECB;">4.1&#x7B80;&#x4ECB;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6240;&#x6709;&#x6743;&#x662F;&#x901A;&#x8FC7;&#x6570;&#x5B57;&#x5BC6;&#x94A5;&#x3001;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x548C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x6765;&#x786E;&#x5B9A;&#x7684;&#x3002;&#x6570;&#x5B57;&#x5BC6;&#x94A5;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5B58;&#x50A8;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x7531;&#x7528;&#x6237;&#x751F;&#x6210;&#x4E4B;&#x540E;&#xFF0C;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x94B1;&#x5305;&#x7684;&#x6587;&#x4EF6;&#x6216;&#x7B80;&#x5355;&#x7684;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x5B58;&#x50A8;&#x5728;&#x7528;&#x6237;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x6570;&#x5B57;&#x5BC6;&#x94A5;&#x5B8C;&#x5168;&#x72EC;&#x7ACB;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#xFF0C;&#x53EF;&#x7531;&#x7528;&#x6237;&#x7684;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x751F;&#x6210;&#x5E76;&#x7BA1;&#x7406;&#xFF0C;&#x800C;&#x65E0;&#x9700;&#x53C2;&#x7167;&#x533A;&#x5757;&#x94FE;&#x6216;&#x8BBF;&#x95EE;&#x7F51;&#x7EDC;&#x3002;&#x5BC6;&#x94A5;&#x5B9E;&#x73B0;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BB8;&#x591A;&#x6709;&#x8DA3;&#x7279;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x4FE1;&#x4EFB;&#x548C;&#x63A7;&#x5236;&#x3001;&#x6240; &#x6709;&#x6743;&#x8BA4;&#x8BC1;&#x548C;&#x57FA;&#x4E8E;&#x5BC6;&#x7801;&#x5B66;&#x8BC1;&#x660E;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5927;&#x591A;&#x6570;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x90FD;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x7B7E;&#x540D;&#x624D;&#x4F1A;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x533A;&#x5757;&#x94FE;&#x3002;&#x53EA;&#x6709;&#x6709;&#x6548;&#x7684;&#x5BC6;&#x94A5;&#x624D;&#x80FD;&#x4EA7;&#x751F;&#x6709;&#x6548;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x56E0;&#x6B64;&#x62E5;&#x6709;~&#x5BC6;&#x94A5;&#x526F;&#x672C;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x5BF9;&#x8BE5;&#x5E10;&#x6237;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x63A7;&#x5236;&#x6743;&#x3002;&#x7528;&#x4E8E;&#x652F;&#x51FA;&#x8D44;&#x91D1;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x4E5F;&#x79F0;&#x4E3A;&#x89C1;&#x8BC1;&#xFF08;witness&#xFF09;&#xFF0C;&#x5BC6;&#x7801;&#x672F;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x672F;&#x8BED;&#x3002; &#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x89C1;&#x8BC1;&#x6570;&#x636E;&#x8BC1;&#x660E;&#x4E86;&#x6240;&#x7528;&#x8D44;&#x91D1;&#x7684;&#x771F;&#x6B63;&#x5F52;&#x8C01;&#x6240;&#x6709;&#x3002;</p>
<p>&#x5BC6;&#x94A5;&#x662F;&#x6210;&#x5BF9;&#x51FA;&#x73B0;&#x7684;&#xFF0C;&#x7531;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x548C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x6240;&#x7EC4;&#x6210;&#x3002;&#x516C;&#x94A5;&#x5C31;&#x50CF;&#x94F6;&#x884C;&#x7684;&#x5E10;&#x53F7;&#xFF0C;&#x800C;&#x79C1;&#x94A5;&#x5C31;&#x50CF;&#x63A7;&#x5236;&#x8D26;&#x6237;&#x7684;PIN&#x7801;&#x6216;&#x652F;&#x7968;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x7528;&#x6237;&#x5F88;&#x5C11;&#x4F1A;&#x76F4;&#x63A5;&#x770B;&#x5230;&#x6570;&#x5B57;&#x5BC6;&#x94A5;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5B83;&#x4EEC;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x94B1;&#x5305;&#x6587;&#x4EF6;&#x5185;&#xFF0C;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x8FDB;&#x884C;&#x7BA1;&#x7406;&#x3002;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x652F;&#x4ED8;&#x73AF;&#x8282;&#xFF0C;&#x6536;&#x4EF6;&#x4EBA;&#x7684;&#x516C;&#x94A5;&#x662F;&#x901A;&#x8FC7;&#x5176;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x4EE3;&#x8868;&#x7684;&#xFF0C;&#x79F0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5C31;&#x50CF;&#x652F;&#x7968;&#x4E0A;&#x7684;&#x652F;&#x4ED8;&#x5BF9;&#x8C61;&#x7684;&#x540D;&#x5B57; &#xFF08;&#x5373;&#x201C;&#x6536;&#x6B3E;&#x65B9;&#x201D;&#xFF09;&#x3002;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7531;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x751F;&#x6210;&#x5E76;&#x5BF9;&#x5E94;&#x4E8E;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x90FD;&#x662F;&#x516C;&#x94A5;&#xFF1B; &#x4ED6;&#x4EEC;&#x4E5F;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x5176;&#x4ED6;&#x652F;&#x4ED8;&#x5BF9;&#x8C61;&#xFF0C;&#x8B6C;&#x5982;&#x811A;&#x672C;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x540E;&#x9762;&#x63D0;&#x53CA;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x628A;&#x6536;&#x6B3E;&#x65B9;&#x62BD;&#x8C61;&#x8D77;&#x6765;&#x4E86;&#xFF0C;&#x4F7F;&#x5F97; &#x4EA4;&#x6613;&#x7684;&#x76EE;&#x7684;&#x5730;&#x66F4;&#x7075;&#x6D3B;&#xFF0C;&#x5C31;&#x50CF;&#x652F;&#x7968;&#x4E00;&#x6837;&#xFF1A;&#x8FD9;&#x4E2A;&#x652F;&#x4ED8;&#x5DE5;&#x5177;&#x53EF;&#x652F;&#x4ED8;&#x5230;&#x4E2A;&#x4EBA;&#x8D26;&#x6237;&#x3001;&#x516C;&#x53F8;&#x8D26;&#x6237;&#xFF0C;&#x8FDB;&#x884C;&#x8D26;&#x5355;&#x652F;&#x4ED8;&#x6216;&#x73B0;&#x91D1;&#x652F;&#x4ED8;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x7528;&#x6237;&#x7ECF;&#x5E38;&#x770B;&#x5230;&#x7684;&#x5BC6;&#x94A5;&#x7684;&#x552F;&#x4E00;&#x4EE3;&#x8868;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EA;&#x9700;&#x8981;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x544A;&#x8BC9;&#x5176;&#x4ED6;&#x4EBA;&#x5373;&#x53EF;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5BC6;&#x7801;&#x5B66;&#x5E76;&#x89E3;&#x91CA;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6570;&#x5B66;&#x77E5;&#x8BC6;&#x3002;&#x7136;&#x540E;&#x6211;&#x4EEC;&#x5C06;&#x4E86;&#x89E3;&#x5BC6;&#x94A5;&#x5982;&#x4F55;&#x88AB;&#x4EA7;&#x751F;&#x3001;&#x5B58;&#x50A8;&#x548C;&#x7BA1;&#x7406;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x56DE;&#x987E;&#x7528;&#x4E8E;&#x4EE3;&#x8868;&#x79C1;&#x94A5;&#x548C;&#x516C; &#x94A5;&#x3001;&#x5730;&#x5740;&#x548C;&#x811A;&#x672C;&#x5730;&#x5740;&#x7684;&#x5404;&#x79CD;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8BB2;&#x89E3;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#x7684;&#x9AD8;&#x7EA7;&#x7528;&#x9014;&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x9753;&#x53F7;&#xFF0C;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x4EE5;&#x53CA;&#x811A;&#x672C;&#x5730;&#x5740;&#x548C;&#x7EB8;&#x94B1;&#x5305;&#x3002;</p>
<h3 id="411-&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x548C;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;">4.1.1 &#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x548C;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;</h3>
<p>&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x53D1;&#x660E;&#x4E8E;20&#x4E16;&#x7EAA;70&#x5E74;&#x4EE3;&#x3002;&#x5B83;&#x662F;&#x8BA1;&#x7B97;&#x673A;&#x548C;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7684;&#x6570;&#x5B66;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x81EA;&#x4ECE;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x88AB;&#x53D1;&#x660E;&#x4E4B;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x5408;&#x9002;&#x7684;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x88AB;&#x53D1;&#x73B0;&#xFF0C;&#x8B6C;&#x5982;&#xFF1A;&#x7D20;&#x6570;&#x5E42;&#x548C;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x90FD;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x7684;&#xFF0C; &#x5C31;&#x662F;&#x8BF4;&#x5F88;&#x5BB9;&#x6613;&#x5411;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x8BA1;&#x7B97;&#xFF0C;&#x4F46;&#x4E0D;&#x53EF;&#x4EE5;&#x5411;&#x76F8;&#x53CD;&#x65B9;&#x5411;&#x5012;&#x63A8;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E9B;&#x6570;&#x5B66;&#x51FD;&#x6570;&#x7684;&#x5BC6;&#x7801;&#x5B66;&#xFF0C;&#x4F7F;&#x5F97;&#x751F;&#x6210;&#x6570;&#x5B57;&#x5BC6;&#x94A5;&#x548C;&#x4E0D;&#x53EF;&#x4F2A;&#x9020; &#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x6B63;&#x662F;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#x4F5C;&#x4E3A;&#x5176;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7528;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x5BF9;&#xFF0C;&#x7528;&#x4E8E;&#x63A7;&#x5236;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x83B7;&#x53D6;&#x3002;&#x5BC6;&#x94A5;&#x5BF9;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x548C;&#x7531;&#x5176;&#x884D;&#x751F;&#x51FA;&#x7684;&#x552F; &#x4E00;&#x7684;&#x516C;&#x94A5;&#x3002;&#x516C;&#x94A5;&#x7528;&#x4E8E;&#x63A5;&#x6536;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x800C;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x652F;&#x4ED8;&#x65F6;&#x7684;&#x4EA4;&#x6613;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x4E4B;&#x95F4;&#x7684;&#x6570;&#x5B66;&#x5173;&#x7CFB;&#xFF0C;&#x4F7F;&#x5F97;&#x79C1;&#x94A5;&#x53EF;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x7279;&#x5B9A;&#x6D88;&#x606F;&#x7684;&#x7B7E;&#x540D;&#x3002;&#x6B64;&#x7B7E;&#x540D;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x6CC4;&#x9732;&#x79C1;&#x94A5;&#x7684;&#x540C;&#x65F6;&#x5BF9;&#x516C;&#x94A5;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x652F;&#x4ED8;&#x6BD4;&#x7279;&#x5E01;&#x65F6;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5F53;&#x524D;&#x6240;&#x6709;&#x8005;&#x9700;&#x8981;&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#x63D0;&#x4EA4;&#x5176;&#x516C;&#x94A5;&#x548C;&#x7B7E;&#x540D;&#xFF08;&#x6BCF;&#x6B21;&#x4EA4;&#x6613;&#x7684;&#x7B7E;&#x540D;&#x90FD;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x5747;&#x4ECE;&#x540C;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x751F; &#x6210;&#xFF09;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6240;&#x63D0;&#x4EA4;&#x7684;&#x516C;&#x94A5;&#x548C;&#x7B7E;&#x540D;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x5E76;&#x786E;&#x8BA4;&#x8BE5;&#x4EA4;&#x6613;&#x662F;&#x5426;&#x6709;&#x6548;&#xFF0C;&#x5373;&#x786E;&#x8BA4;&#x652F;&#x4ED8;&#x8005;&#x5728;&#x8BE5;&#x65F6;&#x523B;&#x5BF9;&#x6240;&#x4EA4;&#x6613;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x62E5;&#x6709;&#x6240;&#x6709;&#x6743;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x5927;&#x591A;&#x6570;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5DE5;&#x5177;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x4F1A;&#x5C06;&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#x4EE5;&#x5BC6;&#x94A5;&#x5BF9;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x8D77;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x516C;&#x94A5;&#x53EF;&#x4EE5;&#x7531;&#x79C1;&#x94A5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#xFF0C; &#x6240;&#x4EE5;&#x53EA;&#x5B58;&#x50A8;&#x79C1;&#x94A5;&#x4E5F;&#x662F;&#x53EF;&#x4EE5;&#x7684;&#x3002;</p>
<h3 id="412-&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;">4.1.2 &#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;</h3>
<p>&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E2D;&#x5305;&#x542B;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x5BC6;&#x94A5;&#x5BF9;&#xFF0C;&#x6BCF;&#x4E2A;&#x5BC6;&#x94A5;&#x5BF9;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x548C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x3002;&#x79C1;&#x94A5;&#xFF08;k&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x968F;&#x673A;&#x9009;&#x51FA;&#x7684;&#x3002;&#x6709;&#x4E86;&#x79C1;&#x94A5;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#x8FD9;&#x4E2A;&#x5355;&#x5411;&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#xFF08;K&#xFF09;&#x3002;&#x6709;&#x4E86;&#x516C;&#x94A5;&#xFF08;K&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F; &#x7528;&#x4E00;&#x4E2A;&#x5355;&#x5411;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF08;A&#xFF09;&#x3002;&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECE;&#x751F;&#x6210;&#x79C1;&#x94A5;&#x5F00;&#x59CB;&#xFF0C;&#x8BB2;&#x8FF0;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x8FD0;&#x7B97;&#x5C06;&#x79C1; &#x94A5;&#x751F;&#x6210;&#x516C;&#x94A5;&#xFF0C;&#x5E76;&#x6700;&#x7EC8;&#x7531;&#x516C;&#x94A5;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x79C1;&#x94A5;&#x3001;&#x516C;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5982;&#x4E0B;&#x56FE;&#x6240;&#x793A;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-dd62f685376a57d3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-1&#x79C1;&#x94A5;&#x3001;&#x516C;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;"></p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x4F7F;&#x7528;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#xFF08;&#x516C;&#x94A5;/&#x79C1;&#x94A5;&#xFF09;&#xFF1F;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x4F7F;&#x7528;&#x975E;&#x5BF9;&#x79F0;&#x5BC6;&#x7801;&#x672F;&#xFF1F; &#x5B83;&#x4E0D;&#x662F;&#x7528;&#x4E8E;&#x201C;&#x52A0;&#x5BC6;&#x201D;&#xFF08;make secret&#xFF09;&#x4EA4;&#x6613;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x975E;&#x5BF9;&#x79F0;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x6709;&#x7528;&#x5C5E;&#x6027;&#x662F;&#x751F;&#x6210;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x80FD;&#x529B;&#x3002; &#x53EF;&#x4EE5;&#x5C06;&#x79C1;&#x94A5;&#x5E94;&#x7528;&#x4E8E;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x4EE5;&#x4EA7;&#x751F;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x3002; &#x8BE5;&#x7B7E;&#x540D;&#x53EA;&#x80FD;&#x7531;&#x77E5;&#x6653;&#x79C1;&#x94A5;&#x7684;&#x4EBA;&#x751F;&#x6210;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x8BBF;&#x95EE;&#x516C;&#x94A5;&#x548C;&#x4EA4;&#x6613;&#x6307;&#x7EB9;&#x7684;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x6765;&#x9A8C;&#x8BC1;&#x7B7E;&#x540D;&#x3002; &#x8FD9;&#x79CD;&#x975E;&#x5BF9;&#x79F0;&#x5BC6;&#x7801;&#x5B66;&#x7684;&#x9002;&#x7528;&#x6027;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x6BCF;&#x4E2A;&#x7B7E;&#x540D;&#xFF0C;&#x540C;&#x65F6;&#x786E;&#x4FDD;&#x53EA;&#x6709;&#x79C1;&#x94A5;&#x7684;&#x6240;&#x6709;&#x8005;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;&#x6709;&#x6548;&#x7684;&#x7B7E;&#x540D;&#x3002;</p>
<h3 id="413-&#x79C1;&#x94A5;">4.1.3 &#x79C1;&#x94A5;</h3>
<p>&#x79C1;&#x94A5;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x9009;&#x51FA;&#x7684;&#x6570;&#x5B57;&#x800C;&#x5DF2;&#x3002;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8D44;&#x91D1;&#x7684;&#x63A7;&#x5236;&#x53D6;&#x51B3;&#x4E8E;&#x76F8;&#x5E94;&#x79C1;&#x94A5;&#x7684;&#x6240;&#x6709;&#x6743;&#x548C;&#x63A7;&#x5236;&#x6743;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x79C1;&#x94A5;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x652F;&#x4ED8;&#x6BD4;&#x7279;&#x5E01;&#x6240;&#x5FC5;&#x9700;&#x7684;&#x7B7E;&#x540D;&#x4EE5;&#x8BC1;&#x660E;&#x5BF9;&#x8D44;&#x91D1;&#x7684;&#x6240;&#x6709;&#x6743;&#x3002;&#x79C1;&#x94A5;&#x5FC5;&#x987B;&#x59CB;&#x7EC8;&#x4FDD;&#x6301;&#x673A;&#x5BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x88AB;&#x6CC4;&#x9732;&#x7ED9;&#x7B2C;&#x4E09; &#x65B9;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x8BE5;&#x79C1;&#x94A5;&#x4FDD;&#x62A4;&#x4E4B;&#x4E0B;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4E5F;&#x62F1;&#x624B;&#x76F8;&#x8BA9;&#x4E86;&#x3002;&#x79C1;&#x94A5;&#x8FD8;&#x5FC5;&#x987B;&#x8FDB;&#x884C;&#x5907;&#x4EFD;&#xFF0C;&#x4EE5;&#x9632;&#x610F;&#x5916;&#x4E22;&#x5931;&#xFF0C;&#x56E0;&#x4E3A;&#x79C1;&#x94A5;&#x4E00;&#x65E6;&#x4E22;&#x5931;&#x5C31;&#x96BE;&#x4EE5;&#x590D;&#x539F;&#xFF0C;&#x5176;&#x6240;&#x4FDD;&#x62A4;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4E5F;&#x5C06;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>   &#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x7528;&#x786C;&#x5E01;&#x3001;&#x94C5;&#x7B14;&#x548C;&#x7EB8;&#x6765;&#x968F;&#x673A;&#x751F;&#x6210;&#x4F60;&#x7684;&#x79C1;&#x94A5;&#xFF1A;&#x63B7;&#x786C;&#x5E01;256&#x6B21;&#xFF0C;&#x7528;&#x7EB8;&#x548C;&#x7B14;&#x8BB0;&#x5F55;&#x6B63;&#x53CD;&#x9762;&#x5E76;&#x8F6C;&#x6362;&#x4E3A;0&#x548C;1&#xFF0C;&#x968F;&#x673A;&#x5F97;&#x5230;&#x7684;256&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x53EF;&#x4F5C;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x8BE5;&#x79C1;&#x94A5;&#x53EF;&#x8FDB;&#x4E00;&#x6B65;&#x751F;&#x6210;&#x516C;&#x94A5;&#x3002;</p>
<p><strong><em>&#x4ECE;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x79C1;&#x94A5;</em></strong>
&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x7684;&#x7B2C;&#x4E00;&#x6B65;&#x4E5F;&#x662F;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x6B65;&#xFF0C;&#x662F;&#x8981;&#x627E;&#x5230;&#x8DB3;&#x591F;&#x5B89;&#x5168;&#x7684;&#x71B5;&#x6E90;&#xFF0C;&#x5373;&#x968F;&#x673A;&#x6027;&#x6765;&#x6E90;&#x3002;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#x5728;&#x672C;&#x8D28;&#x4E0A;&#x4E0E;&#x201C;&#x5728;1 &#x5230;2^256&#x4E4B;&#x95F4;&#x9009;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x201D;&#x65E0;&#x5F02;&#x3002;&#x53EA;&#x8981;&#x9009;&#x53D6;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E0D;&#x53EF;&#x9884;&#x6D4B;&#x6216;&#x4E0D;&#x53EF;&#x91CD;&#x590D;&#x7684;&#xFF0C;&#x90A3;&#x4E48;&#x9009;&#x53D6;&#x6570;&#x5B57;&#x7684;&#x5177;&#x4F53;&#x65B9;&#x6CD5;&#x5E76;&#x4E0D;&#x91CD;&#x8981;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x8F6F;&#x4EF6;&#x4F7F;&#x7528;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E95;&#x5C42;&#x7684;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x6765;&#x4EA7;&#x751F;256&#x4F4D;&#x7684;&#x71B5;&#xFF08;&#x968F;&#x673A;&#x6027;&#xFF09;&#x3002;&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x7531;&#x4EBA;&#x5DE5;&#x7684;&#x968F;&#x673A;&#x6E90;&#x8FDB;&#x884C;&#x521D;&#x59CB;&#x5316;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x4E0D;&#x505C;&#x6643;&#x52A8;&#x9F20;&#x6807;&#x51E0;&#x79D2;&#x949F;&#x3002;</p>
<p>&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x662F;1&#x548C;n-1&#x4E4B;&#x95F4;&#x7684;&#x4EFB;&#x4F55;&#x6570;&#x5B57;&#xFF0C;&#x5176;&#x4E2D;n&#x662F;&#x4E00;&#x4E2A;&#x5E38;&#x6570;&#xFF08;n=1.158 * 10^77&#xFF0C;&#x7565;&#x5C0F;&#x4E8E;2^256&#xFF09;&#xFF0C;&#x5E76;&#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x9636;&#xFF08;&#x89C1;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5BC6;&#x7801;&#x5B66;&#x89E3;&#x91CA;&#xFF09;&#x3002;&#x8981;&#x751F;&#x6210;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x6211;&#x4EEC;&#x968F;&#x673A;&#x9009;&#x62E9;&#x4E00;&#x4E2A;256&#x4F4D;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x5B83;&#x662F;&#x5426;&#x5C0F;&#x4E8E;n-1&#x3002;&#x4ECE;&#x7F16;&#x7A0B;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x901A;&#x8FC7;&#x5728;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#x5B66;&#x5B89;&#x5168;&#x7684;&#x968F;&#x673A;&#x6E90;&#x4E2D;&#x53D6;&#x51FA;&#x4E00;&#x957F;&#x4E32;&#x968F;&#x673A;&#x5B57;&#x8282;&#xFF0C;&#x5BF9;&#x5176;&#x4F7F;&#x7528;SHA256&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x5730;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;256&#x4F4D;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5982;&#x679C;&#x8FD0;&#x7B97;&#x7ED3;&#x679C;&#x5C0F;&#x4E8E;n-1&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x6211;&#x4EEC;&#x5C31;&#x7528;&#x53E6;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x518D;&#x91CD;&#x590D;&#x4E00;&#x6B21;&#x3002;</p>
<p><strong>&#x8B66;&#x544A;</strong>  &#x4E0D;&#x8981;&#x81EA;&#x5DF1;&#x5199;&#x4EE3;&#x7801;&#x6216;&#x4F7F;&#x7528;&#x4F60;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x63D0;&#x4F9B;&#x7684;&#x7B80;&#x6613;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x6765;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x6570;&#x3002;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x5B66;&#x5B89;&#x5168;&#x7684;&#x4F2A;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#xFF08;CSPRNG&#xFF09;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6765;&#x81EA;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x71B5;&#x503C;&#x7684;&#x6E90;&#x7684;&#x79CD;&#x5B50;&#x3002;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x6570;&#x53D1;&#x751F;&#x5668;&#x7684;&#x7A0B;&#x5E8F;&#x5E93;&#x65F6;&#xFF0C;&#x9700;&#x4ED4;&#x7EC6;&#x7814;&#x8BFB;&#x5176;&#x6587;&#x6863;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5B83;&#x662F;&#x52A0;&#x5BC6;&#x5B89;&#x5168;&#x7684;&#x3002;&#x6B63;&#x786E;&#x5B9E;&#x65BD;CSPRNG&#x662F;&#x5BC6;&#x94A5;&#x5B89;&#x5168;&#x6027;&#x7684;&#x5173;&#x952E;&#x6240;&#x5728;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x662F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;&#xFF08;k&#xFF09;&#xFF0C;&#x4EE5;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x8868;&#x793A;&#xFF08;256&#x4F4D;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#xFF0C;&#x4EE5;64&#x4F4D;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x663E;&#x793A;&#xFF0C;&#x6BCF;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5360;4&#x4F4D;&#xFF09;&#xFF1A;</p>
<p>1E99423A4ED27608A15A2616A2B0E9E52CED330AC530EDCC32C8FFC6A526AEDD</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#x7A7A;&#x95F4;&#x7684;&#x5927;&#x5C0F;&#x662F;2^256&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x6570;&#x5B57;&#x3002;&#x7528;&#x5341;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x7684;&#x8BDD;&#xFF0C;&#x5927;&#x7EA6;&#x662F;10^77&#xFF0C;&#x800C;&#x53EF;&#x89C1;&#x5B87;&#x5B99;&#x88AB;&#x4F30;&#x8BA1;&#x53EA;&#x542B;&#x6709;10^80&#x4E2A;&#x539F;&#x5B50;&#x3002;</p>
<p>&#x8981;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x53EF;&#x4F7F;&#x7528; getnewaddress &#x547D;&#x4EE4;&#x3002;&#x51FA;&#x4E8E;&#x5B89;&#x5168;&#x8003;&#x8651;&#xFF0C;&#x547D;&#x4EE4;&#x8FD0;&#x884C;&#x540E;&#x53EA; &#x663E;&#x793A;&#x751F;&#x6210;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x4E0D;&#x663E;&#x793A;&#x79C1;&#x94A5;&#x3002;&#x5982;&#x679C;&#x8981;bitcoind&#x663E;&#x793A;&#x79C1;&#x94A5;&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; dumpprivkey &#x547D;&#x4EE4;&#x3002; dumpprivkey &#x547D;&#x4EE4;&#x4F1A;&#x628A;&#x79C1;&#x94A5;&#x4EE5; Base58&#x6821;&#x9A8C;&#x548C;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x663E;&#x793A;&#xFF0C;&#x8FD9;&#x79CD;&#x79C1;&#x94A5;&#x683C;&#x5F0F;&#x88AB;&#x79F0;&#x4E3A;&#x94B1;&#x5305;&#x5BFC;&#x5165;&#x683C;&#x5F0F;&#xFF08;WIF&#xFF0C;Wallet Import Format&#xFF09;&#xFF0C;&#x5728;&#x201C;&#x79C1;&#x94A5;&#x7684;&#x683C;&#x5F0F;&#x201D;&#x4E00;&#x8282;&#x6709;&#x8BE6;&#x7EC6;&#x8BB2;&#x89E3;&#x3002;&#x4E0B;&#x9762;&#x7ED9;&#x51FA;&#x4E86;&#x4F7F;&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x547D;&#x4EE4;&#x751F;&#x6210;&#x548C;&#x663E;&#x793A;&#x79C1;&#x94A5;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>$ bitcoin-cli getnewaddress
1J7mdg5rbQyUHENYdx39WVWK7fsLpEoXZy
$ bitcoin-cli dumpprivkey 1J7mdg5rbQyUHENYdx39WVWK7fsLpEoXZy
KxFC1jmwwCoACiCAWZ3eXa96mBM6tb3TYzGmf6YwgdGWZgawvrtJ</p>
<p>dumpprivkey &#x547D;&#x4EE4;&#x6253;&#x5F00;&#x94B1;&#x5305;&#x63D0;&#x53D6;&#x7531; getnewaddress &#x547D;&#x4EE4;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x9664;&#x975E;&#x5BC6;&#x94A5;&#x5BF9;&#x90FD;&#x5B58;&#x50A8;&#x5728;&#x94B1;&#x5305;&#x91CC;&#xFF0C;&#x5426;&#x5219;bitcoind&#x7684;&#x5E76;&#x4E0D;&#x80FD;&#x4ECE;&#x516C;&#x94A5;&#x5F97;&#x77E5;&#x79C1;&#x94A5;&#x3002; dumpprivkey &#x547D;&#x4EE4;&#x624D;&#x6709;&#x6548;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  dumpprivkey&#x547D;&#x4EE4;&#x65E0;&#x6CD5;&#x4ECE;&#x516C;&#x94A5;&#x5F97;&#x5230;&#x5BF9;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x547D;&#x4EE4;&#x53EA;&#x662F;&#x663E;&#x793A;&#x94B1;&#x5305;&#x4E2D;&#x5DF2;&#x6709;&#x4E5F;&#x5C31;&#x662F;&#x7531;getnewaddress&#x547D;&#x4EE4;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Bitcoin Explorer&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x9644;&#x5F55;&#x4E2D;&#x7684;[appdx_bx]&#xFF09;&#x4F7F;&#x7528;&#x547D;&#x4EE4;seed&#xFF0C;ec-new&#x548C;ec-to-wif&#x751F;&#x6210;&#x548C;&#x663E;&#x793A;&#x79C1;&#x94A5;&#xFF1A;</p>
<p>$ bx seed | bx ec-new | bx ec-to-wif
5J3mBbAH58CpQ3Y5RNJpUKPE62SQ5tfcvU2JpbnkeyhfsYB1Jcn</p>
<h3 id="414-&#x516C;&#x94A5;">4.1.4 &#x516C;&#x94A5;</h3>
<p>&#x901A;&#x8FC7;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#x53EF;&#x4EE5;&#x4ECE;&#x79C1;&#x94A5;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x516C;&#x94A5;&#xFF0C;&#x8FD9;&#x662F;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;K = k * G &#x3002;&#x5176;&#x4E2D;k&#x662F;&#x79C1;&#x94A5;&#xFF0C;G&#x662F;&#x88AB;&#x79F0;&#x4E3A;&#x751F;&#x6210;&#x70B9;&#x7684;&#x5E38;&#x6570;&#x70B9;&#xFF0C;&#x800C;K&#x662F;&#x6240;&#x5F97;&#x516C;&#x94A5;&#x3002;&#x5176;&#x53CD;&#x5411;&#x8FD0;&#x7B97;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x5BFB;&#x627E;&#x79BB;&#x6563;&#x5BF9;&#x6570;&#x201D;&#x2014;&#x2014;&#x5DF2;&#x77E5;&#x516C;&#x94A5;K&#x6765;&#x6C42;&#x51FA;&#x79C1;&#x94A5;k&#x2014;&#x2014;&#x662F;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x5C31;&#x50CF;&#x53BB;&#x8BD5;&#x9A8C;&#x6240;&#x6709;&#x53EF;&#x80FD;&#x7684;k&#x503C;&#xFF0C;&#x5373;&#x66B4;&#x529B;&#x641C;&#x7D22;&#x3002;&#x5728;&#x6F14;&#x793A;&#x5982;&#x4F55;&#x4ECE;&#x79C1;&#x94A5;&#x751F;&#x6210;&#x516C;&#x94A5;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x7A0D;&#x5FAE;&#x8BE6;&#x7EC6;&#x5B66;&#x4E60;&#x4E0B;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5BC6;&#x7801;&#x5B66;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#x662F;&#x5BC6;&#x7801;&#x5B66;&#x5BB6;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;&#x9677;&#x9631;&#x95E8;&#x201D;&#x529F;&#x80FD;&#x7684;&#x4E00;&#x79CD;&#x51FD;&#x6570;&#xFF1A;&#x5728;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#xFF08;&#x4E58;&#x6CD5;&#xFF09;&#x5F88;&#x5BB9;&#x6613;&#x505A;&#xFF0C;&#x800C;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x76F8;&#x53CD;&#x7684;&#x65B9;&#x5411;&#xFF08;&#x9664;&#x6CD5;&#xFF09;&#x505A;&#x3002; &#x79C1;&#x94A5;&#x7684;&#x6240;&#x6709;&#x8005;&#x53EF;&#x4EE5;&#x5BB9;&#x6613;&#x5730;&#x521B;&#x5EFA;&#x516C;&#x94A5;&#xFF0C;&#x7136;&#x540E;&#x4E0E;&#x4E16;&#x754C;&#x5171;&#x4EAB;&#xFF0C;&#x77E5;&#x9053;&#x6CA1;&#x6709;&#x4EBA;&#x53EF;&#x4EE5;&#x4ECE;&#x516C;&#x94A5;&#x4E2D;&#x53CD;&#x8F6C;&#x51FD;&#x6570;&#x5E76;&#x8BA1;&#x7B97;&#x51FA;&#x79C1;&#x94A5;&#x3002; &#x8FD9;&#x4E2A;&#x6570;&#x5B66;&#x6280;&#x5DE7;&#x6210;&#x4E3A;&#x8BC1;&#x660E;&#x6BD4;&#x7279;&#x5E01;&#x8D44;&#x91D1;&#x6240;&#x6709;&#x6743;&#x7684;&#x4E0D;&#x53EF;&#x4F2A;&#x9020;&#x548C;&#x5B89;&#x5168;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<h3 id="415-&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5BC6;&#x7801;&#x5B66;&#xFF08;elliptic-curve-cryptography&#xFF09;&#x89E3;&#x91CA;">4.1.5 &#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5BC6;&#x7801;&#x5B66;&#xFF08;Elliptic Curve Cryptography&#xFF09;&#x89E3;&#x91CA;</h3>
<p>&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x52A0;&#x5BC6;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x79BB;&#x6563;&#x5BF9;&#x6570;&#x95EE;&#x9898;&#x7684;&#x975E;&#x5BF9;&#x79F0;&#x52A0;&#x5BC6;&#x6CD5;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5BF9;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;&#x8FDB;&#x884C;&#x52A0;&#x6CD5;&#x6216;&#x4E58;&#x6CD5;&#x8FD0;&#x7B97;&#x6765;&#x8868;&#x8FBE;&#x3002;
&#x4E0B;&#x56FE;&#x662F;&#x4E00;&#x4E2A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x793A;&#x4F8B;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x6240;&#x7528;&#x7684;&#x66F2;&#x7EBF;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-38f55b8ef0bdae9f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-2&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x793A;&#x4F8B;">
&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x4E86;secp256k1&#x6807;&#x51C6;&#x6240;&#x5B9A;&#x4E49;&#x7684;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x548C;&#x4E00;&#x7CFB;&#x5217;&#x6570;&#x5B66;&#x5E38;&#x6570;&#x3002;&#x8BE5;&#x6807;&#x51C6;&#x7531;&#x7F8E;&#x56FD;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x4E0E;&#x6280;&#x672F;&#x7814;&#x7A76;&#x9662; &#xFF08;NIST&#xFF09;&#x8BBE;&#x7ACB;&#x3002;secp256k1&#x66F2;&#x7EBF;&#x7531;&#x4E0B;&#x8FF0;&#x51FD;&#x6570;&#x5B9A;&#x4E49;&#xFF0C;&#x8BE5;&#x51FD;&#x6570;&#x53EF;&#x4EA7;&#x751F;&#x4E00;&#x6761;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-599a94d07fe149c2.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x4EA7;&#x751F;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x51FD;&#x6570;"></p>
<p>&#x4E0A;&#x8FF0;mod p&#xFF08;&#x7D20;&#x6570;p&#x53D6;&#x6A21;&#xFF09;&#x8868;&#x660E;&#x8BE5;&#x66F2;&#x7EBF;&#x662F;&#x5728;&#x7D20;&#x6570;&#x9636;p&#x7684;&#x6709;&#x9650;&#x57DF;&#x5185;&#xFF0C;&#x4E5F;&#x5199;&#x4F5C;Fp&#xFF0C;&#x5176;&#x4E2D;p = 2^256 &#x2013; 2^32 &#x2013; 2^9 &#x2013; 2^8 &#x2013; 2^7 &#x2013; 2^6 &#x2013; 2^4 &#x2013; 1&#xFF0C; &#x8FD9;&#x662F;&#x4E2A;&#x975E;&#x5E38;&#x5927;&#x7684;&#x7D20;&#x6570;&#x3002; 
&#x56E0;&#x4E3A;&#x8FD9;&#x6761;&#x66F2;&#x7EBF;&#x88AB;&#x5B9A;&#x4E49;&#x5728;&#x4E00;&#x4E2A;&#x7D20;&#x6570;&#x9636;&#x7684;&#x6709;&#x9650;&#x57DF;&#x5185;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5B9A;&#x4E49;&#x5728;&#x5B9E;&#x6570;&#x8303;&#x56F4;&#xFF0C;&#x5B83;&#x7684;&#x51FD;&#x6570;&#x56FE;&#x50CF;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x5206;&#x6563;&#x5728;&#x4E24;&#x4E2A;&#x7EF4;&#x5EA6;&#x4E0A;&#x7684;&#x6563;&#x843D;&#x7684;&#x70B9;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x53EF;&#x89C6;&#x5316;&#x3002;&#x4E0D;&#x8FC7;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x5B66;&#x539F;&#x7406;&#x4E0E;&#x5B9E;&#x6570;&#x8303;&#x56F4;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x76F8;&#x4F3C;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x5C0F;&#x4E86;&#x5F88;&#x591A;&#x7684;&#x7D20;&#x6570;&#x9636;17&#x7684;&#x6709;&#x9650;&#x57DF;&#x5185;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#xFF0C;&#x5176;&#x5F62;&#x5F0F;&#x4E3A;&#x7F51;&#x683C;&#x4E0A;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6563;&#x70B9;&#x3002;&#x800C;secp256k1&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x53EF;&#x4EE5;&#x88AB;&#x60F3;&#x8C61;&#x6210;&#x4E00;&#x4E2A;&#x6781;&#x5927;&#x7684;&#x7F51;&#x683C;&#x4E0A;&#x4E00;&#x7CFB;&#x5217;&#x66F4;&#x4E3A;&#x590D;&#x6742;&#x7684;&#x6563;&#x70B9;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-8557f7751b57d1e4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-3&#x56FE;&#x4E3A;&#xFF1A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5BC6;&#x7801;&#x5B66;F(p)&#x4E0A;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#xFF0C;&#x5176;&#x4E2D;p = 17"></p>
<p>&#x4E0B;&#x9762;&#x4E3E;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x662F; secp256k1 &#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;P&#xFF0C;&#x5176;&#x5750;&#x6807;&#x4E3A;(x&#xFF0C;y)&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Python&#x5BF9;&#x5176;&#x68C0;&#x9A8C;&#xFF1A;</p>
<p><code>P = (55066263022277343669578718895168534326250603453777594175500187360389116729240, 32670510020758816978083085130507043184471273380659243275938904335757337482424)</code></p>
<p>&#x5728;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x6570;&#x5B66;&#x539F;&#x7406;&#x4E2D;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x70B9;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x65E0;&#x7A77;&#x8FDC;&#x70B9;&#x201D;&#xFF0C;&#x8FD9;&#x5927;&#x81F4;&#x5BF9;&#x5E94;&#x4E8E;0&#x5728;&#x52A0;&#x6CD5;&#x4E2D;&#x7684;&#x4F5C;&#x7528;&#x3002;&#x8BA1;&#x7B97;&#x673A;&#x4E2D;&#xFF0C;&#x5B83;&#x6709;&#x65F6;&#x8868;&#x793A;&#x4E3A;X = Y = 0&#xFF08;&#x867D;&#x7136;&#x8FD9;&#x4E0D;&#x6EE1;&#x8DB3;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x65B9;&#x7A0B;&#xFF0C;&#x4F46;&#x53EF;&#x4F5C;&#x4E3A;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x8FDB;&#x884C;&#x68C0;&#x9A8C;&#xFF09;&#x3002;</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A; + &#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x52A0;&#x6CD5;&#x201D;&#xFF0C;&#x5C31;&#x50CF;&#x5C0F;&#x5B66;&#x6570;&#x5B66;&#x4E2D;&#x7684;&#x5B9E;&#x6570;&#x76F8;&#x52A0;&#x3002;&#x7ED9;&#x5B9A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x4E24;&#x4E2A;&#x70B9;P1&#x548C;P2&#xFF0C;&#x5219;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x5FC5;&#x5B9A;&#x6709;&#x7B2C;&#x4E09;&#x70B9; P3 = P1 + P2&#x3002; 
&#x51E0;&#x4F55;&#x56FE;&#x5F62;&#x4E2D;&#xFF0C;&#x8BE5;&#x7B2C;&#x4E09;&#x70B9;P3&#x53EF;&#x4EE5;&#x5728;P1&#x548C;P2&#x4E4B;&#x95F4;&#x753B;&#x4E00;&#x6761;&#x7EBF;&#x6765;&#x786E;&#x5B9A;&#x3002;&#x8FD9;&#x6761;&#x76F4;&#x7EBF;&#x6070;&#x597D;&#x4E0E;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x76F8;&#x4EA4;&#x4E8E;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x5730;&#x65B9;&#x3002;&#x6B64;&#x70B9;&#x8BB0;&#x4E3A; P3&apos;= (x&#xFF0C;y)&#x3002;&#x7136;&#x540E;&#xFF0C;&#x5728;x&#x8F74;&#x505A;&#x7FFB;&#x6298;&#x83B7;&#x5F97; P3=(x&#xFF0C;-y)&#x3002; </p>
<p>&#x4E0B;&#x9762;&#x662F;&#x51E0;&#x4E2A;&#x53EF;&#x4EE5;&#x89E3;&#x91CA;&#x201C;&#x7A77;&#x8FDC;&#x70B9;&#x201D;&#x4E4B;&#x5B58;&#x5728;&#x9700;&#x8981;&#x7684;&#x7279;&#x6B8A;&#x60C5;&#x51B5;&#x3002; </p>
<p>&#x82E5; P1&#x548C; P2&#x662F;&#x540C;<strong>&#x4E00;</strong>&#x70B9;&#xFF0C;P1&#x548C;P2&#x95F4;&#x7684;&#x8FDE;&#x7EBF;&#x5219;&#x4E3A;&#x70B9;P1 &#x7684;&#x5207;&#x7EBF;&#x3002;&#x66F2;&#x7EBF;&#x4E0A;&#x6709;&#x4E14;&#x53EA;&#x6709;<strong>&#x4E00;</strong>&#x4E2A;&#x65B0;&#x7684;&#x70B9;&#x4E0E;&#x8BE5;&#x5207;&#x7EBF;&#x76F8;&#x4EA4;&#x3002;&#x8BE5;&#x5207;&#x7EBF;&#x7684;&#x659C;&#x7387;&#x53EF;&#x7528;&#x5FAE;&#x79EF;&#x5206;&#x6C42;&#x5F97;&#x3002;&#x5373;&#x4F7F;&#x9650;&#x5236;&#x66F2;&#x7EBF;&#x70B9;&#x4E3A;&#x4E24;&#x4E2A;&#x6574;&#x6570;&#x5750;&#x6807;&#x4E5F;&#x53EF;&#x6C42;&#x5F97;&#x659C;&#x7387;&#xFF01; </p>
<p>&#x5728;&#x67D0;&#x4E9B;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;&#x5373;&#xFF0C;&#x5982;&#x679C;P1&#x548C;P2&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;x&#x503C;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;y&#x503C;&#xFF09;&#xFF0C;&#x5219;&#x5207;&#x7EBF;&#x4F1A;&#x5B8C;&#x5168;&#x5782;&#x76F4;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;P3 = &#x201C;&#x65E0;&#x7A77;&#x8FDC;&#x70B9;&#x201D;&#x3002;</p>
<p>&#x82E5;P1&#x5C31;&#x662F;&#x201C;&#x65E0;&#x7A77;&#x8FDC;&#x70B9;&#x201D;&#xFF0C;&#x90A3;&#x4E48;&#x5176;&#x548C; P1 + P2= P2&#x3002;&#x7C7B;&#x4F3C;&#x5730;&#xFF0C;&#x5F53;P2&#x662F;&#x65E0;&#x7A77;&#x8FDC;&#x70B9;&#xFF0C;&#x5219;P1+ P2 = P1&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x628A;&#x65E0;&#x7A77;&#x8FDC;&#x70B9;&#x7C7B;&#x4F3C;&#x4E8E;0&#x7684;&#x4F5C;&#x7528;&#x3002; &#x4E8B;&#x5B9E;&#x8BC1;&#x660E;&#xFF0C;&#x5728;&#x8FD9;&#x91CC; + &#x8FD0;&#x7B97;&#x7B26;&#x9075;&#x5B88;&#x7ED3;&#x5408;&#x5F8B;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;(A+B)+C = A+(B+C)&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8BF4;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x4E0D;&#x52A0;&#x62EC;&#x53F7;&#x4E66;&#x5199; A + B + C&#xFF0C;&#x800C;&#x4E0D;&#x81F3;&#x4E8E;&#x6DF7;&#x6DC6;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B9A;&#x4E49;&#x4E86;&#x692D;&#x5706;&#x52A0;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5BF9;&#x4E58;&#x6CD5;&#x7528;&#x62D3;&#x5C55;&#x52A0;&#x6CD5;&#x7684;&#x6807;&#x51C6;&#x65B9;&#x6CD5;&#x8FDB;&#x884C;&#x5B9A;&#x4E49;&#x3002;&#x7ED9;&#x5B9A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;P&#xFF0C;&#x5982;&#x679C;k&#x662F;&#x6574;&#x6570;&#xFF0C;&#x5219; kP = P + P + P + &#x2026;+ P&#xFF08;k&#x6B21;&#xFF09;&#x3002;&#x6CE8;&#x610F;&#xFF0C;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;k&#x6709;&#x65F6;&#x88AB;&#x6DF7;&#x6DC6;&#x800C;&#x79F0;&#x4E3A;&#x201C;&#x6307;&#x6570;&#x201D;&#x3002;</p>
<h3 id="416-&#x751F;&#x6210;&#x516C;&#x94A5;">4.1.6 &#x751F;&#x6210;&#x516C;&#x94A5;</h3>
<p>&#x4EE5;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;k&#x4E3A;&#x8D77;&#x70B9;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5176;&#x4E0E;&#x66F2;&#x7EBF;&#x4E0A;&#x9884;&#x5B9A;&#x7684;&#x751F;&#x6210;&#x70B9;G&#x76F8;&#x4E58;&#x4EE5;&#x83B7;&#x5F97;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x53E6;&#x4E00;&#x70B9;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x76F8;&#x5E94;&#x7684;&#x516C;&#x94A5; K&#x3002;&#x751F;&#x6210;&#x70B9;&#x662F;secp256k1&#x6807;&#x51C6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#x7684;&#x751F;&#x6210;&#x70B9;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF1A;</p>
<p> {K = k * G} </p>
<p>&#x5176;&#x4E2D;k&#x662F;&#x79C1;&#x94A5;&#xFF0C;G&#x662F;&#x751F;&#x6210;&#x70B9;&#xFF0C;&#x5728;&#x8BE5;&#x66F2;&#x7EBF;&#x4E0A;&#x6240;&#x5F97;&#x7684;&#x70B9;K&#x662F;&#x516C;&#x94A5;&#x3002;&#x56E0;&#x4E3A;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x7684;&#x751F;&#x6210;&#x70B9;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;k&#x4E58;&#x4EE5;G&#x5C06; &#x5F97;&#x5230;&#x76F8;&#x540C;&#x7684;&#x516C;&#x94A5;K&#x3002;k&#x548C;K&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x662F;&#x56FA;&#x5B9A;&#x7684;&#xFF0C;&#x4F46;&#x53EA;&#x80FD;&#x5355;&#x5411;&#x8FD0;&#x7B97;&#xFF0C;&#x5373;&#x4ECE;k&#x5F97;&#x5230;K&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF08;K&#x7684;&#x884D;&#x751F;&#xFF09; &#x4E0E;&#x4EFB;&#x4F55;&#x4EBA;&#x5171;&#x4EAB;&#x800C;&#x4E0D;&#x4F1A;&#x6CC4;&#x9732;&#x79C1;&#x94A5;&#xFF08;k&#xFF09;&#x7684;&#x539F;&#x56E0;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x56E0;&#x4E3A;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x5B66;&#x8FD0;&#x7B97;&#x662F;&#x5355;&#x5411;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x8F6C;&#x6362;&#x4E3A;&#x516C;&#x94A5;&#xFF0C;&#x4F46;&#x516C;&#x94A5;&#x4E0D;&#x80FD;&#x8F6C;&#x6362;&#x56DE;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x4E3A;&#x5B9E;&#x73B0;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E58;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC; &#x4EE5;&#x4E4B;&#x524D;&#x4EA7;&#x751F;&#x7684;&#x79C1;&#x94A5;k&#x548C;&#x4E0E;&#x751F;&#x6210;&#x70B9;G&#x76F8;&#x4E58;&#x5F97;&#x5230;&#x516C;&#x94A5;K&#xFF1A;</p>
<p>K = 1E99423A4ED27608A15A2616A2B0E9E52CED330AC530EDCC32C8FFC6A526AEDD * G</p>
<p>&#x516C;&#x94A5;K &#x88AB;&#x5B9A;&#x4E49;&#x4E3A;&#x4E00;&#x4E2A;&#x70B9; K = (x, y)&#xFF1A;</p>
<p> K = (x, y) </p>
<p>&#x5176;&#x4E2D;&#xFF0C;</p>
<p>x = F028892BAD7ED57D2FB57BF33081D5CFCF6F9ED3D3D7F159C2E2FFF579DC341A 
y = 07CF33DA18BD734C600B96A72BBC4749D5141C90EC8AC328AE52DDFE2E505BDB</p>
<p>&#x4E3A;&#x4E86;&#x5C55;&#x793A;&#x6574;&#x6570;&#x70B9;&#x7684;&#x4E58;&#x6CD5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;&#x8F83;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x5B9E;&#x6570;&#x8303;&#x56F4;&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x3002;&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;&#x5176;&#x4E2D;&#x7684;&#x6570;&#x5B66;&#x539F;&#x7406;&#x662F;&#x76F8;&#x540C;&#x7684;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x6807;&#x662F;&#x627E;&#x5230;&#x751F;&#x6210;&#x70B9;G&#x7684;&#x500D;&#x6570;kG&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x5C06;G&#x76F8;&#x52A0;k&#x6B21;&#x3002;&#x5728;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E2D;&#xFF0C;&#x70B9;&#x7684;&#x76F8;&#x52A0;&#x7B49;&#x540C;&#x4E8E;&#x4ECE;&#x8BE5;&#x70B9;&#x753B;&#x5207;&#x7EBF;&#x627E;&#x5230;&#x4E0E;&#x66F2;&#x7EBF;&#x76F8;&#x4EA4;&#x7684;&#x53E6;&#x4E00; &#x70B9;&#xFF0C;&#x7136;&#x540E;&#x7FFB;&#x6298;&#x5230;x&#x8F74;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x663E;&#x793A;&#x4E86;&#x5728;&#x66F2;&#x7EBF;&#x4E0A;&#x5F97;&#x5230; G&#x3001;2G&#x3001;4G &#x7684;&#x51E0;&#x4F55;&#x64CD;&#x4F5C;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-52ef6b8a628405a8.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-4&#x66F2;&#x7EBF;&#x4E0A; G&#x3001;2G&#x3001;4G &#x7684;&#x51E0;&#x4F55;&#x64CD;&#x4F5C;"></p>
<p><strong>&#x63D0;&#x793A;</strong>&#x5927;&#x591A;&#x6570;&#x6BD4;&#x7279;&#x5E01;&#x7A0B;&#x5E8F;&#x4F7F;&#x7528;OpenSSL&#x52A0;&#x5BC6;&#x5E93;&#x8FDB;&#x884C;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x8BA1;&#x7B97;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x8C03;&#x7528;EC_POINT_mul() &#x51FD;&#x6570;&#xFF0C;&#x53EF;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x516C;&#x94A5;&#x3002;</p>
<h2 id="42-&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;">4.2 &#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x6BCD;&#x7EC4;&#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF0C;&#x53EF;&#x4EE5;&#x4E0E;&#x4EFB;&#x4F55;&#x60F3;&#x7ED9;&#x4F60;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EBA;&#x5206;&#x4EAB;&#x3002;&#x7531;&#x516C;&#x94A5;&#xFF08;&#x4E00;&#x4E2A;&#x540C;&#x6837;&#x7531;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x6BCD;&#x7EC4; &#x6210;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#xFF09;&#x751F;&#x6210;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4EE5;&#x6570;&#x5B57;&#x201C;1&#x201D;&#x5F00;&#x5934;&#x3002;&#x4E0B;&#x9762;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x4F8B;&#x5B50;&#xFF1A;</p>
<p>1J7mdg5rbQyUHENYdx39WVWK7fsLpEoXZy</p>
<p>&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x901A;&#x5E38;&#x4EE5;&#x6536;&#x6B3E;&#x65B9;&#x51FA;&#x73B0;&#x3002;&#x5982;&#x679C;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6BD4;&#x4F5C;&#x4E00;&#x5F20;&#x652F;&#x7968;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5C31;&#x662F;&#x6536;&#x6B3E;&#x4EBA;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x5165;&#x6536;&#x6B3E;&#x4EBA;&#x4E00;&#x680F;&#x7684;&#x5185;&#x5BB9;&#x3002;&#x4E00;&#x5F20;&#x652F;&#x7968;&#x7684; &#x6536;&#x6B3E;&#x4EBA;&#x53EF;&#x80FD;&#x662F;&#x67D0;&#x4E2A;&#x94F6;&#x884C;&#x8D26;&#x6237;&#xFF0C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x67D0;&#x4E2A;&#x516C;&#x53F8;&#x3001;&#x673A;&#x6784;&#xFF0C;&#x751A;&#x81F3;&#x662F;&#x73B0;&#x91D1;&#x652F;&#x7968;&#x3002;&#x652F;&#x7968;&#x4E0D;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x8D26;&#x6237;&#xFF0C;&#x800C;&#x662F;&#x7528;&#x4E00;&#x4E2A;&#x62BD;&#x8C61;&#x7684;&#x540D;&#x5B57;&#x4F5C;&#x4E3A;&#x6536;&#x6B3E;&#x4EBA;&#xFF0C;&#x8FD9;&#x4F7F;&#x5B83;&#x6210;&#x4E3A;&#x4E00;&#x79CD;&#x76F8;&#x5F53;&#x7075;&#x6D3B;&#x7684;&#x652F;&#x4ED8;&#x5DE5;&#x5177;&#x3002;&#x4E0E;&#x6B64;&#x7C7B;&#x4F3C;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4F7F;&#x7528;&#x7C7B;&#x4F3C;&#x7684;&#x62BD;&#x8C61;&#xFF0C;&#x4E5F;&#x4F7F;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x53D8;&#x5F97;&#x5F88;&#x7075;&#x6D3B;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x4E00;&#x5BF9;&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x7684;&#x6240;&#x6709;&#x8005;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x5176; &#x5B83;&#x4E1C;&#x897F;&#xFF0C;&#x6BD4;&#x5982;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x201C;P2SH (Pay-to-Script-Hash)&#x201D;&#x4E00;&#x8282;&#x8BB2;&#x5230;&#x7684;&#x4ED8;&#x6B3E;&#x811A;&#x672C;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7531;&#x516C;&#x94A5;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53EF;&#x7531;&#x516C;&#x94A5;&#x7ECF;&#x8FC7;&#x5355;&#x5411;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x5F97;&#x5230;&#x3002;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x662F;&#x4E00;&#x79CD;&#x5355;&#x5411;&#x51FD;&#x6570;&#xFF0C;&#x63A5;&#x6536;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x7684;&#x8F93;&#x5165;&#x4EA7;&#x751F;&#x6307;&#x7EB9;&#x6216;&#x54C8;&#x5E0C;&#x3002;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x88AB;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528; &#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3001;&#x811A;&#x672C;&#x5730;&#x5740;&#x4EE5;&#x53CA;&#x5728;&#x6316;&#x77FF;&#x4E2D;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x3002;&#x7531;&#x516C;&#x94A5;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x65F6;&#x4F7F;&#x7528;&#x7684;&#x7B97;&#x6CD5;&#x662F;Secure Hash Algorithm (SHA)&#x548C;the RACE Integ rity Primitives Evaluation Message Digest (RIPEMD)&#xFF0C;&#x5177;&#x4F53;&#x5730;&#x8BF4;&#x662F;SHA256&#x548C;RIPEMD160&#x3002;</p>
<p>&#x4EE5;&#x516C;&#x94A5; K &#x4E3A;&#x8F93;&#x5165;&#xFF0C;&#x8BA1;&#x7B97;&#x5176;SHA256&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x7ED3;&#x679C;&#x8BA1;&#x7B97;RIPEMD160 &#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x4E3A;160&#x4F4D;&#xFF08;20&#x5B57;&#x8282;&#xFF09;&#x7684;&#x6570;&#x5B57;&#xFF1A;</p>
<p>A = RIPEMD160(SHA256(K))</p>
<p>&#x516C;&#x5F0F;&#x4E2D;&#xFF0C;K&#x662F;&#x516C;&#x94A5;&#xFF0C;A&#x662F;&#x751F;&#x6210;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E0E;&#x516C;&#x94A5;&#x4E0D;&#x540C;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x7531;&#x516C;&#x94A5;&#x7ECF;&#x8FC7;&#x5355;&#x5411;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x751F;&#x6210;&#x7684;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x7528;&#x6237;&#x89C1;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x7ECF;&#x8FC7;&#x201C;Base58Check&#x201D;&#x7F16;&#x7801;&#x7684;&#xFF08;&#x53C2;&#x89C1;&#x201C;Base58&#x548C;Base58Check&#x7F16;&#x7801;&#x201D;&#x4E00;&#x8282;&#xFF09;&#xFF0C;&#x8FD9;&#x79CD;&#x7F16;&#x7801; &#x4F7F;&#x7528;&#x4E86;58&#x4E2A;&#x5B57;&#x7B26;&#xFF08;&#x4E00;&#x79CD;Base58&#x6570;&#x5B57;&#x7CFB;&#x7EDF;&#xFF09;&#x548C;&#x6821;&#x9A8C;&#x7801;&#xFF0C;&#x63D0;&#x9AD8;&#x4E86;&#x53EF;&#x8BFB;&#x6027;&#x3001;&#x907F;&#x514D;&#x6B67;&#x4E49;&#x5E76;&#x6709;&#x6548;&#x9632;&#x6B62;&#x4E86;&#x5728;&#x5730;&#x5740;&#x8F6C;&#x5F55;&#x548C;&#x8F93;&#x5165;&#x4E2D;&#x4EA7;&#x751F; &#x7684;&#x9519;&#x8BEF;&#x3002;Base58Check&#x7F16;&#x7801;&#x4E5F;&#x88AB;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5176;&#x5B83;&#x5730;&#x65B9;&#xFF0C;&#x4F8B;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3001;&#x79C1;&#x94A5;&#x3001;&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x4E2D;&#xFF0C;&#x7528;&#x6765;&#x63D0;&#x9AD8;&#x53EF;&#x8BFB;&#x6027;&#x548C;&#x5F55;&#x5165;&#x7684;&#x6B63;&#x786E;&#x6027;&#x3002;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#x6211;&#x4EEC;&#x4F1A;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;Base58Check&#x7684;&#x7F16;&#x7801;&#x548C;&#x89E3;&#x7801;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x53CA;&#x5B83;&#x4EA7;&#x751F;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x4E0B;&#x56FE;&#x63CF;&#x8FF0;&#x4E86;&#x5982;&#x4F55;&#x4ECE;&#x516C;&#x94A5;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-6fc43eee55666ff2.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-5&#x4ECE;&#x516C;&#x94A5;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;"></p>
<h3 id="421-base58&#x548C;base58check&#x7F16;&#x7801;">4.2.1 Base58&#x548C;Base58Check&#x7F16;&#x7801;</h3>
<p>&#x4E3A;&#x4E86;&#x66F4;&#x7B80;&#x6D01;&#x65B9;&#x4FBF;&#x5730;&#x8868;&#x793A;&#x957F;&#x4E32;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x4F7F;&#x7528;&#x66F4;&#x5C11;&#x7684;&#x7B26;&#x53F7;&#xFF0C;&#x8BB8;&#x591A;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x4F1A;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x4EE5;&#x6570;&#x5B57;&#x548C;&#x5B57;&#x6BCD;&#x7EC4;&#x6210;&#x7684;&#x5927;&#x4E8E;&#x5341;&#x8FDB;&#x5236;&#x7684;&#x8868;&#x793A;&#x6CD5;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x6570;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;0-9&#x5341;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x800C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x4E86;&#x989D;&#x5916;&#x7684; A-F &#x516D;&#x4E2A;&#x5B57;&#x6BCD;&#x3002;&#x4E00;&#x4E2A;&#x540C;&#x6837;&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5B83;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868; &#x793A;&#x5C31;&#x4F1A;&#x6BD4;&#x5341;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x66F4;&#x77ED;&#x3002;&#x751A;&#x81F3;&#x66F4;&#x52A0;&#x7B80;&#x6D01;&#xFF0C;Base64&#x4F7F;&#x7528;&#x4E86;26&#x4E2A;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x3001;26&#x4E2A;&#x5927;&#x5199;&#x5B57;&#x6BCD;&#x3001;10&#x4E2A;&#x6570;&#x5B57;&#x4EE5;&#x53CA;&#x4E24;&#x4E2A;&#x7B26;&#x53F7;&#xFF08;&#x4F8B; &#x5982;&#x201C;+&#x201D;&#x548C;&#x201C;/&#x201D;&#xFF09;&#xFF0C;&#x7528;&#x4E8E;&#x5728;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x8FD9;&#x6837;&#x7684;&#x57FA;&#x4E8E;&#x6587;&#x672C;&#x7684;&#x5A92;&#x4ECB;&#x4E2D;&#x4F20;&#x8F93;&#x4E8C;&#x8FDB;&#x5236;&#x6570;&#x636E;&#x3002;Base64&#x901A;&#x5E38;&#x7528;&#x4E8E;&#x7F16;&#x7801;&#x90AE;&#x4EF6;&#x4E2D;&#x7684;&#x9644;&#x4EF6;&#x3002;Base58 &#x662F;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x6587;&#x672C;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x7528;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x5176;&#x5B83;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x4E0D;&#x4EC5;&#x5B9E;&#x73B0;&#x4E86;&#x6570;&#x636E;&#x538B;&#x7F29;&#xFF0C;&#x4FDD;&#x6301;&#x4E86;&#x6613;&#x8BFB; &#x6027;&#xFF0C;&#x8FD8;&#x5177;&#x6709;&#x9519;&#x8BEF;&#x8BCA;&#x65AD;&#x529F;&#x80FD;&#x3002;Base58&#x662F;Base64&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x5B50;&#x96C6;&#xFF0C;&#x540C;&#x6837;&#x4F7F;&#x7528;&#x5927;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x548C;10&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x4F46;&#x820D;&#x5F03;&#x4E86;&#x4E00;&#x4E9B;&#x5BB9;&#x6613;&#x9519; &#x8BFB;&#x548C;&#x5728;&#x7279;&#x5B9A;&#x5B57;&#x4F53;&#x4E2D;&#x5BB9;&#x6613;&#x6DF7;&#x6DC6;&#x7684;&#x5B57;&#x7B26;&#x3002;&#x5177;&#x4F53;&#x5730;&#xFF0C;Base58&#x4E0D;&#x542B;Base64&#x4E2D;&#x7684;0&#xFF08;&#x6570;&#x5B57;0&#xFF09;&#x3001;O&#xFF08;&#x5927;&#x5199;&#x5B57;&#x6BCD;o&#xFF09;&#x3001;l&#xFF08;&#x5C0F;&#x5199;&#x5B57;&#x6BCD; L&#xFF09;&#x3001;I&#xFF08;&#x5927;&#x5199;&#x5B57;&#x6BCD;i&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;&#x201C;+&#x201D;&#x548C;&#x201C;/&#x201D;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;Base58&#x5C31;&#x662F;&#x7531;&#x4E0D;&#x5305;&#x62EC;&#xFF08;0&#xFF0C;O&#xFF0C;l&#xFF0C;I&#xFF09;&#x7684;&#x5927;&#x5C0F;&#x5199;&#x5B57;&#x6BCD;&#x548C;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#x3002;</p>
<p>&#x4F8B;4-1 &#x6BD4;&#x7279;&#x5E01;&#x7684;Base58&#x5B57;&#x6BCD;&#x8868;</p>
<p>123456789ABCDEFGHJKLMNPQRSTUVWXYZabcdefghijkmnopqrstuvwxyz</p>
<p>&#x4E3A;&#x4E86;&#x589E;&#x52A0;&#x9632;&#x6B62;&#x6253;&#x5370;&#x548C;&#x8F6C;&#x5F55;&#x9519;&#x8BEF;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;Base58Check&#x662F;&#x4E00;&#x79CD;&#x5E38;&#x7528;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x7684;Base58&#x7F16;&#x7801;&#x683C;&#x5F0F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6709;&#x5185;&#x7F6E;&#x7684;&#x68C0;&#x67E5;&#x9519;&#x8BEF;&#x7684;&#x7F16;&#x7801;&#x3002;&#x68C0;&#x9A8C;&#x548C;&#x662F;&#x6DFB;&#x52A0;&#x5230;&#x6B63;&#x5728;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x672B;&#x7AEF;&#x7684;&#x989D;&#x5916;4&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x6821;&#x9A8C;&#x548C;&#x662F;&#x4ECE;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E2D;&#x5F97;&#x5230;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x68C0;&#x6D4B;&#x5E76;&#x907F;&#x514D;&#x8F6C;&#x5F55;&#x548C;&#x8F93;&#x5165;&#x4E2D;&#x4EA7;&#x751F;&#x7684;&#x9519;&#x8BEF;&#x3002;&#x4F7F;&#x7528;Base58check&#x7F16;&#x7801;&#x65F6;&#xFF0C;&#x89E3;&#x7801;&#x8F6F;&#x4EF6;&#x4F1A;&#x8BA1;&#x7B97;&#x6570;&#x636E;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x5E76;&#x548C;&#x7F16;&#x7801;&#x4E2D;&#x81EA;&#x5E26;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x8FDB;&#x884C;&#x5BF9;&#x6BD4;&#x3002;&#x4E8C;&#x8005;&#x4E0D;&#x5339;&#x914D;&#x5219;&#x8868;&#x660E;&#x6709;&#x9519;&#x8BEF;&#x4EA7;&#x751F;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;Base58Check&#x7684;&#x6570;&#x636E;&#x5C31;&#x662F;&#x65E0;&#x6548;&#x7684;&#x3002;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5C31;&#x4E0D;&#x4F1A;&#x88AB;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x8BA4;&#x4E3A;&#x662F;&#x6709;&#x6548;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5426;&#x5219;&#x8FD9;&#x79CD;&#x9519;&#x8BEF;&#x4F1A;&#x9020;&#x6210;&#x8D44;&#x91D1;&#x7684;&#x4E22;&#x5931;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5C06;&#x6570;&#x636E;&#xFF08;&#x6570;&#x5B57;&#xFF09;&#x8F6C;&#x6362;&#x6210;Base58Check&#x683C;&#x5F0F;&#xFF0C;&#x9996;&#x5148;&#x6211;&#x4EEC;&#x8981;&#x5BF9;&#x6570;&#x636E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x79F0;&#x4F5C;&#x201C;&#x7248;&#x672C;&#x5B57;&#x8282;&#x201D;&#x7684;&#x524D;&#x7F00;&#xFF0C;&#x8FD9;&#x4E2A;&#x524D;&#x7F00;&#x7528;&#x6765;&#x8BC6;&#x522B;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x7684;&#x7C7B; &#x578B;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x524D;&#x7F00;&#x662F;0&#xFF08;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x662F;0x00&#xFF09;&#xFF0C;&#x800C;&#x5BF9;&#x79C1;&#x94A5;&#x7F16;&#x7801;&#x65F6;&#x524D;&#x7F00;&#x662F;128&#xFF08;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x662F;0x80&#xFF09;&#x3002; &#x8868;4-1&#x4F1A;&#x5217;&#x51FA;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7248;&#x672C;&#x7684;&#x524D;&#x7F00;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x201C;&#x53CC;&#x54C8;&#x5E0C;&#x201D;&#x6821;&#x9A8C;&#x548C;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x8981;&#x5BF9;&#x4E4B;&#x524D;&#x7684;&#x7ED3;&#x679C;&#xFF08;&#x524D;&#x7F00;&#x548C;&#x6570;&#x636E;&#xFF09;&#x8FD0;&#x884C;&#x4E24;&#x6B21;SHA256&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#xFF1A;</p>
<p>checksum = SHA256(SHA256(prefix+data))</p>
<p>&#x5728;&#x4EA7;&#x751F;&#x7684;&#x957F;32&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF08;&#x4E24;&#x6B21;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#xFF09;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EA;&#x53D6;&#x524D;4&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x8FD9;4&#x4E2A;&#x5B57;&#x8282;&#x5C31;&#x4F5C;&#x4E3A;&#x68C0;&#x9A8C;&#x9519;&#x8BEF;&#x7684;&#x4EE3;&#x7801;&#x6216;&#x8005;&#x6821;&#x9A8C;&#x548C;&#x3002;&#x6821;&#x9A8C;&#x7801;&#x4F1A;&#x6DFB;&#x52A0;&#x5230;&#x6570;&#x636E;&#x4E4B;&#x540E;&#x3002;</p>
<p>&#x7ED3;&#x679C;&#x7531;&#x4E09;&#x90E8;&#x5206;&#x7EC4;&#x6210;&#xFF1A;&#x524D;&#x7F00;&#x3001;&#x6570;&#x636E;&#x548C;&#x6821;&#x9A8C;&#x548C;&#x3002;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x91C7;&#x7528;&#x4E4B;&#x524D;&#x63CF;&#x8FF0;&#x7684;Base58&#x5B57;&#x6BCD;&#x8868;&#x7F16;&#x7801;&#x3002;&#x4E0B;&#x56FE;&#x63CF;&#x8FF0;&#x4E86;Base58Check&#x7F16; &#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-fd3d820e5ba1474c.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-6Base58Check&#x7F16; &#x7801;&#x7684;&#x8FC7;&#x7A0B;"></p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x9700;&#x8981;&#x5411;&#x7528;&#x6237;&#x5C55;&#x793A;&#x7684;&#x6570;&#x636E;&#x90FD;&#x4F7F;&#x7528;Base58Check&#x7F16;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x6570;&#x636E;&#x538B;&#x7F29;&#xFF0C;&#x6613;&#x8BFB;&#x800C;&#x4E14;&#x6709;&#x9519;&#x8BEF;&#x68C0;&#x9A8C;&#x3002; Base58Check&#x7F16;&#x7801;&#x4E2D;&#x7684;&#x7248;&#x672C;&#x524D;&#x7F00;&#x662F;&#x7528;&#x6765;&#x521B;&#x9020;&#x6613;&#x4E8E;&#x8FA8;&#x522B;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x5728;Base58&#x91CC;&#x7684;&#x683C;&#x5F0F;&#x5728;Base58Check&#x7F16;&#x7801;&#x7684;&#x6709;&#x6548;&#x8F7D;&#x8377;&#x7684;&#x5F00;&#x59CB;&#x5305;&#x542B;&#x4E86;&#x660E;&#x786E;&#x7684;&#x5C5E;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x5C5E;&#x6027;&#x4F7F;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x660E;&#x786E;&#x88AB;&#x7F16;&#x7801;&#x7684;&#x6570;&#x636E;&#x7684;&#x7C7B;&#x578B;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x4F8B;&#x5982;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4ED6;&#x4EEC;&#x7684;&#x4E0D;&#x540C;&#xFF0C;Base58Check&#x7F16;&#x7801;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x4EE5;1&#x5F00;&#x5934;&#x7684;&#xFF0C;&#x800C;Base58Check&#x7F16;&#x7801;&#x7684;&#x79C1;&#x94A5;WIF&#x662F;&#x4EE5;5&#x5F00;&#x5934;&#x7684;&#x3002;&#x8868;4-1&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x7248;&#x672C;&#x524D;&#x7F00;&#x548C;&#x4ED6;&#x4EEC;&#x5BF9;&#x5E94;&#x7684;Base58&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x8868;4-1 Base58Check&#x7248;&#x672C;&#x524D;&#x7F00;&#x548C;&#x7F16;&#x7801;&#x540E;&#x7684;&#x7ED3;&#x679C;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-f3cd346fa1b81b2b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="Base58Check&#x7248;&#x672C;&#x524D;&#x7F00;&#x548C;&#x7F16;&#x7801;&#x540E;&#x7684;&#x7ED3;&#x679C;"></p>
<p>&#x6211;&#x4EEC;&#x56DE;&#x987E;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4EA7;&#x751F;&#x7684;&#x5B8C;&#x6574;&#x8FC7;&#x7A0B;&#xFF0C;&#x4ECE;&#x79C1;&#x94A5;&#x3001;&#x5230;&#x516C;&#x94A5;&#xFF08;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x67D0;&#x4E2A;&#x70B9;&#xFF09;&#x3001;&#x518D;&#x5230;&#x4E24;&#x6B21;&#x54C8;&#x5E0C;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5230;&#x6700;&#x7EC8;&#x7684; Base58Check&#x7F16;&#x7801;&#x3002;&#x4F8B;4-3&#x7684;C++&#x4EE3;&#x7801;&#x5B8C;&#x6574;&#x8BE6;&#x7EC6;&#x7684;&#x5C55;&#x793A;&#x4E86;&#x4ECE;&#x79C1;&#x94A5;&#x5230;Base58Check&#x7F16;&#x7801;&#x540E;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684; &#x6B65;&#x9AA4;&#x3002;&#x4EE3;&#x7801;&#x4E2D;&#x4F7F;&#x7528;&#x201C;3.3 &#x5176;&#x4ED6;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x8D44;&#x6599;&#x5E93;&#x3001;&#x5DE5;&#x5177;&#x5305; &#x201D;&#x4E00;&#x8282;&#x4E2D;&#x4ECB;&#x7ECD;&#x7684;libbitcoin library&#x6765;&#x5B9E;&#x73B0;&#x67D0;&#x4E9B;&#x8F85;&#x52A9;&#x529F;&#x80FD;&#x3002;</p>
<p>&#x4F8B;4-3.&#x4ECE;&#x79C1;&#x94A5;&#x4E2D;&#x521B;&#x5EFA;Base58Check&#x7F16;&#x7801;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;</p>
<p>code/addr.cpp[]</p>
<p>&#x4EE3;&#x7801;&#x4F7F;&#x7528;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x79C1;&#x94A5;&#x5728;&#x6BCF;&#x6B21;&#x8FD0;&#x884C;&#x65F6;&#x4EA7;&#x751F;&#x76F8;&#x540C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x4E0B;&#x4F8B;&#x6240;&#x793A;</p>
<p>&#x4F8B;4-3.&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;addr&#x4EE3;&#x7801;</p>
<p> Compile the addr.cpp code
$ g++ -o addr addr.cpp $(pkg-config --cflags --libs libbitcoin)
Run the addr executable
$ ./addr
Public key: 0202a406624211f2abbdc68da3df929f938c3399dd79fac1b51b0e4ad1d26a47aa
Address: 1PRTTaJesdNovgne6Ehcdu1fpEdX7913CK</p>
<h3 id="422-&#x5BC6;&#x94A5;&#x7684;&#x683C;&#x5F0F;">4.2.2 &#x5BC6;&#x94A5;&#x7684;&#x683C;&#x5F0F;</h3>
<p>&#x516C;&#x94A5;&#x548C;&#x79C1;&#x94A5;&#x7684;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x79CD;&#x683C;&#x5F0F;&#x3002;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x88AB;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;&#x7F16;&#x7801;&#x540E;&#xFF0C;&#x867D;&#x7136;&#x7ED3;&#x679C;&#x770B;&#x8D77;&#x6765;&#x53EF;&#x80FD;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x662F;&#x5BC6;&#x94A5;&#x6240;&#x7F16;&#x7801;&#x6570;&#x5B57;&#x5E76;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x4E9B;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x4E3B;&#x8981;&#x662F;&#x7528;&#x6765;&#x65B9;&#x4FBF;&#x4EBA;&#x4EEC;&#x65E0;&#x8BEF;&#x5730;&#x4F7F;&#x7528;&#x548C;&#x8BC6;&#x522B;&#x5BC6;&#x94A5;&#x3002;</p>
<h4 id="4221&#x79C1;&#x94A5;&#x7684;&#x683C;&#x5F0F;">4.2.2.1&#x79C1;&#x94A5;&#x7684;&#x683C;&#x5F0F;</h4>
<p>&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x4EE5;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;&#x8868;&#x793A;&#xFF0C;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x90FD;&#x5BF9;&#x5E94;&#x4E8E;&#x76F8;&#x540C;&#x7684;256&#x4F4D;&#x7684;&#x6570;&#x5B57;&#x3002;&#x8868;4-2&#x5C55;&#x793A;&#x4E86;&#x79C1;&#x94A5;&#x7684;&#x4E09;&#x79CD;&#x5E38;&#x89C1;&#x683C;&#x5F0F;&#x3002;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;&#x7528;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x573A;&#x666F;&#x4E0B;&#x3002;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x548C;&#x539F;&#x59CB;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#x7528;&#x5728;&#x8F6F;&#x4EF6;&#x7684;&#x5185;&#x90E8;&#xFF0C;&#x5F88;&#x5C11;&#x5C55;&#x793A;&#x7ED9;&#x7528;&#x6237;&#x770B;&#x3002;WIF&#x683C;&#x5F0F;&#x7528;&#x5728;&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x5BC6;&#x94A5;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF0C;&#x4E5F;&#x7528;&#x4E8E;&#x4EE3;&#x8868;&#x79C1;&#x94A5;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#xFF08;&#x6761;&#x5F62;&#x7801;&#xFF09;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-fa916ebbf5c0d2cf.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-2&#x5C55;&#x79C1;&#x94A5;&#x7684;&#x4E09;&#x79CD;&#x5E38;&#x89C1;&#x683C;&#x5F0F;"></p>
<p>&#x8868;4-3 &#x793A;&#x4F8B;&#xFF1A;&#x540C;&#x6837;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-1654059037c90c8b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-3 &#x793A;&#x4F8B;&#xFF1A;&#x540C;&#x6837;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;"></p>
<p>&#x8FD9;&#x4E9B;&#x8868;&#x793A;&#x6CD5;&#x90FD;&#x662F;&#x7528;&#x6765;&#x8868;&#x793A;&#x76F8;&#x540C;&#x7684;&#x6570;&#x5B57;&#x3001;&#x76F8;&#x540C;&#x7684;&#x79C1;&#x94A5;&#x7684;&#x4E0D;&#x540C;&#x65B9;&#x6CD5;&#x3002;&#x867D;&#x7136;&#x7F16;&#x7801;&#x540E;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x540C;&#xFF0C;&#x4F46;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;&#x5F7C;&#x6B64;&#x4E4B; &#x95F4;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x76F8;&#x4E92;&#x8F6C;&#x6362;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x201C;raw binary&#x201D;&#x672A;&#x663E;&#x793A;&#x5728;&#x8868;4-3 &#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x6839;&#x636E;&#x5B9A;&#x4E49;&#x6B64;&#x5904;&#x663E;&#x793A;&#x7684;&#x4EFB;&#x4F55;&#x7F16;&#x7801;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x4E0D;&#x662F;raw binary&#x6570;&#x636E;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;Bitcoin Explorer&#x4E2D;&#x7684;wif-to-ec&#x547D;&#x4EE4;&#xFF08;&#x8BF7;&#x53C2;&#x9605;[appdx_bx]&#xFF09;&#x6765;&#x663E;&#x793A;&#x4E24;&#x4E2A;WIF&#x952E;&#x4EE3;&#x8868;&#x76F8;&#x540C;&#x7684;&#x79C1;&#x94A5;&#xFF1A;</p>
<p>$ bx wif-to-ec 5J3mBbAH58CpQ3Y5RNJpUKPE62SQ5tfcvU2JpbnkeyhfsYB1Jcn</p>
<p>1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd</p>
<p>$ bx wif-to-ec KxFC1jmwwCoACiCAWZ3eXa96mBM6tb3TYzGmf6YwgdGWZgawvrtJ</p>
<p>1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd</p>
<h3 id="423&#x4ECE;base58check&#x89E3;&#x7801;">4.2.3&#x4ECE;Base58Check&#x89E3;&#x7801;</h3>
<p>Bitcoin Explorer&#x547D;&#x4EE4;&#xFF08;&#x53C2;&#x89C1;[appdx_bx]&#xFF09;&#x4F7F;&#x5F97;&#x7F16;&#x5199;shell&#x811A;&#x672C;&#x548C;&#x547D;&#x4EE4;&#x884C;&#x201C;&#x7BA1;&#x9053;&#x201D;&#x53D8;&#x5F97;&#x5BB9;&#x6613;&#xFF0C;&#x8FD9;&#x4E9B;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x5904;&#x7406;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#xFF0C;&#x5730;&#x5740;&#x548C;&#x4EA4;&#x6613;&#x3002; &#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Bitcoin Explorer&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4E0A;&#x89E3;&#x7801;Base58Check&#x683C;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4F7F;&#x7528;base58check-decode&#x547D;&#x4EE4;&#x89E3;&#x7801;&#x672A;&#x538B;&#x7F29;&#x7684;&#x5BC6;&#x94A5;&#xFF1A;</p>
<p>$ bx base58check-decode 5J3mBbAH58CpQ3Y5RNJpUKPE62SQ5tfcvU2JpbnkeyhfsYB1Jcn</p>
<p>wrapper</p>
<p>{</p>
<pre><code>checksum 4286807748
payload 1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd
version 128
</code></pre><p>}</p>
<p>&#x7ED3;&#x679C;&#x5305;&#x542B;&#x5BC6;&#x94A5;&#x4F5C;&#x4E3A;&#x6709;&#x6548;&#x8F7D;&#x8377;&#xFF0C;WIF&#x7248;&#x672C;&#x524D;&#x7F00;128&#x548C;&#x6821;&#x9A8C;&#x548C;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x538B;&#x7F29;&#x5BC6;&#x94A5;&#x7684;&#x201C;&#x6709;&#x6548;&#x8D1F;&#x8F7D;&#x201D;&#x9644;&#x52A0;&#x4E86;&#x540E;&#x7F00;01&#xFF0C;&#x8868;&#x793A;&#x5BFC;&#x51FA;&#x7684;&#x516C;&#x94A5;&#x8981;&#x538B;&#x7F29;&#xFF1A;</p>
<p>$ bx base58check-decode KxFC1jmwwCoACiCAWZ3eXa96mBM6tb3TYzGmf6YwgdGWZgawvrtJ</p>
<p>wrapper
{</p>
<pre><code>checksum 2339607926
payload 1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd01
version 128
</code></pre><p>}</p>
<p><strong><em>&#x5C06;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8F6C;&#x6362;&#x4E3A;Base58Check&#x7F16;&#x7801;</em></strong></p>
<p>&#x8981;&#x8F6C;&#x6362;&#x6210;Base58Check&#xFF08;&#x4E0E;&#x4E0A;&#x4E00;&#x4E2A;&#x547D;&#x4EE4;&#x76F8;&#x53CD;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;Bitcoin Explorer&#x7684;base58check-encode&#x547D;&#x4EE4;&#xFF08;&#x8BF7;&#x53C2;&#x9605;[appdx_bx]&#xFF09;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x79C1;&#x94A5;&#xFF0C;&#x5176;&#x6B21;&#x662F;WIF&#x7248;&#x672C;&#x524D;&#x7F00;128&#xFF1A;</p>
<p>bx base58check-encode 1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd --version 128</p>
<p>5J3mBbAH58CpQ3Y5RNJpUKPE62SQ5tfcvU2JpbnkeyhfsYB1Jcn</p>
<p><strong><em>&#x5C06;&#x5341;&#x516D;&#x8FDB;&#x5236;&#xFF08;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x5BC6;&#x94A5;&#xFF09;&#x8F6C;&#x6362;&#x4E3A;Base58Check&#x7F16;&#x7801;</em></strong></p>
<p>&#x8981;&#x5C06;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x7684;&#x79C1;&#x94A5;&#x7F16;&#x7801;&#x4E3A;Base58Check&#xFF08;&#x53C2;&#x89C1;&#x201C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;&#x201D;&#x4E00;&#x8282;&#xFF09;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x5728;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x79C1;&#x94A5;&#x7684;&#x540E;&#x9762;&#x6DFB;&#x52A0;&#x540E;&#x7F00;01&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8DDF;&#x4E0A;&#x9762;&#x4E00;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;</p>
<p>$ bx base58check-encode 1e99423a4ed27608a15a2616a2b0e9e52ced330ac530edcc32c8ffc6a526aedd01 --version 128</p>
<p>KxFC1jmwwCoACiCAWZ3eXa96mBM6tb3TYzGmf6YwgdGWZgawvrtJ</p>
<p>&#x751F;&#x6210;&#x7684;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x7684;&#x79C1;&#x94A5;&#x4EE5;&#x5B57;&#x6BCD;&#x201C;K&#x201D;&#x5F00;&#x5934;&#xFF0C;&#x7528;&#x4EE5;&#x8868;&#x660E;&#x88AB;&#x7F16;&#x7801;&#x7684;&#x79C1;&#x94A5;&#x6709;&#x4E00;&#x4E2A;&#x540E;&#x7F00;&#x201C;01&#x201D;&#xFF0C;&#x4E14;&#x8BE5;&#x79C1;&#x94A5;&#x53EA;&#x80FD;&#x88AB;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x538B;&#x7F29;&#x683C;&#x5F0F; &#x7684;&#x516C;&#x94A5;&#xFF08;&#x53C2;&#x89C1;&#x201C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x201D;&#x4E00;&#x8282;&#xFF09;&#x3002;</p>
<h4 id="4231&#x516C;&#x94A5;&#x7684;&#x683C;&#x5F0F;">4.2.3.1&#x516C;&#x94A5;&#x7684;&#x683C;&#x5F0F;</h4>
<p>&#x516C;&#x94A5;&#x4E5F;&#x53EF;&#x4EE5;&#x7528;&#x591A;&#x79CD;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x6765;&#x8868;&#x793A;&#xFF0C;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x5B83;&#x4EEC;&#x5206;&#x4E3A;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x6216;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x8FD9;&#x4E24;&#x79CD;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4ECE;&#x524D;&#x6587;&#x53EF;&#x77E5;&#xFF0C;&#x516C;&#x94A5;&#x662F;&#x5728;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x4E00;&#x4E2A;&#x70B9;&#xFF0C;&#x7531;&#x4E00;&#x5BF9;&#x5750;&#x6807;&#xFF08;x&#xFF0C;y&#xFF09;&#x7EC4;&#x6210;&#x3002;&#x516C;&#x94A5;&#x901A;&#x5E38;&#x8868;&#x793A;&#x4E3A;&#x524D;&#x7F00;04&#x7D27;&#x63A5;&#x7740;&#x4E24;&#x4E2A;256&#x6BD4;&#x7279;&#x7684;&#x6570;&#x5B57;&#x3002;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;256&#x6BD4;&#x7279;&#x6570;&#x5B57;&#x662F;&#x516C;&#x94A5;&#x7684;x&#x5750;&#x6807;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;256&#x6BD4;&#x7279;&#x6570;&#x5B57;&#x662F;y&#x5750;&#x6807;&#x3002;&#x524D;&#x7F00;04&#x662F;&#x7528;&#x6765;&#x533A;&#x5206;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#xFF0C; &#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x662F;&#x4EE5;02&#x6216;&#x8005;03&#x5F00;&#x5934;&#x3002;</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x7531;&#x524D;&#x6587;&#x4E2D;&#x7684;&#x79C1;&#x94A5;&#x6240;&#x751F;&#x6210;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x5176;&#x5750;&#x6807;x&#x548C;y&#x5982;&#x4E0B;&#xFF1A;</p>
<p>x = F028892BAD7ED57D2FB57BF33081D5CFCF6F9ED3D3D7F159C2E2FFF579DC341A </p>
<p>y = 07CF33DA18BD734C600B96A72BBC4749D5141C90EC8AC328AE52DDFE2E505BDB</p>
<p>&#x4E0B;&#x9762;&#x662F;&#x540C;&#x6837;&#x7684;&#x516C;&#x94A5;&#x4EE5;520&#x6BD4;&#x7279;&#x7684;&#x6570;&#x5B57;&#xFF08;130&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF09;&#x6765;&#x8868;&#x8FBE;&#x3002;&#x8FD9;&#x4E2A;520&#x6BD4;&#x7279;&#x7684;&#x6570;&#x5B57;&#x4EE5;&#x524D;&#x7F00;04&#x5F00;&#x5934;&#xFF0C;&#x7D27;&#x63A5;&#x7740;&#x662F;x&#x53CA;y &#x5750;&#x6807;&#xFF0C;&#x7EC4;&#x6210;&#x683C;&#x5F0F;&#x4E3A;04 x y&#xFF1A;</p>
<p>K = 04F028892BAD7ED57D2FB57BF33081D5CFCF6F9ED3D3D7F159C2E2FFF579DC341A07CF33DA18BD734C600B96A72BBC4749D5141C90EC8AC328AE 52DDFE2E505BDB</p>
<h4 id="4232&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;">4.2.3.2&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;</h4>
<p>&#x5F15;&#x5165;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x662F;&#x4E3A;&#x4E86;&#x51CF;&#x5C11;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x8282;&#x7701;&#x90A3;&#x4E9B;&#x8FD0;&#x884C;&#x533A;&#x5757;&#x94FE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x8282;&#x70B9;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x3002;&#x5927;&#x90E8;&#x5206;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x4E86;&#x516C;&#x94A5;&#xFF0C;&#x7528;&#x4E8E;&#x9A8C;&#x8BC1;&#x7528;&#x6237;&#x7684;&#x51ED;&#x636E;&#x548C;&#x652F;&#x4ED8;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x6BCF;&#x4E2A;&#x516C;&#x94A5;&#x6709;520&#x6BD4;&#x7279;&#xFF08;&#x5305;&#x62EC;&#x524D;&#x7F00;&#xFF0C;x&#x5750;&#x6807;&#xFF0C;y&#x5750;&#x6807;&#xFF09;&#x3002;&#x5982;&#x679C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x6709;&#x6570;&#x767E;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x6BCF;&#x5929;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x5C31;&#x4F1A;&#x88AB;&#x5199;&#x5165;&#x5927;&#x91CF;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x5728;&#x201C;4.1.4 &#x516C;&#x94A5;&#x201D;&#x4E00;&#x8282;&#x6240;&#x89C1;&#xFF0C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x662F;&#x4E00;&#x4E2A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;(x, y)&#x3002;&#x800C;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x5B9E;&#x9645;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B66;&#x65B9;&#x7A0B;&#xFF0C;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x70B9;&#x5B9E;&#x9645;&#x662F;&#x8BE5;&#x65B9;&#x7A0B;&#x7684;&#x4E00;&#x4E2A;&#x89E3;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x516C;&#x94A5;&#x7684;x&#x5750;&#x6807;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x89E3;&#x65B9;&#x7A0B;y2 mod p = (x3 + 7) mod p&#x5F97;&#x5230;y&#x5750; &#x6807;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x53EA;&#x5B58;&#x50A8;&#x516C;&#x94A5;&#x7684;x&#x5750;&#x6807;&#xFF0C;&#x7565;&#x53BB;y&#x5750;&#x6807;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x516C;&#x94A5;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x51CF;&#x5C11;&#x4E86;256&#x6BD4;&#x7279;&#x3002;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x6240; &#x9700;&#x8981;&#x7684;&#x5B57;&#x8282;&#x6570;&#x51CF;&#x5C11;&#x4E86;&#x8FD1;&#x4E00;&#x534A;&#xFF0C;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x63A8;&#x79FB;&#xFF0C;&#x5C31;&#x5927;&#x5927;&#x8282;&#x7701;&#x4E86;&#x5F88;&#x591A;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x548C;&#x5B58;&#x50A8;&#x3002;</p>
<p>&#x672A;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x4F7F;&#x7528;04&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#xFF0C;&#x800C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x662F;&#x4EE5;02&#x6216;03&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x3002;&#x9700;&#x8981;&#x8FD9;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x524D;&#x7F00;&#x7684;&#x539F;&#x56E0;&#x662F;&#xFF1A;&#x56E0;&#x4E3A;&#x692D;&#x5706;&#x66F2; &#x7EBF;&#x52A0;&#x5BC6;&#x7684;&#x516C;&#x5F0F;&#x7684;&#x5DE6;&#x8FB9;&#x662F;y2 &#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;y&#x7684;&#x89E3;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x5E73;&#x65B9;&#x6839;&#xFF0C;&#x53EF;&#x80FD;&#x662F;&#x6B63;&#x503C;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x8D1F;&#x503C;&#x3002;&#x66F4;&#x5F62;&#x8C61;&#x5730;&#x8BF4;&#xFF0C;y&#x5750;&#x6807;&#x53EF;&#x80FD;&#x5728; x&#x5750;&#x6807;&#x8F74;&#x7684;&#x4E0A;&#x9762;&#x6216;&#x8005;&#x4E0B;&#x9762;&#x3002;&#x4ECE;&#x56FE;4-2&#x7684;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x56FE;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x66F2;&#x7EBF;&#x662F;&#x5BF9;&#x79F0;&#x7684;&#xFF0C;&#x4ECE;x&#x8F74;&#x770B;&#x5C31;&#x50CF;&#x5BF9;&#x79F0;&#x7684;&#x955C;&#x5B50;&#x4E24;&#x9762;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x7565;&#x53BB;y&#x5750;&#x6807;&#xFF0C;&#x5C31;&#x5FC5;&#x987B;&#x50A8;&#x5B58;y&#x7684;&#x7B26;&#x53F7;&#xFF08;&#x6B63;&#x503C;&#x6216;&#x8005;&#x8D1F;&#x503C;&#xFF09;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5BF9;&#x4E8E;&#x7ED9;&#x5B9A;&#x7684;x&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x77E5;&#x9053;y&#x503C;&#x5728;x&#x8F74;&#x7684;&#x4E0A;&#x9762;&#x8FD8;&#x662F;&#x4E0B;&#x9762;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4EE3;&#x8868;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x4E0D;&#x540C;&#x7684;&#x70B9;&#xFF0C;&#x5373;&#x4E0D;&#x540C;&#x7684;&#x516C;&#x94A5;&#x3002;&#x5F53;&#x6211;&#x4EEC;&#x5728;&#x7D20;&#x6570;p&#x9636;&#x7684;&#x6709;&#x9650;&#x57DF;&#x4E0A;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x7B97;&#x672F;&#x8BA1;&#x7B97;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x7684;&#x65F6;&#x5019;&#xFF0C;y&#x5750;&#x6807;&#x53EF;&#x80FD;&#x662F;&#x5947;&#x6570;&#x6216;&#x8005;&#x5076;&#x6570;&#xFF0C;&#x5206;&#x522B;&#x5BF9;&#x5E94;&#x524D;&#x9762;&#x6240;&#x8BB2;&#x7684;y&#x503C;&#x7684;&#x6B63;&#x8D1F;&#x7B26;&#x53F7;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E3A;&#x4E86;&#x533A;&#x5206;y&#x5750;&#x6807;&#x7684;&#x4E24;&#x79CD;&#x53EF;&#x80FD;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x751F;&#x6210;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x65F6;&#xFF0C;&#x5982;&#x679C;y&#x662F;&#x5076;&#x6570;&#xFF0C;&#x5219;&#x4F7F;&#x7528;02&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#xFF1B;&#x5982;&#x679C;y&#x662F;&#x5947;&#x6570;&#xFF0C;&#x5219;&#x4F7F;&#x7528;03&#x4F5C;&#x4E3A;&#x524D;&#x7F00;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x516C;&#x94A5;&#x4E2D;&#x7ED9;&#x5B9A;&#x7684;x&#x503C;&#xFF0C;&#x6B63;&#x786E;&#x63A8;&#x5BFC;&#x51FA;&#x5BF9;&#x5E94;&#x7684;y&#x5750;&#x6807;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x516C;&#x94A5;&#x89E3;&#x538B;&#x7F29;&#x4E3A;&#x5728;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x4E0A;&#x7684;&#x5B8C;&#x6574;&#x7684;&#x70B9;&#x5750;&#x6807;&#x3002;&#x4E0B;&#x56FE;&#x9610;&#x91CA;&#x4E86;&#x516C;&#x94A5;&#x538B;&#x7F29;&#xFF1A;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4e4e3255fc54395b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-7&#x516C;&#x94A5;&#x538B;&#x7F29;"></p>
<p>&#x4E0B;&#x9762;&#x662F;&#x524D;&#x8FF0;&#x7AE0;&#x8282;&#x6240;&#x751F;&#x6210;&#x7684;&#x516C;&#x94A5;&#xFF0C;&#x4F7F;&#x7528;&#x4E86;264&#x6BD4;&#x7279;&#xFF08;66&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#xFF09;&#x7684;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x683C;&#x5F0F;&#xFF0C;&#x5176;&#x4E2D;&#x524D;&#x7F00;03&#x8868;&#x793A;y&#x5750;&#x6807;&#x662F;&#x4E00;&#x4E2A;&#x5947;&#x6570;&#xFF1A;</p>
<p>K = 03F028892BAD7ED57D2FB57BF33081D5CFCF6F9ED3D3D7F159C2E2FFF579DC341A</p>
<p>&#x8FD9;&#x4E2A;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x5BF9;&#x5E94;&#x7740;&#x540C;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x5B83;&#x662F;&#x7531;&#x540C;&#x6837;&#x7684;&#x79C1;&#x94A5;&#x6240;&#x751F;&#x6210;&#x3002;&#x4F46;&#x662F;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x548C;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x770B;&#x8D77;&#x6765;&#x4E0D;&#x540C;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x53CC;&#x54C8;&#x5E0C;&#x51FD;&#x6570;(RIPEMD160(SHA256(K)))&#x5C06;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x8F6C;&#x5316;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x5730;&#x5740;&#x5C06;&#x4F1A;&#x4E0D;&#x540C;&#x4E8E;&#x7531;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x4EA7;&#x751F;&#x7684;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x79CD;&#x7ED3;&#x679C;&#x4F1A;&#x8BA9;&#x4EBA;&#x8FF7;&#x60D1;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E24;&#x79CD;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x7684;&#x516C;&#x94A5;&#x2014;&#x2014;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x548C;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#xFF0C;&#x800C;&#x8FD9;&#x4E24;&#x79CD;&#x683C;&#x5F0F;&#x7684;&#x516C;&#x94A5;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x79C1;&#x94A5;&#x662F;&#x4E00;&#x6837;&#x7684;&#x3002;</p>
<p>&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x6E10;&#x6E10;&#x6210;&#x4E3A;&#x4E86;&#x5404;&#x79CD;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x9ED8;&#x8BA4;&#x683C;&#x5F0F;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x51CF;&#x5C11;&#x4EA4;&#x6613;&#x6240;&#x9700;&#x7684;&#x5B57;&#x8282;&#x6570;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8BA9;&#x5B58;&#x50A8;&#x533A;&#x5757;&#x94FE;&#x6240;&#x9700;&#x7684;&#x78C1;&#x76D8;&#x7A7A;&#x95F4;&#x53D8;&#x5C0F;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5E76;&#x975E;&#x6240;&#x6709;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90FD;&#x652F;&#x6301;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#xFF0C;&#x4E8E;&#x662F;&#x90A3;&#x4E9B;&#x8F83;&#x65B0;&#x7684;&#x652F;&#x6301;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5C31;&#x4E0D;&#x5F97;&#x4E0D;&#x8003;&#x8651;&#x5982;&#x4F55;&#x5904;&#x7406;&#x90A3;&#x4E9B;&#x6765;&#x81EA;&#x8F83;&#x8001;&#x7684;&#x4E0D;&#x652F;&#x6301;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x5728;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x5BFC;&#x5165;&#x53E6;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7684;&#x79C1;&#x94A5;&#x7684; &#x65F6;&#x5019;&#x5C31;&#x4F1A;&#x53D8;&#x5F97;&#x5C24;&#x5176;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x65B0;&#x94B1;&#x5305;&#x9700;&#x8981;&#x626B;&#x63CF;&#x533A;&#x5757;&#x94FE;&#x5E76;&#x627E;&#x5230;&#x6240;&#x6709;&#x4E0E;&#x8FD9;&#x4E9B;&#x88AB;&#x5BFC;&#x5165;&#x79C1;&#x94A5;&#x76F8;&#x5173;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5E94;&#x8BE5;&#x626B;&#x63CF;&#x54EA;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5462;&#xFF1F;&#x65B0;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x77E5;&#x9053;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x54EA;&#x4E2A;&#x516C;&#x94A5;&#xFF1A;&#x56E0;&#x4E3A;&#x4E0D;&#x8BBA;&#x662F;&#x901A;&#x8FC7;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x4EA7;&#x751F;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x8FD8;&#x662F;&#x901A;&#x8FC7;&#x975E;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x4EA7;&#x751F;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x5408;&#x6CD5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x79C1;&#x94A5;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x662F;&#x4ED6;&#x4EEC;&#x662F;&#x4E0D;&#x540C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x5F53;&#x79C1;&#x94A5;&#x4ECE;&#x94B1;&#x5305;&#x4E2D;&#x88AB;&#x5BFC;&#x51FA;&#x65F6;&#xFF0C;&#x4EE3;&#x8868;&#x79C1;&#x94A5;&#x7684;WIF&#x5728;&#x8F83;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x91CC;&#x88AB;&#x5904;&#x7406;&#x7684;&#x65B9;&#x5F0F;&#x4E0D;&#x540C;&#xFF0C;&#x8868;&#x660E;&#x8BE5;&#x79C1;&#x94A5;&#x5DF2;&#x7ECF;&#x88AB;&#x7528;&#x6765;&#x751F;&#x6210;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x548C;&#x56E0;&#x6B64;&#x538B;&#x7F29;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x5BFC;&#x5165;&#x79C1;&#x94A5;&#x6765;&#x81EA;&#x4E8E;&#x8001;&#x94B1;&#x5305;&#x8FD8;&#x662F;&#x65B0;&#x94B1;&#x5305;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x89E3;&#x51B3;&#x4E86;&#x901A;&#x8FC7;&#x516C;&#x94A5;&#x751F;&#x6210;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x8FD8;&#x662F;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x95EE;&#x9898;&#x3002;&#x6700;&#x540E;&#x65B0;&#x94B1;&#x5305;&#x5728;&#x626B;&#x63CF;&#x533A;&#x5757;&#x94FE;&#x65F6;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x5BF9;&#x5E94;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53BB;&#x67E5;&#x627E;&#x8BE5;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5728;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x8BE6;&#x7EC6;&#x89E3;&#x91CA;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<h4 id="4233&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;">4.2.3.3&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;</h4>
<p>&#x5B9E;&#x9645;&#x4E0A;&#x201C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;&#x201D;&#x662F;&#x4E00;&#x79CD;&#x540D;&#x79F0;&#x4E0A;&#x7684;&#x8BEF;&#x5BFC;&#xFF0C;&#x56E0;&#x4E3A;&#x5F53;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x88AB;&#x4F7F;&#x7528;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x5BFC;&#x51FA;&#x65F6;&#xFF0C;&#x4E0D;&#x4F46;&#x6CA1;&#x6709;&#x538B;&#x7F29;&#xFF0C;&#x800C;&#x4E14;&#x6BD4;&#x201C;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x201D;&#x79C1;&#x94A5;&#x957F;&#x51FA;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x3002;&#x8FD9;&#x4E2A;&#x591A;&#x51FA;&#x6765;&#x7684;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x662F;&#x79C1;&#x94A5;&#x88AB;&#x52A0;&#x4E86;&#x540E;&#x7F00;01&#xFF0C;&#x7528;&#x4EE5;&#x8868;&#x660E;&#x8BE5;&#x79C1;&#x94A5;&#x662F;&#x6765;&#x81EA;&#x4E8E;&#x4E00;&#x4E2A;&#x8F83;&#x65B0;&#x7684;&#x94B1;&#x5305;&#xFF0C; &#x53EA;&#x80FD;&#x88AB;&#x7528;&#x6765;&#x751F;&#x6210;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x3002;&#x79C1;&#x94A5;&#x662F;&#x975E;&#x538B;&#x7F29;&#x7684;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x88AB;&#x538B;&#x7F29;&#x3002;&#x201C;&#x538B;&#x7F29;&#x7684;&#x79C1;&#x94A5;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#x53EA;&#x662F;&#x8868;&#x793A;&#x201C;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x79C1;&#x94A5;&#x201D;&#xFF0C;&#x800C;&#x201C;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;&#x201D;&#x7528;&#x6765;&#x8868;&#x660E;&#x201C;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x79C1;&#x94A5;&#x201D;&#x3002;&#x4E3A;&#x907F;&#x514D;&#x66F4;&#x591A;&#x8BEF;&#x89E3;&#xFF0C;&#x5E94;&#x8BE5;&#x53EA;&#x53EF;&#x4EE5;&#x8BF4;&#x5BFC;&#x51FA;&#x683C;&#x5F0F; &#x662F;&#x201C;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x201D;&#x6216;&#x8005;&#x201C;WIF&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x80FD;&#x8BF4;&#x8FD9;&#x4E2A;&#x79C1;&#x94A5;&#x662F;&#x201C;&#x538B;&#x7F29;&#x201D;&#x7684;&#x3002;</p>
<p>&#x8868;4&#x793A;&#x4F8B;&#xFF1A;&#x76F8;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x683C;&#x5F0F;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-9b55c974726bc841.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-4&#x5C55;&#x793A;&#x4E86;&#x540C;&#x6837;&#x7684;&#x79C1;&#x94A5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;WIF&#x548C;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x7F16;&#x7801;&#x3002;"></p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x538B;&#x7F29;&#x79C1;&#x94A5;&#x683C;&#x5F0F;&#x5728;&#x672B;&#x5C3E;&#x6709;&#x4E00;&#x4E2A;&#x989D;&#x5916;&#x7684;&#x5B57;&#x8282;&#xFF08;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x4E3A;01&#xFF09;&#x3002; &#x867D;&#x7136;Base58&#x7F16;&#x7801;&#x7248;&#x672C;&#x524D;&#x7F00;&#x5BF9;&#x4E8E;WIF&#x548C;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x90FD;&#x662F;&#x76F8;&#x540C;&#x7684;&#xFF08;0x80&#xFF09;&#xFF0C;&#x4F46;&#x5728;&#x6570;&#x5B57;&#x672B;&#x5C3E;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x4F1A;&#x5BFC;&#x81F4;Base58&#x7F16;&#x7801;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x4ECE;5&#x53D8;&#x4E3A;K&#x6216; L&#xFF0C;&#x8003;&#x8651;&#x5230;&#x5BF9;&#x4E8E;Base58&#x8FD9;&#x662F;&#x5341;&#x8FDB;&#x5236;&#x7F16;&#x7801;100&#x53F7;&#x548C;99&#x53F7;&#x4E4B;&#x95F4;&#x7684;&#x5DEE;&#x522B;&#x3002;&#x5BF9;&#x4E8E;100&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x957F;&#x4E8E;99&#x7684;&#x6570;&#x5B57;&#xFF0C;&#x5B83;&#x6709;&#x4E00;&#x4E2A;&#x524D;&#x7F00;1&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x524D;&#x7F00;9&#x3002;&#x5F53;&#x957F;&#x5EA6;&#x53D8;&#x5316; &#xFF0C;&#x5B83;&#x4F1A;&#x5F71;&#x54CD;&#x524D;&#x7F00;&#x3002; &#x5728;Base58&#x4E2D;&#xFF0C;&#x524D;&#x7F00;5&#x6539;&#x53D8;&#x4E3A;K&#x6216;L&#xFF0C;&#x56E0;&#x4E3A;&#x6570;&#x5B57;&#x7684;&#x957F;&#x5EA6;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x3002;</p>
<p>&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x683C;&#x5F0F;&#x5E76;&#x4E0D;&#x662F;&#x53EF;&#x4E92;&#x6362;&#x4F7F;&#x7528;&#x7684;&#x3002;&#x5728;&#x5B9E;&#x73B0;&#x4E86;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x8F83;&#x65B0;&#x7684;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x79C1;&#x94A5;&#x53EA;&#x80FD;&#x4E14;&#x6C38;&#x8FDC;&#x88AB;&#x5BFC;&#x51FA;&#x4E3A;WIF&#x538B; &#x7F29;&#x683C;&#x5F0F;&#xFF08;&#x4EE5;K&#x6216;L&#x4E3A;&#x524D;&#x7F00;&#xFF09;&#x3002;&#x5BF9;&#x4E8E;&#x8F83;&#x8001;&#x7684;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x79C1;&#x94A5;&#x5C06;&#x53EA;&#x80FD;&#x88AB;&#x5BFC;&#x51FA;&#x4E3A;WIF&#x683C;&#x5F0F;&#xFF08;&#x4EE5;5&#x4E3A;&#x524D;&#x7F00;&#xFF09;&#x5BFC; &#x51FA;&#x3002;&#x8FD9;&#x6837;&#x505A;&#x7684;&#x76EE;&#x7684;&#x5C31;&#x662F;&#x4E3A;&#x4E86;&#x7ED9;&#x5BFC;&#x5165;&#x8FD9;&#x4E9B;&#x79C1;&#x94A5;&#x7684;&#x94B1;&#x5305;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#xFF1A;&#x662F;&#x5426;&#x94B1;&#x5305;&#x5FC5;&#x987B;&#x641C;&#x7D22;&#x533A;&#x5757;&#x94FE;&#x5BFB;&#x627E;&#x538B;&#x7F29;&#x6216;&#x975E;&#x538B;&#x7F29;&#x516C;&#x94A5;&#x548C;&#x5730;&#x5740;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5B9E;&#x73B0;&#x4E86;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5C06;&#x4F1A;&#x5728;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x4E2D;&#x4F7F;&#x7528;&#x8BE5;&#x538B;&#x683C;&#x5F0F;&#x7F29;&#x516C;&#x94A5;&#x3002;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x79C1;&#x94A5;&#x5C06;&#x4F1A;&#x88AB;&#x7528;&#x6765;&#x5728;&#x66F2;&#x7EBF;&#x4E0A;&#x751F;&#x6210;&#x516C;&#x94A5;&#x70B9;&#xFF0C;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x70B9;&#x5C06;&#x4F1A;&#x88AB;&#x538B;&#x7F29;&#x3002;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7136;&#x540E;&#x88AB;&#x7528;&#x6765;&#x751F;&#x6210;&#x4EA4;&#x6613;&#x4E2D;&#x4F7F;&#x7528;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x5F53;&#x4ECE;&#x4E00;&#x4E2A;&#x5B9E;&#x73B0;&#x4E86;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x516C;&#x94A5;&#x7684;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5BFC;&#x51FA;&#x79C1;&#x94A5;&#x65F6;&#xFF0C;&#x94B1;&#x5305;&#x5BFC;&#x5165;&#x683C;&#x5F0F;&#xFF08;WIF&#xFF09;&#x5C06;&#x4F1A;&#x88AB;&#x4FEE;&#x6539;&#x4E3A;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#xFF0C;&#x8BE5;&#x683C;&#x5F0F;&#x5C06;&#x4F1A;&#x5728;&#x79C1;&#x94A5;&#x7684;&#x540E;&#x9762;&#x9644;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x540E;&#x7F00;01&#x3002;&#x6700; &#x7EC8;&#x7684;Base58Check&#x7F16;&#x7801;&#x683C;&#x5F0F;&#x7684;&#x79C1;&#x94A5;&#x88AB;&#x79F0;&#x4F5C;WIF&#xFF08;&#x201C;&#x538B;&#x7F29;&#x201D;&#xFF09;&#x79C1;&#x94A5;&#xFF0C;&#x4EE5;&#x5B57;&#x6BCD;&#x201C;K&#x201D;&#x6216;&#x201C;L&#x201D;&#x5F00;&#x5934;&#x3002;&#x800C;&#x4EE5;&#x201C;5&#x201D;&#x5F00;&#x5934;&#x7684;&#x662F;&#x4ECE;&#x8F83;&#x8001;&#x7684;&#x94B1;&#x5305;&#x4E2D; &#x4EE5;WIF&#xFF08;&#x975E;&#x538B;&#x7F29;&#xFF09;&#x683C;&#x5F0F;&#x5BFC;&#x51FA;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>  &#x201C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x79C1;&#x94A5;&#x201D;&#x662F;&#x4E00;&#x4E2A;&#x4E0D;&#x5F53;&#x7528;&#x8BCD;&#xFF01;&#x79C1;&#x94A5;&#x4E0D;&#x662F;&#x538B;&#x7F29;&#x7684;&#x3002;WIF&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x7684;&#x79C1;&#x94A5;&#x53EA;&#x662F;&#x7528;&#x6765;&#x8868;&#x660E;&#x4ED6;&#x4EEC;&#x53EA;&#x80FD;&#x88AB;&#x751F;&#x6210;&#x538B;&#x7F29;&#x7684;&#x516C;&#x94A5;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x76F8;&#x53CD;&#x5730;&#xFF0C;&#x201C;WIF&#x538B;&#x7F29;&#x201D;&#x7F16;&#x7801;&#x7684;&#x79C1;&#x94A5;&#x8FD8;&#x591A;&#x51FA;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x79C1;&#x94A5;&#x591A;&#x4E86;&#x540E;&#x7F00;&#x201C;01&#x201D;&#x3002;&#x8BE5;&#x540E;&#x7F00;&#x662F;&#x7528;&#x6765;&#x533A;&#x5206;&#x201C;&#x975E;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x201D;&#x79C1;&#x94A5;&#x548C;&#x201C;&#x538B;&#x7F29;&#x683C;&#x5F0F;&#x201D;&#x79C1;&#x94A5;&#x3002;</p>
<h2 id="43-&#x7528;python&#x5B9E;&#x73B0;&#x5BC6;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;">4.3 &#x7528;Python&#x5B9E;&#x73B0;&#x5BC6;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;</h2>
<p>&#x6700;&#x5168;&#x9762;&#x7684;&#x6BD4;&#x7279;&#x5E01;Python&#x5E93;&#x662F; Vitalik Buterin&#x5199;&#x7684; pybitcointools&#x3002;&#x5728;&#x4F8B;4-5&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;pybitcointools&#x5E93;&#xFF08;&#x5BFC;&#x5165; &#x4E3A;&#x201C;bitcoin&#x201D;&#xFF09;&#x6765;&#x751F;&#x6210;&#x548C;&#x663E;&#x793A;&#x4E0D;&#x540C;&#x683C;&#x5F0F;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p>&#x4F8B;4-5 &#x4F7F;&#x7528;pybitcointools&#x5E93;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x751F;&#x6210;&#x548C;&#x683C;&#x5F0F;&#x5316;&#x8FC7;</p>
<p>code/key-to-address-ecc-example.py[]</p>
<p>&#x4F8B;4-6 &#x4E0A;&#x4F8B;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$ python key-to-address-ecc-example.py</p>
<p>Private Key (hex) is:</p>
<p> 3aba4162c7251c891207b747840551a71939b0de081f85c4e44cf7c13e41daa6</p>
<p>Private Key (decimal) is:</p>
<p> 26563230048437957592232553826663696440606756685920117476832299673293013768870</p>
<p>Private Key (WIF) is:</p>
<p> 5JG9hT3beGTJuUAmCQEmNaxAuMacCTfXuw1R3FCXig23RQHMr4K</p>
<p>Private Key Compressed (hex) is:</p>
<p> 3aba4162c7251c891207b747840551a71939b0de081f85c4e44cf7c13e41daa601</p>
<p>Private Key (WIF-Compressed) is:</p>
<p> KyBsPXxTuVD82av65KZkrGrWi5qLMah5SdNq6uftawDbgKa2wv6S</p>
<p>Public Key (x,y) coordinates is:</p>
<p> (41637322786646325214887832269588396900663353932545912953362782457239403430124L,
 16388935128781238405526710466724741593761085120864331449066658622400339362166L)</p>
<p>Public Key (hex) is:</p>
<p> 045c0de3b9c8ab18dd04e3511243ec2952002dbfadc864b9628910169d9b9b00ec&#x21B5;
243bcefdd4347074d44bd7356d6a53c495737dd96295e2a9374bf5f02ebfc176</p>
<p>Compressed Public Key (hex) is:</p>
<p> 025c0de3b9c8ab18dd04e3511243ec2952002dbfadc864b9628910169d9b9b00ec</p>
<p>Bitcoin Address (b58check) is:</p>
<p> 1thMirt546nngXqyPEz532S8fLwbozud8</p>
<p>Compressed Bitcoin Address (b58check) is:
 14cxpo3MBCYYWCgF74SWTdcmxipnGUsPw3</p>
<p>&#x4F8B;4-7&#x662F;&#x53E6;&#x5916;&#x4E00;&#x4E2A;&#x793A;&#x4F8B;&#xFF0C;&#x4F7F;&#x7528;&#x7684;&#x662F;Python ECDSA&#x5E93;&#x6765;&#x505A;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x8BA1;&#x7B97;&#x800C;&#x975E;&#x4F7F;&#x7528;bitcoin&#x7684;&#x5E93;&#x3002;</p>
<p>code/ec-math.py[]</p>
<p>&#x4F8B;4-8&#x662F;&#x4E0A;&#x8FF0;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x6CE8;&#x610F;&#xFF1A;
\  Install Python PIP package manager</p>
<p>$ sudo apt-get install python-pip</p>
<p>\Install the Python ECDSA library</p>
<p>$ sudo pip install ecdsa</p>
<p>\ Run the script</p>
<p>$ python ec-math.py</p>
<p>Secret:  38090835015954358862481132628887443905906204995912378278060168703580660294000
EC point: (70048853531867179489857750497606966272382583471322935454624595540007269312627, 105262206478686743191060800263479589329920209527285803935736021686045542353380)</p>
<p>BTC public key: 029ade3effb0a67d5c8609850d797366af428f4a0d5194cb221d807770a1522873</p>
<h2 id="44-&#x9AD8;&#x7EA7;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;">4.4 &#x9AD8;&#x7EA7;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;</h2>
<p>&#x5728;&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x9AD8;&#x7EA7;&#x5F62;&#x5F0F;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#xFF0C;&#x8BF8;&#x5982;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x3001;&#x811A;&#x672C;&#x548C;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#xFF0C;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x548C;&#x7EB8;&#x94B1;&#x5305;&#x3002;</p>
<h3 id="441-&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#xFF08;bip0038&#xFF09;">4.4.1 &#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#xFF08;BIP0038&#xFF09;</h3>
<p>&#x79C1;&#x94A5;&#x5FC5;&#x987B;&#x4FDD;&#x5BC6;&#x3002;&#x79C1;&#x94A5;&#x7684;&#x673A;&#x5BC6;&#x6027;&#x9700;&#x6C42;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x76F8;&#x5F53;&#x96BE;&#x4EE5;&#x5B9E;&#x73B0;&#xFF0C;&#x56E0;&#x4E3A;&#x8BE5;&#x9700;&#x6C42;&#x4E0E;&#x540C;&#x6837;&#x91CD;&#x8981;&#x7684;&#x5B89;&#x5168;&#x5BF9;&#x8C61;&#x53EF;&#x7528;&#x6027;&#x76F8;&#x4E92;&#x77DB;&#x76FE;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x79C1;&#x94A5;&#x4E22;&#x5931;&#x800C;&#x5B58;&#x50A8;&#x5907;&#x4EFD;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x73B0;&#x7EF4;&#x62A4;&#x79C1;&#x94A5;&#x79C1;&#x5BC6;&#x6027;&#x662F;&#x4E00;&#x4EF6;&#x76F8;&#x5F53;&#x56F0;&#x96BE;&#x7684;&#x4E8B;&#x60C5;&#x3002;&#x901A;&#x8FC7;&#x5BC6;&#x7801;&#x52A0;&#x5BC6;&#x5B58;&#x6709;&#x79C1;&#x94A5;&#x7684;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x8981;&#x5B89;&#x5168;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x90A3;&#x4E2A;&#x94B1;&#x5305;&#x4E5F;&#x9700;&#x8981;&#x5907;&#x4EFD;&#x3002;&#x6709;&#x65F6;&#xFF0C;&#x4F8B;&#x5982;&#x7528;&#x6237;&#x56E0;&#x4E3A;&#x8981;&#x5347;&#x7EA7;&#x6216;&#x91CD;&#x88C5;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#xFF0C;&#x800C;&#x9700;&#x8981;&#x628A;&#x5BC6;&#x94A5;&#x4ECE;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x8F6C;&#x79FB;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x3002;&#x79C1;&#x94A5;&#x5907;&#x4EFD;&#x4E5F;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x5728;&#x7EB8;&#x5F20;&#x4E0A;&#xFF08;&#x53C2;&#x89C1;&#x201C;&#x540E;&#x9762;&#x7EB8;&#x94B1;&#x5305;&#x201D;&#x4E00;&#x8282;&#xFF09;&#x6216;&#x8005;&#x5916;&#x90E8;&#x5B58;&#x50A8;&#x4ECB;&#x8D28;&#x91CC;&#xFF0C;&#x6BD4;&#x5982;U&#x76D8;&#x3002;&#x4F46;&#x5982;&#x679C;&#x4E00;&#x65E6;&#x5907;&#x4EFD;&#x6587;&#x4EF6;&#x5931;&#x7A83;&#x6216;&#x4E22;&#x5931;&#x5462;&#xFF1F;&#x8FD9;&#x4E9B;&#x77DB;&#x76FE;&#x7684;&#x5B89;&#x5168;&#x76EE;&#x6807;&#x63A8;&#x8FDB;&#x4E86;&#x4FBF;&#x643A;&#x3001;&#x65B9;&#x4FBF;&#x3001;&#x53EF;&#x4EE5;&#x88AB;&#x4F17;&#x591A;&#x4E0D;&#x540C;&#x94B1;&#x5305;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x7406;&#x89E3;&#x7684;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x6807;&#x51C6;BIP0038&#x7684;&#x51FA;&#x53F0;&#xFF08;BIP-38&#x8BE6;&#x7EC6;&#x53EF;&#x53C2;&#x89C1;&#x9644;&#x5F55;&#x90E8;&#x5206;&#xFF09;&#x3002;</p>
<p>BIP0038&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x6807;&#x51C6;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x53E3;&#x4EE4;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x5E76;&#x4F7F;&#x7528;Base58Check&#x5BF9;&#x52A0;&#x5BC6;&#x7684;&#x79C1;&#x94A5;&#x8FDB;&#x884C;&#x7F16;&#x7801;&#xFF0C;&#x8FD9;&#x6837;&#x52A0;&#x5BC6;&#x7684;&#x79C1;&#x94A5;&#x5C31;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x4FDD;&#x5B58;&#x5728;&#x5907;&#x4EFD;&#x4ECB;&#x8D28;&#x91CC;&#xFF0C;&#x5B89;&#x5168;&#x5730;&#x5728;&#x94B1;&#x5305;&#x95F4;&#x4F20;&#x8F93;&#xFF0C;&#x4FDD;&#x6301;&#x5BC6;&#x94A5;&#x5728;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x88AB;&#x66B4;&#x9732;&#x60C5;&#x51B5;&#x4E0B;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;&#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x6807;&#x51C6;&#x4F7F; &#x7528;&#x4E86;AES&#xFF0C;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x7531;NIST&#x5EFA;&#x7ACB;&#xFF0C;&#x5E76;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E8E;&#x5546;&#x4E1A;&#x548C;&#x519B;&#x4E8B;&#x5E94;&#x7528;&#x7684;&#x6570;&#x636E;&#x52A0;&#x5BC6;&#x3002;</p>
<p>BIP0038&#x52A0;&#x5BC6;&#x65B9;&#x6848;&#x662F;&#xFF1A;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#xFF0C;&#x901A;&#x5E38;&#x4F7F;&#x7528;WIF&#x7F16;&#x7801;&#x8FC7;&#xFF0C;base58chek&#x5B57;&#x7B26;&#x4E32;&#x7684;&#x524D;&#x7F00;&#x201C;5&#x201D;&#x3002;&#x6B64;&#x5916;BIP0038&#x52A0;&#x5BC6;&#x65B9;&#x6848;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x957F;&#x5BC6;&#x7801;&#x4F5C;&#x4E3A;&#x53E3;&#x4EE4;&#xFF0C;&#x901A;&#x5E38;&#x7531;&#x591A;&#x4E2A;&#x5355;&#x8BCD;&#x6216;&#x4E00;&#x6BB5;&#x590D;&#x6742;&#x7684;&#x6570;&#x5B57;&#x5B57;&#x6BCD;&#x5B57;&#x7B26;&#x4E32;&#x7EC4;&#x6210;&#x3002;BIP0038&#x52A0;&#x5BC6;&#x65B9;&#x6848;&#x7684;&#x7ED3;&#x679C;&#x662F;&#x4E00;&#x4E2A;&#x7531; base58check&#x7F16;&#x7801;&#x8FC7;&#x7684;&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#xFF0C;&#x524D;&#x7F00;&#x4E3A;6P&#x3002;&#x5982;&#x679C;&#x4F60;&#x770B;&#x5230;&#x4E00;&#x4E2A;6P&#x5F00;&#x5934;&#x7684;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x5BC6;&#x94A5;&#x662F;&#x88AB;&#x52A0;&#x5BC6;&#x8FC7;&#xFF0C;&#x5E76;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x53E3;&#x4EE4;&#x6765;&#x8F6C;&#x6362;&#xFF08;&#x89E3;&#x7801;&#xFF09;&#x8BE5;&#x5BC6;&#x94A5;&#x56DE;&#x5230;&#x53EF;&#x88AB;&#x7528;&#x5728;&#x4EFB;&#x4F55;&#x94B1;&#x5305;WIF&#x683C;&#x5F0F;&#x7684;&#x79C1;&#x94A5;&#xFF08;&#x524D;&#x7F00;&#x4E3A;5&#xFF09;&#x3002;&#x8BB8;&#x591A;&#x94B1;&#x5305;APP&#x73B0;&#x5728;&#x80FD;&#x591F;&#x8BC6;&#x522B; BIP0038&#x52A0;&#x5BC6;&#x8FC7;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x4F1A;&#x8981;&#x6C42;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x53E3;&#x4EE4;&#x89E3;&#x7801;&#x5E76;&#x5BFC;&#x5165;&#x5BC6;&#x94A5;&#x3002;&#x7B2C;&#x4E09;&#x65B9;APP&#xFF0C;&#x8BF8;&#x5982;&#x975E;&#x5E38;&#x597D;&#x7528;&#x57FA;&#x4E8E;&#x6D4F;&#x89C8;&#x5668;&#x7684;<a href="http://bitaddress.org/" target="_blank">Bit Address</a> &#xFF0C; &#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x89E3;&#x7801;BIP00038&#x7684;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x6700;&#x901A;&#x5E38;&#x4F7F;&#x7528;BIP0038&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x94A5;&#x7528;&#x4F8B;&#x662F;&#x7EB8;&#x94B1;&#x5305;&#x2014;&#x2014;&#x4E00;&#x5F20;&#x7EB8;&#x5F20;&#x4E0A;&#x5907;&#x4EFD;&#x79C1;&#x94A5;&#x3002;&#x53EA;&#x8981;&#x7528;&#x6237;&#x9009;&#x62E9;&#x4E86;&#x5F3A;&#x53E3;&#x4EE4;&#xFF0C;&#x4F7F;&#x7528;BIP0038&#x52A0;&#x5BC6;&#x7684;&#x79C1;&#x94A5;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x5C31;&#x65E0;&#x6BD4;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x4E00;&#x79CD;&#x5F88;&#x68D2;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x79BB;&#x7EBF;&#x5B58;&#x50A8;&#x65B9;&#x5F0F;&#xFF08;&#x4E5F;&#x88AB;&#x79F0;&#x4F5C;&#x201C;&#x51B7;&#x5B58;&#x50A8;&#x201D;&#xFF09;&#x3002;</p>
<p>&#x5728;bitaddress.org&#x4E0A;&#x6D4B;&#x8BD5;&#x8868;4-5&#x4E2D;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#xFF0C;&#x770B;&#x770B;&#x5982;&#x4F55;&#x8F93;&#x5165;&#x5BC6;&#x7801;&#x4EE5;&#x5F97;&#x5230;&#x52A0;&#x5BC6;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x8868;4-5 BIP0038&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x4F8B;&#x5B50;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-53ab728fe9ad49fc.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-5 BIP0038&#x52A0;&#x5BC6;&#x79C1;&#x94A5;&#x4F8B;&#x5B50;"></p>
<h3 id="442-p2sh-pay-to-script-hash&#x548C;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;">4.4.2 P2SH (Pay-to-Script Hash)&#x548C;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;</h3>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x6240;&#x77E5;&#xFF0C;&#x4F20;&#x7EDF;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4ECE;&#x6570;&#x5B57;1&#x5F00;&#x5934;&#xFF0C;&#x6765;&#x6E90;&#x4E8E;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x516C;&#x94A5;&#x6765;&#x6E90;&#x4E8E;&#x79C1;&#x94A5;&#x3002;&#x867D;&#x7136;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230; &#x4E00;&#x4E2A;1&#x5F00;&#x5934;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4F46;&#x6BD4;&#x7279;&#x5E01;&#x53EA;&#x80FD;&#x5728;&#x901A;&#x8FC7;&#x76F8;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#x7B7E;&#x540D;&#x548C;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x503C;&#x540E;&#x624D;&#x80FD;&#x6D88;&#x8D39;&#x3002;</p>
<p>&#x4EE5;&#x6570;&#x5B57;3&#x5F00;&#x5934;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x662F;P2SH&#x5730;&#x5740;&#xFF0C;&#x6709;&#x65F6;&#x88AB;&#x9519;&#x8BEF;&#x7684;&#x79F0;&#x8C13;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x6216;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#x3002;&#x4ED6;&#x4EEC;&#x6307;&#x5B9A;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x53D7;&#x76CA;&#x4EBA;&#x4E3A;&#x54C8;&#x5E0C;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x516C;&#x94A5;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x5728;2012&#x5E74;1&#x6708;&#x7531;BIP0016&#x5F15;&#x8FDB;&#xFF0C;&#x76EE;&#x524D;&#x56E0;&#x4E3A;BIP0016&#x63D0;&#x4F9B;&#x4E86;&#x589E;&#x52A0;&#x529F;&#x80FD;&#x5230;&#x5730;&#x5740;&#x672C;&#x8EAB;&#x7684;&#x673A;&#x4F1A;&#x800C;&#x88AB;&#x5E7F;&#x6CDB;&#x7684;&#x91C7;&#x7EB3;&#x3002;&#x4E0D;&#x540C;&#x4E8E;P2PKH&#x4EA4;&#x6613;&#x53D1;&#x9001;&#x8D44;&#x91D1;&#x5230;&#x4F20;&#x7EDF;1&#x5F00;&#x5934;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x8D44;&#x91D1;&#x88AB;&#x53D1;&#x9001;&#x5230;3&#x5F00;&#x5934;&#x7684;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x9700;&#x8981;&#x7684;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x548C;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x7B7E;&#x540D;&#x4F5C;&#x4E3A;&#x6240;&#x6709;&#x8005;&#x8BC1;&#x660E;&#x3002;&#x5728;&#x521B;&#x5EFA;&#x5730;&#x5740;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x4F1A;&#x88AB;&#x6307;&#x5B9A;&#x5728;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x6240;&#x6709;&#x5BF9;&#x5730;&#x5740;&#x7684;&#x8F93;&#x5165;&#x90FD;&#x4F1A;&#x88AB;&#x8FD9;&#x4E9B;&#x8981;&#x6C42;&#x963B;&#x9694;&#x3002;</p>
<p>&#x4E00;&#x4E2A;P2SH&#x5730;&#x5740;&#x4ECE;&#x4EA4;&#x6613;&#x811A;&#x672C;&#x4E2D;&#x521B;&#x5EFA;&#xFF0C;&#x5B83;&#x5B9A;&#x4E49;&#x8C01;&#x80FD;&#x6D88;&#x8017;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF08;&#x540E;&#x9762;&#x201C;P2SH&#xFF08;Pay-to-Script-Hash&#xFF09;&#x201D;&#x4E00;&#x8282;&#x5BF9;&#x6B64;&#x6709; &#x8BE6;&#x7EC6;&#x7684;&#x4ECB;&#x7ECD;&#xFF09;&#x3002;&#x7F16;&#x7801;&#x4E00;&#x4E2A;P2SH&#x5730;&#x5740;&#x6D89;&#x53CA;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x5728;&#x521B;&#x5EFA;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7528;&#x5230;&#x8FC7;&#x7684;&#x53CC;&#x91CD;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x80FD;&#x5E94;&#x7528;&#x5728;&#x811A;&#x672C;&#x800C;&#x4E0D;&#x662F;&#x516C;&#x94A5;&#xFF1A;</p>
<p> script hash = RIPEMD160(SHA256(script)) </p>
<p>&#x4EA7;&#x751F;&#x7684;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x7531;Base58Check&#x7F16;&#x7801;&#x524D;&#x7F00;&#x4E3A;5&#x7684;&#x7248;&#x672C;&#x3001;&#x7F16;&#x7801;&#x540E;&#x5F97;&#x5230;&#x5F00;&#x5934;&#x4E3A;3&#x7684;&#x7F16;&#x7801;&#x5730;&#x5740;&#x3002;&#x4E00;&#x4E2A;P2SH&#x5730;&#x5740;&#x4F8B;&#x5B50;&#x662F; 3F6i6kwkevjR7AsAd4te2YB2zZyASEm1HM&#x3002;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;Bitcoin Explorer&#x547D;&#x4EE4;&#x811A;&#x672C;&#x7F16;&#x7801;&#x83B7;&#x5F97;&#xFF0C;&#x6BD4;&#x5982;sha256, ripemd160, and base58check-encode&#xFF0C;&#x4E3E;&#x4F8B;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>$ echo dup hash160 [ 89abcdefabbaabbaabbaabbaabbaabbaabbaabba ] equalverify checksig &gt; script</p>
<p>$ bx script-encode &lt; script | bx sha256 | bx ripemd160 | bx base58check-encode --version 5</p>
<p>3F6i6kwkevjR7AsAd4te2YB2zZyASEm1HM</p>
<p><strong>&#x63D0;&#x793A;</strong>P2SH &#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x867D;&#x7136;P2SH&#x5730;&#x5740;&#x901A;&#x5E38;&#x90FD;&#x662F;&#x4EE3;&#x8868;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x7F16;&#x7801;&#x5176;&#x4ED6;&#x7C7B;&#x578B;&#x7684;&#x4EA4;&#x6613;&#x811A;&#x672C;&#x3002;</p>
<h4 id="4421-&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#x548C;p2sh">4.4.2.1 &#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#x548C;P2SH</h4>
<p>&#x76EE;&#x524D;&#xFF0C;P2SH&#x51FD;&#x6570;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x5B9E;&#x73B0;&#x662F;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#x811A;&#x672C;&#x3002;&#x987E;&#x540D;&#x601D;&#x4E49;&#xFF0C;&#x5E95;&#x5C42;&#x811A;&#x672C;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x7B7E;&#x540D;&#x6765;&#x8BC1;&#x660E;&#x6240;&#x6709;&#x6743;&#xFF0C;&#x6B64;&#x540E;&#x624D;&#x80FD;&#x6D88;&#x8D39;&#x8D44;&#x91D1;&#x3002;&#x8BBE;&#x8BA1;&#x6BD4;&#x7279;&#x5E01;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7279;&#x6027;&#x662F;&#x9700;&#x8981;&#x4ECE;&#x603B;&#x5171;N&#x4E2A;&#x5BC6;&#x94A5;&#x4E2D;&#x9700;&#x8981;M&#x4E2A;&#x7B7E;&#x540D;&#xFF08;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x9608;&#x503C;&#x201D;&#xFF09;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;M-N&#x591A;&#x7B7E;&#x540D;&#xFF0C;&#x5176; &#x4E2D;M&#x662F;&#x7B49;&#x4E8E;&#x6216;&#x5C0F;&#x4E8E;N&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x5496;&#x5561;&#x5E97;&#x4E3B;Bob&#x4F7F;&#x7528;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#x9700;&#x8981;1-2&#x7B7E;&#x540D;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x5C5E;&#x4E8E;&#x4ED6;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x4E00;&#x4E2A;&#x5C5E;&#x4E8E;&#x4ED6;&#x540C;&#x4F34;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5176;&#x4E2D;&#x4E00;&#x65B9;&#x53EF;&#x4EE5;&#x7B7E;&#x7F72;&#x6D88;&#x8D39;&#x4E00;&#x7B14;&#x9501;&#x5B9A;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x201C;&#x8054;&#x5408;&#x8D26;&#x6237;&#x201D;&#xFF0C;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x914D;&#x5076;&#x53EF;&#x4EE5;&#x5355;&#x72EC;&#x7B7E;&#x5355;&#x6D88;&#x8D39;&#x3002;&#x6216;&#x5C31;&#x50CF;Bob&#x96C7;&#x4F63;&#x7684;&#x7F51;&#x9875;&#x8BBE;&#x8BA1;&#x5E08;Gopesh&#xFF0C; &#x521B;&#x7ACB;&#x4E00;&#x4E2A;&#x7F51;&#x7AD9;&#xFF0C;&#x53EF;&#x80FD;&#x4E3A;&#x4ED6;&#x7684;&#x4E1A;&#x52A1;&#x9700;&#x8981;&#x4E00;&#x4E2A;2-3&#x7684;&#x591A;&#x7B7E;&#x540D;&#x5730;&#x5740;&#xFF0C;&#x786E;&#x4FDD;&#x9664;&#x975E;&#x81F3;&#x5C11;&#x4E24;&#x4E2A;&#x4E1A;&#x52A1;&#x5408;&#x4F5C;&#x4F19;&#x4F34;&#x7B7E;&#x7F72;&#x7B7E;&#x540D;&#x4EA4;&#x6613;&#x624D;&#x53EF;&#x4EE5;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#x6D88;&#x8D39;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x5728;&#x7B2C;&#x4E94;&#x7AE0;&#x8282;&#x63A2;&#x7D22;&#x5982;&#x4F55;&#x4F7F;&#x7528;P2SH&#x5730;&#x5740;&#x521B;&#x5EFA;&#x4EA4;&#x6613;&#x7528;&#x6765;&#x6D88;&#x8D39;&#x8D44;&#x91D1;&#x3002;</p>
<h3 id="443-&#x6BD4;&#x7279;&#x5E01;&#x9753;&#x53F7;&#x5730;&#x5740;">4.4.3 &#x6BD4;&#x7279;&#x5E01;&#x9753;&#x53F7;&#x5730;&#x5740;</h3>
<p>&#x9753;&#x53F7;&#x5730;&#x5740;&#x5305;&#x542B;&#x4E86;<strong>&#x4EBA;&#x7C7B;</strong>&#x53EF;&#x8BFB;&#x4FE1;&#x606F;&#x7684;&#x6709;&#x6548;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x4F8B;&#x5982;&#xFF0C;1LoveBPzzD72PUXLzCkYAtGFYmK5vYNR33&#x5C31;&#x662F;&#x5305;&#x542B;&#x4E86;Base-58 &#x5B57;&#x6BCD;love&#x7684;&#x3002;&#x9753;&#x53F7;&#x5730;&#x5740;&#x9700;&#x8981;&#x751F;&#x6210;&#x5E76;&#x901A;&#x8FC7;&#x6570;&#x5341;&#x4EBF;&#x7684;&#x5019;&#x9009;&#x79C1;&#x94A5;&#x6D4B;&#x8BD5;&#xFF0C;&#x76F4;&#x5230;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#x80FD;&#x751F;&#x6210;&#x5177;&#x6709;&#x6240;&#x9700;&#x56FE;&#x6848;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x867D;&#x7136;&#x6709;&#x4E00;&#x4E9B;&#x4F18;&#x5316;&#x8FC7;&#x7684;&#x9753;&#x53F7;&#x751F;&#x6210;&#x7B97;&#x6CD5;&#xFF0C;&#x8BE5;&#x65B9;&#x6CD5;&#x5FC5;&#x987B;&#x6D89;&#x53CA;&#x968F;&#x673A;<del>&#x4E0A;</del>&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x751F;&#x6210;&#x516C;&#x94A5;&#xFF0C;&#x518D;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x662F;&#x5426;&#x4E0E;&#x6240;&#x8981;&#x7684;&#x9753;&#x53F7;&#x56FE;&#x6848;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x91CD;&#x590D;&#x6570;&#x5341;&#x4EBF;&#x6B21;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x6240;&#x8981;&#x56FE;&#x6848;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x6765;&#x81EA;&#x8FD9;&#x4E2A;&#x9753;&#x53F7;&#x5730;&#x5740;&#x7684;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x548C;&#x5176;&#x4ED6;&#x5730;&#x5740;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x88AB;&#x62E5;&#x6709;&#x8005;&#x6D88;&#x8D39;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x9753;&#x53F7;&#x5730;&#x5740;&#x4E0D;&#x6BD4;&#x5176;&#x4ED6;&#x5730;&#x5740;&#x5177;&#x6709;&#x66F4;&#x591A;&#x6216;&#x66F4;&#x5C11;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5B83;&#x4EEC;&#x4F9D;&#x9760;&#x548C;&#x5176;&#x4ED6;&#x5730;&#x5740;&#x76F8;&#x540C;&#x7684;ECC&#x548C;SHA&#x3002;&#x4F60;&#x65E0;&#x6CD5;&#x6BD4;&#x4EFB;&#x4F55;&#x522B;&#x7684;&#x5730;&#x5740;&#x66F4;&#x5BB9;&#x6613;&#x7684;&#x83B7;&#x5F97;&#x4E00;&#x4E2A;&#x9753;&#x53F7;&#x56FE;&#x6848;&#x5F00;&#x5934;&#x7684;&#x5730;&#x5740;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E00;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;Eugenia&#xFF0C;&#x4E00;&#x4F4D;&#x5728;&#x83F2;&#x5F8B;&#x5BBE;&#x5DE5;&#x4F5C;&#x7684;&#x513F;&#x7AE5;&#x6148;&#x5584;&#x603B;&#x76D1;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;Eugenia&#x7EC4;&#x7EC7;&#x4E86;&#x4E00;&#x573A;&#x6BD4;&#x7279;&#x5E01;&#x52DF;&#x6350;&#x6D3B;&#x52A8;&#xFF0C;&#x5E76;&#x5E0C;&#x671B;&#x4F7F;&#x7528;&#x9753;&#x53F7;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x6765;&#x5BA3;&#x4F20;&#x8FD9;&#x4E2A;&#x52DF;&#x6350;&#x6D3B;&#x52A8;&#x3002;Eugenia&#x5C06;&#x4F1A;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x4EE5;1Kids&#x5F00;&#x5934;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#x6765;&#x4FC3;&#x8FDB;&#x513F;&#x7AE5;&#x6148;&#x5584;&#x52DF;&#x6350;&#x7684;&#x6D3B;&#x52A8;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x8FD9;&#x4E2A;&#x9753;&#x53F7;&#x5730;&#x5740;&#x5982;&#x4F55;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x8FD9;&#x4E2A;&#x9753;&#x53F7;&#x5730;&#x5740;&#x5BF9;Eugenia&#x6148;&#x5584;&#x52DF;&#x6350;&#x7684;&#x5B89;&#x5168;&#x6027;&#x53C8;&#x610F;&#x5473;&#x7740;&#x4EC0;&#x4E48;&#x3002;</p>
<h4 id="4431-&#x751F;&#x6210;&#x9753;&#x53F7;&#x5730;&#x5740;">4.4.3.1 &#x751F;&#x6210;&#x9753;&#x53F7;&#x5730;&#x5740;</h4>
<p>&#x8BA4;&#x8BC6;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E0D;&#x8FC7;&#x662F;&#x7531;Base58&#x5B57;&#x6BCD;&#x4EE3;&#x8868;&#x7684;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#x662F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x3002;&#x641C;&#x7D22;&#x201C;1kids&#x201D;&#x5F00;&#x5934;&#x7684;&#x56FE;&#x6848;&#x6211;&#x4EEC;&#x4F1A;&#x53D1; &#x73B0;&#x4ECE;1Kids11111111111111111111111111111&#x5230;1Kidszzzzzzzzzzzzzzzzzzzzzzzzzzzzz&#x7684;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E9B;&#x4EE5;&#x201C;1kid&#x201D;&#x5F00;&#x5934;&#x7684;&#x5730;&#x5740;&#x8303;&#x56F4;&#x4E2D;&#x5927;&#x7EA6;&#x6709;58&#x7684;29&#x6B21;&#x65B9;&#x5730;&#x5740;&#xFF08;1.4 * 10^51)&#xFF09;&#x3002;&#x8868;4-6&#x663E;&#x793A;&#x4E86;&#x8FD9;&#x4E9B;&#x6709;&#x201C;1kids&#x201D;&#x524D;&#x7F00;&#x7684;&#x5730;&#x5740;&#x3002;</p>
<p>&#x8868;4-6 &#x201C;1Kids&#x201D;&#x9753;&#x53F7;&#x7684;&#x8303;&#x56F4;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-109c9f3dd898136f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-6 &#x201C;1Kids&#x201D;&#x9753;&#x53F7;&#x7684;&#x8303;&#x56F4;"></p>
<p>&#x6211;&#x4EEC;&#x628A;&#x201C;1Kids&#x201D;&#x8FD9;&#x4E2A;&#x524D;&#x7F00;&#x5F53;&#x4F5C;&#x6570;&#x5B57;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E2D;&#x8FD9;&#x4E2A;&#x524D;&#x7F00;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#x3002;&#x5982;&#x679C;&#x662F;&#x4E00;&#x53F0;&#x666E;&#x901A;&#x6027;&#x80FD;&#x7684;&#x684C;&#x9762;&#x7535;&#x8111;&#xFF0C; &#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x7279;&#x6B8A;&#x7684;&#x786C;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x6BCF;&#x79D2;&#x641C;&#x7D22;&#x5927;&#x7EA6;10&#x4E07;&#x4E2A;&#x5BC6;&#x94A5;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-0dea5525924cc502.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-12 &#x9753;&#x53F7;&#x7684;&#x51FA;&#x73B0;&#x7684;&#x9891;&#x7387;&#xFF08;1KidsCharity&#xFF09;&#x4EE5;&#x53CA;&#x751F;&#x6210;&#x6240;&#x9700;&#x65F6;&#x95F4;"></p>
<p>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x89C1;&#xFF0C;Eugenia&#x5C06;&#x4E0D;&#x4F1A;&#x5F88;&#x5FEB;&#x5730;&#x521B;&#x5EFA;&#x51FA;&#x4EE5;&#x201C;1KidsCharity&#x201D;&#x5F00;&#x5934;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x5373;&#x4F7F;&#x5979;&#x6709;&#x6570;&#x5343;&#x53F0;&#x7684;&#x7535;&#x8111;&#x540C;&#x65F6;&#x8FDB;&#x884C;&#x8FD0;&#x7B97;&#x3002;&#x6BCF;&#x589E;&#x52A0;&#x4E00;&#x4E2A;&#x5B57;&#x7B26;&#x5C31;&#x4F1A;&#x589E;&#x52A0;58&#x500D;&#x7684;&#x8BA1;&#x7B97;&#x96BE;&#x5EA6;&#x3002;&#x8D85;&#x8FC7;&#x4E03;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x56FE;&#x6848;&#x901A;&#x5E38;&#x9700;&#x8981;&#x4E13;&#x7528;&#x7684;&#x786C;&#x4EF6;&#x624D;&#x80FD;&#x88AB;&#x627E;&#x51FA;&#xFF0C;&#x8B6C;&#x5982;&#x7528;&#x6237;&#x5B9A;&#x5236;&#x7684;&#x5177;&#x6709;&#x591A;&#x4E2A;&#x56FE;&#x5F62;&#x5904;&#x7406;&#x5355;&#x5143;&#xFF08;GPU&#xFF09;&#x7684;&#x53F0;&#x5F0F;&#x673A;&#x3002;&#x90A3;&#x4E9B;&#x901A;&#x5E38;&#x662F;&#x65E0;&#x6CD5;&#x7EE7;&#x7EED;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x4E2D;&#x76C8;&#x5229;&#x7684;&#x94BB;&#x673A;&#xFF0C;&#x88AB;&#x91CD;&#x65B0;&#x8D4B;&#x4E88;&#x4E86;&#x5BFB;&#x627E;&#x9753;&#x53F7;&#x5730; &#x5740;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x7528;GPU&#x7CFB;&#x7EDF;&#x641C;&#x7D22;&#x9753;&#x53F7;&#x7684;&#x901F;&#x5EA6;&#x6BD4;&#x7528;&#x901A;&#x7528;CPU&#x8981;&#x5FEB;&#x5F88;&#x591A;&#x4E2A;&#x91CF;&#x7EA7;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x5BFB;&#x627E;&#x9753;&#x53F7;&#x5730;&#x5740;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x5C06;&#x5DE5;&#x4F5C;&#x5916;&#x5305;&#x7ED9;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x91CC;&#x7684;&#x9753;&#x53F7;&#x77FF;&#x5DE5;&#x4EEC;&#xFF0C;&#x5982;&#x9753;&#x53F7;&#x77FF;&#x6C60;&#x4E2D;&#x7684;&#x77FF;&#x6C60;&#x3002;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x662F;&#x4E00;&#x79CD;&#x5141;&#x8BB8;&#x90A3;&#x4E9B; GPU&#x786C;&#x4EF6;&#x901A;&#x8FC7;&#x4E3A;&#x4ED6;&#x4EBA;&#x5BFB;&#x627E;&#x9753;&#x53F7;&#x5730;&#x5740;&#x6765;&#x83B7;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x670D;&#x52A1;&#x3002;&#x5BF9;&#x5C0F;&#x989D;&#x7684;&#x8D26;&#x5355;&#xFF0C;Eugenia&#x53EF;&#x4EE5;&#x5C06;&#x641C;&#x7D22;7&#x4F4D;&#x5B57;&#x7B26;&#x56FE;&#x6848;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#x7684;&#x5DE5;&#x4F5C;&#x5916;&#x5305;&#xFF0C;&#x5728;&#x51E0;&#x4E2A;&#x5C0F;&#x65F6;&#x5185;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x7528;&#x4E00;&#x4E2A;CPU&#x641C;&#x7D22;&#x4E0A;&#x51E0;&#x4E2A;&#x6708;&#x624D;&#x5F97;&#x5230;&#x7ED3;&#x679C;&#x3002;</p>
<p>&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x9753;&#x53F7;&#x5730;&#x5740;&#x662F;&#x4E00;&#x9879;&#x901A;&#x8FC7;&#x86EE;&#x529B;&#x7684;&#x8FC7;&#x7A0B;&#xFF1A;&#x5C1D;&#x8BD5;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x5BC6;&#x94A5;&#xFF0C;&#x68C0;&#x67E5;&#x751F;&#x6210;&#x7684;&#x5730;&#x5740;&#x662F;&#x5426;&#x548C;&#x6240;&#x9700;&#x7684;&#x56FE;&#x6848;&#x76F8;&#x5339;&#x914D;&#xFF0C;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x76F4;&#x5230;&#x6210;&#x529F;&#x627E;&#x5230;&#x4E3A;&#x6B62;&#x3002;&#x4F8B;4-9&#x662F;&#x4E2A;&#x9753;&#x53F7;&#x77FF;&#x5DE5;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x7528;C++&#x7A0B;&#x5E8F;&#x5199;&#x7684;&#x6765;&#x5BFB;&#x627E;&#x9753;&#x53F7;&#x5730;&#x5740;&#x7684;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x8FD0;&#x7528;&#x5230;&#x4E86;&#x6211;&#x4EEC;&#x5728;&#x201C;&#x5176;&#x4ED6;&#x66FF;&#x4EE3;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x8D44;&#x6599;&#x5E93;&#x3001;&#x5DE5;&#x5177;&#x5305;&#x201D;&#x4E00;&#x8282;&#x4ECB;&#x7ECD;&#x8FC7;&#x7684;libbitcoin&#x5E93;&#x3002;</p>
<p>&#x4F8B;4-9 &#x9753;&#x53F7;&#x6316;&#x6398;&#x7A0B;&#x5E8F;</p>
<p>code/vanity-miner.cpp[]</p>
<p><strong>&#x6CE8;&#x91CA;</strong>&#x7F16;&#x8BD1;&#x548C;&#x8FD0;&#x884C;&#x865A;&#x62DF;&#x77FF;&#x5DE5;&#x793A;&#x4F8B;&#x4F7F;&#x7528;std :: random_device&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;std :: random_device&#x662F;&#x5747;&#x5300;&#x5206;&#x5E03;&#x7684;&#x6574;&#x6570;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x4EA7;&#x751F;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x968F;&#x673A;&#x6570;&#xFF09;&#x3002; &#x6839;&#x636E;&#x5B9E;&#x65BD;&#x60C5;&#x51B5;&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53CD;&#x6620;&#x5E95;&#x5C42;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x7684;CSRNG&#x3002; &#x5728;&#x7C7B;&#x4F3C;Unix&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x5982;Linux&#xFF09;&#x4E2D;&#xFF0C;&#x5B83;&#x6765;&#x81EA;/ dev/urandom&#x3002; &#x8FD9;&#x91CC;&#x4F7F;&#x7528;&#x7684;&#x968F;&#x673A;&#x6570;&#x5B57;&#x751F;&#x6210;&#x5668;&#x7528;&#x4E8E;&#x6F14;&#x793A;&#xFF0C;&#x5E76;&#x4E0D;&#x9002;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x7EA7;&#x522B;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6CA1;&#x6709;&#x4EE5;&#x8DB3;&#x591F;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x9700;&#x8981;&#x7528;C&#x7F16;&#x8BD1;&#x5668;&#x94FE;&#x63A5;libbitcoin&#x5E93;&#xFF08;&#x6B64;&#x5E93;&#x9700;&#x8981;&#x63D0;&#x524D;&#x88C5;&#x5165;&#x8BE5;&#x7CFB;&#x7EDF;&#xFF09;&#x8FDB;&#x884C;&#x7F16;&#x8BD1;&#x3002;&#x53EF;&#x4EE5;&#x4E0D;&#x5E26;&#x53C2;&#x6570;&#x76F4;&#x63A5;&#x6267;&#x884C;vanity-miner&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6; &#xFF08;&#x53C2;&#x89C1;&#x4F8B;4-10&#xFF09;&#xFF0C;&#x5B83;&#x5C31;&#x4F1A;&#x5C1D;&#x8BD5;&#x627E;&#x5230;&#x4EE5;&#x201C;1kid&#x201D;&#x5F00;&#x5934;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#x3002;</p>
<p>&#x4F8B;4-10&#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;vanity-miner&#x7A0B;&#x5E8F;&#x793A;&#x4F8B;</p>
<p>\Compile the code with g++
$ g++ -o vanity-miner vanity-miner.cpp </p>
<p>$(pkg-config --cflags --libs libbitcoin)</p>
<p>\Run the example</p>
<p>$ ./vanity-miner</p>
<p>Found vanity address! 1KiDzkG4MxmovZryZRj8tK81oQRhbZ46YT
Secret: 57cc268a05f83a23ac9d930bc8565bac4e277055f4794cbd1a39e5e71c038f3f</p>
<p>\ Run it again for a different result</p>
<p>$ ./vanity-miner</p>
<p>Found vanity address! 1Kidxr3wsmMzzouwXibKfwTYs5Pau8TUFn
Secret: 7f65bbbbe6d8caae74a0c6a0d2d7b5c6663d71b60337299a1a2cf34c04b2a623</p>
<p>&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x547D;&#x4EE4;&#x67E5;&#x770B;&#x9700;&#x8981;&#x591A;&#x4E45;&#x624D;&#x80FD;&#x627E;&#x5230;&#x7ED3;&#x679C;</p>
<p>$ time ./vanity-miner
Found vanity address! 1KidPWhKgGRQWD5PP5TAnGfDyfWp5yceXM
Secret: 2a802e7a53d8aa237cd059377b616d2bfcfa4b0140bc85fa008f2d3d4b225349</p>
<p>real    0m8.868s
user    0m8.828s
sys    0m0.035s</p>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x8FD0;&#x884C;Unix&#x547D;&#x4EE4;&#x6240;&#x6D4B;&#x51FA;&#x7684;&#x8FD0;&#x884C;&#x65F6;&#x95F4;&#x6240;&#x793A;&#xFF0C;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x8981;&#x82B1;&#x51E0;&#x79D2;&#x949F;&#x6765;&#x627E;&#x51FA;&#x5339;&#x914D;&#x201C;kid&#x201D;&#x4E09;&#x4E2A;&#x5B57;&#x7B26;&#x6A21;&#x677F;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x5728;&#x6E90;&#x4EE3;&#x7801;&#x4E2D;&#x6539;&#x53D8;search&#x8FD9;&#x4E00;&#x641C;&#x7D22;&#x6A21;&#x677F;&#xFF0C;&#x770B;&#x4E00;&#x770B;&#x5982;&#x679C;&#x662F;&#x56DB;&#x4E2A;&#x5B57;&#x7B26;&#x6216;&#x8005;&#x4E94;&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x641C;&#x7D22;&#x6A21;&#x677F;&#x9700;&#x8981;&#x82B1;&#x591A;&#x4E45;&#x65F6;&#x95F4;&#xFF01;</p>
<h4 id="4432-&#x9753;&#x53F7;&#x5730;&#x5740;&#x5B89;&#x5168;&#x6027;">4.4.3.2 &#x9753;&#x53F7;&#x5730;&#x5740;&#x5B89;&#x5168;&#x6027;</h4>
<p>&#x9753;&#x53F7;&#x5730;&#x5740;&#x65E2;&#x53EF;&#x4EE5;&#x589E;&#x52A0;&#x3001;&#x4E5F;&#x53EF;&#x4EE5;&#x524A;&#x5F31;&#x5B89;&#x5168;&#x63AA;&#x65BD;&#xFF0C;&#x5B83;&#x4EEC;&#x7740;&#x5B9E;&#x662F;&#x4E00;&#x628A;&#x53CC;&#x5203;&#x5251;&#x3002;&#x7528;&#x4E8E;&#x6539;&#x5584;&#x5B89;&#x5168;&#x6027;&#x65F6;&#xFF0C;&#x4E00;&#x4E2A;&#x72EC;&#x7279;&#x7684;&#x5730;&#x5740;&#x4F7F;&#x5BF9;&#x624B;&#x96BE;&#x4EE5;&#x4F7F;&#x7528;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#x66FF;&#x4EE3;&#x4F60;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4EE5;&#x6B3A;&#x9A97;&#x4F60;&#x7684;&#x987E;&#x5BA2;&#x652F;&#x4ED8;&#x4ED6;&#x4EEC;&#x7684;&#x8D26;&#x5355;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x9753;&#x53F7;&#x5730;&#x5740;&#x4E5F;&#x53EF;&#x80FD;&#x4F7F;&#x5F97;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x7C7B;&#x4F3C;&#x4E8E;&#x968F;&#x673A;&#x5730;&#x5740;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x751A;&#x81F3;&#x53E6;&#x4E00;&#x4E2A;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x4ECE;&#x800C;&#x6B3A;&#x9A97;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#x3002;</p>
<p>Eugenia&#x53EF;&#x4EE5;&#x8BA9;&#x6350;&#x6B3E;&#x4EBA;&#x6350;&#x6B3E;&#x5230;&#x5979;&#x5BA3;&#x5E03;&#x7684;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x751F;&#x6210;&#x5730;&#x5740;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;1J7mdg5rbQyUHENYdx39WVWK7fsLpEoXZy&#xFF09;&#x3002; &#x6216;&#x8005;&#x5979;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x4EE5;&#x201C;1Kids&#x201D;&#x5F00;&#x5934;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#x4EE5;&#x663E;&#x5F97;&#x66F4;&#x72EC;&#x7279;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x5355;&#x4E00;&#x56FA;&#x5B9A;&#x5730;&#x5740;&#xFF08;&#x800C;&#x4E0D;&#x662F;&#x6BCF;&#x6BD4;&#x6350;&#x6B3E;&#x7528;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x52A8;&#x6001;&#x5730;&#x5740;&#xFF09;&#x7684;&#x98CE;&#x9669;&#x4E4B;&#x4E00;&#x662F;&#x5C0F;&#x5077;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x9ED1;&#x8FDB;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#xFF0C;&#x7528;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;&#x5730;&#x5740;&#x53D6;&#x4EE3;&#x4F60;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x4ECE;&#x800C;&#x5C06;&#x6350;&#x8D60;&#x8F6C;&#x79FB;&#x7ED9;&#x4ED6;&#x81EA;&#x5DF1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x516C;&#x5E03;&#x4E86;&#x4F60;&#x7684;&#x6350;&#x6B3E;&#x5730;&#x5740;&#xFF0C;&#x4F60;&#x7684;&#x7528;&#x6237;&#x53EF;&#x4EE5; &#x5728;&#x4ED8;&#x6B3E;&#x4E4B;&#x524D;&#x7528;&#x81EA;&#x5DF1;&#x773C;&#x775B;&#x68C0;&#x67E5;&#x4EE5;&#x786E;&#x4FDD;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x8DDF;&#x5728;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x3001;&#x90AE;&#x4EF6;&#x548C;&#x4F20;&#x5355;&#x4E0A;&#x770B;&#x5230;&#x7684;&#x5730;&#x5740;&#x662F;&#x540C;&#x4E00;&#x4E2A;&#x3002;&#x5728;&#x968F;&#x673A;&#x5730;&#x5740; 1j7mdg5rbqyuhenydx39wvwk7fslpeoxzy&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x666E;&#x901A;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x4F1A;&#x53EA;&#x68C0;&#x67E5;&#x5934;&#x51E0;&#x4E2A;&#x5B57;&#x7B26;&#x201C;1j7mdg&#x201D;&#xFF0C;&#x5C31;&#x8BA4;&#x4E3A;&#x5730;&#x5740;&#x5339;&#x914D;&#x3002;&#x4F7F;&#x7528;&#x9753;&#x53F7;&#x5730;&#x5740;&#x751F;&#x6210;&#x5668;&#xFF0C;&#x90A3;&#x4E9B;&#x60F3;&#x901A;&#x8FC7;&#x66FF;&#x6362;&#x7C7B;&#x4F3C;&#x5730;&#x5740;&#x6765;&#x76D7;&#x7A83;&#x7684;&#x4EBA;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x751F;&#x6210;&#x4E0E;&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x7B26;&#x76F8;&#x5339;&#x914D;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x8868;4-8&#x6240;&#x793A;&#x3002;</p>
<p>&#x8868;4-8 &#x751F;&#x6210;&#x5339;&#x914D;&#x67D0;&#x968F;&#x673A;&#x5730;&#x5740;&#x7684;&#x591A;&#x4E2A;&#x9753;&#x53F7;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4243cb78fd2b4bf3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-8 &#x751F;&#x6210;&#x5339;&#x914D;&#x67D0;&#x968F;&#x673A;&#x5730;&#x5740;&#x7684;&#x591A;&#x4E2A;&#x9753;&#x53F7;"></p>
<p>&#x90A3;&#x9753;&#x53F7;&#x5730;&#x5740;&#x4F1A;&#x4E0D;&#x4F1A;&#x589E;&#x52A0;&#x5B89;&#x5168;&#x6027;&#xFF1F;&#x5982;&#x679C;Eugenia&#x751F;&#x6210;1Kids33q44erFfpeXrmDSz7zEqG2FesZEN&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x80FD;&#x770B;&#x5230;&#x9753;&#x53F7;&#x56FE;&#x6848;&#x7684;&#x5B57;&#x6BCD;&#x548C;&#x4E00;&#x4E9B;&#x5B57;&#x7B26;&#x5728;&#x4E0A;&#x9762;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x5730;&#x5740;&#x90E8;&#x5206;&#x4E2D;&#x6CE8;&#x660E;&#x4E86;1Kids33&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x4F1A;&#x8FEB;&#x4F7F;&#x653B;&#x51FB;&#x8005;&#x751F;&#x6210;&#x81F3;&#x5C11;6&#x4E2A;&#x5B57;&#x6BCD;&#x76F8;&#x5339; &#x914D;&#x7684;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF08;&#x6BD4;&#x4E4B;&#x524D;&#x591A;2&#x4E2A;&#x5B57;&#x7B26;&#xFF09;&#xFF0C;&#x5C31;&#x8981;&#x82B1;&#x8D39;&#x6BD4;Eugenia&#x591A;3364&#x500D;&#x7684;&#x52AA;&#x529B;&#x3002;&#x672C;&#x8D28;&#x4E0A;&#xFF0C;Eugenia&#x4ED8;&#x51FA;&#x7684;&#x52AA;&#x529B;&#xFF08;&#x6216;&#x8005;&#x9753;&#x53F7;&#x6C60;&#x4ED8;&#x51FA;&#x7684;&#xFF09;&#x8FEB;&#x4F7F;&#x653B;&#x51FB;&#x8005;&#x4E0D;&#x5F97;&#x4E0D;&#x751F;&#x6210;&#x66F4;&#x957F;&#x7684;&#x9753;&#x53F7;&#x56FE;&#x6848;&#x3002;&#x5982;&#x679C;Eugenia&#x82B1;&#x94B1;&#x8BF7;&#x77FF;&#x6C60;&#x751F;&#x6210;8&#x4E2A;&#x5B57;&#x7B26;&#x7684;&#x9753;&#x53F7;&#x5730;&#x5740;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x5C06;&#x4F1A;&#x88AB;&#x903C;&#x8FEB;&#x5230;10&#x5B57;&#x7B26;&#x7684;&#x5883;&#x5730;&#xFF0C;&#x90A3;&#x5C06;&#x662F;&#x4E2A;&#x4EBA;&#x7535;&#x8111;&#xFF0C;&#x751A;&#x81F3;&#x6602;&#x8D35;&#x81EA;&#x5B9A;&#x4E49;&#x9753;&#x53F7;&#x6316;&#x6398;&#x673A;&#x6216;&#x9753;&#x53F7;&#x6C60;&#x4E5F;&#x65E0;&#x6CD5;&#x751F;&#x6210;&#x3002;&#x5BF9;Eugenia&#x6765;&#x8BF4;&#x53EF;&#x627F;&#x62C5;&#x7684;&#x8D77;&#x652F;&#x51FA;&#xFF0C;&#x5BF9;&#x653B;&#x51FB;&#x8005;&#x6765;&#x8BF4;&#x5219;&#x53D8;&#x6210;&#x4E86;&#x65E0;&#x6CD5;&#x627F;&#x62C5;&#x652F;&#x51FA;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5982;&#x679C;&#x6B3A;&#x8BC8;&#x7684;&#x6F5C;&#x5728;&#x56DE;&#x62A5;&#x4E0D;&#x8DB3;&#x4EE5;&#x652F;&#x4ED8;&#x751F;&#x6210;&#x9753;&#x53F7;&#x5730;&#x5740;&#x6240;&#x9700;&#x7684;&#x8D39;&#x7528;&#x3002;</p>
<h3 id="444-&#x7EB8;&#x94B1;&#x5305;">4.4.4 &#x7EB8;&#x94B1;&#x5305;</h3>
<p>&#x7EB8;&#x94B1;&#x5305;&#x662F;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x5F20;&#x4E0A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#x3002;&#x6709;&#x65F6;&#x7EB8;&#x94B1;&#x5305;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x8D77;&#x89C1;&#x4E5F;&#x5305;&#x62EC;&#x5BF9;&#x5E94;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x4F46;&#x8FD9;&#x5E76;&#x4E0D;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5730;&#x5740;&#x53EF;&#x4EE5;&#x4ECE;&#x79C1;&#x94A5;&#x4E2D;&#x5BFC;&#x51FA;&#x3002;&#x7EB8;&#x94B1;&#x5305;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x5EFA;&#x7ACB;&#x5907;&#x4EFD;&#x6216;&#x8005;&#x7EBF;&#x4E0B;&#x5B58;&#x50A8;&#x6BD4;&#x7279;&#x5E01;&#xFF08;&#x5373;&#x51B7;&#x5B58;&#x50A8;&#xFF09;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x4F5C;&#x4E3A;&#x5907;&#x4EFD;&#x673A;&#x5236;&#xFF0C;&#x4E00;&#x4E2A;&#x7EB8;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4EE5;&#x9632;&#x5728;&#x7535;&#x8111;&#x786C;&#x76D8;&#x635F;&#x574F;&#x3001;&#x5931;&#x7A83;&#x6216;&#x610F;&#x5916;&#x5220;&#x9664;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x9020;&#x6210;&#x5BC6;&#x94A5;&#x7684;&#x7684;&#x4E22;&#x5931;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x51B7;&#x5B58;&#x50A8;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5982;&#x679C;&#x7EB8;&#x94B1;&#x5305;&#x5BC6;&#x94A5;&#x5728;&#x7EBF;&#x4E0B;&#x751F;&#x6210;&#x5E76;&#x6C38;&#x4E45;&#x4E0D;&#x5728;&#x7535;&#x8111;&#x7CFB;&#x7EDF;&#x4E2D;&#x5B58;&#x50A8;&#xFF0C;&#x4ED6;&#x4EEC;&#x5728;&#x5E94;&#x5BF9;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#xFF0C;&#x952E;&#x76D8;&#x8BB0;&#x5F55;&#x5668;&#xFF0C;&#x6216;&#x5176;&#x4ED6;&#x5728;&#x7EBF;&#x7535;&#x8111;&#x5A01;&#x80C1;&#x66F4;&#x6709;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x7EB8;&#x94B1;&#x5305;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x72B6;&#xFF0C;&#x5927;&#x5C0F;&#xFF0C;&#x548C;&#x5916;&#x89C2;&#x8BBE;&#x8BA1;&#xFF0C;&#x4F46;&#x975E;&#x5E38;&#x57FA;&#x672C;&#x7684;&#x539F;&#x5219;&#x662F;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x548C;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x5F20;&#x4E0A;&#x3002;&#x8868;4-14&#x5C55;&#x73B0;&#x4E86;&#x7EB8;&#x94B1;&#x5305;&#x6700;&#x57FA;&#x672C;&#x7684;&#x5F62;&#x5F0F;&#x3002;</p>
<p>&#x8868;4-9 &#x6BD4;&#x7279;&#x5E01;&#x7EB8;&#x94B1;&#x5305;&#x7684;&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#x7684;&#x6253;&#x5370;&#x5F62;&#x5F0F;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4eaf2c3a31d62c2e.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;4-9 &#x6BD4;&#x7279;&#x5E01;&#x7EB8;&#x94B1;&#x5305;&#x7684;&#x79C1;&#x94A5;&#x548C;&#x516C;&#x94A5;&#x7684;&#x6253;&#x5370;&#x5F62;&#x5F0F;"></p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5DE5;&#x5177;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x751F;&#x6210;&#x7EB8;&#x94B1;&#x5305;&#xFF0C;&#x8B6C;&#x5982;&#x4F7F;&#x7528;bitaddress.org&#x7F51;&#x7AD9;&#x4E0A;&#x7684;&#x5BA2;&#x6237;&#x7AEF;Javascript&#x751F;&#x6210;&#x5668;&#x3002;&#x8FD9;&#x4E2A;&#x9875;&#x9762;&#x5305;&#x542B;&#x6240;&#x6709;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x548C;&#x7EB8;&#x94B1;&#x5305;&#x6240;&#x5FC5;&#x987B;&#x4EE3;&#x7801;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x5B8C;&#x5168;&#x5931;&#x53BB;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#x548C;&#x7EB8;&#x94B1;&#x5305;&#x3002;&#x82E5;&#x8981;&#x4F7F;&#x7528;&#x5B83;&#xFF0C;&#x5148;&#x5C06;HTML&#x9875;&#x9762;&#x4FDD;&#x5B58;&#x5728;&#x672C;&#x5730;&#x78C1;&#x76D8;&#x6216;&#x5916;&#x90E8;U&#x76D8;&#x3002;&#x4ECE;Internet&#x7F51;&#x7EDC;&#x65AD;&#x5F00;&#xFF0C;&#x4ECE;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x6253;&#x5F00;&#x6587;&#x4EF6;&#x3002;&#x66F4;&#x65B9;&#x4FBF;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x539F;&#x59CB;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x542F;&#x52A8;&#x7535;&#x8111;&#xFF0C;&#x6BD4;&#x5982;&#x4E00; &#x4E2A;&#x5149;&#x76D8;&#x542F;&#x52A8;&#x7684;Linux&#x7CFB;&#x7EDF;&#x3002;&#x4EFB;&#x4F55;&#x5728;&#x8131;&#x673A;&#x60C5;&#x51B5;&#x4E0B;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x6240;&#x751F;&#x6210;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;USB&#x7EBF;&#x5728;&#x672C;&#x5730;&#x6253;&#x5370;&#x673A;&#x4E0A;&#x6253;&#x5370;&#x51FA; &#x6765;&#xFF0C;&#x4ECE;&#x800C;&#x5236;&#x9020;&#x4E86;&#x5BC6;&#x94A5;&#x53EA;&#x5B58;&#x5728;&#x7EB8;&#x5F20;&#x4E0A;&#x800C;&#x4ECE;&#x672A;&#x5B58;&#x50A8;&#x5728;&#x5728;&#x7EBF;&#x7CFB;&#x7EDF;&#x4E0A;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x3002;&#x5C06;&#x8FD9;&#x4E9B;&#x7EB8;&#x94B1;&#x5305;&#x653E;&#x7F6E;&#x5728;&#x9632;&#x706B;&#x4FDD;&#x9669;&#x67DC;&#x5185;&#xFF0C;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x5E01;&#x5230; &#x5BF9;&#x5E94;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E0A;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x4F46;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x51B7;&#x5B58;&#x50A8;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;&#x56FE;4-8&#x5C55;&#x793A;&#x4E86;&#x901A;&#x8FC7;bitaddress.org &#x751F;&#x6210;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-70c69724c6b7d805.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-8&#x5C55;&#x793A;&#x4E86;&#x901A;&#x8FC7;bitaddress.org &#x751F;&#x6210;&#x7684;&#x7EB8;&#x94B1;&#x5305;"></p>
<p>&#x8FD9;&#x4E2A;&#x7B80;&#x5355;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x8DB3;&#x4E4B;&#x5904;&#x662F;&#x90A3;&#x4E9B;&#x88AB;&#x6253;&#x5370;&#x4E0B;&#x6765;&#x7684;&#x5BC6;&#x94A5;&#x5BB9;&#x6613;&#x88AB;&#x76D7;&#x7A83;&#x3002;&#x4E00;&#x4E2A;&#x80FD;&#x591F;&#x63A5;&#x8FD1;&#x8FD9;&#x4E9B;&#x7EB8;&#x7684;&#x5C0F;&#x5077;&#x53EA;&#x9700;&#x5077;&#x8D70;&#x7EB8;&#x6216;&#x8005;&#x7528;&#x628A;&#x62CD;&#x6444;&#x7EB8;&#x4E0A;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x5C31;&#x80FD;&#x63A7;&#x5236;&#x88AB;&#x8FD9;&#x4E9B;&#x5BC6;&#x94A5;&#x9501;&#x5B9A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;BIP0038&#x52A0;&#x5BC6;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x94B1;&#x5305;&#x4E0A;&#x7684;&#x8FD9;&#x4E9B;&#x79C1;&#x94A5;&#x88AB;&#x5176;&#x6240;&#x6709;&#x8005;&#x8BB0;&#x4F4F;&#x7684;&#x4E00;&#x4E2A;&#x53E3;&#x4EE4;&#x4FDD;&#x62A4;&#x8D77;&#x6765;&#x3002;&#x6CA1;&#x6709;&#x53E3;&#x4EE4;&#xFF0C;&#x8FD9;&#x4E9B;&#x88AB;&#x52A0;&#x5BC6;&#x8FC7;&#x7684;&#x5BC6;&#x94A5;&#x4E5F;&#x662F;&#x6BEB;&#x65E0;&#x7528;&#x5904;&#x7684;&#x3002;&#x4F46;&#x5B83;&#x4EEC;&#x4ECD;&#x65E7;&#x4F18;&#x4E8E;&#x7528;&#x53E3;&#x4EE4;&#x4FDD;&#x62A4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x5BC6;&#x94A5;&#x4ECE;&#x6CA1;&#x6709;&#x5728;&#x7EBF;&#x8FC7;&#xFF0C;&#x5E76;&#x4E14;&#x5FC5;&#x987B;&#x4ECE;&#x4FDD;&#x9669;&#x7BB1;&#x6216;&#x8005;&#x5176;&#x4ED6;&#x7269;&#x7406;&#x7684;&#x5B89;&#x5168;&#x5B58;&#x50A8;&#x4E2D;&#x5BFC;&#x51FA;&#x3002;&#x56FE;4-9&#x5C55;&#x793A;&#x4E86;&#x901A;&#x8FC7;bitaddress.org &#x751F;&#x6210;&#x7684;&#x52A0;&#x5BC6;&#x7EB8;&#x94B1;&#x5305;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-ce1a7a9106d6606e.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-9&#x5C55;&#x793A;&#x4E86;&#x901A;&#x8FC7;bitaddress.org &#x751F;&#x6210;&#x7684;&#x52A0;&#x5BC6;&#x7EB8;&#x94B1;&#x5305;&#xFF0C;&#x5BC6;&#x7801;&#xFF1A;test"></p>
<p><strong>&#x8B66;&#x544A;</strong>&#x867D;&#x7136;&#x4F60;&#x53EF;&#x4EE5;&#x591A;&#x6B21;&#x5B58;&#x6B3E;&#x5230;&#x7EB8;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x4F46;&#x662F;&#x4F60;&#x6700;&#x597D;&#x4E00;&#x6B21;&#x6027;&#x63D0;&#x53D6;&#x91CC;&#x9762;&#x6240;&#x6709;&#x7684;&#x8D44;&#x91D1;&#x3002;&#x56E0;&#x4E3A;&#x5982;&#x679C;&#x4F60;&#x63D0;&#x53D6;&#x7684;&#x91D1;&#x989D;&#x5C11;&#x4E8E;&#x5176;&#x4E2D;&#x7684;<strong>&#x603B;</strong>&#x91D1;&#x989D;&#x7684;&#x8BDD;&#xFF0C;&#x6709;&#x4E9B;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x627E;&#x96F6;&#x5730;&#x5740;&#x3002;&#x5E76;&#x4E14;&#xFF0C;&#x4F60;&#x6240;&#x7528;&#x7684;&#x7535;&#x8111;&#x53EF;&#x80FD;&#x88AB;&#x75C5;&#x6BD2;&#x611F;&#x67D3;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x6709;&#x53EF;&#x80FD;&#x6CC4;&#x9732;&#x79C1;&#x94A5;&#x3002;&#x4E00; &#x6B21;&#x6027;&#x63D0;&#x8D70;&#x6240;&#x6709;&#x4F59;&#x6B3E;&#x53EF;&#x4EE5;&#x51CF;&#x5C11;&#x79C1;&#x94A5;&#x6CC4;&#x9732;&#x7684;&#x98CE;&#x9669;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x6240;&#x9700;&#x7684;&#x91D1;&#x989D;&#x6BD4;&#x8F83;&#x5C11;&#xFF0C;&#x90A3;&#x4E48;&#x8BF7;&#x628A;&#x4F59;&#x989D;&#x53D1;&#x9001;&#x5230;&#x76F8;&#x540C;&#x4EA4;&#x6613;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x91CC;&#x3002;</p>
<p>&#x7EB8;&#x94B1;&#x5305;&#x6709;&#x8BB8;&#x591A;&#x8BBE;&#x8BA1;&#x548C;&#x5927;&#x5C0F;&#xFF0C;&#x5E76;&#x6709;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x7279;&#x6027;&#x3002;&#x6709;&#x4E9B;&#x4F5C;&#x4E3A;&#x793C;&#x7269;&#x9001;&#x7ED9;&#x4ED6;&#x4EBA;&#xFF0C;&#x6709;&#x5B63;&#x8282;&#x6027;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x50CF;&#x5723;&#x8BDE;&#x8282;&#x548C;&#x65B0;&#x5E74;&#x4E3B;&#x9898;&#x3002;&#x53E6; &#x5916;&#x4E00;&#x4E9B;&#x5219;&#x662F;&#x8BBE;&#x8BA1;&#x4FDD;&#x5B58;&#x5728;&#x94F6;&#x884C;&#x91D1;&#x5E93;&#x6216;&#x901A;&#x8FC7;&#x67D0;&#x79CD;&#x65B9;&#x5F0F;&#x9690;&#x85CF;&#x79C1;&#x94A5;&#x7684;&#x4FDD;&#x9669;&#x7BB1;&#x5185;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x4E0D;&#x900F;&#x660E;&#x7684;&#x522E;&#x522E;&#x8D34;&#xFF0C;&#x6216;&#x8005;&#x6298;&#x53E0;&#x548C;&#x9632;&#x7BE1;&#x6539;&#x7684;&#x94DD;&#x7B94;&#x80F6;&#x7C98;&#x5BC6;&#x5C01;&#x3002;&#x56FE;4-10&#x81F3;&#x56FE;4-12&#x5C55;&#x793A;&#x4E86;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x5B89;&#x5168;&#x548C;&#x5907;&#x4EFD;&#x529F;&#x80FD;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x56FE;4-10 &#x901A;&#x8FC7;bitcoinpaperwallet.com&#x751F;&#x6210;&#x7684;&#x3001;&#x79C1;&#x94A5;&#x5199;&#x5728;&#x6298;&#x53E0;&#x888B;&#x4E0A;&#x7684;&#x7EB8;&#x94B1;&#x5305;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-ae0037e0c9b1513c.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-10 &#x901A;&#x8FC7;bitcoinpaperwallet.com&#x751F;&#x6210;&#x7684;&#x3001;&#x79C1;&#x94A5;&#x5199;&#x5728;&#x6298;&#x53E0;&#x888B;&#x4E0A;&#x7684;&#x7EB8;&#x94B1;&#x5305;"></p>
<p>&#x56FE;4-11 &#x901A;&#x8FC7;bitcoinpaperwallet.com &#x751F;&#x6210;&#x7684;&#x3001;&#x79C1;&#x94A5;&#x88AB;&#x5BC6;&#x5C01;&#x4F4F;&#x7684;&#x7EB8;&#x94B1;&#x5305;&#xFF0C; &#x5176;&#x4ED6;&#x8BBE;&#x8BA1;&#x6709;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#x7684;&#x989D;&#x5916;&#x526F;&#x672C;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x7968;&#x6839;&#x5F62;&#x5F0F;&#x7684;&#x53EF;&#x4EE5;&#x62C6;&#x5378;&#x5B58;&#x6839;&#xFF0C;&#x8BA9;&#x4F60;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;&#x591A;&#x4E2A;&#x526F;&#x672C;&#x4EE5;&#x9632;&#x706B;&#x707E;&#x3001;&#x6D2A;&#x6C34;&#x6216;&#x5176;&#x4ED6;&#x81EA;&#x7136;&#x707E;&#x5BB3;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4dcae8d6eff650c4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-11 &#x901A;&#x8FC7;bitcoinpaperwallet.com &#x751F;&#x6210;&#x7684;&#x3001;&#x79C1;&#x94A5;&#x88AB;&#x5BC6;&#x5C01;&#x4F4F;&#x7684;&#x7EB8;&#x94B1;&#x5305;"></p>
<p>&#x56FE;4-12 &#x5728;&#x5907;&#x4EFD;&#x201C;&#x5B58;&#x6839;&#x201D;&#x4E0A;&#x6709;&#x591A;&#x4E2A;&#x79C1;&#x94A5;&#x526F;&#x672C;&#x7684;&#x7EB8;&#x94B1;&#x5305;
<img src="http://upload-images.jianshu.io/upload_images/1785959-37ca362234fe4cbc.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;4-12 &#x5728;&#x5907;&#x4EFD;&#x201C;&#x5B58;&#x6839;&#x201D;&#x4E0A;&#x6709;&#x591A;&#x4E2A;&#x79C1;&#x94A5;&#x526F;&#x672C;&#x7684;&#x7EB8;&#x94B1;&#x5305;"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch03.html" class="navigation navigation-prev " aria-label="Previous page: 第三章比特币核心">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch05.html" class="navigation navigation-next " aria-label="Next page: 第五章钱包">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第四章密钥和地址","level":"1.10","depth":1,"next":{"title":"第五章钱包","level":"1.11","depth":1,"path":"ch05.md","ref":"ch05.md","articles":[]},"previous":{"title":"第三章比特币核心","level":"1.9","depth":1,"path":"ch03.md","ref":"ch03.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch04.md","mtime":"2018-12-14T06:26:05.578Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

