
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第五章钱包 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch06.html" />
    
    
    <link rel="prev" href="ch04.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第五章钱包</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x201C;&#x94B1;&#x5305;&#x201D;&#x4E00;&#x8BCD;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x6709;&#x591A;&#x91CD;&#x542B;&#x4E49;&#x3002;
&#x5E7F;&#x4E49;&#x4E0A;&#xFF0C;&#x94B1;&#x5305;&#x662F;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4E3A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x4EA4;&#x4E92;&#x754C;&#x9762;&#x3002; &#x94B1;&#x5305;&#x63A7;&#x5236;&#x7528;&#x6237;&#x8BBF;&#x95EE;&#x6743;&#x9650;&#xFF0C;&#x7BA1;&#x7406;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#xFF0C;&#x8DDF;&#x8E2A;&#x4F59;&#x989D;&#x4EE5;&#x53CA;&#x521B;&#x5EFA;&#x548C;&#x7B7E;&#x540D;&#x4EA4;&#x6613;&#x3002;
&#x72ED;&#x4E49;&#x4E0A;&#xFF0C;&#x5373;&#x4ECE;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x201C;&#x94B1;&#x5305;&#x201D;&#x662F;&#x6307;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x548C;&#x7BA1;&#x7406;&#x7528;&#x6237;&#x5BC6;&#x94A5;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;
&#x6211;&#x4EEC;&#x5C06;&#x6DF1;&#x5165;&#x4ECB;&#x7ECD;&#x7B2C;&#x4E8C;&#x5C42;&#x542B;&#x4E49;&#xFF0C;&#x672C;&#x7AE0;&#x4E2D;&#x94B1;&#x5305;&#x662F;&#x79C1;&#x94A5;&#x7684;&#x5BB9;&#x5668;&#xFF0C;&#x4E00;&#x822C;&#x662F;&#x901A;&#x8FC7;&#x7ED3;&#x6784;&#x5316;&#x6587;&#x4EF6;&#x6216;&#x7B80;&#x5355;&#x6570;&#x636E;&#x5E93;&#x6765;&#x5B9E;&#x73B0;&#x3002;</p>
<h2 id="51&#x94B1;&#x5305;&#x6280;&#x672F;&#x6982;&#x8FF0;">5.1&#x94B1;&#x5305;&#x6280;&#x672F;&#x6982;&#x8FF0;</h2>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x603B;&#x7ED3;&#x4E86;&#x5404;&#x79CD;&#x6280;&#x672F;&#xFF0C;&#x5B83;&#x4EEC;&#x4E3A;&#x7528;&#x6237;&#x6784;&#x5EFA;&#x8D77;&#x53CB;&#x597D;&#xFF0C;&#x5B89;&#x5168;&#x548C;&#x7075;&#x6D3B;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x8BEF;&#x89E3;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x91CC;&#x542B;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x94B1;&#x5305;&#x91CC;&#x53EA;&#x542B;&#x6709;&#x94A5;&#x5319;&#x3002; &#x201C;&#x94B1;&#x5E01;&#x201D;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002; &#x7528;&#x6237;&#x901A;&#x8FC7;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x5BC6;&#x94A5;&#x7B7E;&#x540D;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x6765;&#x63A7;&#x5236;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x94B1;&#x5E01;&#x3002; &#x5728;&#x67D0;&#x79CD;&#x610F;&#x4E49;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x662F;&#x5BC6;&#x94A5;&#x94FE;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x53EA;&#x542B;&#x6709;&#x5BC6;&#x94A5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x94B1;&#x5E01;&#x3002; &#x6BCF;&#x4E2A;&#x7528;&#x6237;&#x6709;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x591A;&#x4E2A;&#x5BC6;&#x94A5;&#x7684;&#x94B1;&#x5305;&#x3002; &#x94B1;&#x5305;&#x53EA;&#x5305;&#x542B;&#x79C1;&#x94A5;/&#x516C;&#x94A5;&#x5BF9;&#x7684;&#x5BC6;&#x94A5;&#x94FE;&#xFF08;&#x8BF7;&#x53C2;&#x9605;[&#x79C1;&#x94A5;&#x7AE0;&#x8282;]&#xFF09;&#x3002; &#x7528;&#x6237;&#x7528;&#x5BC6;&#x94A5;&#x7B7E;&#x540D;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x8BC1;&#x660E;&#x4ED6;&#x4EEC;&#x62E5;&#x6709;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF08;&#x4ED6;&#x4EEC;&#x7684;&#x94B1;&#x5E01;&#xFF09;&#x3002; &#x94B1;&#x5E01;&#x4EE5;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x7684;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF08;&#x901A;&#x5E38;&#x8BB0;&#x4E3A;vout&#x6216;txout&#xFF09;&#x3002;</p>
<p>&#x6709;&#x4E24;&#x79CD;&#x4E3B;&#x8981;&#x7C7B;&#x578B;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x5B83;&#x4EEC;&#x5305;&#x542B;&#x7684;&#x591A;&#x4E2A;&#x5BC6;&#x94A5;&#x662F;&#x5426;&#x76F8;&#x4E92;&#x5173;&#x8054;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x79CD;&#x7C7B;&#x578B;&#x662F;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF08;nondeterministic wallet&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6BCF;&#x4E2A;&#x5BC6;&#x94A5;&#x90FD;&#x662F;&#x4ECE;&#x968F;&#x673A;&#x6570;&#x72EC;&#x7ACB;&#x751F;&#x6210;&#x7684;&#x3002;&#x5BC6;&#x94A5;&#x5F7C;&#x6B64;&#x65E0;&#x5173;&#x3002;&#x8FD9;&#x79CD;&#x94B1;&#x5305;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x201C;Just a Bunch Of Keys&#xFF08;&#x4E00;&#x5806;&#x5BC6;&#x94A5;&#xFF09;&#x201D;&#xFF0C;&#x7B80;&#x79F0;JBOK&#x94B1;&#x5305;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x7C7B;&#x578B;&#x662F;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF08;deterministic wallet&#xFF09;&#xFF0C;&#x5176;&#x4E2D;&#x6240;&#x6709;&#x7684;&#x5BC6;&#x94A5;&#x90FD;&#x662F;&#x4ECE;&#x4E00;&#x4E2A;&#x4E3B;&#x5BC6;&#x94A5;&#x6D3E;&#x751F;&#x51FA;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E3B;&#x5BC6;&#x94A5;&#x5373;&#x4E3A;&#x79CD;&#x5B50;&#xFF08;seed&#xFF09;&#x3002;&#x8BE5;&#x7C7B;&#x578B;&#x94B1;&#x5305;&#x4E2D;&#x6240;&#x6709;&#x5BC6;&#x94A5;&#x90FD;&#x76F8;&#x4E92;&#x5173;&#x8054;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x539F;&#x59CB;&#x79CD;&#x5B50;&#xFF0C;&#x5219;&#x53EF;&#x4EE5;&#x518D;&#x6B21;&#x751F;&#x6210;&#x5168;&#x90E8;&#x5BC6;&#x94A5;&#x3002;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x4E2D;&#x4F7F;&#x7528;&#x4E86;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5BC6;&#x94A5;&#x63A8;&#x5BFC;&#x65B9;&#x6CD5;&#x3002;&#x6700;&#x5E38;&#x7528;&#x7684;&#x63A8;&#x5BFC;&#x65B9;&#x6CD5;&#x662F;&#x4F7F;&#x7528;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#xFF0C;&#x79F0;&#x4E3A;&#x5206;&#x7EA7;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x6216;HD&#x94B1;&#x5305;&#x3002;</p>
<p>&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7531;&#x79CD;&#x5B50;&#x884D;&#x751F;&#x521B;&#x9020;&#x3002;&#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x79CD;&#x5B50;&#x88AB;&#x7F16;&#x7801;&#x4E3A;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#xFF0C;&#x4E5F;&#x79F0;&#x4E3A;&#x52A9;&#x8BB0;&#x8BCD;&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x8282;&#x5C06;&#x6DF1;&#x5165;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x3002;</p>
<h3 id="511&#x975E;&#x786E;&#x5B9A;&#x6027;&#xFF08;&#x968F;&#x673A;&#xFF09;&#x94B1;&#x5305;">5.1.1&#x975E;&#x786E;&#x5B9A;&#x6027;&#xFF08;&#x968F;&#x673A;&#xFF09;&#x94B1;&#x5305;</h3>
<p>&#x5728;&#x6700;&#x65E9;&#x7684;&#x4E00;&#x6279;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#xFF08; Bitcoin Core&#xFF0C;&#x73B0;&#x5728;&#x79F0;&#x4F5C;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#xFF09;&#xFF0C;&#x94B1;&#x5305;&#x53EA;&#x662F;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;&#x96C6;&#x5408;&#x3002;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x94B1;&#x5305;&#x88AB;&#x79F0;&#x4F5C;&#x96F6;&#x578B;&#x975E;&#x786E;&#x5B9A;&#x94B1;&#x5305;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6BD4; &#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x9884;&#x5148;&#x751F;&#x6210;100&#x4E2A;&#x968F;&#x673A;&#x79C1;&#x94A5;&#xFF0C;&#x4ECE;&#x6700;&#x5F00;&#x59CB;&#x5C31;&#x751F;&#x6210;&#x8DB3;&#x591F;&#x591A;&#x7684;&#x79C1;&#x94A5;&#x5E76;&#x4E14;&#x6BCF;&#x4E2A;&#x5BC6;&#x94A5;&#x53EA;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x79CD;&#x94B1;&#x5305;&#x73B0;&#x5728;&#x6B63;&#x5728;&#x88AB;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x66FF;&#x6362;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x96BE;&#x4EE5;&#x7BA1;&#x7406;&#x3001; &#x5907;&#x4EFD;&#x4EE5;&#x53CA;&#x5BFC;&#x5165;&#x3002;&#x968F;&#x673A;&#x5BC6;&#x94A5;&#x7684;&#x7F3A;&#x70B9;&#x5C31;&#x662F;&#x5982;&#x679C;&#x4F60;&#x751F;&#x6210;&#x5F88;&#x591A;&#x79C1;&#x94A5;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x4FDD;&#x5B58;&#x5B83;&#x4EEC;&#x6240;&#x6709;&#x7684;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x94B1;&#x5305;&#x5FC5;&#x987B;&#x88AB;&#x7ECF;&#x5E38;&#x6027; &#x5730;&#x5907;&#x4EFD;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x90FD;&#x5FC5;&#x987B;&#x5907;&#x4EFD;&#xFF0C;&#x5426;&#x5219;&#x4E00;&#x65E6;&#x94B1;&#x5305;&#x4E0D;&#x53EF;&#x8BBF;&#x95EE;&#x65F6;&#xFF0C;&#x94B1;&#x5305;&#x6240;&#x63A7;&#x5236;&#x7684;&#x8D44;&#x91D1;&#x5C31;&#x4ED8;&#x4E4B;&#x4E1C;&#x6D41;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x76F4;&#x63A5;&#x4E0E;&#x907F;&#x514D;&#x5730;&#x5740;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x7684;&#x539F;&#x5219;&#x76F8;&#x51B2;&#x7A81;&#x2014;&#x2014;&#x6BCF;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53EA;&#x80FD;&#x7528;&#x4E00;&#x6B21;&#x4EA4;&#x6613;&#x3002;&#x5730;&#x5740;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x5C06;&#x591A;&#x4E2A;&#x4EA4;&#x6613;&#x548C;&#x5730;&#x5740;&#x5173;&#x8054;&#x5728;&#x4E00;&#x8D77;&#xFF0C;&#x8FD9;&#x4F1A;&#x51CF;&#x5C11;&#x9690;&#x79C1;&#x3002;&#x5F53;&#x4F60;&#x60F3;&#x907F;&#x514D;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x5730;&#x5740;&#x65F6;&#xFF0C;&#x96F6;&#x578B;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x5E76;&#x4E0D;&#x662F;&#x597D;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x56E0;&#x4E3A;&#x4F60;&#x8981;&#x521B;&#x9020;&#x8FC7;&#x591A;&#x7684;&#x79C1;&#x94A5;&#x5E76;&#x4E14;&#x8981;&#x4FDD;&#x5B58;&#x5B83;&#x4EEC;&#x3002;&#x867D;&#x7136;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x5305;&#x542B;&#x96F6;&#x578B;&#x94B1;&#x5305;&#xFF0C;&#x4F46;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x8005;&#x5E76;&#x4E0D;&#x9F13;&#x52B1;&#x5927;&#x5BB6;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x56FE;5-1&#x5C55;&#x793A;&#x7684;&#x662F;&#x4E00;&#x4E2A;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF0C;&#x5176;&#x542B;&#x6709;&#x7684;&#x968F;&#x673A;&#x5BC6;&#x94A5;&#x662F;&#x4E2A;&#x677E;&#x6563;&#x7684;&#x96C6;&#x5408;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-77bbcea7174071c3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-1&#x8868;&#x793A;&#x5305;&#x542B;&#x6709;&#x677E;&#x6563;&#x7ED3;&#x6784;&#x7684;&#x968F;&#x673A;&#x94A5;&#x5319;&#x7684;&#x96C6;&#x5408;&#x7684;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;"></p>
<p><strong>&#x63D0;&#x793A;</strong>&#x9664;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x6D4B;&#x8BD5;&#x4E4B;&#x5916;&#xFF0C;&#x4E0D;&#x8981;&#x4F7F;&#x7528;&#x975E;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x3002; &#x5B83;&#x4EEC;&#x5BF9;&#x4E8E;&#x5907;&#x4EFD;&#x548C;&#x4F7F;&#x7528;&#x6765;&#x8BF4;&#x592A;&#x9EBB;&#x70E6;&#x4E86;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x63A8;&#x8350;&#x4F7F;&#x7528;&#x57FA;&#x4E8E;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#x7684;HD&#x94B1;&#x5305;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x79CD;&#x5B50;&#x52A9;&#x8BB0;&#x8BCD;&#x8FDB;&#x884C;&#x5907;&#x4EFD;&#x3002;</p>
<h3 id="512-&#x786E;&#x5B9A;&#x6027;&#xFF08;&#x79CD;&#x5B50;&#xFF09;&#x94B1;&#x5305;">5.1.2 &#x786E;&#x5B9A;&#x6027;&#xFF08;&#x79CD;&#x5B50;&#xFF09;&#x94B1;&#x5305;</h3>
<p>&#x786E;&#x5B9A;&#x6027;&#xFF0C;&#x6216;&#x8005;&#x201C;&#x79CD;&#x5B50;&#x201D;&#x94B1;&#x5305;&#x5305;&#x542B;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5355;&#x9879;&#x79BB;&#x6563;&#x51FD;&#x6570;&#x800C;&#x53EF;&#x4ECE;&#x516C;&#x5171;&#x7684;&#x79CD;&#x5B50;&#x751F;&#x6210;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x79CD;&#x5B50;&#x662F;&#x968F;&#x673A;&#x751F;&#x6210;&#x7684;&#x6570;&#x5B57;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x4E5F;&#x542B;&#x6709;&#x6BD4;&#x5982;&#x7D22;&#x5F15;&#x53F7;&#x7801;&#x6216;&#x8005;&#x53EF;&#x751F;&#x6210;&#x79C1;&#x94A5;&#x7684;&#x201C;&#x94FE;&#x7801;&#x201D;&#xFF08;&#x53C2;&#x89C1;&#x201C; &#x5206;&#x5C42;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF08;BIP0032/BIP0044&#xFF09;&#x201D;&#x4E00;&#x8282;&#xFF09;&#x3002;&#x5728;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x79CD;&#x5B50;&#x8DB3;&#x591F;&#x6062;&#x590D;&#x6240;&#x6709;&#x7684;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x7684;&#x79C1;&#x94A5;&#xFF0C;&#x6240;&#x4EE5;&#x53EA;&#x7528;&#x5728;&#x521D;&#x59CB;&#x521B;&#x5EFA;&#x65F6;&#x7684;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x5907;&#x4EFD;&#x5C31;&#x8DB3;&#x4EE5;&#x641E;&#x5B9A;&#x3002;&#x5E76;&#x4E14;&#x79CD;&#x5B50;&#x4E5F;&#x8DB3;&#x591F;&#x8BA9;&#x94B1;&#x5305;&#x5BFC;&#x5165;&#x6216;&#x8005;&#x5BFC;&#x51FA;&#x3002;&#x8FD9;&#x5C31;&#x5F88;&#x5BB9;&#x6613;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x8005;&#x7684;&#x79C1;&#x94A5;&#x5728;&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x8F7B;&#x677E;&#x8F6C;&#x79FB;&#x3002;</p>
<p>&#x56FE;5-2&#x5C55;&#x793A;&#x4E86;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7684;&#x903B;&#x8F91;&#x56FE;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-be390ca284ed5f40.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-2&#x786E;&#x5B9A;&#x6027;&#x79CD;&#x5B50;&#x94B1;&#x5305;&#xFF1A;&#x4ECE;&#x79CD;&#x5B50;&#x6D3E;&#x751F;&#x7684;&#x5BC6;&#x94A5;&#x7684;&#x786E;&#x5B9A;&#x6027;&#x5E8F;&#x5217;"></p>
<h3 id="513-&#x5206;&#x5C42;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF08;hd-wallets-bip-32bip-44&#xFF09;">5.1.3 &#x5206;&#x5C42;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#xFF08;HD Wallets (BIP-32/BIP-44)&#xFF09;</h3>
<p>&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x88AB;&#x5F00;&#x53D1;&#x6210;&#x66F4;&#x5BB9;&#x6613;&#x4ECE;&#x5355;&#x4E2A;&#x201C;&#x79CD;&#x5B50;&#x201D;&#x4E2D;&#x751F;&#x6210;&#x8BB8;&#x591A;&#x5BC6;&#x94A5;&#x3002;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7684;&#x6700;&#x9AD8;&#x7EA7;&#x5F62;&#x5F0F;&#x662F;&#x901A;&#x8FC7;BIP0032&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x7684;HD&#x94B1;&#x5305;&#x3002;HD&#x94B1;&#x5305;&#x5305;&#x542B;&#x4EE5;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x884D;&#x751F;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4F7F;&#x5F97;&#x7236;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x4E00;&#x7CFB;&#x5217;&#x5B50;&#x5BC6;&#x94A5;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;<strong>&#x53C8;</strong>&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x4E00;&#x7CFB;&#x5217;&#x5B59;&#x5BC6;&#x94A5;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#xFF0C;&#x65E0;&#x9650;&#x884D;&#x751F;&#x3002;&#x56FE;5-3&#x5C55;&#x793A;&#x4E86;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-7ce3000da8239b74.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-3HD&#x94B1;&#x5305;:&#x4ECE;&#x79CD;&#x5B50;&#x4EA7;&#x751F;&#x7684;&#x5BC6;&#x94A5;&#x6811;"></p>
<p>&#x76F8;&#x6BD4;&#x8F83;&#x968F;&#x673A;&#xFF08;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#xFF09;&#x5BC6;&#x94A5;&#xFF0C;HD&#x94B1;&#x5305;&#x6709;&#x4E24;&#x4E2A;&#x4E3B;&#x8981;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x7B2C;&#x4E00;&#xFF0C;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x8868;&#x8FBE;&#x989D;&#x5916;&#x7684;&#x7EC4;&#x7EC7;&#x542B;&#x4E49;&#x3002;&#x6BD4;&#x5982;&#x5F53;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x5206;&#x652F;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x88AB;&#x7528;&#x6765;&#x63A5;&#x6536;&#x4EA4;&#x6613;&#x6536;&#x5165;&#x5E76;&#x4E14;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x7528;&#x6765;&#x8D1F;&#x8D23;&#x652F;&#x4ED8;&#x82B1;&#x8D39;&#x3002;&#x4E0D;&#x540C;&#x5206;&#x652F;&#x7684;&#x5BC6;&#x94A5;&#x90FD;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x5728;&#x4F01;&#x4E1A;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x8FD9;&#x5C31;&#x53EF;&#x4EE5;&#x652F;&#x914D;&#x4E0D;&#x540C;&#x7684;&#x5206;&#x652F;&#x90E8;&#x95E8;&#x3001;&#x5B50;&#x516C;&#x53F8;&#x3001;&#x5177;&#x4F53;&#x529F;&#x80FD;&#x4EE5;&#x53CA;&#x4F1A;&#x8BA1;&#x7C7B;&#x522B;&#x3002;</p>
<p>HD&#x94B1;&#x5305;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x597D;&#x5904;&#x662F;&#xFF0C;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x7CFB;&#x5217;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x8BBF;&#x95EE;&#x5BF9;&#x5E94;&#x7684;&#x79C1;&#x94A5;&#x3002;&#x8FD9;&#x6837;&#xFF0C;HD&#x94B1;&#x5305;&#x5C31;&#x80FD;&#x7528;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6216;&#x8005;&#x7528;&#x5728;&#x63A5;&#x6536;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5B83;&#x4E3A;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x53D1;&#x5E03;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x516C;&#x94A5;&#x3002;&#x516C;&#x5171;&#x94A5;&#x5319;&#x4E0D;&#x9700;&#x8981;&#x88AB;&#x9884;&#x5148;&#x52A0;&#x8F7D;&#x6216;&#x8005;&#x63D0;&#x524D;&#x884D;&#x751F;&#xFF0C;&#x800C;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E2D;&#x4E0D;&#x9700;&#x8981;&#x53EF;&#x7528;&#x6765;&#x652F;&#x4ED8;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<h3 id="514&#x79CD;&#x5B50;&#x548C;&#x52A9;&#x8BB0;&#x8BCD;&#xFF08;bip-39&#xFF09;">5.1.4&#x79CD;&#x5B50;&#x548C;&#x52A9;&#x8BB0;&#x8BCD;&#xFF08;BIP-39&#xFF09;</h3>
<p>HD&#x94B1;&#x5305;&#x5177;&#x6709;&#x7BA1;&#x7406;&#x591A;&#x4E2A;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#x7684;&#x5F3A;&#x5927;&#x673A;&#x5236;&#x3002;&#x7531;&#x4E00;&#x7CFB;&#x5217;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x751F;&#x6210;&#x79CD;&#x5B50;&#x662F;&#x4E2A;&#x6807;&#x51C6;&#x5316;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x8FD9;&#x6837;&#x6613;&#x4E8E;&#x5728;&#x94B1;&#x5305;&#x4E2D;&#x8F6C;&#x79FB;&#x3001;&#x5BFC;&#x51FA;&#x548C;&#x5BFC;&#x5165;&#xFF0C;&#x5982;&#x679C;HD&#x94B1;&#x5305;&#x4E0E;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x76F8;&#x7ED3;&#x5408;&#xFF0C;&#x5C06;&#x4F1A;&#x66F4;&#x52A0;&#x6709;&#x7528;&#x3002; &#x8FD9;&#x4E9B;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x88AB;&#x79F0;&#x4E3A;&#x52A9;&#x8BB0;&#x8BCD;&#xFF0C;&#x6807;&#x51C6;&#x7531;BIP-39&#x5B9A;&#x4E49;&#x3002; &#x4ECA;&#x5929;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF08;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x94B1;&#x5305;&#xFF09;&#x4F7F;&#x7528;&#x6B64;&#x6807;&#x51C6;&#xFF0C;&#x5E76;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x53EF;&#x4E92;&#x64CD;&#x4F5C;&#x7684;&#x52A9;&#x8BB0;&#x8BCD;&#x5BFC;&#x5165;&#x548C;&#x5BFC;&#x51FA;&#x79CD;&#x5B50;&#x8FDB;&#x884C;&#x5907;&#x4EFD;&#x548C;&#x6062;&#x590D;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x5B9E;&#x9645;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#x4EE5;&#x4E0B;&#x54EA;&#x79CD;&#x79CD;&#x5B50;&#x66F4;&#x5BB9;&#x6613;&#x6284;&#x5F55;&#x3001;&#x9605;&#x8BFB;&#x3001;&#x5BFC;&#x51FA;&#x4EE5;&#x53CA;&#x5BFC;&#x5165;&#x3002;</p>
<p>16&#x8FDB;&#x5236;&#x8868;&#x793A;&#x7684;&#x79CD;&#x5B50;&#xFF1A;
0C1E24E5917779D297E14D45F14E1A1A</p>
<p>&#x52A9;&#x8BB0;&#x8BCD;&#x8868;&#x793A;&#x7684;&#x79CD;&#x5B50;&#xFF1A;</p>
<p>army van defense carry jealous true
garbage claim echo media make crunch</p>
<h3 id="515&#x94B1;&#x5305;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;">5.1.5&#x94B1;&#x5305;&#x6700;&#x4F73;&#x5B9E;&#x8DF5;</h3>
<p>&#x7531;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x6280;&#x672F;&#x5DF2;&#x7ECF;&#x6210;&#x719F;&#xFF0C;&#x51FA;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x5E38;&#x89C1;&#x7684;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#xFF0C;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x5177;&#x5907;&#x5E7F;&#x6CDB;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x6613;&#x4E8E;&#x4F7F;&#x7528;&#xFF0C;&#x5B89;&#x5168;&#x548C;&#x7075;&#x6D3B;&#x7684;&#x7279;&#x6027;&#x3002;&#x8FD9;&#x4E9B;&#x5E38;&#x7528;&#x7684;&#x6807;&#x51C6;&#x662F;&#xFF1A;</p>
<p>&#x52A9;&#x8BB0;&#x7801;&#xFF0C;&#x57FA;&#x4E8E;BIP-39</p>
<p>HD&#x94B1;&#x5305;&#xFF0C;&#x57FA;&#x4E8E;BIP-32</p>
<p>&#x591A;&#x7528;&#x9014;HD&#x94B1;&#x5305;&#x7ED3;&#x6784;&#xFF0C;&#x57FA;&#x4E8E;BIP-43</p>
<p>&#x591A;&#x5E01;&#x79CD;&#x548C;&#x591A;&#x5E10;&#x6237;&#x94B1;&#x5305;&#xFF0C;&#x57FA;&#x4E8E;BIP-44</p>
<p>&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x53D1;&#x5C55;&#x800C;&#x6539;&#x53D8;&#x6216;&#x8FC7;&#x65F6;&#xFF0C;&#x4F46;&#x662F;&#x73B0;&#x5728;&#x5B83;&#x4EEC;&#x5F62;&#x6210;&#x4E86;&#x4E00;&#x5957;&#x4E92;&#x9501;&#x6280;&#x672F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x5DF2;&#x6210;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x94B1;&#x5305;&#x6807;&#x51C6;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x5DF2;&#x88AB;&#x5E7F;&#x6CDB;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x786C;&#x4EF6;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x91C7;&#x7528;&#xFF0C;&#x4F7F;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x94B1;&#x5305;&#x4E92;&#x64CD;&#x4F5C;&#x3002;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x5BFC;&#x51FA;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x4E0A;&#x751F;&#x6210;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x5BFC;&#x5165;&#x53E6;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#xFF0C;&#x5B9E;&#x73B0;&#x6062;&#x590D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#x3002;</p>
<p>&#x5217;&#x4E3E;&#x652F;&#x6301;&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x7684;&#x8F6F;&#x4EF6;&#x94B1;&#x5305;&#xFF0C;&#x5305;&#x62EC;&#xFF08;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF09;Breadwallet&#xFF0C;Copay&#xFF0C;Multibit HD&#x548C;Mycelium&#x3002;&#x5217;&#x4E3E;&#x652F;&#x6301;&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x7684;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF0C;&#x5305;&#x62EC;&#xFF08;&#x6309;&#x5B57;&#x6BCD;&#x987A;&#x5E8F;&#x6392;&#x5217;&#xFF09;Keepkey&#xFF0C;Ledger&#x548C;Trezor&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x90E8;&#x5206;&#x5C06;&#x8BE6;&#x7EC6;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E9B;&#x6280;&#x672F;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x5982;&#x679C;&#x60A8;&#x6B63;&#x51C6;&#x5907;&#x5F00;&#x53D1;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF0C;&#x90A3;&#x4E48;&#x5B83;&#x5E94;&#x8BE5;&#x88AB;&#x6784;&#x5EFA;&#x4E3A;&#x4E00;&#x4E2A;HD&#x94B1;&#x5305;&#xFF0C;&#x4E00;&#x4E2A;&#x79CD;&#x5B50;&#x88AB;&#x7F16;&#x7801;&#x4E3A;&#x52A9;&#x8BB0;&#x8BCD;&#x4EE3;&#x7801;&#x8FDB;&#x884C;&#x5907;&#x4EFD;&#xFF0C;&#x9075;&#x5FAA;BIP-32&#xFF0C;BIP-39&#xFF0C;BIP-43&#x548C;BIP-44&#x6807;&#x51C6;&#xFF0C;&#x4E0B;&#x9762;&#x7AE0;&#x8282;&#x6709;&#x6240;&#x6D89;&#x730E;&#x3002;</p>
<h3 id="516&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;">5.1.6&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;</h3>
<p>&#x5728;[&#x7528;&#x6237;&#x6545;&#x4E8B;]&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;Gabriel&#xFF0C;&#x91CC;&#x7EA6;&#x70ED;&#x5185;&#x5362;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x8FDB;&#x53D6;&#x5FC3;&#x7684;&#x5C11;&#x5E74;&#xFF0C;&#x4ED6;&#x6B63;&#x5728;&#x7ECF;&#x8425;&#x4E00;&#x5BB6;&#x7B80;&#x5355;&#x7684;&#x7F51;&#x7EDC;&#x5546;&#x5E97;&#xFF0C;&#x9500;&#x552E;&#x6BD4;&#x7279;&#x5E01;&#x54C1;&#x724C;&#x7684;T&#x6064;&#xFF0C;&#x5496;&#x5561;&#x676F;&#x548C;&#x8D34;&#x7EB8;&#x3002;</p>
<p>Gabriel&#x4F7F;&#x7528;Trezor&#x6BD4;&#x7279;&#x5E01;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF08;Trezor&#x8BBE;&#x5907;&#xFF1A;&#x786C;&#x4EF6;HD&#x94B1;&#x5305;&#xFF09;&#x6765;&#x5B89;&#x5168;&#x5730;&#x7BA1;&#x7406;&#x4ED6;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002; Trezor&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;USB&#x8BBE;&#x5907;&#xFF0C;&#x5177;&#x6709;&#x4E24;&#x4E2A;&#x6309;&#x94AE;&#xFF0C;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5BC6;&#x94A5;<em>&#xFF08;&#x4EE5;HD&#x94B1;&#x5305;&#x7684;&#x5F62;&#x5F0F;&#xFF09;&#x548C;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x3002; Trezor&#x94B1;&#x5305;&#x9075;&#x5FAA;</em>&#x672C;&#x7AE0;&#x8BA8;&#x8BBA;&#x7684;&#x6240;&#x6709;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#xFF0C;&#x56E0;&#x6B64;Gabriel&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;&#x4EFB;&#x4F55;&#x4E13;&#x6709;&#x6280;&#x672F;&#x6216;&#x5355;&#x4E00;&#x4F9B;&#x5E94;&#x5546;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-033e7edd7be6fb85.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-4Trezor&#x786C;&#x4EF6;&#x94B1;&#x5305;"></p>
<p>&#x5F53;Gabriel&#x9996;&#x6B21;&#x4F7F;&#x7528;Trezor&#x65F6;&#xFF0C;&#x8BBE;&#x5907;&#x4ECE;&#x5185;&#x7F6E;&#x7684;&#x786C;&#x4EF6;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x751F;&#x6210;&#x52A9;&#x8BB0;&#x8BCD;&#x548C;&#x79CD;&#x5B50;&#x3002; &#x5728;&#x8FD9;&#x4E2A;&#x521D;&#x59CB;&#x5316;&#x9636;&#x6BB5;&#xFF0C;&#x94B1;&#x5305;&#x5728;&#x5C4F;&#x5E55;&#x4E0A;&#x6309;&#x987A;&#x5E8F;&#x9010;&#x4E2A;&#x663E;&#x793A;&#x5355;&#x8BCD;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-a5ddfe3aa83e06b6.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-5Trezor&#x4F1A;&#x9010;&#x4E2A;&#x663E;&#x793A;&#x52A9;&#x8BB0;&#x8BCD;"></p>
<p>&#x901A;&#x8FC7;&#x5199;&#x4E0B;&#x8FD9;&#x4E2A;&#x52A9;&#x8BB0;&#x7B26;&#xFF0C;Gabriel&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5907;&#x4EFD;&#xFF08;&#x53C2;&#x89C1;&#x8868;5-1&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;Trezor&#x8BBE;&#x5907;&#x4E22;&#x5931;&#x6216;&#x635F;&#x574F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7528;&#x4E8E;&#x6062;&#x590D;&#x3002; &#x5728;&#x65B0;&#x7684;Trezor&#x94B1;&#x5305;&#xFF0C;&#x6216;&#x8005;&#x4EFB;&#x4E00;&#x79CD;&#x517C;&#x5BB9;&#x7684;&#x8F6F;&#x4EF6;&#x548C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x4E2D;&#xFF0C;&#x52A9;&#x8BB0;&#x8BCD;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x6062;&#x590D;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x5355;&#x8BCD;&#x5E8F;&#x5217;&#x5F88;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8BB0;&#x5FC6;&#x7EB8;&#x5907;&#x4EFD;&#x9700;&#x8981;&#x5BF9;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x90FD;&#x6709;&#x7A7A;&#x683C;&#x3002;Gabriel&#x5FC5;&#x987B;&#x4ED4;&#x7EC6;&#x8BB0;&#x5F55;&#x6BCF;&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x7F16;&#x53F7;&#xFF0C;&#x4EE5;&#x4FDD;&#x6301;&#x6B63;&#x786E;&#x7684;&#x987A;&#x5E8F;&#x3002;
&#x8868;5-1Gabriel&#x7684;&#x52A9;&#x8BB0;&#x5668;&#x5907;&#x4EFD;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-3550708d8fe6fa98.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-1Gabriel&#x7684;&#x52A9;&#x8BB0;&#x5668;&#x5907;&#x4EFD;"></p>
<p><strong>&#x63D0;&#x793A;</strong>&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;Gabriel&#x7684;&#x52A9;&#x8BB0;&#x8BCD;&#x8BB0;&#x5F55;&#x4E2D;&#x663E;&#x793A;&#x4E86;&#x4E00;&#x4E2A;12&#x4E2A;&#x8BCD;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x751F;&#x6210;&#x66F4;&#x5B89;&#x5168;&#x7684;24&#x4E2A;&#x8BCD;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#x3002; &#x52A9;&#x8BB0;&#x8BCD;&#x4EE5;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x65B9;&#x5F0F;&#x4F7F;&#x7528;&#xFF0C;&#x4E0D;&#x7BA1;&#x957F;&#x5EA6;&#x5982;&#x4F55;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x7F51;&#x5E97;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x5B9E;&#x8DF5;&#xFF0C;Gabriel&#x4F7F;&#x7528;&#x4ED6;&#x7684;Trezor&#x8BBE;&#x5907;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002; &#x6240;&#x6709;&#x5BA2;&#x6237;&#x7684;&#x8BA2;&#x5355;&#x90FD;&#x4F7F;&#x7528;&#x6B64;&#x5355;&#x4E00;&#x5730;&#x5740;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6709;&#x4E00;&#x4E9B;&#x7F3A;&#x70B9;&#xFF0C;&#x4E0D;&#x8FC7;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;HD&#x94B1;&#x5305;&#x8FDB;&#x884C;&#x6539;&#x8FDB;&#x3002;</p>
<h2 id="52&#x94B1;&#x5305;&#x6280;&#x672F;&#x7EC6;&#x8282;">5.2&#x94B1;&#x5305;&#x6280;&#x672F;&#x7EC6;&#x8282;</h2>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x6765;&#x6DF1;&#x5165;&#x4E86;&#x89E3;&#x88AB;&#x4F17;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x91CD;&#x8981;&#x7684;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#x3002;</p>
<h3 id="521&#x52A9;&#x8BB0;&#x7801;&#x8BCD;&#x6C47;&#xFF08;bip-39&#xFF09;">5.2.1&#x52A9;&#x8BB0;&#x7801;&#x8BCD;&#x6C47;&#xFF08;BIP-39&#xFF09;</h3>
<p>&#x52A9;&#x8BB0;&#x7801;&#x8BCD;&#x6C47;&#x662F;&#x82F1;&#x6587;&#x5355;&#x8BCD;&#x5E8F;&#x5217;&#x4EE3;&#x8868;&#xFF08;&#x7F16;&#x7801;&#xFF09;&#x7528;&#x4F5C;&#x79CD;&#x5B50;&#x5BF9;&#x5E94;&#x6240;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7684;&#x968F;&#x673A;&#x6570;&#x3002;&#x5355;&#x8BCD;&#x7684;&#x5E8F;&#x5217;&#x8DB3;&#x4EE5;&#x91CD;&#x65B0;&#x521B;&#x5EFA;&#x79CD;&#x5B50;&#xFF0C;&#x5E76;&#x4E14;&#x4ECE; &#x79CD;&#x5B50;&#x90A3;&#x91CC;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x94B1;&#x5305;&#x4EE5;&#x53CA;&#x6240;&#x6709;&#x79C1;&#x94A5;&#x3002;&#x5728;&#x9996;&#x6B21;&#x521B;&#x5EFA;&#x94B1;&#x5305;&#x65F6;&#xFF0C;&#x5E26;&#x6709;&#x52A9;&#x8BB0;&#x7801;&#x7684;&#xFF0C;&#x8FD0;&#x884C;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7684;&#x94B1;&#x5305;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x4F1A;&#x5411;&#x4F7F;&#x7528;&#x8005;&#x5C55;&#x793A;&#x4E00;&#x4E2A;12&#x81F3;24&#x4E2A;&#x8BCD;&#x7684;&#x987A;&#x5E8F;&#x3002;&#x5355;&#x8BCD;&#x7684;&#x987A;&#x5E8F;&#x5C31;&#x662F;&#x94B1;&#x5305;&#x7684;&#x5907;&#x4EFD;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x6062;&#x590D;&#x4EE5;&#x53CA;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x76F8;&#x540C;&#x6216;&#x8005;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x7684;&#x5BC6;&#x94A5;&#x3002;&#x52A9;&#x8BB0;&#x7801;&#x8BCD;&#x6C47;&#x53EF;&#x4EE5;&#x8BA9;&#x4F7F;&#x7528;&#x8005;&#x590D;&#x5236;&#x94B1;&#x5305;&#x66F4;&#x5BB9;&#x6613;&#x4E00;&#x4E9B;&#xFF0C;&#x56E0;&#x4E3A;&#x76F8;&#x6BD4;&#x8F83;&#x968F;&#x673A;&#x6570;&#x5B57;&#x987A;&#x5E8F;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4EEC;&#x66F4;&#x5BB9;&#x6613;&#x5730;&#x88AB;&#x9605;&#x8BFB;&#x548C;&#x6B63;&#x786E;&#x6284;&#x5199;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x52A9;&#x8BB0;&#x8BCD;&#x7ECF;&#x5E38;&#x4E0E;&#x201C;&#x8111;&#x94B1;&#x5305;&#x201D;&#x6DF7;&#x6DC6;&#x3002; &#x4ED6;&#x4EEC;&#x4E0D;&#x4E00;&#x6837;&#x3002;&#x4E3B;&#x8981;&#x533A;&#x522B;&#x5728;&#x4E8E;&#x8111;&#x94B1;&#x5305;&#x7531;&#x7528;&#x6237;&#x9009;&#x62E9;&#x7684;&#x5355;&#x8BCD;&#x7EC4;&#x6210;&#xFF0C;&#x800C;&#x52A9;&#x8BB0;&#x7B26;&#x662F;&#x7531;&#x94B1;&#x5305;&#x968F;&#x673A;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5E76;&#x5448;&#x73B0;&#x7ED9;&#x7528;&#x6237;&#x3002; &#x8FD9;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x533A;&#x522B;&#x4F7F;&#x52A9;&#x8BB0;&#x8BCD;&#x66F4;&#x52A0;&#x5B89;&#x5168;&#xFF0C;&#x56E0;&#x4E3A;&#x4EBA;&#x7C7B;&#x731C;&#x6D4B;&#x968F;&#x673A;&#x6570;&#x8FD8;&#x662F;&#x65E0;&#x80FD;&#x4E3A;&#x529B;&#x3002;</p>
<p>&#x52A9;&#x8BB0;&#x7801;&#x88AB;&#x5B9A;&#x4E49;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;39&#x4E2D;&#xFF08;&#x53C2;&#x89C1;&quot;&#x9644;&#x5F55;&#xFF12; &#x6BD4;&#x7279;&#x5E01;&#x6539;&#x8FDB;&#x534F;&#x8BAE;[bip0039]&#x201D;&#xFF09;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;BIP-39&#x662F;&#x52A9;&#x8BB0;&#x7801;&#x6807;&#x51C6;&#x7684;&#x4E00;&#x4E2A;&#x5B9E;&#x65BD;&#x65B9;&#x6848;&#x3002;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x6807;&#x51C6;&#xFF0C;&#x4F7F;&#x7528;&#x4E00;&#x7EC4;&#x4E0D;&#x540C;&#x7684;&#x5355;&#x8BCD;&#xFF0C;&#x662F;&#x7531;Electrum&#x94B1;&#x5305;&#x4F7F;&#x7528;&#xFF0C;&#x5E76;&#x4E14;&#x65E9;&#x4E8E;BIP-39&#x3002; BIP-39&#x7531;Trezor&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x80CC;&#x540E;&#x7684;&#x516C;&#x53F8;&#x63D0;&#x51FA;&#xFF0C;&#x4E0E;Electrum&#x7684;&#x5B9E;&#x65BD;&#x4E0D;&#x517C;&#x5BB9;&#x3002; &#x7136;&#x800C;&#xFF0C;BIP-39&#x73B0;&#x5728;&#x5DF2;&#x7ECF;&#x5728;&#x6570;&#x5341;&#x4E2A;&#x53EF;&#x4E92;&#x64CD;&#x4F5C;&#x7684;&#x5B9E;&#x8DF5;&#x6848;&#x4F8B;&#x4E2D;&#x83B7;&#x5F97;&#x4E86;&#x5E7F;&#x6CDB;&#x7684;&#x884C;&#x4E1A;&#x652F;&#x6301;&#xFF0C;&#x5E94;&#x88AB;&#x89C6;&#x4E3A;&#x4E8B;&#x5B9E;&#x4E0A;&#x7684;&#x884C;&#x4E1A;&#x6807;&#x51C6;&#x3002;</p>
<p>BIP-39&#x5B9A;&#x4E49;&#x4E86;&#x52A9;&#x8BB0;&#x7B26;&#x7801;&#x548C;&#x79CD;&#x5B50;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x8FD9;&#x91CC;&#x63CF;&#x8FF0;&#x4E86;&#x4E5D;&#x4E2A;&#x6B65;&#x9AA4;&#x3002; &#x4E3A;&#x4E86;&#x6E05;&#x695A;&#x8D77;&#x89C1;&#xFF0C;&#x8BE5;&#x8FC7;&#x7A0B;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;</p>
<p>1-6&#x6B65;&#x662F;&#x521B;&#x5EFA;&#x52A9;&#x8BB0;&#x8BCD;&#xFF0C;7-9&#x6B65;&#x662F;&#x4ECE;&#x52A9;&#x8BB0;&#x8BCD;&#x5230;&#x79CD;&#x5B50;&#x3002;</p>
<h3 id="522&#x521B;&#x5EFA;&#x52A9;&#x8BB0;&#x8BCD;">5.2.2&#x521B;&#x5EFA;&#x52A9;&#x8BB0;&#x8BCD;</h3>
<p>&#x52A9;&#x8BB0;&#x8BCD;&#x662F;&#x7531;&#x94B1;&#x5305;&#x4F7F;&#x7528;BIP-39&#x4E2D;&#x5B9A;&#x4E49;&#x7684;&#x6807;&#x51C6;&#x5316;&#x8FC7;&#x7A0B;&#x81EA;&#x52A8;&#x751F;&#x6210;&#x7684;&#x3002; &#x94B1;&#x5305;&#x4ECE;&#x71B5;&#x6E90;&#x5F00;&#x59CB;&#xFF0C;&#x589E;&#x52A0;&#x6821;&#x9A8C;&#x548C;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x71B5;&#x6620;&#x5C04;&#x5230;&#x5355;&#x8BCD;&#x5217;&#x8868;&#xFF1A;</p>
<p>1&#x3001;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;128&#x5230;256&#x4F4D;&#x7684;&#x968F;&#x673A;&#x5E8F;&#x5217;&#xFF08;&#x71B5;&#xFF09;&#x3002;</p>
<p>2&#x3001;&#x63D0;&#x51FA;SHA256&#x54C8;&#x5E0C;&#x524D;&#x51E0;&#x4F4D;&#xFF08;&#x71B5;&#x957F;/ 32&#xFF09;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x5E8F;&#x5217;&#x7684;&#x6821;&#x9A8C;&#x548C;&#x3002;</p>
<p>3&#x3001;&#x5C06;&#x6821;&#x9A8C;&#x548C;&#x6DFB;&#x52A0;&#x5230;&#x968F;&#x673A;&#x5E8F;&#x5217;&#x7684;&#x672B;&#x5C3E;&#x3002;</p>
<p>4&#x3001;&#x5C06;&#x5E8F;&#x5217;&#x5212;&#x5206;&#x4E3A;<strong>&#x5305;&#x542B;</strong>11&#x4F4D;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;</p>
<p>5&#x3001;&#x5C06;&#x6BCF;&#x4E2A;&#x5305;&#x542B;11&#x4F4D;&#x90E8;&#x5206;&#x7684;&#x503C;&#x4E0E;&#x4E00;&#x4E2A;&#x5DF2;&#x7ECF;&#x9884;&#x5148;&#x5B9A;&#x4E49;2048&#x4E2A;&#x5355;&#x8BCD;&#x7684;&#x5B57;&#x5178;&#x505A;&#x5BF9;&#x5E94;&#x3002;</p>
<p>6&#x3001;&#x751F;&#x6210;&#x7684;&#x6709;&#x987A;&#x5E8F;&#x7684;&#x5355;&#x8BCD;&#x7EC4;&#x5C31;&#x662F;&#x52A9;&#x8BB0;&#x7801;&#x3002;</p>
<p>&#x56FE;5-6&#x5C55;&#x793A;&#x4E86;&#x71B5;&#x5982;&#x4F55;&#x751F;&#x6210;&#x52A9;&#x8BB0;&#x8BCD;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-bed496243dd75389.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-6&#x8868;&#x793A;&#x751F;&#x6210;&#x71B5;&#x548C;&#x7F16;&#x7801;&#x4F5C;&#x4E3A;&#x52A9;&#x8BB0;&#x8BCD;"></p>
<p>&#x8868;5-2&#x8868;&#x793A;&#x4E86;&#x71B5;&#x6570;&#x636E;&#x7684;&#x5927;&#x5C0F;&#x548C;&#x52A9;&#x8BB0;&#x8BCD;&#x7684;&#x957F;&#x5EA6;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4b5a86e421dabfe1.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-2&#x52A9;&#x8BB0;&#x7801;&#xFF1A;&#x71B5;&#x53CA;&#x5B57;&#x6BB5;&#x957F;&#x5EA6;"></p>
<h3 id="523&#x4ECE;&#x52A9;&#x8BB0;&#x8BCD;&#x751F;&#x6210;&#x79CD;&#x5B50;">5.2.3&#x4ECE;&#x52A9;&#x8BB0;&#x8BCD;&#x751F;&#x6210;&#x79CD;&#x5B50;</h3>
<p>&#x52A9;&#x8BB0;&#x8BCD;&#x8868;&#x793A;&#x957F;&#x5EA6;&#x4E3A;128&#x81F3;256&#x4F4D;&#x7684;&#x71B5;&#x3002; &#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;PBKDF2&#xFF0C;&#x71B5;&#x88AB;&#x7528;&#x4E8E;&#x5BFC;&#x51FA;&#x8F83;&#x957F;&#x7684;&#xFF08;512&#x4F4D;&#xFF09;&#x79CD;&#x5B50;&#x3002;&#x5C06;&#x6240;&#x5F97;&#x7684;&#x79CD;&#x5B50;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x5E76;&#x5F97;&#x5230;&#x5176;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;&#x6709;&#x4E24;&#x4E2A;&#x53C2;&#x6570;&#xFF1A;&#x52A9;&#x8BB0;&#x8BCD;&#x548C;&#x76D0;&#x3002;&#x5176;&#x4E2D;&#x76D0;&#x7684;&#x76EE;&#x7684;&#x662F;&#x589E;&#x52A0;&#x6784;&#x5EFA;&#x80FD;&#x591F;&#x8FDB;&#x884C;&#x66B4;&#x529B;&#x653B;&#x51FB;&#x7684;&#x67E5;&#x627E;&#x8868;&#x7684;&#x56F0;&#x96BE;&#x5EA6;&#x3002; &#x5728;BIP-39&#x6807;&#x51C6;&#x4E2D;&#xFF0C;&#x76D0;&#x5177;&#x6709;&#x53E6;&#x4E00;&#x76EE;&#x7684;&#xFF0C;&#x5B83;&#x5141;&#x8BB8;&#x5F15;&#x5165;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#xFF08;passphrase&#xFF09;&#xFF0C;&#x4F5C;&#x4E3A;&#x4FDD;&#x62A4;&#x79CD;&#x5B50;&#x7684;&#x9644;&#x52A0;&#x5B89;&#x5168;&#x56E0;&#x7D20;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;BIP-39&#x53EF;&#x9009;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x7AE0;&#x8282;&#x8BE6;&#x7EC6;&#x5730;&#x63CF;&#x8FF0;&#x3002;</p>
<p>&#x521B;&#x5EFA;&#x52A9;&#x8BB0;&#x8BCD;&#x4E4B;&#x540E;&#x7684;7-9&#x6B65;&#x662F;&#xFF1A;</p>
<p>7&#x3001;PBKDF2&#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x4ECE;&#x6B65;&#x9AA4;6&#x751F;&#x6210;&#x7684;&#x52A9;&#x8BB0;&#x7B26;&#x3002;</p>
<p>8&#x3001;PBKDF2&#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x53C2;&#x6570;&#x662F;&#x76D0;&#x3002; &#x7531;&#x5B57;&#x7B26;&#x4E32;&#x5E38;&#x6570;&#x201C;&#x52A9;&#x8BB0;&#x8BCD;&#x201D;&#x4E0E;&#x53EF;&#x9009;&#x7684;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x5BC6;&#x7801;&#x5B57;&#x7B26;&#x4E32;&#x8FDE;&#x63A5;&#x7EC4;&#x6210;&#x3002;</p>
<p>9&#x3001;PBKDF2&#x4F7F;&#x7528;HMAC-SHA512&#x7B97;&#x6CD5;&#xFF0C;&#x4F7F;&#x7528;2048&#x6B21;&#x54C8;&#x5E0C;&#x6765;&#x5EF6;&#x4F38;&#x52A9;&#x8BB0;&#x7B26;&#x548C;&#x76D0;&#x53C2;&#x6570;&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;512&#x4F4D;&#x7684;&#x503C;&#x4F5C;&#x4E3A;&#x5176;&#x6700;&#x7EC8;&#x8F93;&#x51FA;&#x3002; &#x8FD9;&#x4E2A;512&#x4F4D;&#x7684;&#x503C;&#x5C31;&#x662F;&#x79CD;&#x5B50;&#x3002;</p>
<p>&#x56FE;5-7&#x663E;&#x793A;&#x4E86;&#x4ECE;&#x52A9;&#x8BB0;&#x8BCD;&#x5982;&#x4F55;&#x751F;&#x6210;&#x79CD;&#x5B50;
<img src="http://upload-images.jianshu.io/upload_images/1785959-155e604188878b39.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-7&#x663E;&#x793A;&#x4E86;&#x4ECE;&#x52A9;&#x8BB0;&#x8BCD;&#x5982;&#x4F55;&#x751F;&#x6210;&#x79CD;&#x5B50;"></p>
<p><strong>&#x63D0;&#x793A;</strong> &#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;&#xFF0C;&#x4F7F;&#x7528;2048&#x6B21;&#x54C8;&#x5E0C;&#x662F;&#x4E00;&#x79CD;&#x975E;&#x5E38;&#x6709;&#x6548;&#x7684;&#x4FDD;&#x62A4;&#xFF0C;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5BF9;&#x52A9;&#x8BB0;&#x8BCD;&#x6216;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x7684;&#x66B4;&#x529B;&#x653B;&#x51FB;&#x3002; &#x5B83;&#x4F7F;&#x5F97;&#x653B;&#x51FB;&#x5C1D;&#x8BD5;&#x975E;&#x5E38;&#x6602;&#x8D35;&#xFF08;&#x4ECE;&#x8BA1;&#x7B97;&#x7684;&#x89D2;&#x5EA6;&#xFF09;&#xFF0C;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x8D85;&#x8FC7;&#x51E0;&#x5343;&#x4E2A;&#x5BC6;&#x7801;&#x548C;&#x52A9;&#x8BB0;&#x7B26;&#x7EC4;&#x5408;&#xFF0C;&#x800C;&#x8FD9;&#x6837;&#x53EF;&#x80FD;&#x4EA7;&#x751F;&#x7684;&#x79CD;&#x5B50;&#x7684;&#x6570;&#x91CF;&#x662F;&#x5DE8;&#x5927;&#x7684;&#xFF08;2^512&#xFF09;&#x3002;</p>
<p>&#x8868;5-3&#x3001;5-4&#x548C;&#x8868;5-5&#x5C55;&#x793A;&#x4E86;&#x4E00;&#x4E9B;&#x52A9;&#x8BB0;&#x7801;&#x7684;&#x4F8B;&#x5B50;&#x548C;&#x5B83;&#x6240;&#x751F;&#x6210;&#x7684;&#x79CD;&#x5B50;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-ccb7cc04d13d06a0.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-3 128&#x4F4D;&#x71B5;&#x7684;&#x52A9;&#x8BB0;&#x7801;&#xFF0C;&#x6CA1;&#x6709;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x79CD;&#x5B50;"></p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-bdfe02cac8c6524b.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-4 128&#x4F4D;&#x71B5;&#x7684;&#x52A9;&#x8BB0;&#x7801;&#xFF0C;&#x589E;&#x52A0;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x79CD;&#x5B50;"></p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-a525f31f72c53aee.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-5 256&#x4F4D;&#x71B5;&#x7684;&#x52A9;&#x8BB0;&#x7801;&#xFF0C;&#x6CA1;&#x6709;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x79CD;&#x5B50;"></p>
<h3 id="524bip-39&#x4E2D;&#x7684;&#x53EF;&#x9009;&#x5BC6;&#x7801;&#x77ED;&#x8BED;">5.2.4BIP-39&#x4E2D;&#x7684;&#x53EF;&#x9009;&#x5BC6;&#x7801;&#x77ED;&#x8BED;</h3>
<p>BIP-39&#x6807;&#x51C6;&#x5141;&#x8BB8;&#x5728;&#x63A8;&#x5BFC;&#x79CD;&#x5B50;&#x65F6;&#x4F7F;&#x7528;&#x53EF;&#x9009;&#x7684;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x3002; &#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#xFF0C;&#x52A9;&#x8BB0;&#x8BCD;&#x662F;&#x7528;&#x7531;&#x5E38;&#x91CF;&#x5B57;&#x7B26;&#x4E32;&#x201C;&#x52A9;&#x8BB0;&#x8BCD;&#x201D;&#x6784;&#x6210;&#x7684;&#x76D0;&#x8FDB;&#x884C;&#x5EF6;&#x4F38;&#xFF0C;&#x4ECE;&#x4EFB;&#x4F55;&#x7ED9;&#x5B9A;&#x7684;&#x52A9;&#x8BB0;&#x8BCD;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;512&#x4F4D;&#x79CD;&#x5B50;&#x3002; &#x5982;&#x679C;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#xFF0C;&#x5BC6;&#x94A5;&#x5EF6;&#x4F38;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x540C;&#x6837;&#x7684;&#x52A9;&#x8BB0;&#x8BCD;&#x4E5F;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x79CD;&#x5B50;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x7ED9;&#x4E88;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x52A9;&#x8BB0;&#x8BCD;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7684;&#x79CD;&#x5B50;&#x3002; &#x57FA;&#x672C;&#x4E0A;&#x6CA1;&#x6709;&#x201C;&#x9519;&#x8BEF;&#x201D;&#x7684;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#xFF0C; &#x6240;&#x6709;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E0D;&#x540C;&#x7684;&#x79CD;&#x5B50;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x5927;&#x6279;&#x53EF;&#x80FD;&#x672A;&#x521D;&#x59CB;&#x5316;&#x7684;&#x94B1;&#x5305;&#x3002;&#x8FD9;&#x6279;&#x94B1;&#x5305;&#x975E;&#x5E38;&#x4E4B;&#x5927;&#xFF08;2^512&#xFF09;&#xFF0C;&#x4F7F;&#x7528;&#x66B4;&#x529B;&#x7834;&#x89E3;&#x6216;&#x968F;&#x673A;&#x731C;&#x6D4B;&#x57FA;&#x672C;&#x4E0D;&#x53EF;&#x80FD;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>BIP-39&#x4E2D;&#x6CA1;&#x6709;&#x201C;&#x9519;&#x8BEF;&#x7684;&#x201D;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x3002; &#x6BCF;&#x4E2A;&#x5BC6;&#x7801;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E00;&#x4E9B;&#x94B1;&#x5305;&#xFF0C;&#x53EA;&#x662F;&#x672A;&#x4F7F;&#x7528;&#x7684;&#x94B1;&#x5305;&#x662F;&#x7A7A;&#x7684;&#x3002;</p>
<p>&#x53EF;&#x9009;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x5E26;&#x6765;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x529F;&#x80FD;&#xFF1A;</p>
<p>&#xFF08;&#x5B58;&#x50A8;&#x5728;&#x5927;&#x8111;&#x4E2D;&#x7684;&#xFF09;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x6210;&#x4E3A;&#x7B2C;&#x4E8C;&#x4E2A;&#x56E0;&#x7D20;&#xFF0C;&#x4F7F;&#x5F97;&#x52A9;&#x8BB0;&#x8BCD;&#x4E0D;&#x80FD;&#x5355;&#x72EC;&#x4F7F;&#x7528;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x52A9;&#x8BB0;&#x8BCD;&#x5907;&#x4EFD;&#x76D7;&#x53D6;&#x540E;&#x88AB;&#x5229;&#x7528;&#x3002;
&#x8D77;&#x5230;&#x63A9;&#x4EBA;&#x8033;&#x76EE;&#x7684;&#x6548;&#x679C;&#xFF0C;&#x628A;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x6307;&#x5411;&#x6709;&#x5C0F;&#x989D;&#x8D44;&#x91D1;&#x7684;&#x94B1;&#x5305;&#xFF0C;&#x5206;&#x6563;&#x653B;&#x51FB;&#x8005;&#x6CE8;&#x610F;&#x529B;&#xFF0C;&#x4F7F;&#x5176;&#x4E0D;&#x5728;&#x5173;&#x6CE8;&#x62E5;&#x6709;&#x5927;&#x989D;&#x8D44;&#x91D1;&#x7684;&#x201C;&#x771F;&#x5B9E;&#x201D;&#x94B1;&#x5305;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x4F7F;&#x7528;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x4E5F;&#x4F1A;&#x5F15;&#x8D77;&#x4E22;&#x5931;&#x7684;&#x98CE;&#x9669;&#xFF1A;</p>
<p>&#x5982;&#x679C;&#x94B1;&#x5305;&#x6240;&#x6709;&#x8005;&#x65E0;&#x884C;&#x4E3A;&#x80FD;&#x529B;&#x6216;&#x6B7B;&#x4EA1;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x77E5;&#x9053;&#x5BC6;&#x7801;&#xFF0C;&#x79CD;&#x5B50;&#x662F;&#x65E0;&#x7528;&#x7684;&#xFF0C;&#x6240;&#x6709;&#x5B58;&#x50A8;&#x5728;&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x8D44;&#x91D1;&#x90FD;&#x5C06;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x5982;&#x679C;&#x6240;&#x6709;&#x8005;&#x5C06;&#x5BC6;&#x7801;&#x77ED;&#x8BED;&#x4E0E;&#x79CD;&#x5B50;&#x5907;&#x4EFD;&#x5728;&#x76F8;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5219;&#x8FDD;&#x53CD;&#x4E86;&#x4E0A;&#x8FF0;&#x7B2C;&#x4E8C;&#x4E2A;&#x56E0;&#x7D20;&#x7684;&#x76EE;&#x7684;&#x3002;&#x867D;&#x7136;&#x5BC6;&#x7801;&#x662F;&#x975E;&#x5E38;&#x6709;&#x7528;&#x7684;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x53EA;&#x80FD;&#x4E0E;&#x4ED4;&#x7EC6;&#x8BA1;&#x5212;&#x7684;&#x5907;&#x4EFD;&#x548C;&#x6062;&#x590D;&#x6D41;&#x7A0B;&#x7ED3;&#x5408;&#x4F7F;&#x7528;&#xFF0C;&#x8003;&#x8651;&#x5230;&#x6240;&#x6709;&#x8005;&#x4E2A;&#x4EBA;&#x98CE;&#x9669;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x5E94;&#x8BE5;&#x5141;&#x8BB8;&#x5176;&#x5BB6;&#x4EBA;&#x6062;&#x590D;&#x52A0;&#x5BC6;&#x8D44;&#x4EA7;&#x3002;</p>
<h3 id="525&#x4F7F;&#x7528;&#x52A9;&#x8BB0;&#x7B26;&#x4EE3;&#x7801;">5.2.5&#x4F7F;&#x7528;&#x52A9;&#x8BB0;&#x7B26;&#x4EE3;&#x7801;</h3>
<p>BIP-39&#x88AB;&#x505A;&#x6210;&#x51FD;&#x6570;&#x5E93;&#xFF0C;&#x652F;&#x6301;&#x591A;&#x79CD;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF1A;</p>
<p><a href="https://github.com/trezor/python-mnemonic" target="_blank">python-mnemonic</a></p>
<p>SatoshiLabs&#x56E2;&#x961F;&#x5728;Python&#x4E2D;&#x63D0;&#x51FA;&#x4E86;BIP-39&#x6807;&#x51C6;&#x7684;&#x53C2;&#x8003;&#x5B9E;&#x73B0;</p>
<p><a href="https://github.com/bitcoinjs/bip39" target="_blank">bitcoinjs/bip39</a></p>
<p>&#x4F5C;&#x4E3A;&#x6D41;&#x884C;&#x7684;bitcoinJS&#x6846;&#x67B6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;JavaScript&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;BIP-39</p>
<p><a href="https://github.com/libbitcoin/libbitcoin/blob/master/src/wallet/mnemonic.cpp" target="_blank">libbitcoin/mnemonic</a></p>
<p>&#x4F5C;&#x4E3A;&#x6D41;&#x884C;&#x7684;Libbitcoin&#x6846;&#x67B6;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5728;C ++&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;BIP-39</p>
<p>&#x8FD8;&#x6709;&#x4E00;&#x4E2A;BIP-39&#x751F;&#x6210;&#x5668;&#x5728;&#x72EC;&#x7ACB;&#x7684;&#x7F51;&#x9875;&#x4E2D;&#x5B9E;&#x73B0;&#xFF0C;&#x5BF9;&#x4E8E;&#x6D4B;&#x8BD5;&#x548C;&#x5B9E;&#x9A8C;&#x975E;&#x5E38;&#x6709;&#x7528;&#x3002;&#x56FE;5-8&#x5C55;&#x793A;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x7F51;&#x9875;&#xFF0C;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x52A9;&#x8BB0;&#x8BCD;&#x3001;&#x79CD;&#x5B50;&#x548C;&#x6269;&#x5C55;&#x79C1;&#x94A5;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-32bc5dce1e7f8ecf.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-8BIP-39&#x751F;&#x6210;&#x5668;&#x5728;&#x72EC;&#x7ACB;&#x7684;&#x7F51;&#x9875;&#x4E2D;&#x5B9E;&#x73B0;"></p>
<p>BIP-39&#x751F;&#x6210;&#x5668;&#x53EF;&#x4EE5;&#x79BB;&#x7EBF;&#x4F7F;&#x7528;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;<a href="https://dcpos.github.io/bip39/" target="_blank">&#x8FD9;&#x4E2A;&#x5728;&#x7EBF;&#x5730;&#x5740;</a>.&#x5730;&#x5740;&#x8F6C;&#x5411;&#x5230;<a href="https://iancoleman.github.io/bip39/" target="_blank">&#x8FD9;&#x513F;&#x4E86;</a>&#x3002;</p>
<h2 id="53&#x4ECE;&#x79CD;&#x5B50;&#x4E2D;&#x521B;&#x9020;hd&#x94B1;&#x5305;">5.3&#x4ECE;&#x79CD;&#x5B50;&#x4E2D;&#x521B;&#x9020;HD&#x94B1;&#x5305;</h2>
<p>HD&#x94B1;&#x5305;&#x4ECE;&#x5355;&#x4E2A;&#x6839;&#x79CD;&#x5B50;&#xFF08;root seed&#xFF09;&#x4E2D;&#x521B;&#x5EFA;&#xFF0C;&#x4E3A;128&#x5230;256&#x4F4D;&#x7684;&#x968F;&#x673A;&#x6570;&#x3002;&#x6700;&#x5E38;&#x89C1;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x79CD;&#x5B50;&#x662F;&#x4ECE;&#x52A9;&#x8BB0;&#x7B26;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x5982;&#x4E0A;&#x4E00;&#x8282;&#x6240;&#x8FF0;&#x3002;</p>
<p>HD&#x94B1;&#x5305;&#x7684;&#x6240;&#x6709;&#x7684;&#x786E;&#x5B9A;&#x6027;&#x90FD;&#x884D;&#x751F;&#x81EA;&#x8FD9;&#x4E2A;&#x6839;&#x79CD;&#x5B50;&#x3002;&#x4EFB;&#x4F55;&#x517C;&#x5BB9;HD &#x94B1;&#x5305;&#x7684;&#x6839;&#x79CD;&#x5B50;&#x4E5F;&#x53EF;&#x91CD;&#x65B0;&#x521B;&#x9020;&#x6574;&#x4E2A;HD&#x94B1;&#x5305;&#x3002;&#x6240;&#x4EE5;&#x7B80;&#x5355;&#x7684;&#x8F6C;&#x79FB;HD&#x94B1;&#x5305;&#x7684;&#x6839;&#x79CD;&#x5B50;&#x5C31;&#x8BA9;HD&#x94B1;&#x5305;&#x4E2D;&#x6240;&#x5305;&#x542B;&#x7684;&#x6210;&#x5343;&#x4E0A;&#x767E;&#x4E07;&#x7684;&#x5BC6;&#x94A5;&#x88AB;&#x590D;&#x5236;&#xFF0C;&#x50A8;&#x5B58;&#x5BFC;&#x51FA;&#x4EE5;&#x53CA;&#x5BFC;&#x5165;&#x3002;</p>
<p>&#x56FE;5-9&#x5C55;&#x793A;&#x521B;&#x5EFA;&#x4E3B;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;HD&#x94B1;&#x5305;&#x7684;&#x4E3B;&#x94FE;&#x4EE3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-838fb4445a1d179c.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-9&#x4ECE;&#x6839;&#x79CD;&#x5B50;&#x521B;&#x5EFA;&#x4E3B;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;HD&#x94B1;&#x5305;&#x7684;&#x4E3B;&#x94FE;&#x4EE3;&#x7801;&#x7684;&#x8FC7;&#x7A0B;"></p>
<p>&#x6839;&#x79CD;&#x5B50;&#x8F93;&#x5165;&#x5230;HMAC-SHA512&#x7B97;&#x6CD5;&#x4E2D;&#x5C31;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x53EF;&#x7528;&#x6765;&#x521B;&#x9020;&#x4E3B;&#x79C1;&#x94A5;(m)&#xFF08;master private key(m) &#xFF09;&#x548C;&#x4E3B;&#x94FE;&#x4EE3;&#x7801;&#xFF08;a master chain code&#xFF09;&#x7684;&#x54C8;&#x5E0C;&#x3002;&#x4E3B;&#x79C1;&#x94A5;&#xFF08;m&#xFF09;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x6211;&#x4EEC;&#x5728;&#x672C;&#x7AE0;&#x5148;&#x524D;&#x770B;&#x5230;&#x7684;&#x90A3;&#x4E2A;&#x666E;&#x901A;&#x692D;&#x5706;&#x66F2;&#x7EBF;m * G&#x8FC7;&#x7A0B;&#x751F;&#x6765;&#x6210;&#x76F8;&#x5BF9;&#x5E94;&#x7684;&#x4E3B;&#x516C;&#x94A5;&#xFF08;M&#xFF09;&#x3002; &#x94FE;&#x4EE3;&#x7801;&#x7528;&#x4E8E;&#x4ECE;&#x6BCD;&#x5BC6;&#x94A5;&#x4E2D;&#x521B;&#x9020;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x90A3;&#x4E2A;&#x51FD;&#x6570;&#x4E2D;&#x5F15;&#x5165;&#x71B5;&#x3002;&#x5982;&#x4E0B;&#x4E00;&#x8282;&#x6240;&#x793A;&#x3002;</p>
<h3 id="531&#x79C1;&#x6709;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x884D;&#x751F;">5.3.1&#x79C1;&#x6709;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x884D;&#x751F;</h3>
<p>&#x5206;&#x5C42;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x4F7F;&#x7528;CKD&#xFF08;child key derivation)&#x51FD;&#x6570;&#x53BB;&#x4ECE;&#x6BCD;&#x5BC6;&#x94A5;&#x884D;&#x751F;&#x51FA;&#x5B50;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x5B50;&#x5BC6;&#x94A5;&#x884D;&#x751F;&#x51FD;&#x6570;&#x662F;&#x57FA;&#x4E8E;&#x5355;&#x9879;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7ED3;&#x5408;&#x4E86;&#xFF1A;</p>
<p>&#x4E00;&#x4E2A;&#x6BCD;&#x79C1;&#x94A5;&#x6216;&#x8005;&#x516C;&#x5171;&#x94A5;&#x5319;&#xFF08;ECDSA&#x672A;&#x538B;&#x7F29;&#x952E;&#xFF09; </p>
<p>&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x94FE;&#x7801;&#xFF08;256 bits&#xFF09;&#x7684;&#x79CD;&#x5B50; </p>
<p>&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x53F7;&#xFF08;32 bits&#xFF09;</p>
<p>&#x94FE;&#x7801;&#x662F;&#x7528;&#x6765;&#x7ED9;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x5F15;&#x5165;&#x786E;&#x5B9A;&#x6027;&#x968F;&#x673A;&#x6570;&#x636E;&#x7684;&#xFF0C;&#x4F7F;&#x5F97;&#x7D22;&#x5F15;&#x4E0D;&#x80FD;&#x5145;&#x5206;&#x884D;&#x751F;&#x5176;&#x4ED6;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x4E86;&#x5B50;&#x5BC6;&#x94A5;&#x5E76;&#x4E0D;&#x80FD;&#x8BA9;&#x5B83;&#x53D1;&#x73B0;&#x81EA;&#x5DF1;&#x7684;&#x59CA;&#x59B9;&#x5BC6;&#x94A5;&#xFF0C;&#x9664;&#x975E;&#x4F60;&#x5DF2;&#x7ECF;&#x6709;&#x4E86;&#x94FE;&#x7801;&#x3002;&#x6700;&#x521D;&#x7684;&#x94FE;&#x7801;&#x79CD;&#x5B50;&#xFF08;&#x5728;&#x5BC6;&#x7801;&#x6811;&#x7684;&#x6839;&#x90E8;&#xFF09;&#x662F;&#x7528;&#x968F;&#x673A;&#x6570;&#x636E;&#x6784;&#x6210;&#x7684;&#xFF0C;&#x968F;&#x540E;&#x94FE;&#x7801;&#x4ECE;&#x5404;&#x81EA;&#x7684;&#x6BCD;&#x94FE;&#x7801;&#x4E2D;&#x884D;&#x751F;&#x51FA;&#x6765;&#x3002;</p>
<p>&#x8FD9;&#x4E09;&#x4E2A;&#x9879;&#x76EE;&#xFF08;&#x6BCD;&#x5BC6;&#x94A5;&#xFF0C;&#x94FE;&#x7801;&#xFF0C;&#x7D22;&#x5F15;&#xFF09;&#x76F8;&#x7ED3;&#x5408;&#x5E76;&#x6563;&#x5217;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x5B50;&#x5BC6;&#x94A5;&#xFF0C;&#x5982;&#x4E0B;&#x3002;</p>
<p>&#x6BCD;&#x516C;&#x5171;&#x94A5;&#x5319;&#x2014;&#x2014;&#x94FE;&#x7801;&#x2014;&#x2014;&#x4EE5;&#x53CA;&#x7D22;&#x5F15;&#x53F7;&#x5408;&#x5E76;&#x5728;&#x4E00;&#x8D77;&#x5E76;&#x4E14;&#x7528;HMAC-SHA512&#x51FD;&#x6570;&#x6563;&#x5217;&#x4E4B;&#x540E;&#x53EF;&#x4EE5;&#x4EA7;&#x751F;512&#x4F4D;&#x7684;&#x6563;&#x5217;&#x3002;&#x6240;&#x5F97;&#x7684;&#x6563;&#x5217;&#x53EF;&#x88AB;&#x62C6;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#x3002;&#x6563;&#x5217;&#x53F3;&#x534A;&#x90E8;&#x5206;&#x7684;256&#x4F4D;&#x4EA7;&#x51FA;&#x53EF;&#x4EE5;&#x7ED9;&#x5B50;&#x94FE;&#x5F53;&#x94FE;&#x7801;&#x3002;&#x5DE6;&#x534A;&#x90E8;&#x5206;256&#x4F4D;&#x6563;&#x5217;&#x4EE5;&#x53CA;&#x7D22;&#x5F15;&#x7801;&#x88AB;&#x52A0;&#x8F7D;&#x5728;&#x6BCD;&#x79C1;&#x94A5;&#x4E0A;&#x6765;&#x884D;&#x751F;&#x5B50;&#x79C1;&#x94A5;&#x3002;&#x5728;&#x56FE;5-11&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8BF4;&#x660E;&#x2014;&#x2014;&#x7D22;&#x5F15;&#x96C6;&#x88AB;&#x8BBE;&#x4E3A;0&#x53BB;&#x751F;&#x4EA7;&#x6BCD;&#x5BC6;&#x94A5;&#x7684;&#x7B2C;0&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;&#x7D22; &#x5F15;&#xFF09;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-23efe345e02fa0d4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-10&#x5EF6;&#x957F;&#x6BCD;&#x79C1;&#x94A5;&#x53BB;&#x521B;&#x9020;&#x5B50;&#x79C1;&#x94A5;"></p>
<p>&#x6539;&#x53D8;&#x7D22;&#x5F15;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x5EF6;&#x957F;&#x6BCD;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;&#x521B;&#x9020;&#x5E8F;&#x5217;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x6BD4;&#x5982;&#x5B50;0&#xFF0C;&#x5B50;1&#xFF0C;&#x5B50;2&#x7B49;&#x7B49;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x6BCD;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x6709;2,147,483,647 (2^31) &#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x3002;2^31&#x662F;&#x6574;&#x4E2A;2^32&#x8303;&#x56F4;&#x53EF;&#x7528;&#x7684;&#x4E00;&#x534A;&#xFF0C;&#x56E0;&#x4E3A;&#x53E6;&#x4E00;&#x534A;&#x662F;&#x4E3A;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x63A8;&#x5BFC;&#x800C;&#x4FDD;&#x7559;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x8BA8;&#x8BBA;&#x3002;</p>
<p>&#x5411;&#x5BC6;&#x7801;&#x6811;&#x4E0B;&#x4E00;&#x5C42;&#x91CD;&#x590D;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#xFF0C;&#x6BCF;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x4F9D;&#x6B21;&#x6210;&#x4E3A;&#x6BCD;&#x5BC6;&#x94A5;&#x7EE7;&#x7EED;&#x521B;&#x9020;&#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#xFF0C;&#x76F4;&#x5230;&#x65E0;&#x9650;&#x4EE3;&#x3002;</p>
<p>&#x56FE;5-11&#x9610;&#x8FF0;&#x4E86;&#x6269;&#x5C55;&#x6BCD;&#x516C;&#x94A5;&#x6765;&#x884D;&#x751F;&#x5B50;&#x516C;&#x94A5;&#x7684;&#x4F20;&#x9012;&#x673A;&#x5236;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-1224f8f1acd381d4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-11&#x6269;&#x5C55;&#x6BCD;&#x516C;&#x5171;&#x94A5;&#x5319;&#x6765;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x5B50;&#x516C;&#x5171;&#x94A5;&#x5319;"></p>
<h3 id="532&#x4F7F;&#x7528;&#x884D;&#x751F;&#x7684;&#x5B50;&#x5BC6;&#x94A5;">5.3.2&#x4F7F;&#x7528;&#x884D;&#x751F;&#x7684;&#x5B50;&#x5BC6;&#x94A5;</h3>
<p>&#x5B50;&#x79C1;&#x94A5;&#x4E0D;&#x80FD;&#x4ECE;&#x975E;&#x786E;&#x5B9A;&#x6027;&#xFF08;&#x968F;&#x673A;&#xFF09;&#x5BC6;&#x94A5;&#x4E2D;&#x88AB;&#x533A;&#x5206;&#x51FA;&#x6765;&#x3002;&#x56E0;&#x4E3A;&#x884D;&#x751F;&#x51FD;&#x6570;&#x662F;&#x5355;&#x5411;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x5B50;&#x5BC6;&#x94A5;&#x4E0D;&#x80FD;&#x88AB;&#x7528;&#x6765;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x6BCD;&#x5BC6;&#x94A5;&#x3002;&#x5B50;&#x5BC6;&#x94A5;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x53D1;&#x73B0;&#x4ED6;&#x4EEC;&#x7684;&#x76F8;&#x540C;&#x5C42;&#x7EA7;&#x7684;&#x59CA;&#x59B9;&#x5BC6;&#x94A5;&#x3002;&#x5982;&#x679C;&#x4F60;&#x6709;&#x7B2C;n&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#xFF0C;&#x4F60;&#x4E0D;&#x80FD;&#x53D1;&#x73B0;&#x5B83;&#x524D;&#x9762;&#x7684;&#xFF08;&#x7B2C;n&#xFF0D;1&#xFF09;&#x6216;&#x8005; &#x540E;&#x9762;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#xFF08;n&#xFF0B;1&#xFF09;&#x6216;&#x8005;&#x5728;&#x540C;&#x4E00;&#x987A;&#x5E8F;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x53EA;&#x6709;&#x6BCD;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;&#x94FE;&#x7801;&#x624D;&#x80FD;&#x5F97;&#x5230;&#x6240;&#x6709;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x6CA1;&#x6709;&#x5B50;&#x94FE;&#x7801;&#x7684;&#x8BDD;&#xFF0C;&#x5B50;&#x5BC6;&#x94A5;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x6765;&#x884D;&#x751F;&#x51FA;&#x4EFB;&#x4F55;&#x5B59;&#x5BC6;&#x94A5;&#x3002;&#x4F60;&#x9700;&#x8981;&#x540C;&#x65F6;&#x6709;&#x5B50;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;&#x5BF9;&#x5E94;&#x7684;&#x94FE;&#x7801;&#x624D;&#x80FD;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x5206;&#x652F;&#x6765;&#x884D;&#x751F;&#x51FA;&#x5B59;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x90A3;&#x5B50;&#x79C1;&#x94A5;&#x81EA;&#x5DF1;&#x53EF;&#x88AB;&#x7528;&#x505A;&#x4EC0;&#x4E48;&#x5462;&#xFF1F;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x505A;&#x516C;&#x94A5;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x4E4B;&#x540E;&#x5B83;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x5728;&#x90A3;&#x4E2A;&#x5730;&#x5740;&#x6765;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x548C;&#x652F;&#x4ED8;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x5B50;&#x79C1;&#x94A5;&#x3001;&#x5BF9;&#x5E94;&#x7684;&#x516C;&#x94A5;&#x4EE5;&#x53CA;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x90FD;&#x4E0D;&#x80FD;&#x4ECE;&#x968F;&#x673A;&#x521B;&#x9020;&#x7684;&#x5BC6;&#x94A5;&#x548C;&#x5730;&#x5740;&#x4E2D;&#x88AB;&#x533A;&#x5206;&#x51FA;&#x6765;&#x3002;&#x4E8B;&#x5B9E;&#x662F;&#x5B83;&#x4EEC;&#x6240;&#x5728;&#x7684;&#x5E8F;&#x5217;&#xFF0C;&#x5728;&#x521B;&#x9020;&#x4ED6;&#x4EEC;&#x7684;HD&#x94B1;&#x5305;&#x51FD;&#x6570;&#x4E4B;&#x5916;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x88AB;&#x521B;&#x9020;&#x51FA;&#x6765;&#xFF0C;&#x5B83;&#x4EEC;&#x5C31;&#x548C;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x5BC6;&#x94A5;&#x4E00;&#x6837;&#x8FD0;&#x884C;&#x4E86;&#x3002;</p>
<h3 id="533&#x6269;&#x5C55;&#x5BC6;&#x94A5;">5.3.3&#x6269;&#x5C55;&#x5BC6;&#x94A5;</h3>
<p>&#x6B63;&#x5982;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x7684;&#xFF0C;&#x5BC6;&#x94A5;&#x884D;&#x751F;&#x51FD;&#x6570;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x521B;&#x9020;&#x5BC6;&#x94A5;&#x6811;&#x4E0A;&#x4EFB;&#x4F55;&#x5C42;&#x7EA7;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x8FD9;&#x53EA;&#x9700;&#x8981;&#x4E09;&#x4E2A;&#x8F93;&#x5165;&#x91CF;&#xFF1A;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x4E00;&#x4E2A;&#x94FE;&#x7801;&#x4EE5;&#x53CA;&#x60F3;&#x8981;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x7D22;&#x5F15;&#x3002;&#x5BC6;&#x94A5;&#x4EE5;&#x53CA;&#x94FE;&#x7801;&#x8FD9;&#x4E24;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#x88AB;&#x7ED3;&#x5408;&#x4E4B;&#x540E;&#xFF0C;&#x5C31;&#x53EB;&#x505A;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#xFF08;extended key&#xFF09;&#x3002;&#x672F;&#x8BED;&#x201C;extended key&#x201D;&#x4E5F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x53EF;&#x6269;&#x5C55;&#x7684;&#x5BC6;&#x94A5;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x884D;&#x751F;&#x5B50;&#x5BC6;&#x94A5;&#x3002;</p>
<p>&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x7B80;&#x5355;&#x5730;&#x88AB;&#x50A8;&#x5B58;&#x5E76;&#x4E14;&#x8868;&#x793A;&#x4E3A;&#x7B80;&#x5355;&#x7684;&#x5C06;256&#x4F4D;&#x5BC6;&#x94A5;&#x4E0E;256&#x4F4D;&#x94FE;&#x7801;&#x6240;&#x5E76;&#x8054;&#x7684;512&#x4F4D;&#x5E8F;&#x5217;&#x3002;&#x6709;&#x4E24;&#x79CD;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x3002;&#x6269;&#x5C55;&#x7684;&#x79C1;&#x94A5;&#x662F;&#x79C1;&#x94A5;&#x4EE5;&#x53CA;&#x94FE;&#x7801;&#x7684;&#x7ED3;&#x5408;&#x3002;&#x5B83;&#x53EF;&#x88AB;&#x7528;&#x6765;&#x884D;&#x751F;&#x5B50;&#x79C1;&#x94A5;&#xFF08;&#x5B50;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x5B50;&#x516C;&#x94A5;&#xFF09;&#x3002;&#x516C;&#x94A5;&#x4EE5;&#x53CA;&#x94FE;&#x7801;&#x7EC4;&#x6210;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x6269;&#x5C55;&#x5B50;&#x516C;&#x94A5;&#xFF0C;&#x89C1;&#x201C;&#x751F;&#x6210;&#x516C;&#x94A5;&#x201D;&#x7AE0;&#x8282;&#x3002;</p>
<p>&#x60F3;&#x8C61;&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x4F5C;&#x4E3A;HD&#x94B1;&#x5305;&#x4E2D;&#x5BC6;&#x94A5;&#x6811;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x6839;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x8FD9;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x5269;&#x4E0B;&#x6240;&#x6709;&#x90E8;&#x5206;&#x3002;&#x6269;&#x5C55;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x800C;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x53EA;&#x80FD;&#x591F;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x7684;&#x5206;&#x652F;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x79C1;&#x94A5;&#xFF08;&#x6216;&#x8005;&#x516C;&#x94A5;&#xFF09;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x94FE;&#x7801;&#x3002;&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x51FA;&#x5B50;&#x5BC6;&#x94A5;&#x5E76;&#x4E14;&#x80FD;&#x521B;&#x9020;&#x51FA;&#x5BC6;&#x94A5;&#x6811;&#x7ED3;&#x6784;&#x4E2D;&#x7684;&#x6574;&#x4E2A;&#x5206;&#x652F;&#x3002;&#x5206;&#x4EAB;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6574;&#x4E2A;&#x5206;&#x652F;&#x3002;</p>
<p>&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x901A;&#x8FC7;Base58Check&#x6765;&#x7F16;&#x7801;&#xFF0C;&#x4ECE;&#x800C;&#x80FD;&#x8F7B;&#x6613;&#x5730;&#x5728;&#x4E0D;&#x540C;&#x7684;BIP-32&#x517C;&#x5BB9;&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x5BFC;&#x5165;&#x5BFC;&#x51FA;&#x3002;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x7F16;&#x7801;&#x7528;&#x7684; Base58Check&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x7248;&#x672C;&#x53F7;&#xFF0C;&#x8FD9;&#x5BFC;&#x81F4;&#x5728;Base58&#x7F16;&#x7801;&#x5B57;&#x7B26;&#x4E2D;&#xFF0C;&#x51FA;&#x73B0;&#x524D;&#x7F00;&#x201C;xprv&#x201D;&#x548C;&#x201C;xpub&#x201D;&#x3002;&#x8FD9;&#x79CD;&#x524D;&#x7F00;&#x53EF;&#x4EE5;&#x8BA9;&#x7F16;&#x7801;&#x66F4;&#x6613;&#x88AB;&#x8BC6;&#x522B;&#x3002;&#x56E0;&#x4E3A;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x662F;512&#x6216;&#x8005;513&#x4F4D;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x6BD4;&#x6211;&#x4EEC;&#x4E4B;&#x524D;&#x6240;&#x770B;&#x5230;&#x7684;Base58Check&#x7F16;&#x7801;&#x4E32;&#x66F4;&#x957F;&#x4E00;&#x4E9B;&#x3002;</p>
<p>&#x4EE5;&#x4E0B;&#x9762;&#x7684;&#x6269;&#x5C55;&#x79C1;&#x94A5;&#x4E3A;&#x4F8B;&#xFF0C;&#x5176;&#x4F7F;&#x7528;&#x7684;&#x662F;Base58Check&#x7F16;&#x7801;&#xFF1A;</p>
<p>xprv9tyUQV64JT5qs3RSTJkXCWKMyUgoQp7F3hA1xzG6ZGu6u6Q9VMNjGr67Lctvy5P8oyaYAL9CAWrUE9i6GoNMKUga5biW6Hx4tws2six3b9c</p>
<p>&#x8FD9;&#x662F;&#x4E0A;&#x9762;&#x6269;&#x5C55;&#x79C1;&#x94A5;&#x5BF9;&#x5E94;&#x7684;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF0C;&#x540C;&#x6837;&#x4F7F;&#x7528;Base58Check&#x7F16;&#x7801;&#xFF1A;</p>
<p>xpub67xpozcx8pe95XVuZLHXZeG6XWXHpGq6Qv5cmNfi7cS5mtjJ2tgypeQbBs2UAR6KECeeMVKZBPLrtJunSDMstweyLXhRgPxdp14sk9tJPW9</p>
<h3 id="534&#x516C;&#x5171;&#x5B50;&#x5BC6;&#x94A5;&#x63A8;&#x5BFC;">5.3.4&#x516C;&#x5171;&#x5B50;&#x5BC6;&#x94A5;&#x63A8;&#x5BFC;</h3>
<p>&#x6B63;&#x5982;&#x4E4B;&#x524D;&#x63D0;&#x5230;&#x7684;&#xFF0C;&#x5206;&#x5C42;&#x786E;&#x5B9A;&#x6027;&#x94B1;&#x5305;&#x7684;&#x4E00;&#x4E2A;&#x5F88;&#x6709;&#x7528;&#x7684;&#x7279;&#x70B9;&#x5C31;&#x662F;&#x53EF;&#x4EE5;&#x4E0D;&#x901A;&#x8FC7;&#x79C1;&#x94A5;&#x800C;&#x76F4;&#x63A5;&#x4ECE;&#x516C;&#x5171;&#x6BCD;&#x5BC6;&#x94A5;&#x6D3E;&#x751F;&#x51FA;&#x516C;&#x5171;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x80FD; &#x529B;&#x3002;&#x8FD9;&#x5C31;&#x7ED9;&#x4E86;&#x6211;&#x4EEC;&#x4E24;&#x79CD;&#x884D;&#x751F;&#x5B50;&#x516C;&#x94A5;&#x7684;&#x65B9;&#x6CD5;&#xFF1A;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x5B50;&#x79C1;&#x94A5;&#xFF0C;&#x518D;&#x6216;&#x8005;&#x5C31;&#x662F;&#x76F4;&#x63A5;&#x901A;&#x8FC7;&#x6BCD;&#x516C;&#x94A5;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x53EF;&#x4EE5;&#x5728;HD&#x94B1;&#x5305;&#x7ED3;&#x6784;&#x7684;&#x5206;&#x652F;&#x4E2D;&#xFF0C;&#x88AB;&#x7528;&#x6765;&#x884D;&#x751F;&#x6240;&#x6709;&#x7684;&#x516C;&#x94A5;&#xFF08;&#x4E14;&#x53EA;&#x6709;&#x516C;&#x94A5;&#xFF09;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x5FEB;&#x6377;&#x65B9;&#x5F0F;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x521B;&#x9020;&#x975E;&#x5E38;&#x4FDD;&#x5BC6;&#x7684;&#x53EA;&#x6709;&#x516C;&#x94A5;&#x914D;&#x7F6E;&#x3002;&#x5728;&#x914D;&#x7F6E;&#x4E2D;&#xFF0C;&#x670D;&#x52A1;&#x5668;&#x6216;&#x8005;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E0D;&#x7BA1;&#x6709;&#x6CA1;&#x6709;&#x79C1;&#x94A5;&#xFF0C;&#x90FD;&#x53EF;&#x4EE5;&#x6709;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x7684;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x79CD;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x521B;&#x9020;&#x51FA;&#x65E0;&#x9650;&#x6570;&#x91CF;&#x7684;&#x516C;&#x94A5;&#x4EE5;&#x53CA;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x4F46;&#x662F;&#x53D1;&#x9001;&#x5230;&#x8FD9;&#x4E2A;&#x5730;&#x5740;&#x91CC;&#x7684;&#x4EFB;&#x4F55;&#x6BD4;&#x7279;&#x5E01;&#x90FD;&#x4E0D;&#x80FD;&#x4F7F;&#x7528;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x53E6;&#x4E00;&#x79CD;&#x66F4;&#x4FDD;&#x9669;&#x7684;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#xFF0C;&#x6269;&#x5C55;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x884D;&#x751F;&#x51FA;&#x6240;&#x6709;&#x7684;&#x5BF9;&#x5E94;&#x7684;&#x53EF;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x4EE5;&#x53CA;&#x82B1;&#x94B1;&#x7684;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x65B9;&#x6848;&#x7684;&#x5E38;&#x89C1;&#x5E94;&#x7528;&#x662F;&#x5B89;&#x88C5;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x7535;&#x5546;&#x7684;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x516C;&#x94A5;&#x884D;&#x751F;&#x51FD;&#x6570;&#x53BB;&#x7ED9;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF08;&#x6BD4;&#x5982;&#x5BA2;&#x6237;&#x7684;&#x8D2D;&#x7269;&#x8F66;&#xFF09;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x4F46;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x88AB;&#x5077;&#xFF0C;&#x7F51;&#x7EDC;&#x670D;&#x52A1;&#x5546;&#x4E0D;&#x4F1A;&#x6709;&#x4EFB;&#x4F55;&#x79C1;&#x94A5;&#x3002;&#x6CA1;&#x6709;HD&#x94B1;&#x5305;&#x7684;&#x8BDD;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5B89;&#x5168;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x521B;&#x9020;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x4E4B;&#x540E;&#x5C31;&#x63D0;&#x524D;&#x4E0A;&#x4F20;&#x5230;&#x7535;&#x5546;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x6BD4;&#x8F83;&#x7E41;&#x7410;&#x800C;&#x4E14;&#x8981;&#x6C42;&#x6301;&#x7EED;&#x7684;&#x7EF4;&#x62A4;&#x6765;&#x786E;&#x4FDD;&#x7535;&#x5546;&#x670D;&#x52A1;&#x5668;&#x4E0D;&#x201C;&#x7528;&#x5149;&#x201D;&#x516C;&#x94A5;&#x3002;</p>
<p>&#x8FD9;&#x79CD;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5E38;&#x89C1;&#x7684;&#x5E94;&#x7528;&#x662F;&#x51B7;&#x85CF;&#x6216;&#x8005;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6269;&#x5C55;&#x7684;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x88AB;&#x50A8;&#x5B58;&#x5728;&#x7EB8;&#x8D28;&#x94B1;&#x5305;&#x4E2D;&#x6216;&#x8005;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x4E2D;&#xFF08;&#x6BD4;&#x5982; Trezor &#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF09;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x53EF;&#x4EE5;&#x5728;&#x7EBF;&#x4FDD;&#x5B58;&#x3002;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x6839;&#x636E;&#x610F;&#x613F;&#x521B;&#x9020;&#x201C;&#x63A5;&#x6536;&#x201D;&#x5730;&#x5740;&#x800C;&#x79C1;&#x94A5;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x5730;&#x5728;&#x7EBF;&#x4E0B;&#x88AB;&#x4FDD;&#x5B58;&#x3002;&#x4E3A;&#x4E86;&#x652F;&#x4ED8;&#x8D44;&#x91D1;&#xFF0C;&#x4F7F;&#x7528;&#x8005;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x7684;&#x79C1;&#x94A5;&#x79BB;&#x7EBF;&#x7B7E;&#x7F72;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x8BBE;&#x5907;&#xFF08;&#x6BD4;&#x5982; Trezor&#xFF09;&#x7B7E;&#x7F72;&#x4EA4;&#x6613;&#x3002;</p>
<h3 id="535&#x5728;&#x7F51;&#x5E97;&#x4E2D;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF08;xpub&#xFF09;">5.3.5&#x5728;&#x7F51;&#x5E97;&#x4E2D;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF08;xpub&#xFF09;</h3>
<p>&#x7EE7;&#x7EED;Gabriel&#x7F51;&#x5E97;&#x7684;&#x6545;&#x4E8B;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;Gabriel&#x662F;&#x5982;&#x4F55;&#x4F7F;&#x7528;HD&#x94B1;&#x5305;&#x3002;</p>
<p>Gabriel&#x5728;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x6258;&#x7BA1;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x7684;WordPress&#x9875;&#x9762;&#xFF0C;&#x4F5C;&#x4E3A;&#x4ED6;&#x7684;&#x7F51;&#x4E0A;&#x5546;&#x5E97;&#x3002;&#x5B83;&#x7684;&#x7F51;&#x5E97;&#x975E;&#x5E38;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x6709;&#x51E0;&#x4E2A;&#x9875;&#x9762;&#x548C;&#x4E00;&#x5F20;&#x5E26;&#x6709;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x8BA2;&#x5355;&#x3002;</p>
<p>Gabriel&#x4F7F;&#x7528;&#x4ED6;&#x7684;Trezor&#x8BBE;&#x5907;&#x751F;&#x6210;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4F5C;&#x4E3A;&#x4ED6;&#x7684;&#x5546;&#x5E97;&#x7684;&#x4E3B;&#x8981;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x6240;&#x6709;&#x6536;&#x5230;&#x7684;&#x4ED8;&#x6B3E;&#x90FD;&#x5C06;&#x652F;&#x4ED8;&#x7ED9;&#x4ED6;&#x7684;Trezor&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x6240;&#x63A7;&#x5236;&#x7684;&#x5730;&#x5740;&#x3002;</p>
<p>&#x5BA2;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8868;&#x683C;&#x63D0;&#x4EA4;&#x8BA2;&#x5355;&#xFF0C;&#x5E76;&#x5411;Gabriel&#x53D1;&#x5E03;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x53D1;&#x9001;&#x4ED8;&#x6B3E;&#xFF0C;&#x89E6;&#x53D1;&#x4E00;&#x5C01;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#xFF0C;&#x5176;&#x4E2D;&#x5305;&#x542B;Gabriel&#x7684;&#x8BA2;&#x5355;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x3002;&#x6BCF;&#x5468;&#x53EA;&#x51E0;&#x4E2A;&#x8BA2;&#x5355;&#xFF0C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x5F97;&#x5F88;&#x597D;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x4E2A;&#x5C0F;&#x578B;&#x7F51;&#x7EDC;&#x5546;&#x5E97;&#x53D8;&#x5F97;&#x76F8;&#x5F53;&#x6210;&#x529F;&#xFF0C;&#x5E76;&#x5438;&#x5F15;&#x4E86;&#x5F88;&#x591A;&#x6765;&#x81EA;&#x5F53;&#x5730;&#x793E;&#x533A;&#x7684;&#x8BA2;&#x5355;&#x3002;Gabriel&#x5F88;&#x5FEB;&#x5C31;&#x4E0D;&#x582A;&#x91CD;&#x8D1F;&#x3002;&#x7531;&#x4E8E;&#x6240;&#x6709;&#x8BA2;&#x5355;&#x90FD;&#x652F;&#x4ED8;&#x76F8;&#x540C;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x56E0;&#x6B64;&#x5F88;&#x96BE;&#x6B63;&#x786E;&#x5339;&#x914D;&#x8BA2;&#x5355;&#x548C;&#x4EA4;&#x6613;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5F53;&#x540C;&#x4E00;&#x6570;&#x91CF;&#x7684;&#x591A;&#x4E2A;&#x8BA2;&#x5355;&#x7D27;&#x5BC6;&#x76F8;&#x8FDE;&#x65F6;&#x3002;</p>
<p>HD&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x79C1;&#x94A5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x83B7;&#x53D6;&#x516C;&#x5171;&#x5B50;&#x5BC6;&#x94A5;&#xFF0C;&#x8BE5;&#x80FD;&#x529B;&#x4E3A;Gabriel&#x63D0;&#x4F9B;&#x4E86;&#x66F4;&#x597D;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x3002; Gabriel&#x53EF;&#x4EE5;&#x5728;&#x4ED6;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x52A0;&#x8F7D;&#x4E00;&#x4E2A;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF08;xpub&#xFF09;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x7528;&#x4E8E;&#x4E3A;&#x6BCF;&#x4E2A;&#x5BA2;&#x6237;&#x8BA2;&#x5355;&#x5BFC;&#x51FA;&#x552F;&#x4E00;&#x7684;&#x5730;&#x5740;&#x3002;Gabriel&#x53EF;&#x4EE5;&#x82B1;&#x8D39;&#x4ED6;&#x5728;Trezor&#x91CC;&#x8D44;&#x91D1;&#xFF0C;&#x4F46;&#x52A0;&#x8F7D;&#x5728;&#x7F51;&#x7AD9;&#x4E0A;&#x7684;xpub&#x53EA;&#x80FD;&#x751F;&#x6210;&#x5730;&#x5740;&#x5E76;&#x6536;&#x5230;&#x8D44;&#x91D1;&#x3002;HD&#x94B1;&#x5305;&#x7684;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x975E;&#x5E38;&#x5B89;&#x5168;&#x3002; Gabriel&#x7684;&#x7F51;&#x7AD9;&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;&#x79C1;&#x94A5;&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x9700;&#x8981;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5BFC;&#x51FA;xpub&#xFF0C;Gabriel&#x5C06;&#x57FA;&#x4E8E;Web&#x7684;&#x8F6F;&#x4EF6;&#x4E0E;Trezor&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x914D;&#x5408;&#x4F7F;&#x7528;&#x3002;&#x5FC5;&#x987B;&#x63D2;&#x5165;Trezor&#x8BBE;&#x5907;&#x624D;&#x80FD;&#x5BFC;&#x51FA;&#x516C;&#x94A5;&#x3002;&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x5BFC;&#x51FA;&#x79C1;&#x94A5;&#xFF0C;&#x8FD9;&#x4E9B;&#x5BC6;&#x94A5;&#x59CB;&#x7EC8;&#x4FDD;&#x7559;&#x5728;&#x8BBE;&#x5907;&#x4E0A;&#x3002;&#x56FE;5-12&#x663E;&#x793A;&#x4E86;Gabriel&#x7528;&#x4E8E;&#x5BFC;&#x51FA;xpub&#x7684;Web&#x754C;&#x9762;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-d2be0a190bb66849.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-12&#x4ECE;Trezor&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x5BFC;&#x51FA;xpub"></p>
<p>Gabriel&#x5C06;xpub&#x590D;&#x5236;&#x5230;&#x4ED6;&#x7F51;&#x5E97;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8D2D;&#x7269;&#x8F6F;&#x4EF6;&#x4E2D;&#x3002; &#x4ED6;&#x4F7F;&#x7528;&#x7684;&#x8F6F;&#x4EF6;&#x662F;Mycelium Gear&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x7F51;&#x5E97;&#x7684;&#x5F00;&#x6E90;&#x63D2;&#x4EF6;&#xFF0C;&#x7528;&#x4E8E;&#x5404;&#x79CD;&#x7F51;&#x7EDC;&#x6258;&#x7BA1;&#x548C;&#x5185;&#x5BB9;&#x5E73;&#x53F0;&#x3002; Mycelium Gear&#x4F7F;&#x7528;xpub&#x4E3A;&#x6BCF;&#x6B21;&#x8D2D;&#x4E70;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x552F;&#x4E00;&#x7684;&#x5730;&#x5740;&#x3002;</p>
<h3 id="536&#x786C;&#x5316;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x884D;&#x751F;">5.3.6&#x786C;&#x5316;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x884D;&#x751F;</h3>
<p>&#x4ECE;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x884D;&#x751F;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x516C;&#x94A5;&#x7684;&#x80FD;&#x529B;&#x662F;&#x5F88;&#x91CD;&#x8981;&#x7684;&#xFF0C;&#x4F46;&#x7275;&#x626F;&#x4E00;&#x4E9B;&#x98CE;&#x9669;&#x3002;&#x8BBF;&#x95EE;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x5E76;&#x4E0D;&#x80FD;&#x5F97;&#x5230;&#x8BBF;&#x95EE;&#x5B50;&#x79C1;&#x94A5;&#x7684;&#x9014;&#x5F84;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x56E0;&#x4E3A;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x5305;&#x542B;&#x6709;&#x94FE;&#x7801;&#xFF0C;&#x5982;&#x679C;&#x5B50;&#x79C1;&#x94A5;&#x88AB;&#x77E5;&#x9053;&#x6216;&#x8005;&#x88AB;&#x6CC4;&#x6F0F;&#x7684;&#x8BDD;&#xFF0C;&#x94FE;&#x7801;&#x5C31;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x884D;&#x751F;&#x6240;&#x6709;&#x7684;&#x5176;&#x4ED6;&#x5B50;&#x79C1;&#x94A5;&#x3002;&#x7B80;&#x5355;&#x5730;&#x6CC4;&#x9732;&#x7684;&#x79C1;&#x94A5;&#x4EE5;&#x53CA;&#x4E00;&#x4E2A;&#x6BCD;&#x94FE;&#x7801;&#xFF0C;&#x53EF;&#x4EE5;&#x66B4;&#x9732;&#x6240;&#x6709;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x5B50;&#x79C1;&#x94A5;&#x4E0E;&#x6BCD;&#x94FE;&#x7801;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x63A8;&#x65AD;&#x6BCD;&#x79C1;&#x94A5;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5E94;&#x5BF9;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#xFF0C;HD&#x94B1;&#x5305;&#x4F7F;&#x7528;&#x4E00;&#x79CD;&#x53EB;&#x505A;&#x786C;&#x5316;&#x884D;&#x751F;(hardened derivation&#xFF09;&#x7684;&#x66FF;&#x4EE3;&#x884D;&#x751F;&#x51FD;&#x6570;&#x3002;&#x8FD9;&#x5C31;&#x201C;&#x6253;&#x7834;&#x201D;&#x4E86;&#x6BCD;&#x516C;&#x94A5;&#x4EE5;&#x53CA;&#x5B50;&#x94FE;&#x7801;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;&#x8FD9;&#x4E2A;&#x786C;&#x5316;&#x884D;&#x751F;&#x51FD;&#x6570;&#x4F7F;&#x7528;&#x4E86;&#x6BCD;&#x79C1;&#x94A5;&#x53BB;&#x63A8;&#x5BFC;&#x5B50;&#x94FE;&#x7801;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6BCD;&#x516C;&#x94A5;&#x3002;&#x8FD9;&#x5C31;&#x5728;&#x6BCD;/&#x5B50;&#x987A;&#x5E8F;&#x4E2D;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x9053;&#x201C;&#x9632;&#x706B;&#x5899;&#x201D;&#x2014;&#x2014;&#x6709;&#x94FE;&#x7801;&#x4F46;&#x5E76;&#x4E0D;&#x80FD;&#x591F;&#x7528;&#x6765;&#x63A8;&#x7B97;&#x5B50;&#x94FE;&#x7801;&#x6216;&#x8005;&#x59CA;&#x59B9;&#x79C1;&#x94A5;&#x3002;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x51FD;&#x6570;&#x770B;&#x8D77;&#x6765;&#x51E0;&#x4E4E;&#x4E0E;&#x4E00;&#x822C;&#x7684;&#x884D;&#x751F;&#x7684;&#x5B50;&#x79C1;&#x94A5;&#x76F8;&#x540C;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#x6BCD;&#x79C1;&#x94A5;&#x88AB;&#x7528;&#x6765;&#x8F93;&#x5165;&#x6563;&#x5217;&#x51FD;&#x6570;&#x4E2D;&#x800C;&#x4E0D;&#x662F;&#x6BCD;&#x516C;&#x94A5;&#xFF0C;&#x5982;&#x56FE;5-13&#x6240;&#x793A;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-da0636d43b3579ed.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;5-13&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x786C;&#x5316;&#x63A8;&#x5BFC;;&#xFF0C;&#x7701;&#x7565;&#x7236;&#x516C;&#x94A5;"></p>
<p>&#x5F53;&#x5F3A;&#x5316;&#x79C1;&#x94A5;&#x884D;&#x751F;&#x51FD;&#x6570;&#x88AB;&#x4F7F;&#x7528;&#x65F6;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x5B50;&#x79C1;&#x94A5;&#x4EE5;&#x53CA;&#x94FE;&#x7801;&#x4E0E;&#x4F7F;&#x7528;&#x4E00;&#x822C;&#x884D;&#x751F;&#x51FD;&#x6570;&#x6240;&#x5F97;&#x5230;&#x7684;&#x7ED3;&#x679C;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x3002;&#x5F97;&#x5230;&#x7684;&#x5BC6;&#x94A5;&#x201C;&#x5206;&#x652F;&#x201D;&#x53EF;&#x4EE5;&#x88AB;&#x7528;&#x6765;&#x751F;&#x4EA7;&#x4E0D;&#x6613;&#x88AB;&#x653B;&#x51FB;&#x7684;&#x6269;&#x5C55;&#x516C;&#x94A5;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6240;&#x542B;&#x7684;&#x94FE;&#x7801;&#x4E0D;&#x80FD;&#x88AB;&#x7528;&#x6765;&#x5F00;&#x53D1;&#x6216;&#x8005;&#x66B4;&#x9732;&#x4EFB;&#x4F55;&#x79C1;&#x94A5;&#x3002;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x4E5F;&#x56E0;&#x6B64;&#x88AB;&#x7528;&#x5728;&#x4E0A;&#x4E00;&#x5C42;&#x7EA7;&#xFF0C;&#x4F7F;&#x7528;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x7684;&#x5BC6;&#x94A5;&#x6811;&#x4E2D;&#x521B;&#x9020;&#x201C;&#x95F4;&#x9699;&#x201D;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x5730;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x8981;&#x5229;&#x7528;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x7684;&#x4FBF;&#x6377;&#x6765;&#x884D;&#x751F;&#x516C;&#x94A5;&#x7684;&#x5206;&#x652F;&#x800C;&#x4E0D;&#x5C06;&#x4F60;&#x81EA;&#x5DF1;&#x66B4;&#x9732;&#x5728;&#x6CC4;&#x9732;&#x6269;&#x5C55;&#x94FE;&#x7801;&#x7684;&#x98CE;&#x9669;&#x4E0B;&#xFF0C; &#x4F60;&#x5E94;&#x8BE5;&#x4ECE;&#x5F3A;&#x5316;&#x6BCD;&#x79C1;&#x94A5;&#x884D;&#x751F;&#x516C;&#x94A5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4ECE;&#x4E00;&#x822C;&#x7684;&#x6BCD;&#x79C1;&#x94A5;&#x6765;&#x884D;&#x751F;&#x3002;&#x6700;&#x597D;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#xFF0C;&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x4E86;&#x63A8;&#x5230;&#x51FA;&#x4E3B;&#x5BC6;&#x94A5;&#xFF0C;&#x4E3B;&#x5BC6;&#x94A5;&#x6240;&#x884D;&#x751F;&#x7684;&#x7B2C;&#x4E00;&#x5C42;&#x7EA7;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x6700;&#x597D;&#x4F7F;&#x7528;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x3002;</p>
<h3 id="537&#x6B63;&#x5E38;&#x884D;&#x751F;&#x548C;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x7684;&#x7D22;&#x5F15;&#x53F7;&#x7801;">5.3.7&#x6B63;&#x5E38;&#x884D;&#x751F;&#x548C;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x7684;&#x7D22;&#x5F15;&#x53F7;&#x7801;</h3>
<p>&#x7528;&#x5728;&#x884D;&#x751F;&#x51FD;&#x6570;&#x4E2D;&#x7684;&#x7D22;&#x5F15;&#x53F7;&#x7801;&#x662F;32&#x4F4D;&#x7684;&#x6574;&#x6570;&#x3002;&#x4E3A;&#x4E86;&#x533A;&#x5206;&#x5BC6;&#x94A5;&#x662F;&#x4ECE;&#x6B63;&#x5E38;&#x884D;&#x751F;&#x51FD;&#x6570;&#x4E2D;&#x884D;&#x751F;&#x51FA;&#x6765;&#x8FD8;&#x662F;&#x4ECE;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x51FD;&#x6570;&#x4E2D;&#x4EA7;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x7D22;&#x5F15;&#x53F7;&#x88AB;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x8303;&#x56F4;&#x3002;&#x7D22;&#x5F15;&#x53F7;&#x5728;0&#x548C;2^31&#x2013;1(0x0 to 0x7FFFFFFF)&#x4E4B;&#x95F4;&#x7684;&#x662F;&#x53EA;&#x88AB;&#x7528;&#x5728;&#x5E38;&#x89C4;&#x884D;&#x751F;&#x3002;&#x7D22;&#x5F15;&#x53F7;&#x5728;2^31&#x548C;2^32&#x2013; 1(0x80000000 to 0xFFFFFFFF)&#x4E4B;&#x95F4;&#x7684;&#x53EA;&#x88AB;&#x7528;&#x5728;&#x5F3A;&#x5316;&#x884D;&#x751F;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7D22;&#x5F15;&#x53F7;&#x5C0F;&#x4E8E;2^31&#x5C31;&#x610F;&#x5473;&#x7740;&#x5B50;&#x5BC6;&#x94A5;&#x662F;&#x5E38;&#x89C4;&#x7684;&#xFF0C;&#x800C;&#x5927;&#x4E8E;&#x6216;&#x8005;&#x7B49;&#x4E8E;2^31&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x5C31;&#x662F;&#x5F3A;&#x5316;&#x578B;&#x7684;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BA9;&#x7D22;&#x5F15;&#x53F7;&#x7801;&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x9605;&#x8BFB;&#x548C;&#x5C55;&#x793A;&#xFF0C;&#x5F3A;&#x5316;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x7D22;&#x5F15;&#x53F7;&#x7801;&#x662F;&#x4ECE;0&#x5F00;&#x59CB;&#x5C55;&#x793A;&#x7684;&#xFF0C;&#x4F46;&#x662F;&#x53F3;&#x4E0A;&#x89D2;&#x6709;&#x4E00;&#x4E2A;&#x5C0F;&#x6487;&#x53F7;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5E38;&#x89C4;&#x5B50;&#x5BC6;&#x94A5;&#x56E0;&#x6B64;&#x88AB;&#x8868;&#x8FF0;&#x4E3A;0&#xFF0C;&#x4F46;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x5F3A;&#x5316;&#x5B50;&#x5BC6;&#x94A5;&#xFF08;&#x7D22;&#x5F15;&#x53F7;&#x4E3A;0x80000000&#xFF09;&#x5C31;&#x88AB;&#x8868;&#x793A;&#x4E3A;0&apos;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5F3A;&#x5316;&#x5BC6;&#x94A5;&#x4F9D;&#x5E8F;&#x6709;&#x4E86;&#x7D22; &#x5F15;&#x53F7;0x80000001&#xFF0C;&#x4E14;&#x88AB;&#x663E;&#x793A;&#x4E3A;1&apos;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x5F53;&#x4F60;&#x770B;&#x5230;HD&#x94B1;&#x5305;&#x7D22;&#x5F15;&#x53F7;i&apos;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740; 2^31+i&#x3002;</p>
<h3 id="538hd&#x94B1;&#x5305;&#x5BC6;&#x94A5;&#x8BC6;&#x522B;&#x7B26;&#xFF08;&#x8DEF;&#x5F84;&#xFF09;">5.3.8HD&#x94B1;&#x5305;&#x5BC6;&#x94A5;&#x8BC6;&#x522B;&#x7B26;&#xFF08;&#x8DEF;&#x5F84;&#xFF09;</h3>
<p>HD&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x5BC6;&#x94A5;&#x662F;&#x7528;&#x201C;&#x8DEF;&#x5F84;&#x201D;&#x547D;&#x540D;&#x7684;&#xFF0C;&#x4E14;&#x6BCF;&#x4E2A;&#x7EA7;&#x522B;&#x4E4B;&#x95F4;&#x7528;&#x659C;&#x6760;&#xFF08;/&#xFF09;&#x5B57;&#x7B26;&#x6765;&#x8868;&#x793A;&#xFF08;&#x89C1;&#x8868;5-6&#xFF09;&#x3002;&#x7531;&#x4E3B;&#x79C1;&#x94A5;&#x884D;&#x751F;&#x51FA;&#x7684;&#x79C1;&#x94A5;&#x8D77;&#x59CB;&#x4EE5;&#x201C;m&#x201D;&#x6253;&#x5934;&#x3002;&#x7531;&#x4E3B;&#x516C;&#x94A5;&#x884D;&#x751F;&#x7684;&#x516C;&#x94A5;&#x8D77;&#x59CB;&#x4EE5;&#x201C;M&#x201C;&#x6253;&#x5934;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCD;&#x5BC6;&#x94A5;&#x751F;&#x6210;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x79C1;&#x94A5;&#x662F;m/0&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x662F;M/0&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x7684;&#x5B50;&#x5BC6;&#x94A5;&#x5C31;&#x662F;m/0/1&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;</p>
<p>&#x5BC6;&#x94A5;&#x7684;&#x201C;&#x7956;&#x5148;&#x201D;&#x662F;&#x4ECE;&#x53F3;&#x5411;&#x5DE6;&#x8BFB;&#xFF0C;&#x76F4;&#x5230;&#x4F60;&#x8FBE;&#x5230;&#x4E86;&#x884D;&#x751F;&#x51FA;&#x7684;&#x5B83;&#x7684;&#x4E3B;&#x5BC6;&#x94A5;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6807;&#x8BC6;&#x7B26;m/x/y/z&#x63CF;&#x8FF0;&#x7684;&#x662F;&#x5B50;&#x5BC6;&#x94A5;m/x/y&#x7684;&#x7B2C;z&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x3002;&#x800C;&#x5B50;&#x5BC6;&#x94A5;m/x/y&#x53C8;&#x662F;m/x&#x7684;&#x7B2C;y&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x3002;m/x&#x53C8;&#x662F;m&#x7684;&#x7B2C;x&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4fb34b7a9b8d8df1.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-6 HD&#x94B1;&#x5305;&#x8DEF;&#x5F84;&#x7684;&#x4F8B;&#x5B50;"></p>
<h3 id="539hd&#x94B1;&#x5305;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x7684;&#x5BFC;&#x822A;">5.3.9HD&#x94B1;&#x5305;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x7684;&#x5BFC;&#x822A;</h3>
<p>HD&#x94B1;&#x5305;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x63D0;&#x4F9B;&#x4E86;&#x6781;&#x5927;&#x7684;&#x7075;&#x6D3B;&#x6027;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x6BCD;&#x6269;&#x5C55;&#x5BC6;&#x94A5;&#x6709;40&#x4EBF;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#xFF1A;20&#x4EBF;&#x4E2A;&#x5E38;&#x89C4;&#x5B50;&#x5BC6;&#x94A5;&#x548C;20&#x4EBF;&#x4E2A;&#x5F3A;&#x5316;&#x5B50;&#x5BC6;&#x94A5;&#x3002; &#x800C;&#x6BCF;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x53C8;&#x4F1A;&#x6709;40&#x4EBF;&#x4E2A;&#x5B50;&#x5BC6;&#x94A5;&#x5E76;&#x4E14;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x53EA;&#x8981;&#x4F60;&#x613F;&#x610F;&#xFF0C;&#x8FD9;&#x4E2A;&#x6811;&#x7ED3;&#x6784;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x7C7B;&#x63A8;&#x5230;&#x65E0;&#x7A77;&#x4EE3;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x53C8;&#x7531;&#x4E8E;&#x6709;&#x4E86;&#x8FD9;&#x4E2A;&#x7075;&#x6D3B;&#x6027;&#xFF0C;&#x5BF9;&#x65E0;&#x9650;&#x7684;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x8FDB;&#x884C;&#x5BFC;&#x822A;&#x5C31;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x56F0;&#x96BE;&#x3002;&#x5C24;&#x5176;&#x662F;&#x5BF9;&#x4E8E;&#x5728;&#x4E0D;&#x540C;&#x7684;HD&#x94B1;&#x5305;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x8F6C;&#x79FB;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x5185;&#x90E8;&#x7EC4;&#x7EC7;&#x5230;&#x5185;&#x90E8;&#x5206;&#x652F;&#x4EE5;&#x53CA;&#x4E9A;&#x5206;&#x652F;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x662F;&#x65E0;&#x7A77;&#x7684;&#x3002;</p>
<p>&#x4E24;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x6539;&#x8FDB;&#x5EFA;&#x8BAE;&#xFF08;BIPs&#xFF09;&#x63D0;&#x4F9B;&#x4E86;&#x8FD9;&#x4E2A;&#x590D;&#x6742;&#x95EE;&#x9898;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x2014;&#x2014;&#x901A;&#x8FC7;&#x521B;&#x5EFA;&#x51E0;&#x4E2A;HD&#x94B1;&#x5305;&#x6811;&#x7684;&#x63D0;&#x8BAE;&#x6807;&#x51C6;&#x3002;BIP-43&#x63D0;&#x51FA;&#x4F7F;&#x7528;&#x7B2C;&#x4E00;&#x4E2A;&#x5F3A;&#x5316;&#x5B50;&#x7D22;&#x5F15;&#x4F5C;&#x4E3A;&#x7279;&#x6B8A;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x8868;&#x793A;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x7684;&#x201C;purpose&#x201D;&#x3002;&#x57FA;&#x4E8E;BIP-43&#xFF0C;HD&#x94B1;&#x5305;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x4E14;&#x53EA;&#x7528;&#x7B2C;&#x4E00;&#x5C42;&#x7EA7;&#x7684;&#x6811;&#x7684;&#x5206;&#x652F;&#xFF0C;&#x800C;&#x4E14;&#x6709;&#x7D22;&#x5F15;&#x53F7;&#x7801;&#x53BB;&#x8BC6;&#x522B;&#x7ED3;&#x6784;&#x5E76;&#x4E14;&#x6709;&#x547D;&#x540D;&#x7A7A;&#x95F4;&#x6765;&#x5B9A;&#x4E49;&#x5269;&#x4F59;&#x7684;&#x6811;&#x7684;&#x76EE;&#x7684;&#x5730;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;HD&#x94B1;&#x5305;&#x53EA;&#x4F7F;&#x7528;&#x5206;&#x652F;m/i&apos;/&#x662F; &#x4E3A;&#x4E86;&#x8868;&#x660E;&#x90A3;&#x4E2A;&#x88AB;&#x7D22;&#x5F15;&#x53F7;&#x201C;i&#x201D;&#x5B9A;&#x4E49;&#x7684;&#x7279;&#x6B8A;&#x4E3A;&#x76EE;&#x5730;&#x3002;</p>
<p>&#x5728;BIP-43&#x6807;&#x51C6;&#x4E0B;&#xFF0C;&#x4E3A;&#x4E86;&#x5EF6;&#x957F;&#x7684;&#x90A3;&#x4E2A;&#x7279;&#x6B8A;&#x89C4;&#x8303;&#xFF0C;BIP-44&#x63D0;&#x8BAE;&#x4E86;&#x591A;&#x8D26;&#x6237;&#x7ED3;&#x6784;&#x4F5C;&#x4E3A;&#x201C;purpose&#x201D;&#x3002;&#x6240;&#x6709;&#x9075;&#x5FAA;BIP-44&#x7684;HD&#x94B1;&#x5305;&#x4F9D;&#x636E;&#x53EA;&#x4F7F;&#x7528;&#x6811;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5206;&#x652F;&#x7684;&#x8981;&#x6C42;&#x800C;&#x88AB;&#x5B9A;&#x4E49;&#xFF1A;m/44&apos;/&#x3002;
BIP-44&#x6307;&#x5B9A;&#x4E86;&#x5305;&#x542B;5&#x4E2A;&#x9884;&#x5B9A;&#x4E49;&#x6811;&#x72B6;&#x5C42;&#x7EA7;&#x7684;&#x7ED3;&#x6784;&#xFF1A;</p>
<p> m / purpose&apos; / coin_type&apos; / account&apos; / change / address_index</p>
<p>&#x7B2C;&#x4E00;&#x5C42;&#x7684;purpose&#x603B;&#x662F;&#x88AB;&#x8BBE;&#x5B9A;&#x4E3A;44&apos;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x5C42;&#x7684;&#x201C;coin_type&#x201D;&#x7279;&#x6307;&#x5E01;&#x79CD;&#x5E76;&#x4E14;&#x5141;&#x8BB8;&#x591A;&#x5143;&#x8D27;&#x5E01;HD&#x94B1;&#x5305;&#x4E2D;&#x7684;&#x8D27;&#x5E01;&#x5728;&#x7B2C;&#x4E8C;&#x4E2A;&#x5C42;&#x7EA7;&#x4E0B;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x4E9A;&#x6811;&#x72B6;&#x7ED3;&#x6784;&#x3002;&#x76EE;&#x524D;&#x6709;&#x4E09;&#x79CD;&#x8D27;&#x5E01;&#x88AB;&#x5B9A;&#x4E49;&#xFF1A;Bitcoin is m/44&apos;/0&apos;&#x3001;Bitcoin Testnet is m/44&apos;/1&apos;&#xFF0C;&#x4EE5;&#x53CA; Litecoin is m/44&apos;/2&apos;&#x3002;</p>
<p>&#x6811;&#x7684;&#x7B2C;&#x4E09;&#x5C42;&#x7EA7;&#x662F;&#x201C;account&#x201D;&#xFF0C;&#x8FD9;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x4F7F;&#x7528;&#x8005;&#x4E3A;&#x4E86;&#x4F1A;&#x8BA1;&#x6216;&#x8005;&#x7EC4;&#x7EC7;&#x76EE;&#x7684;&#xFF0C;&#x800C;&#x53BB;&#x518D;&#x7EC6;&#x5206;&#x4ED6;&#x4EEC;&#x7684;&#x94B1;&#x5305;&#x5230;&#x72EC;&#x7ACB;&#x7684;&#x903B;&#x8F91;&#x6027;&#x4E9A;&#x8D26;&#x6237;&#x3002; &#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;HD&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x201C;&#x8D26;&#x6237;&#x201D;&#xFF1A;m/44&apos;/0&apos;/0&apos; &#x548C; m/44&apos;/0&apos;/1&apos;&#x3002;&#x6BCF;&#x4E2A;&#x8D26;&#x6237;&#x90FD;&#x662F;&#x5B83;&#x81EA;&#x5DF1;&#x4E9A;&#x6811;&#x7684;&#x6839;&#x3002;</p>
<p>&#x7B2C;&#x56DB;&#x5C42;&#x7EA7;&#x5C31;&#x662F;&#x201C;change&#x201D;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;HD&#x94B1;&#x5305;&#x6709;&#x4E24;&#x4E2A;&#x4E9A;&#x6811;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7528;&#x6765;&#x63A5;&#x6536;&#x5730;&#x5740;&#x4E00;&#x4E2A;&#x662F;&#x7528;&#x6765;&#x521B;&#x9020;&#x627E;&#x96F6;&#x5730;&#x5740;&#x3002;&#x6CE8;&#x610F;&#x65E0;&#x8BBA;&#x5148;&#x524D;&#x7684;&#x5C42;&#x7EA7;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x5F3A;&#x5316;&#x884D;&#x751F;&#xFF0C;&#x8FD9;&#x4E00;&#x5C42;&#x7EA7;&#x4F7F;&#x7528;&#x7684;&#x90FD;&#x662F;&#x5E38;&#x89C4;&#x884D;&#x751F;&#x3002;&#x8FD9;&#x662F;&#x4E3A;&#x4E86;&#x5141;&#x8BB8;&#x8FD9;&#x4E00;&#x5C42;&#x7EA7;&#x7684;&#x6811;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x73AF;&#x5883;&#x4E0B;&#xFF0C;&#x8F93;&#x51FA;&#x6269;&#x5C55;&#x516C;&#x94A5;&#x3002;</p>
<p>&#x88AB;HD&#x94B1;&#x5305;&#x884D;&#x751F;&#x7684;&#x53EF;&#x7528;&#x7684;&#x5730;&#x5740;&#x662F;&#x7B2C;&#x56DB;&#x5C42;&#x7EA7;&#x7684;&#x5B50;&#x7EA7;&#xFF0C;&#x5C31;&#x662F;&#x7B2C;&#x4E94;&#x5C42;&#x7EA7;&#x7684;&#x6811;&#x7684;&#x201C;address_index&#x201D;&#x3002;&#x6BD4;&#x5982;&#xFF0C;&#x7B2C;&#x4E09;&#x4E2A;&#x5C42;&#x7EA7;&#x7684;&#x4E3B;&#x8D26;&#x6237;&#x6536;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x652F;&#x4ED8;&#x7684;&#x5730;&#x5740;&#x5C31;&#x662F; M/44&apos;/0&apos;/0&apos;/0/2&#x3002;&#x8868;5-7&#x5C55;&#x793A;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-8e9b2f2dbbc42acd.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;5-7 BIP0044 HD &#x94B1;&#x5305;&#x7ED3;&#x6784;&#x7684;&#x4F8B;&#x5B50;"></p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch04.html" class="navigation navigation-prev " aria-label="Previous page: 第四章密钥和地址">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch06.html" class="navigation navigation-next " aria-label="Next page: 第六章交易">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第五章钱包","level":"1.11","depth":1,"next":{"title":"第六章交易","level":"1.12","depth":1,"path":"ch06.md","ref":"ch06.md","articles":[]},"previous":{"title":"第四章密钥和地址","level":"1.10","depth":1,"path":"ch04.md","ref":"ch04.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch05.md","mtime":"2018-12-14T06:26:05.579Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

