
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第九章区块链 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch10.html" />
    
    
    <link rel="prev" href="ch08.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第九章区块链</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="91&#x7B80;&#x4ECB;">9.1&#x7B80;&#x4ECB;</h2>
<p>&#x533A;&#x5757;&#x94FE;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x662F;&#x7531;&#x5305;&#x542B;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x533A;&#x5757;&#x6309;&#x7167;&#x4ECE;&#x8FDC;&#x53CA;&#x8FD1;&#x7684;&#x987A;&#x5E8F;&#x6709;&#x5E8F;&#x94FE;&#x63A5;&#x8D77;&#x6765;&#x7684;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x5B58;&#x50A8;&#x4E3A;&#x5E73;&#x9762;&#x6587;&#x4EF6;&#xFF08;flat file&#xFF09;&#xFF0C;&#x6216;&#x662F;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x7B80;&#x5355;&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x4F7F;&#x7528;Google&#x7684;LevelDB&#x6570;&#x636E;&#x5E93;&#x5B58;&#x50A8;&#x533A;&#x5757;&#x94FE;&#x5143;&#x6570;&#x636E;&#x3002;&#x533A;&#x5757;&#x88AB;&#x4ECE;&#x8FDC;&#x53CA;&#x8FD1;&#x6709;&#x5E8F;&#x5730;&#x94FE;&#x63A5;&#x5728;&#x8FD9;&#x4E2A;&#x94FE;&#x6761;&#x91CC;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x6307;&#x5411;&#x524D;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x533A;&#x5757;&#x94FE;&#x7ECF;&#x5E38;&#x88AB;&#x89C6;&#x4E3A;&#x4E00;&#x4E2A;&#x5782;&#x76F4;&#x7684;&#x6808;&#xFF0C;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x6808;&#x5E95;&#x7684;&#x9996;&#x533A;&#x5757;&#xFF0C;&#x968F;&#x540E;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x533A;&#x5757;&#x4E4B;&#x4E0A;&#x3002;&#x7528;&#x6808;&#x6765;&#x5F62;&#x8C61;&#x5316;&#x8868;&#x793A;&#x533A;&#x5757;&#x4F9D;&#x6B21;&#x5806;&#x53E0;&#x8FD9;&#x4E00;&#x6982;&#x5FF5;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x4FBF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528; &#x4E00;&#x4E9B;&#x672F;&#x8BED;&#xFF0C;&#x4F8B;&#x5982;&#xFF1A;&#x201C;&#x9AD8;&#x5EA6;&#x201D;&#x6765;&#x8868;&#x793A;&#x533A;&#x5757;&#x4E0E;&#x9996;&#x533A;&#x5757;&#x4E4B;&#x95F4;&#x7684;&#x8DDD;&#x79BB;&#xFF1B;&#x4EE5;&#x53CA;&#x201C;&#x9876;&#x90E8;&#x201D;&#x6216;&#x201C;&#x9876;&#x7AEF;&#x201D;&#x6765;&#x8868;&#x793A;&#x6700;&#x65B0;&#x6DFB;&#x52A0;&#x7684;&#x533A;&#x5757;&#x3002;</p>
<p>&#x5BF9;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5934;&#x8FDB;&#x884C;SHA256&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#xFF0C;&#x53EF;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x53EF;&#x4EE5;&#x8BC6;&#x522B;&#x51FA;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x5BF9;&#x5E94;&#x533A;&#x5757;&#x3002;&#x540C;&#x65F6;&#xFF0C; &#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5176;&#x533A;&#x5757;&#x5934;&#x7684;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x5F15;&#x7528;&#x524D;&#x4E00;&#x533A;&#x5757;&#xFF08;&#x7236;&#x533A;&#x5757;&#xFF09;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5934;&#x90FD;&#x5305;&#x542B;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x8FD9;&#x6837;&#x628A;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x63A5;&#x5230;&#x5404;&#x81EA;&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x5E8F;&#x5217;&#x5C31;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x6761;&#x4E00;&#x76F4;&#x53EF;&#x4EE5;&#x8FFD;&#x6EAF;&#x5230;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF08;&#x521B;&#x4E16;&#x533A;&#x5757;&#xFF09;&#x7684; &#x94FE;&#x6761;&#x3002;</p>
<p>&#x867D;&#x7136;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x4F46;&#x53EF;&#x4EE5;&#x6682;&#x65F6;&#x62E5;&#x6709;&#x591A;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x3002;&#x6BCF;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x90FD;&#x5C06;&#x540C;&#x4E00;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x5176;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x4E2D;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#xFF08;&#x7236;&#x533A;&#x5757;&#xFF09;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x51FA;&#x73B0;&#x591A;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x7684;&#x60C5;&#x51B5;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#x3002;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x53EA;&#x662F;&#x6682;&#x65F6;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x6709;&#x5F53;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x533A;&#x5757;&#x51E0;&#x4E4E;&#x540C;&#x65F6;&#x88AB;&#x4E0D;&#x540C;&#x7684;&#x77FF;&#x5DE5;&#x53D1;&#x73B0;&#x65F6;&#x624D;&#x4F1A;&#x53D1;&#x751F;&#xFF08;&#x53C2;&#x89C1;&#x201C;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#xFF09;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#x4F1A;&#x6210;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x540C;&#x65F6;&#x89E3;&#x51B3;&#x4E86;&#x201C;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#x7684;&#x95EE;&#x9898;&#x3002;&#x5C3D;&#x7BA1;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x4E0D;&#x6B62;&#x4E00;&#x4E2A;&#x5B50;&#x533A;&#x5757;&#xFF0C;&#x4F46;&#x6BCF;&#x4E00;&#x533A;&#x5757;&#x53EA;&#x6709; &#x4E00;&#x4E2A;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x53EF;&#x4EE5;&#x6307;&#x5411;&#x5B83;&#x7684;&#x552F;&#x4E00;&#x7236;&#x533A;&#x5757;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x533A;&#x5757;&#x5934;&#x91CC;&#x9762;&#x5305;&#x542B;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#xFF0C;&#x6240;&#x4EE5;&#x5F53;&#x524D;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E5F;&#x53D7;&#x5230;&#x8BE5;&#x5B57;&#x6BB5;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5982;&#x679C;&#x7236;&#x533A;&#x5757;&#x7684;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x5B50;&#x533A;&#x5757;&#x7684;&#x8EAB;&#x4EFD;&#x6807;&#x8BC6;&#x4E5F;&#x4F1A;&#x8DDF;&#x7740;&#x53D8;&#x5316;&#x3002;&#x5F53;&#x7236;&#x533A;&#x5757;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x52A8;&#x65F6;&#xFF0C;&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E5F;&#x53D1;&#x751F;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x5C06;&#x8FEB;&#x4F7F;&#x5B50;&#x533A;&#x5757;&#x7684;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x4ECE;&#x800C;&#x53C8;&#x5C06;&#x5BFC;&#x81F4;&#x5B50;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x3002;&#x800C;&#x5B50;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53D1;&#x751F;&#x6539;&#x53D8;&#x53C8;&#x5C06;&#x8FEB;&#x4F7F;&#x5B59;&#x533A;&#x5757;&#x7684;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x53D1;&#x751F;&#x6539;&#x53D8;&#xFF0C;&#x53C8;&#x56E0;&#x6B64;&#x6539;&#x53D8;&#x4E86;&#x5B59;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x4EE5;&#x6B64;&#x7C7B;&#x63A8;&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x6709;&#x5F88;&#x591A;&#x4EE3;&#x4EE5;&#x540E;&#xFF0C;&#x8FD9;&#x79CD;&#x7011;&#x5E03;&#x6548;&#x5E94;&#x5C06;&#x4FDD;&#x8BC1;&#x8BE5;&#x533A;&#x5757;&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x53D8;&#xFF0C;&#x9664;&#x975E;&#x5F3A;&#x5236;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x8BE5;&#x533A;&#x5757;&#x6240;&#x6709;&#x540E;&#x7EED;&#x7684;&#x533A;&#x5757;&#x3002;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x9700;&#x8981;&#x8017;&#x8D39;&#x5DE8;&#x5927;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#xFF0C;&#x6240;&#x4EE5;&#x4E00;&#x4E2A;&#x957F;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5B58;&#x5728;&#x53EF;&#x4EE5;&#x8BA9;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5386;&#x53F2;&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5B89;&#x5168;&#x6027;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x5F81;&#x3002;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x533A;&#x5757;&#x94FE;&#x60F3;&#x8C61;&#x6210;&#x5730;&#x8D28;&#x6784;&#x9020;&#x4E2D;&#x7684;&#x5730;&#x8D28;&#x5C42;&#x6216;&#x8005;&#x662F;&#x51B0;&#x5DDD;&#x5CA9;&#x82AF;&#x6837;&#x54C1;&#x3002;&#x8868;&#x5C42;&#x53EF;&#x80FD;&#x4F1A;&#x968F;&#x7740;&#x5B63;&#x8282;&#x800C;&#x53D8;&#x5316;&#xFF0C;&#x751A;&#x81F3;&#x5728;&#x6C89;&#x79EF;&#x4E4B;&#x524D;&#x5C31;&#x88AB;&#x98CE;&#x5439;&#x8D70;&#x4E86;&#x3002;&#x4F46;&#x662F;&#x8D8A;&#x5F80;&#x6DF1;&#x5904;&#xFF0C;&#x5730;&#x8D28;&#x5C42;&#x5C31;&#x53D8;&#x5F97;&#x8D8A;&#x7A33;&#x5B9A;&#x3002;&#x5230;&#x4E86;&#x51E0;&#x767E;&#x82F1;&#x5C3A;&#x6DF1;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x770B;&#x5230;&#x7684;&#x5C06;&#x662F;&#x4FDD;&#x5B58;&#x4E86;&#x6570;&#x767E;&#x4E07;&#x5E74;&#x4F46;&#x4F9D;&#x7136;&#x4FDD;&#x6301;&#x5386;&#x53F2;&#x539F;&#x72B6;&#x7684;&#x5CA9;&#x5C42;&#x3002;&#x5728;&#x533A;&#x5757;&#x94FE;&#x91CC;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x51E0;&#x4E2A;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x4F1A;&#x7531;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x6240;&#x5F15;&#x53D1;&#x7684;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x800C;&#x88AB;&#x4FEE;&#x6539;&#x3002;&#x6700;&#x65B0;&#x7684;&#x516D;&#x4E2A;&#x533A;&#x5757;&#x5C31;&#x50CF;&#x51E0;&#x82F1;&#x5BF8;&#x6DF1;&#x7684;&#x8868;&#x571F;&#x5C42;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8D85;&#x8FC7;&#x8FD9;&#x516D;&#x5757;&#x540E;&#xFF0C;&#x533A;&#x5757;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x8D8A;&#x6DF1;&#xFF0C;&#x88AB;&#x6539;&#x53D8;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#x3002;&#x5728;100&#x4E2A;&#x533A;&#x5757;&#x4EE5;&#x540E;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x5DF2;&#x7ECF;&#x8DB3;&#x591F;&#x7A33;&#x5B9A;&#xFF0C;&#x8FD9;&#x65F6;Coinbase&#x4EA4;&#x6613;&#xFF08;&#x5305;&#x542B;&#x65B0;&#x6316;&#x51FA;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4EA4;&#x6613;&#xFF09;&#x53EF;&#x4EE5;&#x88AB;&#x652F;&#x4ED8;&#x3002;&#x51E0;&#x5343;&#x4E2A;&#x533A;&#x5757;&#xFF08;&#x4E00;&#x4E2A;&#x6708;&#xFF09;&#x540E;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5C06;&#x53D8;&#x6210;&#x786E;&#x5B9A;&#x7684;&#x5386;&#x53F2;&#xFF0C;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x6539;&#x53D8;&#x3002;</p>
<h2 id="92-&#x533A;&#x5757;&#x7ED3;&#x6784;">9.2 &#x533A;&#x5757;&#x7ED3;&#x6784;</h2>
<p>&#x533A;&#x5757;&#x662F;&#x4E00;&#x79CD;&#x88AB;&#x5305;&#x542B;&#x5728;&#x516C;&#x5F00;&#x8D26;&#x7C3F;&#xFF08;&#x533A;&#x5757;&#x94FE;&#xFF09;&#x91CC;&#x7684;&#x805A;&#x5408;&#x4E86;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x7684;&#x5BB9;&#x5668;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x5B83;&#x7531;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x5143;&#x6570;&#x636E;&#x7684;&#x533A;&#x5757;&#x5934;&#x548C;&#x7D27;&#x8DDF;&#x5176;&#x540E;&#x7684;&#x6784;&#x6210;&#x533A;&#x5757;&#x4E3B;&#x4F53;&#x7684;&#x4E00;&#x957F;&#x4E32;&#x4EA4;&#x6613;&#x5217;&#x8868;&#x7EC4;&#x6210;&#x3002;&#x533A;&#x5757;&#x5934;&#x662F;80&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x81F3;&#x5C11;&#x662F;250&#x5B57;&#x8282;&#xFF0C;&#x800C;&#x4E14;&#x5E73;&#x5747;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x8D85;&#x8FC7;500&#x4E2A;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x5B8C;&#x6574;&#x533A;&#x5757;&#x6BD4;&#x533A;&#x5757;&#x5934;&#x5927;1000&#x500D;&#x3002;&#x8868;7-1&#x63CF;&#x8FF0;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-617a257f2a6b7fa3.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;7-1 &#x533A;&#x5757;&#x7ED3;&#x6784;"></p>
<h2 id="93-&#x533A;&#x5757;&#x5934;">9.3 &#x533A;&#x5757;&#x5934;</h2>
<p>&#x533A;&#x5757;&#x5934;&#x7531;&#x4E09;&#x7EC4;&#x533A;&#x5757;&#x5143;&#x6570;&#x636E;&#x7EC4;&#x6210;&#x3002;&#x9996;&#x5148;&#x662F;&#x4E00;&#x7EC4;&#x5F15;&#x7528;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x7EC4;&#x5143;&#x6570;&#x636E;&#x7528;&#x4E8E;&#x5C06;&#x8BE5;&#x533A;&#x5757;&#x4E0E;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x524D;&#x4E00;&#x533A;&#x5757;&#x76F8;&#x8FDE;&#x63A5;&#x3002;&#x7B2C;&#x4E8C;&#x7EC4;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x5373;&#x96BE;&#x5EA6;&#x3001;&#x65F6;&#x95F4;&#x6233;&#x548C;nonce&#xFF0C;&#x4E0E;&#x6316;&#x77FF;&#x7ADE;&#x4E89;&#x76F8;&#x5173;&#xFF0C;&#x8BE6;&#x89C1;&#x6316;&#x77FF;&#x7AE0;&#x8282;&#x3002;&#x7B2C;&#x4E09;&#x7EC4;&#x5143;&#x6570;&#x636E;&#x662F;merkle&#x6811;&#x6839;&#xFF08;&#x4E00;&#x79CD;&#x7528;&#x6765;&#x6709;&#x6548;&#x5730;&#x603B;&#x7ED3;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF09;&#x3002;&#x8868;7-2&#x63CF;&#x8FF0;&#x4E86;&#x533A;&#x5757;&#x5934;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-d37ba521d84f086e.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;7-2 &#x533A;&#x5757;&#x5934;&#x7ED3;&#x6784;"></p>
<p>Nonce&#x3001;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x548C;&#x65F6;&#x95F4;&#x6233;&#x4F1A;&#x7528;&#x4E8E;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#xFF0C;&#x66F4;&#x591A;&#x7EC6;&#x8282;&#x5C06;&#x5728;&#x6316;&#x77FF;&#x7AE0;&#x8282;&#x8BA8;&#x8BBA;&#x3002;</p>
<h2 id="94-&#x533A;&#x5757;&#x6807;&#x8BC6;&#x7B26;&#xFF1A;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x548C;&#x533A;&#x5757;&#x9AD8;&#x5EA6;">9.4 &#x533A;&#x5757;&#x6807;&#x8BC6;&#x7B26;&#xFF1A;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x548C;&#x533A;&#x5757;&#x9AD8;&#x5EA6;</h2>
<p>&#x533A;&#x5757;&#x4E3B;&#x6807;&#x8BC6;&#x7B26;&#x662F;&#x5B83;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x4E00;&#x4E2A;&#x901A;&#x8FC7;SHA256&#x7B97;&#x6CD5;&#x5BF9;&#x533A;&#x5757;&#x5934;&#x8FDB;&#x884C;&#x4E8C;&#x6B21;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x800C;&#x5F97;&#x5230;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x3002;&#x4EA7;&#x751F;&#x7684;32&#x5B57;&#x8282;&#x54C8;&#x5E0C;&#x503C;&#x88AB;&#x79F0;&#x4E3A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x4F46;&#x662F;&#x66F4;&#x51C6;&#x786E;&#x7684;&#x540D;&#x79F0;&#x662F;&#xFF1A;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x533A;&#x5757;&#x5934;&#x88AB;&#x7528;&#x4E8E;&#x8BA1;&#x7B97;&#x3002;&#x4F8B; &#x5982;:000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x7684;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x53EF;&#x4EE5;&#x552F;&#x4E00;&#x3001;&#x660E;&#x786E;&#x5730;&#x6807;&#x8BC6;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x5730;&#x5BF9;&#x533A;&#x5757;&#x5934;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x90FD;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x5730;&#x83B7;&#x53D6;&#x8BE5;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x5B9E;&#x9645;&#x4E0A;&#x5E76;&#x4E0D;&#x5305;&#x542B;&#x5728;&#x533A;&#x5757;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x91CC;&#xFF0C;&#x4E0D;&#x7BA1;&#x662F;&#x8BE5;&#x533A;&#x5757;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x4F20;&#x8F93;&#x65F6;&#xFF0C;&#x6291;&#x6216;&#x662F;&#x5B83;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x67D0;&#x8282;&#x70B9;&#x7684;&#x6C38;&#x4E45;&#x6027;&#x5B58;&#x50A8;&#x8BBE;&#x5907;&#x4E0A;&#x65F6;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x5F53;&#x8BE5;&#x533A;&#x5757;&#x4ECE;&#x7F51;&#x7EDC;&#x88AB;&#x63A5;&#x6536;&#x65F6;&#x7531;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x8BA1;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x3002;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x53EF;&#x80FD;&#x4F1A;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x5143;&#x6570;&#x636E;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#xFF0C;&#x4EE5;&#x4FBF;&#x4E8E;&#x7D22;&#x5F15;&#x548C;&#x66F4;&#x5FEB;&#x5730;&#x4ECE;&#x78C1;&#x76D8;&#x68C0;&#x7D22;&#x533A;&#x5757;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x79CD;&#x8BC6;&#x522B;&#x533A;&#x5757;&#x7684;&#x65B9;&#x5F0F;&#x662F;&#x901A;&#x8FC7;&#x8BE5;&#x533A;&#x5757;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#xFF0C;&#x5373;&#x201C;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#xFF08;block height&#xFF09;&#x201D;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5176;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x4E3A; 0&#xFF0C;&#x548C;&#x4E4B;&#x524D;&#x54C8;&#x5E0C;&#x503C;000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f&#x6240;&#x5F15;&#x7528;&#x7684;&#x533A;&#x5757;&#x4E3A;&#x540C;&#x4E00; &#x4E2A;&#x533A;&#x5757;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x533A;&#x5757;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E24;&#x79CD;&#x65B9;&#x5F0F;&#x88AB;&#x8BC6;&#x522B;&#xFF1A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x6216;&#x8005;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x968F;&#x540E;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E4B;&#x4E0A;&#x7684;&#x533A;&#x5757;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x90FD;&#x6BD4;&#x524D;&#x4E00;&#x533A;&#x5757;&#x201C;&#x9AD8;&#x201D;&#x51FA;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#xFF0C;&#x5C31;&#x50CF;&#x7BB1;&#x5B50;&#x4E00;&#x6837;,&#x4E00;&#x4E2A;&#x63A5;&#x4E00;&#x4E2A;&#x5806;&#x53E0;&#x5728;&#x5176;&#x4ED6;&#x7BB1;&#x5B50;&#x4E4B;&#x4E0A;&#x3002;2017&#x5E74;1&#x6708;1&#x65E5;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x5927;&#x7EA6;&#x662F; 446,000&#xFF0C;&#x8BF4;&#x660E;&#x5DF2;&#x7ECF;&#x6709;446,000&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x5806;&#x53E0;&#x5728;2009&#x5E74;1&#x6708;&#x521B;&#x5EFA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E4B;&#x4E0A;&#x3002;</p>
<p>&#x548C;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x5E76;&#x4E0D;&#x662F;&#x552F;&#x4E00;&#x7684;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x867D;&#x7136;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x533A;&#x5757;&#x603B;&#x662F;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x660E;&#x786E;&#x7684;&#x3001;&#x56FA;&#x5B9A;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#xFF0C; &#x4F46;&#x53CD;&#x8FC7;&#x6765;&#x5374;&#x5E76;&#x4E0D;&#x6210;&#x7ACB;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x8BC6;&#x522B;&#x4E00;&#x4E2A;&#x5355;&#x4E00;&#x7684;&#x533A;&#x5757;&#x3002;&#x4E24;&#x4E2A;&#x6216;&#x4E24;&#x4E2A;&#x4EE5;&#x4E0A;&#x7684;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x6709;&#x76F8;&#x540C;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#xFF0C;&#x5728;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x4E89;&#x593A;&#x540C;&#x4E00;&#x4F4D;&#x7F6E;&#x3002;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x5728;&#x201C;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#x4E00;&#x8282;&#x4E2D;&#x6709;&#x8BE6;&#x7EC6;&#x8BA8;&#x8BBA;&#x3002;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x4E5F;&#x4E0D;&#x662F;&#x533A;&#x5757;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C; &#x5B83;&#x5E76;&#x4E0D;&#x88AB;&#x5B58;&#x50A8;&#x5728;&#x533A;&#x5757;&#x91CC;&#x3002;&#x5F53;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x6765;&#x81EA;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x4F1A;&#x52A8;&#x6001;&#x5730;&#x8BC6;&#x522B;&#x8BE5;&#x533A;&#x5757;&#x5728;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x7684;&#x4F4D;&#x7F6E;&#xFF08;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#xFF09;&#x3002; &#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x4E5F;&#x53EF;&#x4F5C;&#x4E3A;&#x5143;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x5728;&#x4E00;&#x4E2A;&#x7D22;&#x5F15;&#x6570;&#x636E;&#x5E93;&#x8868;&#x4E2D;&#x4EE5;&#x4FBF;&#x5FEB;&#x901F;&#x68C0;&#x7D22;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x603B;&#x662F;&#x80FD;&#x552F;&#x4E00;&#x5730;&#x8BC6;&#x522B;&#x51FA;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x533A;&#x5757;&#x3002;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E5F;&#x603B;&#x662F;&#x6709;&#x7279;&#x5B9A;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x4E00; &#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x5E76;&#x4E0D;&#x4E00;&#x5B9A;&#x603B;&#x662F;&#x80FD;&#x552F;&#x4E00;&#x5730;&#x8BC6;&#x522B;&#x51FA;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x533A;&#x5757;&#x3002;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x6216;&#x8005;&#x66F4;&#x591A;&#x6570;&#x91CF;&#x7684;&#x533A;&#x5757;&#x4E5F;&#x8BB8;&#x4F1A;&#x4E3A;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x4F4D;&#x7F6E;&#x800C;&#x7ADE;&#x4E89;&#x3002;</p>
<h2 id="95-&#x521B;&#x4E16;&#x533A;&#x5757;">9.5 &#x521B;&#x4E16;&#x533A;&#x5757;</h2>
<p>&#x533A;&#x5757;&#x94FE;&#x91CC;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x521B;&#x5EFA;&#x4E8E;2009&#x5E74;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x521B;&#x4E16;&#x533A;&#x5757;&#x3002;&#x5B83;&#x662F;&#x533A;&#x5757;&#x94FE;&#x91CC;&#x9762;&#x6240;&#x6709;&#x533A;&#x5757;&#x7684;&#x5171;&#x540C;&#x7956;&#x5148;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4F60;&#x4ECE;&#x4EFB;&#x4E00;&#x533A;&#x5757;&#xFF0C;&#x5FAA;&#x94FE;&#x5411;&#x540E;&#x56DE;&#x6EAF;&#xFF0C;&#x6700;&#x7EC8;&#x90FD;&#x5C06;&#x5230;&#x8FBE;&#x521B;&#x4E16;&#x533A;&#x5757;&#x3002;
&#x56E0;&#x4E3A;&#x521B;&#x4E16;&#x533A;&#x5757;&#x88AB;&#x7F16;&#x5165;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x5BA2;&#x6237;&#x7AEF;&#x8F6F;&#x4EF6;&#x91CC;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x59CB;&#x4E8E;&#x81F3;&#x5C11;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8FD9;&#x80FD;&#x786E;&#x4FDD;&#x521B;&#x4E16;&#x533A;&#x5757;&#x4E0D;&#x4F1A;&#x88AB;&#x6539;&#x53D8;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x201C;&#x77E5;&#x9053;&#x201D;&#x521B;&#x4E16;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3001;&#x7ED3;&#x6784;&#x3001;&#x88AB;&#x521B;&#x5EFA;&#x7684;&#x65F6;&#x95F4;&#x548C;&#x91CC;&#x9762;&#x7684;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x628A;&#x8BE5;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x9996;&#x533A;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5B89;&#x5168;&#x7684;&#x3001;&#x53EF;&#x4FE1;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;
&#x5728;<a href="http://bit.ly/1x6rcwP" target="_blank"><em>chainparams.cpp</em></a>&#x91CC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x521B;&#x4E16;&#x533A;&#x5757;&#x88AB;&#x7F16;&#x5165;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x91CC;&#x3002;</p>
<p>&#x521B;&#x4E16;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E3A;&#xFF1A;</p>
<p>0000000000 19d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x533A;&#x5757;&#x6D4F;&#x89C8;&#x7F51;&#x7AD9;&#x641C;&#x7D22;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5982;blockchain.info&#xFF0C;&#x4F60;&#x4F1A;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x63CF;&#x8FF0;&#x8FD9;&#x4E00;&#x533A;&#x5757;&#x5185;&#x5BB9;&#x7684;&#x9875;&#x9762;&#xFF0C;&#x8BE5;&#x9875;&#x9762;&#x7684;&#x94FE;&#x63A5;&#x5305;&#x542B;&#x4E86;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#xFF1A;</p>
<p><a href="https://blockchain.info/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f" target="_blank">https://blockchain.info/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</a>
<a href="https://blockexplorer.com/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f" target="_blank">https://blockexplorer.com/block/000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</a></p>
<p>&#x5728;&#x547D;&#x4EE4;&#x884C;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#xFF1A;</p>
<p>``$ bitcoin-cli getblock 000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f</p>
<p>{    &quot;hash&quot; : &quot;000000000019d6689c085ae165831e934ff763ae46a2a6c172b3f1b60a8ce26f&quot;,<br>&quot;confirmations&quot; : 308321,<br>&quot;size&quot; : 285,<br>&quot;height&quot; : 0,<br>&quot;version&quot; : 1,<br>&quot;merkleroot&quot; : &quot;4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b&quot;,<br>&quot;tx&quot; : [        &quot;4a5e1e4baab89f3a32518a88c31bc87f618f76673e2cc77ab2127b7afdeda33b&quot;    ],<br>&quot;time&quot; : 1231006505,<br>&quot;nonce&quot; : 2083236893,<br>&quot;bits&quot; : &quot;1d00ffff&quot;,<br>&quot;difficulty&quot; : 1.00000000,<br>&quot;nextblockhash&quot; : &quot;00000000839a8e6886ab5951d76f411475428afc90947ee320161bbf18eb6048&quot;}``</p>
<p>&#x521B;&#x4E16;&#x533A;&#x5757;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x9690;&#x85CF;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5728;&#x5176;Coinbase&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x4E2D;&#x5305;&#x542B;&#x8FD9;&#x6837;&#x4E00;&#x53E5;&#x8BDD;&#x201C;The Times 03/Jan/2009 Chancellor on brink of second bailout forbanks.&#x201D;&#x8FD9;&#x53E5;&#x8BDD;&#x662F;&#x6CF0;&#x6664;&#x58EB;&#x62A5;&#x5F53;&#x5929;&#x7684;&#x5934;&#x7248;&#x6587;&#x7AE0;&#x6807;&#x9898;&#xFF0C;&#x5F15;&#x7528;&#x8FD9;&#x53E5;&#x8BDD;&#xFF0C;&#x65E2;&#x662F;&#x5BF9;&#x8BE5;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x65F6;&#x95F4;&#x7684;&#x8BF4;&#x660E;&#xFF0C;&#x4E5F;&#x53EF;&#x89C6;&#x4E3A;&#x534A;&#x5F00;&#x73A9;&#x7B11;&#x5730;&#x63D0;&#x9192;&#x4EBA;&#x4EEC;&#x4E00;&#x4E2A;&#x72EC;&#x7ACB;&#x7684;&#x8D27;&#x5E01;&#x5236;&#x5EA6;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x540C;&#x65F6;&#x544A;&#x8BC9;&#x4EBA;&#x4EEC;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E00;&#x573A;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#x4E16;&#x754C;&#x6027;&#x8D27;&#x5E01;&#x9769;&#x547D;&#x5C06;&#x8981;&#x53D1;&#x751F;&#x3002;&#x8BE5;&#x6D88;&#x606F;&#x662F;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x521B;&#x7ACB;&#x8005;&#x4E2D;&#x672C;&#x806A;&#x5D4C;&#x5165;&#x521B;&#x4E16;&#x533A;&#x5757;&#x4E2D;&#x3002;</p>
<h2 id="96-&#x533A;&#x5757;&#x94FE;&#x63A5;&#x6210;&#x4E3A;&#x533A;&#x5757;&#x94FE;">9.6 &#x533A;&#x5757;&#x94FE;&#x63A5;&#x6210;&#x4E3A;&#x533A;&#x5757;&#x94FE;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5168;&#x8282;&#x70B9;&#x5728;&#x672C;&#x5730;&#x4FDD;&#x5B58;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x4ECE;&#x521B;&#x4E16;&#x533A;&#x5757;&#x8D77;&#x7684;&#x5B8C;&#x6574;&#x526F;&#x672C;&#x3002;&#x968F;&#x7740;&#x65B0;&#x7684;&#x533A;&#x5757;&#x7684;&#x4EA7;&#x751F;&#xFF0C;&#x8BE5;&#x533A;&#x5757;&#x94FE;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x4F1A;&#x4E0D;&#x65AD;&#x5730;&#x66F4;&#x65B0;&#x7528;&#x4E8E;&#x6269;&#x5C55;&#x8FD9;&#x4E2A;&#x94FE;&#x6761;&#x3002;&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x4ECE;&#x7F51;&#x7EDC;&#x63A5;&#x6536;&#x4F20;&#x5165;&#x7684;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E9B;&#x533A;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x94FE;&#x63A5;&#x5230;&#x73B0;&#x6709;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x3002;&#x4E3A;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x8FDE;&#x63A5;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5C06;&#x68C0;&#x67E5;&#x4F20;&#x5165;&#x7684;&#x533A;&#x5757;&#x5934;&#x5E76;&#x5BFB;&#x627E;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x533A;&#x5757;&#x94FE;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x4E2D;&#x6709;277,314&#x4E2A;&#x533A;&#x5757;&#x3002;&#x8BE5;&#x8282;&#x70B9;&#x77E5;&#x9053;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E3A;&#x7B2C;277,314&#x4E2A;&#x533A; &#x5757;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x4E3A;&#xFF1A;</p>
<p>00000000000000027e7ba6fe7bad39faf3b5a83daed765f05f7d1b71a1632249&#x3002; </p>
<p>&#x7136;&#x540E;&#x8BE5;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8BE5;&#x533A;&#x5757;&#x63CF;&#x8FF0;&#x5982;&#x4E0B;&#xFF1A;</p>
<p>`{</p>
<pre><code>&quot;size&quot; : 43560,
&quot;version&quot; : 2,
&quot;previousblockhash&quot; :
    &quot;00000000000000027e7ba6fe7bad39faf3b5a83daed765f05f7d1b71a1632249&quot;,
&quot;merkleroot&quot; :
    &quot;5e049f4030e0ab2debb92378f53c0a6e09548aea083f3ab25e1d94ea1155e29d&quot;,
&quot;time&quot; : 1388185038,
&quot;difficulty&quot; : 1180923195.25802612,
&quot;nonce&quot; : 4215469401,
&quot;tx&quot; : [
    &quot;257e7497fb8bc68421eb2c7b699dbab234831600e7352f0d9e6522c7cf3f6c77&quot;,
</code></pre><p> [... many more transactions omitted ...]</p>
<pre><code>    &quot;05cfd38f6ae6aa83674cc99e4d75a1458c165b7ab84725eda41d018a09176634&quot;
]
</code></pre><p>}`</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E00;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8282;&#x70B9;&#x4F1A;&#x5728;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x91CC;&#x627E;&#x51FA;&#x5305;&#x542B;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x8FD9;&#x662F;&#x8282;&#x70B9;&#x5DF2;&#x77E5;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x7B2C; 277314&#x5757;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x6545;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x662F;&#x8FD9;&#x4E2A;&#x94FE;&#x6761;&#x91CC;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5B50;&#x533A;&#x5757;&#xFF0C;&#x56E0;&#x6B64;&#x73B0;&#x6709;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5F97;&#x4EE5;&#x6269;&#x5C55;&#x3002;&#x8282;&#x70B9;&#x5C06;&#x65B0;&#x7684;&#x533A;&#x5757;&#x6DFB;&#x52A0;&#x81F3;&#x94FE;&#x6761;&#x7684;&#x5C3E;&#x7AEF;&#xFF0C;&#x4F7F;&#x533A;&#x5757;&#x94FE;&#x53D8;&#x957F;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x9AD8;&#x5EA6;277,315&#x3002;&#x56FE;9-1&#x663E;&#x793A;&#x4E86;&#x901A;&#x8FC7;&#x201C;&#x7236;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#x201D;&#x5B57;&#x6BB5;&#x8FDB;&#x884C;&#x8FDE;&#x63A5;&#x4E09;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x94FE;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-778f551c409faeba.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;9-1 &#x533A;&#x5757;&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x7236;&#x533A;&#x5757;&#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x94FE;&#x6761;&#x7684;&#x5F62;&#x5F0F;&#x8FDB;&#x884C;&#x76F8;&#x8FDE;"></p>
<p>&#x56FE;9-1&#x901A;&#x8FC7;&#x5F15;&#x7528;&#x524D;&#x9762;&#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x8FDE;&#x63A5;&#x6210;&#x533A;&#x5757;&#x94FE;</p>
<h2 id="97-merkle-&#x6811;">9.7 Merkle &#x6811;</h2>
<p>&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x5305;&#x542B;&#x4E86;&#x4EA7;&#x751F;&#x4E8E;&#x8BE5;&#x533A;&#x5757;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x4E14;&#x4EE5;Merkle&#x6811;&#x8868;&#x793A;&#x3002;</p>
<p>Merkle&#x6811;&#x662F;&#x4E00;&#x79CD;&#x54C8;&#x5E0C;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x7528;&#x4F5C;&#x5FEB;&#x901F;&#x5F52;&#x7EB3;&#x548C;&#x6821;&#x9A8C;&#x5927;&#x89C4;&#x6A21;&#x6570;&#x636E;&#x5B8C;&#x6574;&#x6027;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x8FD9;&#x79CD;&#x4E8C;&#x53C9;&#x6811;&#x5305;&#x542B;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x672F;&#x8BED;&#x201C;&#x6811;&#x201D;&#x5728;&#x8BA1;&#x7B97;&#x673A;&#x5B66;&#x79D1;&#x4E2D;&#x5E38;&#x88AB;&#x7528;&#x6765;&#x63CF;&#x8FF0;&#x4E00;&#x79CD;&#x5177;&#x6709;&#x5206;&#x652F;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x4F46;&#x662F;&#x6811;&#x5E38;&#x5E38;&#x88AB;&#x5012;&#x7F6E;&#x663E;&#x793A;&#xFF0C;&#x201C;&#x6839;&#x201D;&#x5728;&#x56FE;&#x7684;&#x4E0A;&#x90E8;&#x540C;&#x65F6;&#x201C;&#x53F6;&#x5B50;&#x201D;&#x5728;&#x56FE;&#x7684;&#x4E0B;&#x90E8;&#xFF0C;&#x4F60;&#x4F1A;&#x5728;&#x540E;&#x7EED;&#x7AE0;&#x8282;&#x4E2D;&#x770B;&#x5230;&#x76F8;&#x5E94;&#x7684;&#x4F8B;&#x5B50;&#x3002;</p>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;Merkle&#x6811;&#x88AB;&#x7528;&#x6765;&#x5F52;&#x7EB3;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x540C;&#x65F6;&#x751F;&#x6210;&#x6574;&#x4E2A;&#x4EA4;&#x6613;&#x96C6;&#x5408;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#xFF0C;&#x4E14;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x79CD;&#x6821;&#x9A8C;&#x533A;&#x5757;&#x662F;&#x5426;&#x5B58;&#x5728;&#x67D0;&#x4EA4;&#x6613;&#x7684;&#x9AD8;&#x6548;&#x9014;&#x5F84;&#x3002;&#x751F;&#x6210;&#x4E00;&#x68F5;&#x5B8C;&#x6574;&#x7684;Merkle&#x6811;&#x9700;&#x8981;&#x9012;&#x5F52;&#x5730;&#x5BF9;&#x4E00;&#x5BF9;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x751F;&#x6210;&#x7684;&#x54C8;&#x5E0C;&#x8282;&#x70B9;&#x63D2;&#x5165;&#x5230;Merkle&#x6811;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8282;&#x70B9;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x5C31;&#x662F;Merkle&#x6811;&#x7684;&#x6839;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7684;Merkle&#x6811;&#x4E2D;&#x4E24;&#x6B21;&#x4F7F;&#x7528;&#x5230;&#x4E86;SHA256 &#x7B97;&#x6CD5;&#xFF0C;&#x56E0;&#x6B64;&#x5176;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;double-SHA256&#x3002;</p>
<p>&#x5F53;N&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7ECF;&#x8FC7;&#x52A0;&#x5BC6;&#x540E;&#x63D2;&#x5165;Merkle&#x6811;&#x65F6;&#xFF0C;&#x4F60;&#x81F3;&#x591A;&#x8BA1;&#x7B97;2*log~2~(N) &#x6B21;&#x5C31;&#x80FD;&#x68C0;&#x67E5;&#x51FA;&#x4EFB;&#x610F;&#x67D0;&#x6570;&#x636E;&#x5143;&#x7D20;&#x662F;&#x5426;&#x5728;&#x8BE5;&#x6811;&#x4E2D;&#xFF0C;&#x8FD9;&#x4F7F;&#x5F97;&#x8BE5;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x975E;&#x5E38;&#x9AD8;&#x6548;&#x3002;</p>
<p>Merkle&#x6811;&#x662F;&#x81EA;&#x5E95;&#x5411;&#x4E0A;&#x6784;&#x5EFA;&#x7684;&#x3002;&#x5728;&#x5982;&#x4E0B;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECE;A&#x3001;B&#x3001;C&#x3001;D&#x56DB;&#x4E2A;&#x6784;&#x6210;Merkle&#x6811;&#x6811;&#x53F6;&#x7684;&#x4EA4;&#x6613;&#x5F00;&#x59CB;&#xFF0C;&#x5982;&#x56FE;9-2&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-b1008e063f6007dd.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;9-2 &#x5728;Merkle&#x6811;&#x4E2D;&#x8BA1;&#x7B97;&#x8282;&#x70B9;"></p>
<p>&#x56FE;9-2&#x8BA1;&#x7B97;&#x9ED8;&#x514B;&#x6811;&#x4E2D;&#x7684;&#x8282;&#x70B9;</p>
<p>&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x90FD;&#x5E76;&#x4E0D;&#x5B58;&#x50A8;&#x5728;Merkle&#x6811;&#x4E2D;&#xFF0C;&#x800C;&#x662F;&#x5C06;&#x6570;&#x636E;&#x54C8;&#x5E0C;&#x5316;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x54C8;&#x5E0C;&#x503C;&#x5B58;&#x50A8;&#x81F3;&#x76F8;&#x5E94;&#x7684;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4E9B;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x5206;&#x522B;&#x662F;H~A~&#x3001;H~B~&#x3001;H~C~&#x548C;H~D~&#xFF1A; </p>
<p>HA = SHA256(SHA256(Transaction A))</p>
<p>&#x5C06;&#x76F8;&#x90BB;&#x4E24;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E32;&#x8054;&#x5728;&#x4E00;&#x8D77;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#xFF0C;&#x8FD9;&#x5BF9;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x968F;&#x540E;&#x88AB;&#x5F52;&#x7EB3;&#x4E3A;&#x7236;&#x8282;&#x70B9;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x4E3A;&#x4E86;&#x521B;&#x5EFA;&#x7236;&#x8282;&#x70B9;H~AB~&#xFF0C;&#x5B50;&#x8282;&#x70B9; A&#x548C;&#x5B50;&#x8282;&#x70B9;B&#x7684;&#x4E24;&#x4E2A;32&#x5B57;&#x8282;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x5C06;&#x88AB;&#x4E32;&#x8054;&#x6210;64&#x5B57;&#x8282;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x3002;&#x968F;&#x540E;&#x5C06;&#x5B57;&#x7B26;&#x4E32;&#x8FDB;&#x884C;&#x4E24;&#x6B21;&#x54C8;&#x5E0C;&#x6765;&#x4EA7;&#x751F;&#x7236;&#x8282;&#x70B9;&#x7684;&#x54C8;&#x5E0C;&#x503C;:</p>
<p> HAB = SHA256(SHA256(H~A~ + H~B~))</p>
<p>&#x7EE7;&#x7EED;&#x7C7B;&#x4F3C;&#x7684;&#x64CD;&#x4F5C;&#x76F4;&#x5230;&#x53EA;&#x5269;&#x4E0B;&#x9876;&#x90E8;&#x7684;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#xFF0C;&#x5373;Merkle&#x6839;&#x3002;&#x4EA7;&#x751F;&#x7684;32&#x5B57;&#x8282;&#x54C8;&#x5E0C;&#x503C;&#x5B58;&#x50A8;&#x5728;&#x533A;&#x5757;&#x5934;&#xFF0C;&#x540C;&#x65F6;&#x5F52;&#x7EB3;&#x4E86;&#x56DB;&#x4E2A;&#x4EA4;&#x6613;&#x7684;&#x6240;&#x6709;&#x6570;&#x636E;&#x3002;&#x56FE;9-2&#x5C55;&#x793A;&#x4E86;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x6210;&#x5BF9;&#x8282;&#x70B9;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x8BA1;&#x7B97;Merkle&#x6811;&#x7684;&#x6839;&#x3002;</p>
<p>&#x56E0;&#x4E3A;Merkle&#x6811;&#x662F;&#x4E8C;&#x53C9;&#x6811;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x9700;&#x8981;&#x5076;&#x6570;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x3002;&#x5982;&#x679C;&#x4EC5;&#x6709;&#x5947;&#x6570;&#x4E2A;&#x4EA4;&#x6613;&#x9700;&#x8981;&#x5F52;&#x7EB3;&#xFF0C;&#x90A3;&#x6700;&#x540E;&#x7684;&#x4EA4;&#x6613;&#x5C31;&#x4F1A;&#x88AB;&#x590D;&#x5236;&#x4E00;&#x4EFD;&#x4EE5;&#x6784;&#x6210;&#x5076;&#x6570;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x8FD9;&#x79CD;&#x5076;&#x6570;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x7684;&#x6811;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x5E73;&#x8861;&#x6811;&#x3002;&#x5982;&#x56FE;9-3&#x6240;&#x793A;&#xFF0C;C&#x8282;&#x70B9;&#x88AB;&#x590D;&#x5236;&#x4E86;&#x4E00;&#x4EFD;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-93c061674a447479.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;9-3 &#x590D;&#x5236;&#x4E00;&#x4EFD;&#x6570;&#x636E;&#x8282;&#x70B9;&#xFF0C;&#x4F7F;&#x6574;&#x4E2A;&#x6811;&#x4E2D;&#x6570;&#x636E;&#x8282;&#x70B9;&#x4E2A;&#x6570;&#x662F;&#x5076;&#x6570;"></p>
<p>&#x56FE;9-3&#x590D;&#x5236;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;&#x5076;&#x6570;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;</p>
<p>&#x7531;&#x56DB;&#x4E2A;&#x4EA4;&#x6613;&#x6784;&#x9020;Merkle&#x6811;&#x7684;&#x65B9;&#x6CD5;&#x540C;&#x6837;&#x9002;&#x7528;&#x4E8E;&#x4ECE;&#x4EFB;&#x610F;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x6784;&#x9020;Merkle&#x6811;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x5728;&#x5355;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x6709;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x7684;&#x4EA4;&#x6613;&#x662F;&#x975E;&#x5E38;&#x666E;&#x904D;&#x7684;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x91C7;&#x7528;&#x540C;&#x6837;&#x7684;&#x65B9;&#x6CD5;&#x5F52;&#x7EB3;&#x8D77;&#x6765;&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x4EC5;&#x4EC5;32&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#x4F5C;&#x4E3A;Merkle&#x6839;&#x3002;&#x5728;&#x56FE;9-4&#x4E2D;&#xFF0C;&#x4F60;&#x4F1A;&#x770B;&#x89C1;&#x4E00;&#x4E2A;&#x4ECE;16&#x4E2A;&#x4EA4;&#x6613;&#x5F62;&#x6210;&#x7684;&#x6811;&#x3002;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5C3D;&#x7BA1;&#x56FE;&#x4E2D;&#x7684;&#x6839;&#x770B;&#x8D77;&#x6765;&#x6BD4;&#x6240;&#x6709;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x90FD;&#x5927;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x4EEC;&#x90FD;&#x662F;32&#x5B57;&#x8282;&#x7684;&#x76F8;&#x540C;&#x5927;&#x5C0F;&#x3002;&#x65E0;&#x8BBA;&#x533A;&#x5757;&#x4E2D;&#x6709;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x6216;&#x8005;&#x6709;&#x5341;&#x4E07;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;Merkle&#x6839;&#x603B;&#x4F1A;&#x628A;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x5F52;&#x7EB3;&#x4E3A;32&#x5B57;&#x8282;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-81d4c79feb4eb22d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;9-4 &#x5F52;&#x7EB3;&#x4E86;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;Merkle&#x6811;"></p>
<p>&#x56FE;9-4Merkle&#x6811;&#x6C47;&#x603B;&#x4E86;&#x8BB8;&#x591A;&#x6570;&#x636E;&#x5143;&#x7D20;</p>
<p>&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x533A;&#x5757;&#x4E2D;&#x5B58;&#x5728;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53EA;&#x9700;&#x8981;&#x8BA1;&#x7B97;log~2~(N)&#x4E2A;32&#x5B57;&#x8282;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5F62;&#x6210;&#x4E00;&#x6761;&#x4ECE;&#x7279;&#x5B9A;&#x4EA4;&#x6613;&#x5230;&#x6811;&#x6839;&#x7684;&#x8BA4;&#x8BC1;&#x8DEF;&#x5F84;&#x6216;&#x8005;Merkle&#x8DEF;&#x5F84;&#x5373;&#x53EF;&#x3002;&#x968F;&#x7740;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x7684;&#x6025;&#x5267;&#x589E;&#x52A0;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BA1;&#x7B97;&#x91CF;&#x5C31;&#x663E;&#x5F97;&#x5F02;&#x5E38;&#x91CD;&#x8981;&#xFF0C;&#x56E0;&#x4E3A;&#x76F8;&#x5BF9;&#x4E8E;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x7684;&#x589E;&#x957F;&#xFF0C;&#x4EE5;&#x57FA;&#x5E95;&#x4E3A;2&#x7684;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x7684;&#x5BF9;&#x6570;&#x7684;&#x589E;&#x957F;&#x4F1A;&#x7F13;&#x6162;&#x8BB8;&#x591A;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x9AD8;&#x6548;&#x5730;&#x4EA7;&#x751F;&#x4E00;&#x6761;10&#x6216;&#x8005;12&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#xFF08;320~384&#x5B57;&#x8282;&#xFF09;&#x7684;&#x8DEF;&#x5F84;&#xFF0C;&#x6765;&#x8BC1;&#x660E;&#x4E86;&#x5728;&#x4E00;&#x4E2A;&#x5DE8;&#x91CF;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x4E0A;&#x5343;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x67D0;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<p>&#x5728;&#x56FE;9-5&#x4E2D;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x901A;&#x8FC7;&#x751F;&#x6210;&#x4E00;&#x6761;&#x4EC5;&#x6709;4&#x4E2A;32&#x5B57;&#x8282;&#x54C8;&#x5E0C;&#x503C;&#x957F;&#x5EA6;&#xFF08;&#x603B;128&#x5B57;&#x8282;&#xFF09;&#x7684;Merkle&#x8DEF;&#x5F84;&#xFF0C;&#x6765;&#x8BC1;&#x660E;&#x533A;&#x5757;&#x4E2D;&#x5B58;&#x5728;&#x4E00; &#x7B14;&#x4EA4;&#x6613;K&#x3002;&#x8BE5;&#x8DEF;&#x5F84;&#x6709;4&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#xFF08;&#x5728;&#x56FE;9-5&#x4E2D;&#x7531;&#x84DD;&#x8272;&#x6807;&#x6CE8;&#xFF09;H~L~&#x3001;H~IJ~&#x3001;H~MNOP~&#x548C;H~ABCDEFGH~&#x3002;&#x7531;&#x8FD9;4&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x4EA7;&#x751F;&#x7684;&#x8BA4;&#x8BC1;&#x8DEF;&#x5F84;&#xFF0C;&#x518D;&#x901A;&#x8FC7;&#x8BA1;&#x7B97;&#x53E6;&#x5916;&#x56DB;&#x5BF9;&#x54C8;&#x5E0C;&#x503C;H~KL~&#x3001;H~IJKL~&#x3001;H~IJKLMNOP~&#x548C;Merkle&#x6811;&#x6839;&#xFF08;&#x5728;&#x56FE;&#x4E2D;&#x7531;&#x865A;&#x7EBF;&#x6807;&#x6CE8;&#xFF09;&#xFF0C;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x90FD;&#x80FD;&#x8BC1;&#x660E;H~K~&#xFF08;&#x5728;&#x56FE;&#x4E2D;&#x7531;&#x7EFF;&#x8272;&#x6807;&#x6CE8;&#xFF09;&#x5305;&#x542B;&#x5728;Merkle&#x6839;&#x4E2D;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-ae838cf905db704d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x56FE;9-5 &#x4E00;&#x6761;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x6811;&#x4E2D;&#x5305;&#x542B;&#x67D0;&#x4E2A;&#x6570;&#x636E;&#x5143;&#x7D20;&#x800C;&#x4F7F;&#x7528;&#x7684;Merkle&#x8DEF;&#x5F84;"></p>
<p>&#x56FE;9-5&#x7528;&#x4E8E;&#x8BC1;&#x660E;&#x5305;&#x542B;&#x6570;&#x636E;&#x5143;&#x7D20;&#x7684;merkle&#x8DEF;&#x5F84;</p>
<p>&#x4F8B;7-1&#x4E2D;&#x7684;&#x4EE3;&#x7801;&#x501F;&#x7528;libbitcoin&#x5E93;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x8F85;&#x52A9;&#x7A0B;&#x5E8F;&#xFF0C;&#x6F14;&#x793A;&#x4E86;&#x4ECE;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x54C8;&#x5E0C;&#x81F3;&#x6839;&#x521B;&#x5EFA;&#x6574;&#x4E2A;Merkle&#x6811;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<p>&#x4F8B;9-1 &#x6784;&#x9020;Merkle&#x6811;</p>
<p>code/merkle.cpp[]</p>
<p>&#x4F8B;9-2&#x5C55;&#x793A;&#x4E86;&#x7F16;&#x8BD1;&#x4EE5;&#x53CA;&#x8FD0;&#x884C;&#x4E0A;&#x8FF0;&#x4EE3;&#x7801;&#x540E;&#x7684;&#x7ED3;&#x679C;</p>
<p>\ # Compile the merkle.cpp code</p>
<p>$ g++ -o merkle merkle.cpp </p>
<p>$(pkg-config --cflags --libs libbitcoin)</p>
<p>\ # Run the merkle executable</p>
<p>$ ./merkle</p>
<p>Current merkle hash list:</p>
<p> 32650049a0418e4380db0af81788635d8b65424d397170b8499cdc28c4d27006</p>
<p> 30861db96905c8dc8b99398ca1cd5bd5b84ac3264a4e1b3e65afa1bcee7540c4</p>
<p>Current merkle hash list:</p>
<p> d47780c084bad3830bcdaf6eace035e4c6cbf646d103795d22104fb105014ba3</p>
<p>Result: d47780c084bad3830bcdaf6eace035e4c6cbf646d103795d22104fb105014ba3</p>
<p>Merkle&#x6811;&#x7684;&#x9AD8;&#x6548;&#x968F;&#x7740;&#x4EA4;&#x6613;&#x89C4;&#x6A21;&#x7684;&#x589E;&#x52A0;&#x800C;&#x53D8;&#x5F97;&#x5F02;&#x5E38;&#x660E;&#x663E;&#x3002;&#x8868;9-3&#x5C55;&#x793A;&#x4E86;&#x4E3A;&#x4E86;&#x8BC1;&#x660E;&#x533A;&#x5757;&#x4E2D;&#x5B58;&#x5728;&#x67D0;&#x4EA4;&#x6613;&#x800C;&#x6240;&#x9700;&#x8F6C;&#x5316;&#x4E3A;Merkle&#x8DEF;&#x5F84;&#x7684;&#x6570;&#x636E;&#x91CF;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-938a33532cf17d16.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="&#x8868;9-3 Merkle&#x6811;&#x7684;&#x6548;&#x7387;"></p>
<p>&#x4ECE;&#x8868;&#x4E2D;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x5F53;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x7531;16&#x7B14;&#x4EA4;&#x6613;&#xFF08;4KB&#xFF09;&#x6025;&#x5267;&#x589E;&#x52A0;&#x81F3;65,535&#x7B14;&#x4EA4;&#x6613;&#xFF08;16MB&#xFF09;&#x65F6;&#xFF0C;&#x4E3A;&#x8BC1;&#x660E;&#x4EA4;&#x6613;&#x5B58;&#x5728;&#x7684;Merkle&#x8DEF;&#x5F84;&#x957F;&#x5EA6;&#x589E;&#x957F;&#x6781;&#x5176;&#x7F13;&#x6162;&#xFF0C;&#x4EC5;&#x4EC5;&#x4ECE;128&#x5B57;&#x8282;&#x5230;512&#x5B57;&#x8282;&#x3002;&#x6709;&#x4E86;Merkle&#x6811;&#xFF0C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x80FD;&#x591F;&#x4EC5;&#x4E0B;&#x8F7D;&#x533A;&#x5757;&#x5934;&#xFF08;80&#x5B57;&#x8282;/&#x533A;&#x5757;&#xFF09;&#xFF0C;&#x7136;&#x540E;&#x901A;&#x8FC7;&#x4ECE;&#x4E00;&#x4E2A;&#x6EE1;&#x8282;&#x70B9;&#x56DE;&#x6EAF;&#x4E00;&#x6761;&#x5C0F;&#x7684;Merkle&#x8DEF;&#x5F84;&#x5C31;&#x80FD;&#x8BA4;&#x8BC1;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5B58;&#x5728;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x5B58;&#x50A8;&#x6216;&#x8005;&#x4F20;&#x8F93;&#x5927;&#x91CF;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x5927;&#x591A;&#x6570;&#x5185;&#x5BB9;&#xFF0C;&#x8FD9;&#x4E9B;&#x5185;&#x5BB9;&#x53EF;&#x80FD;&#x6709;&#x51E0;&#x4E2A;G&#x7684;&#x5927;&#x5C0F;&#x3002;&#x8FD9;&#x79CD;&#x4E0D;&#x9700;&#x8981;&#x7EF4;&#x62A4;&#x4E00;&#x6761;&#x5B8C;&#x6574;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x53C8;&#x88AB;&#x79F0;&#x4F5C;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#xFF08;SPV&#xFF09;&#x8282;&#x70B9;&#xFF0C;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x4E0B;&#x8F7D;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x800C;&#x901A;&#x8FC7;Merkle&#x8DEF;&#x5F84;&#x53BB;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x7684;&#x5B58;&#x5728;&#x3002;</p>
<h2 id="98-merkle&#x6811;&#x548C;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#xFF08;spv&#xFF09;">9.8 Merkle&#x6811;&#x548C;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#xFF08;SPV&#xFF09;</h2>
<p>Merkle&#x6811;&#x88AB;SPV&#x8282;&#x70B9;&#x5E7F;&#x6CDB;&#x4F7F;&#x7528;&#x3002;SPV&#x8282;&#x70B9;&#x4E0D;&#x4FDD;&#x5B58;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x4E5F;&#x4E0D;&#x4F1A;&#x4E0B;&#x8F7D;&#x6574;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x4EC5;&#x4EC5;&#x4FDD;&#x5B58;&#x533A;&#x5757;&#x5934;&#x3002;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;&#x8BA4;&#x8BC1;&#x8DEF;&#x5F84;&#x6216;&#x8005;Merkle&#x8DEF;&#x5F84;&#x6765;&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x5B58;&#x5728;&#x4E8E;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x800C;&#x4E0D;&#x5FC5;&#x4E0B;&#x8F7D;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;SPV&#x8282;&#x70B9;&#x60F3;&#x77E5;&#x9053;&#x5B83;&#x94B1;&#x5305;&#x4E2D;&#x67D0;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5373;&#x5C06;&#x5230;&#x8FBE;&#x7684;&#x652F;&#x4ED8;&#x3002;&#x8BE5;&#x8282;&#x70B9;&#x4F1A;&#x5728;&#x8282;&#x70B9;&#x95F4;&#x7684;&#x901A;&#x4FE1;&#x94FE;&#x63A5;&#x4E0A;&#x5EFA;&#x7ACB;&#x8D77;bloom&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x9650;&#x5236;&#x53EA;&#x63A5;&#x53D7;&#x542B;&#x6709;&#x76EE;&#x6807;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5F53;&#x5BF9;&#x7B49;&#x4F53;&#x63A2;&#x6D4B;&#x5230;&#x67D0;&#x4EA4;&#x6613;&#x7B26;&#x5408;bloom&#x8FC7;&#x6EE4;&#x5668;&#xFF0C;&#x5B83;&#x5C06;&#x4EE5;Merkleblock&#x6D88;&#x606F;&#x7684;&#x5F62;&#x5F0F;&#x53D1;&#x9001;&#x8BE5;&#x533A;&#x5757;&#x3002;Merkleblock&#x6D88;&#x606F;&#x5305;&#x542B;&#x533A;&#x5757;&#x5934;&#x548C;&#x4E00;&#x6761;&#x8FDE;&#x63A5;&#x76EE;&#x6807;&#x4EA4;&#x6613;&#x4E0E;Merkle&#x6839;&#x7684;Merkle&#x8DEF;&#x5F84;&#x3002;SPV&#x8282;&#x70B9;&#x80FD;&#x591F;&#x4F7F;&#x7528;&#x8BE5;&#x8DEF;&#x5F84;&#x627E;&#x5230;&#x4E0E;&#x8BE5;&#x4EA4;&#x6613;&#x76F8;&#x5173;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x8FDB;&#x800C;&#x9A8C;&#x8BC1;&#x5BF9;&#x5E94;&#x533A;&#x5757;&#x4E2D;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x6709;&#x65E0;&#x3002;SPV&#x8282;&#x70B9;&#x540C;&#x65F6;&#x4E5F;&#x4F7F;&#x7528;&#x533A;&#x5757;&#x5934;&#x53BB;&#x5173;&#x8054;&#x533A;&#x5757;&#x548C;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x5176;&#x4F59;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x4E24;&#x79CD;&#x5173;&#x8054;&#xFF0C;&#x4EA4;&#x6613;&#x4E0E;&#x533A;&#x5757;&#x3001;&#x533A;&#x5757;&#x548C;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x8BC1;&#x660E;&#x4EA4;&#x6613;&#x5B58;&#x5728;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;SPV&#x8282;&#x70B9;&#x4F1A;&#x6536;&#x5230;&#x5C11;&#x4E8E;1KB&#x7684;&#x6709;&#x5173;&#x533A;&#x5757;&#x5934;&#x548C;Merkle&#x8DEF;&#x5F84;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x5176;&#x6570;&#x636E;&#x91CF;&#x6BD4;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x7684;&#x533A;&#x5757;&#xFF08;&#x76EE;&#x524D;&#x5927;&#x7EA6;&#x6709;1MB&#xFF09;&#x5C11;&#x4E86;&#x4E00;&#x5343;&#x591A;&#x500D;&#x3002; </p>
<h2 id="99&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;">9.9&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;</h2>
<p>&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x60CA;&#x8BB6;&#x5730;&#x53D1;&#x73B0;&#xFF0C;&#x6709;&#x591A;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x3002; 2009&#x5E74;1&#x6708;3&#x65E5;&#x7531;Satoshi Nakamoto&#x521B;&#x5EFA;&#x7684;&#x201C;&#x4E3B;&#x8981;&#x201D;&#x6BD4;&#x7279;&#x5E01;&#x5757;&#x94FE;&#xFF0C;<strong>&#x5373;</strong>&#x672C;&#x7AE0;&#x7814;&#x7A76;&#x7684;&#x521B;&#x4E16;&#x533A;&#x5757;&#x6240;&#x5728;&#x7684;&#x7F51;&#x7EDC;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#x3002;&#x53E6;&#x5916;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#xFF1A;&#x73B0;&#x5B58;&#x7684;&#x6709;testnet&#xFF0C;segnet&#x548C;regtest&#x3002;&#x6211;&#x4EEC;&#x4F9D;&#x6B21;&#x770B;&#x770B;&#x6BCF;&#x4E00;&#x4E2A;&#x3002;</p>
<h3 id="991testnet&#x2014;&#x2014;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BD5;&#x9A8C;&#x573A;">9.9.1Testnet&#x2014;&#x2014;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BD5;&#x9A8C;&#x573A;</h3>
<p>Testnet&#x662F;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x7F51;&#x7EDC;&#x548C;&#x8D27;&#x5E01;&#x7684;&#x603B;&#x79F0;&#x3002; testnet&#x662F;&#x4E00;&#x4E2A;&#x529F;&#x80FD;&#x9F50;&#x5168;&#x7684;&#x5728;&#x7EBF;P2P&#x7F51;&#x7EDC;&#xFF0C;&#x5305;&#x62EC;&#x94B1;&#x5305;&#xFF0C;&#x6D4B;&#x8BD5;&#x6BD4;&#x7279;&#x5E01;&#xFF08;testnet&#x5E01;&#xFF09;&#xFF0C;&#x6316;&#x77FF;&#x4EE5;&#x53CA;&#x7C7B;&#x4F3C;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x529F;&#x80FD;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5B83;&#x548C;&#x4E3B;&#x7F51;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x533A;&#x522B;&#xFF1A;testnet&#x5E01;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#xFF0C;&#x6316;&#x6398;&#x96BE;&#x5EA6;&#x8DB3;&#x591F;&#x4F4E;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x76F8;&#x5BF9;&#x5BB9;&#x6613;&#x5730;&#x4F7F;&#x7528;testnet&#x5E01;&#xFF09;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x6253;&#x7B97;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E3B;&#x5E72;&#x7F51;&#x4E0A;&#x7528;&#x4E8E;&#x751F;&#x4EA7;&#x7684;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x90FD;&#x5E94;&#x8BE5;&#x9996;&#x5148;&#x5728;testnet&#x4E0A;&#x7528;&#x6D4B;&#x8BD5;&#x5E01;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x514D;&#x53D7;&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x9519;&#x8BEF;&#x800C;&#x5BFC;&#x81F4;&#x7684;&#x91D1;&#x94B1;&#x635F;&#x5931;&#xFF0C;&#x4E5F;&#x53EF;&#x4EE5;&#x4FDD;&#x62A4;&#x7F51;&#x7EDC;&#x514D;&#x53D7;&#x7531;&#x4E8E;&#x8F6F;&#x4EF6;&#x9519;&#x8BEF;&#x5BFC;&#x81F4;&#x7684;&#x610F;&#x5916;&#x653B;&#x51FB;&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x4FDD;&#x6301;&#x6D4B;&#x8BD5;&#x5E01;&#x7684;&#x65E0;&#x4EF7;&#x503C;&#x548C;&#x6613;&#x6316;&#x6398;&#x5E76;&#x4E0D;&#x5BB9;&#x6613;&#x3002;&#x5C3D;&#x7BA1;&#x6709;&#x6765;&#x81EA;&#x5F00;&#x53D1;&#x5546;&#x7684;&#x547C;&#x5401;&#xFF0C;&#x4F46;&#x8FD8;&#x662F;&#x6709;&#x4EBA;&#x4F7F;&#x7528;&#x5148;&#x8FDB;&#x7684;&#x8BBE;&#x5907;&#xFF08;GPU&#x548C;ASIC&#xFF09;&#x5728;testnet&#x4E0A;&#x6316;&#x77FF;&#x3002;&#x8FD9;&#x5C31;&#x589E;&#x52A0;&#x4E86;&#x96BE;&#x5EA6;&#xFF0C;&#x4F7F;&#x7528;CPU&#x6316;&#x77FF;&#x4E0D;&#x53EF;&#x80FD;&#xFF0C;&#x5BFC;&#x81F4;&#x83B7;&#x53D6;&#x6D4B;&#x8BD5;&#x5E01;&#x975E;&#x5E38;&#x56F0;&#x96BE;&#xFF0C;&#x4EE5;&#x81F4;&#x4E8E;&#x4EBA;&#x4EEC;&#x5F00;&#x59CB;&#x8D4B;&#x4E88;&#x5176;&#x4E00;&#x5B9A;&#x4EF7;&#x503C;&#xFF0C;&#x6240;&#x4EE5;&#x6D4B;&#x8BD5;&#x5E01;&#x5E76;&#x4E0D;&#x662F;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x65F6;&#x4E0D;&#x65F6;&#x5730;testnet&#x5FC5;&#x987B;&#x88AB;&#x62A5;&#x5E9F;&#x5E76;&#x91CD;&#x65B0;&#x4ECE;&#x521B;&#x59CB;&#x533A;&#x5757;&#x542F;&#x52A8;&#xFF0C;&#x91CD;&#x65B0;&#x8FDB;&#x884C;&#x96BE;&#x5EA6;&#x8BBE;&#x7F6E;&#x3002;</p>
<p>&#x76EE;&#x524D;&#x7684;testnet&#x88AB;&#x79F0;&#x4E3A;testnet3&#xFF0C;&#x662F;testnet&#x7684;&#x7B2C;&#x4E09;&#x6B21;&#x8FED;&#x4EE3;&#xFF0C;&#x4E8E;2011&#x5E74;2&#x6708;&#x91CD;&#x542F;&#xFF0C;&#x91CD;&#x7F6E;&#x4E86;&#x4E4B;&#x524D;&#x7684;testnet&#x7F51;&#x7EDC;&#x7684;&#x96BE;&#x5EA6;&#x3002;</p>
<p>&#x8BF7;&#x8BB0;&#x4F4F;&#xFF0C;testnet3&#x662F;&#x4E00;&#x4E2A;&#x5927;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5728;2017&#x5E74;&#x521D;&#x8D85;&#x8FC7;20 GB&#x3002;&#x5B8C;&#x5168;&#x540C;&#x6B65;&#x9700;&#x8981;&#x4E00;&#x5929;&#x5DE6;&#x53F3;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x5E76;&#x5360;&#x7528;&#x60A8;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x8D44;&#x6E90;&#x3002;&#x5B83;&#x4E0D;&#x50CF;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x201C;&#x8F7B;&#x91CF;&#x7EA7;&#x201D;&#x3002;&#x8FD0;&#x884C;testnet&#x8282;&#x70B9;&#x7684;&#x4E00;&#x4E2A;&#x597D;&#x65B9;&#x6CD5;&#x5C31;&#x662F;&#x5C06;&#x5176;&#x8FD0;&#x884C;&#x4E3A;&#x4E00;&#x4E2A;&#x4E13;&#x7528;&#x7684;&#x865A;&#x62DF;&#x673A;&#x955C;&#x50CF;&#xFF08;&#x4F8B;&#x5982;&#xFF0C;VirtualBox&#xFF0C;Docker&#xFF0C;Cloud Server&#x7B49;&#xFF09;&#x3002;</p>
<h4 id="9911&#x4F7F;&#x7528;testnet">9.9.1.1&#x4F7F;&#x7528;testnet</h4>
<p>&#x50CF;&#x51E0;&#x4E4E;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x6BD4;&#x7279;&#x5E01;&#x8F6F;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;Bitcoin Core&#x5B8C;&#x5168;&#x652F;&#x6301;&#x5728;testnet&#x7F51;&#x7EDC;&#x8FD0;&#x884C;&#x800C;&#x4E0D;&#x662F;&#x53EA;&#x80FD;<strong>&#x5728;</strong>&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x8FD8;&#x5141;&#x8BB8;&#x60A8;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x5E01;&#x6316;&#x77FF;&#x5E76;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;testnet&#x5168;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x5982;&#x679C;&#x8981;&#x5728;testnet&#x4E0A;&#x542F;&#x52A8;Bitcoin Core&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5728;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#x542F;&#x52A8;&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;testnet&#x5F00;&#x5173;&#xFF1A;</p>
<p>$ bitcoind -testnet</p>
<p>&#x5728;&#x65E5;&#x5FD7;&#x4E2D;&#xFF0C;&#x60A8;&#x5E94;&#x8BE5;&#x4F1A;&#x770B;&#x5230;&#xFF0C;bitcoind&#x6B63;&#x5728;&#x9ED8;&#x8BA4;bitcoind&#x76EE;&#x5F55;&#x7684;testnet3&#x5B50;&#x76EE;&#x5F55;&#x4E2D;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF1A;</p>
<p>bitcoind: Using data directory /home/username/.bitcoin/testnet3</p>
<p>&#x8981;&#x8FDE;&#x63A5;bitcoind&#xFF0C;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;bitcoin-cli&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x4F46;&#x662F;&#x8981;&#x8BB0;&#x5F97;&#x5207;&#x6362;&#x5230;testnet&#x6A21;&#x5F0F;&#xFF1A;</p>
<p>$ bitcoin-cli -testnet getinfo</p>
<p>{</p>
<p>  &quot;version&quot;: 130200,</p>
<p>  &quot;protocolversion&quot;: 70015,</p>
<p>  &quot;walletversion&quot;: 130000,</p>
<p>  &quot;balance&quot;: 0.00000000,</p>
<p>  &quot;blocks&quot;: 416,</p>
<p>  &quot;timeoffset&quot;: 0,</p>
<p>  &quot;connections&quot;: 3,</p>
<p>  &quot;proxy&quot;: &quot;&quot;,</p>
<p>  &quot;difficulty&quot;: 1,</p>
<p>  &quot;testnet&quot;: true,</p>
<p>  &quot;keypoololdest&quot;: 1484801486,</p>
<p>  &quot;keypoolsize&quot;: 100,</p>
<p>  &quot;paytxfee&quot;: 0.00000000,</p>
<p>  &quot;relayfee&quot;: 0.00001000,</p>
<p>  &quot;errors&quot;: &quot;&quot;</p>
<p>}</p>
<p>&#x60A8;&#x8FD8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;getblockchaininfo&#x547D;&#x4EE4;&#x786E;&#x8BA4;testnet3&#x533A;&#x5757;&#x94FE;&#x7684;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;&#x548C;&#x540C;&#x6B65;&#x8FDB;&#x5EA6;&#xFF1A;</p>
<p>$ bitcoin-cli -testnet getblockchaininfo</p>
<p>{</p>
<p>  &quot;chain&quot;: &quot;test&quot;,</p>
<p>  &quot;blocks&quot;: 1088,</p>
<p>  &quot;headers&quot;: 139999,</p>
<p>  &quot;bestblockhash&quot;: &quot;0000000063d29909d475a1c4ba26da64b368e56cce5d925097bf3a2084370128&quot;,</p>
<p>  &quot;difficulty&quot;: 1,</p>
<p>  &quot;mediantime&quot;: 1337966158,</p>
<p>  &quot;verificationprogress&quot;: 0.001644065914099759,</p>
<p>  &quot;chainwork&quot;: &quot;0000000000000000000000000000000000000000000000000000044104410441&quot;,</p>
<p>  &quot;pruned&quot;: false,</p>
<p>  &quot;softforks&quot;: [</p>
<p>  [...]</p>
<p>&#x5728;testnet3&#x4E0A;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD0;&#x884C;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x8BED;&#x8A00;&#x548C;&#x6846;&#x67B6;&#x5B9E;&#x73B0;&#x7684;&#x5168;&#x8282;&#x70B9;&#x6765;&#x5B9E;&#x9A8C;&#x548C;&#x5B66;&#x4E60;&#xFF0C;&#x4F8B;&#x5982;btcd&#xFF08;&#x7528;Go&#x7F16;&#x5199;&#xFF09;&#x548C;bcoin&#xFF08;&#x7528;JavaScript&#x7F16;&#x5199;&#xFF09;&#x3002;</p>
<p>&#x5728;2017&#x5E74;&#x521D;&#xFF0C;testnet3&#x652F;&#x6301;&#x4E3B;&#x7F51;&#x7684;&#x6240;&#x6709;&#x529F;&#x80FD;&#xFF0C;&#x4E5F;&#x5305;&#x62EC;&#x5728;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#x7EDC;&#x4E0A;&#x5C1A;&#x672A;&#x6FC0;&#x6D3B;&#x7684;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF08;Segregated Witness&#xFF08;&#x89C1;[segwit]&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x7AE0;&#x8282;&#xFF09;&#xFF09;&#x3002; &#x56E0;&#x6B64;&#xFF0C;testnet3&#x4E5F;&#x53EF;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x529F;&#x80FD;&#x3002;</p>
<h3 id="992-segnet&#x2014;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;">9.9.2 Segnet&#x2014;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;</h3>
<p>2016&#x5E74;&#xFF0C;&#x542F;&#x52A8;&#x4E86;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7528;&#x9014;&#x7684;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#xFF0C;&#x4EE5;&#x5E2E;&#x52A9;&#x5F00;&#x53D1;&#x548C;&#x6D4B;&#x8BD5;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#xFF08;&#x4E5F;&#x79F0;&#x4E3A;segwit;&#x89C1;[segwit]&#xFF09;&#x3002; &#x8BE5;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;&#x79F0;&#x4E3A;segnet&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8FD0;&#x884C;Bitcoin Core&#x7684;&#x7279;&#x6B8A;&#x7248;&#x672C;&#xFF08;&#x5206;&#x652F;&#xFF09;&#x6765;&#x8FDE;&#x63A5;&#x3002;</p>
<p>&#x7531;&#x4E8E;&#x5DF2;&#x7ECF;&#x5C06;segwit&#x6DFB;&#x52A0;&#x5230;testnet3&#x4E2D;&#xFF0C;&#x56E0;&#x6B64;&#x540E;&#x6765;&#x4E0D;&#x518D;&#x4F7F;&#x7528;segnet&#x6765;&#x6D4B;&#x8BD5;segwit&#x529F;&#x80FD;&#x3002;</p>
<p>&#x5728;&#x5C06;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x770B;&#x5230;&#x5176;&#x4ED6;&#x4E13;&#x95E8;&#x7528;&#x4E8E;&#x6D4B;&#x8BD5;&#x5355;&#x4E2A;&#x529F;&#x80FD;&#x6216;&#x4E3B;&#x8981;&#x67B6;&#x6784;&#x66F4;&#x6539;&#xFF08;&#x5982;segnet&#xFF09;&#x7684;&#x6D4B;&#x8BD5;&#x7F51;&#x7EDC;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
<h3 id="993-regtest--&#x672C;&#x5730;&#x533A;&#x5757;&#x94FE;">9.9.3 Regtest--&#x672C;&#x5730;&#x533A;&#x5757;&#x94FE;</h3>
<p>Regtest&#x4EE3;&#x8868;&#x201C;&#x56DE;&#x5F52;&#x6D4B;&#x8BD5;&#x201D;&#xFF0C;&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x529F;&#x80FD;&#xFF0C;&#x5141;&#x8BB8;&#x60A8;&#x521B;&#x5EFA;&#x672C;&#x5730;&#x533A;&#x5757;&#x94FE;&#x4EE5;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002; &#x4E0E;testnet3&#xFF08;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x548C;&#x5171;&#x4EAB;&#x7684;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;&#xFF09;&#x4E0D;&#x540C;&#xFF0C;regtest&#x533A;&#x5757;&#x94FE;&#x65E8;&#x5728;&#x4F5C;&#x4E3A;&#x672C;&#x5730;&#x6D4B;&#x8BD5;&#x7684;&#x5C01;&#x95ED;&#x7CFB;&#x7EDF;&#x8FD0;&#x884C;&#x3002; &#x60A8;&#x4ECE;&#x5934;&#x5F00;&#x59CB;&#x542F;&#x52A8;regtest<strong>&#x533A;</strong>&#x5757;&#x94FE;&#xFF0C;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x672C;&#x5730;&#x7684;&#x521B;&#x4E16;&#x533A;&#x5757;&#x3002; &#x60A8;&#x53EF;&#x4EE5;&#x5C06;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x6DFB;&#x52A0;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x6216;&#x8005;&#x4F7F;&#x7528;&#x5355;&#x4E2A;&#x8282;&#x70B9;&#x8FD0;&#x884C;&#x5B83;&#x6765;&#x6D4B;&#x8BD5;Bitcoin Core&#x8F6F;&#x4EF6;&#x3002;</p>
<p>&#x8981;&#x5728;regtest&#x6A21;&#x5F0F;&#x4E0B;&#x542F;&#x52A8;Bitcoin Core&#xFF0C;&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;regtest&#x6807;&#x5FD7;&#xFF1A;</p>
<p>$ bitcoind -regtest</p>
<p>&#x5C31;&#x50CF;&#x4F7F;&#x7528;testnet&#x4E00;&#x6837;&#xFF0C;Bitcoin Core&#x5C06;&#x5728;bitcoind&#x9ED8;&#x8BA4;&#x76EE;&#x5F55;&#x7684;regtest&#x5B50;&#x76EE;&#x5F55;&#x4E0B;&#x521D;&#x59CB;&#x5316;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF1A;</p>
<p>bitcoind: Using data directory /home/username/.bitcoin/regtest</p>
<p>&#x8981;&#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x5DE5;&#x5177;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6307;&#x5B9A;regtest&#x6807;&#x5FD7;&#x3002; &#x6211;&#x4EEC;&#x6765;&#x8BD5;&#x8BD5;getblockchaininfo&#x547D;&#x4EE4;&#x6765;&#x68C0;&#x67E5;regtest<strong>&#x533A;</strong>&#x5757;&#x94FE;&#xFF1A;</p>
<p>$ bitcoin-cli -regtest getblockchaininfo</p>
<p>{
  &quot;chain&quot;: &quot;regtest&quot;,</p>
<p>  &quot;blocks&quot;: 0,</p>
<p>  &quot;headers&quot;: 0,</p>
<p>  &quot;bestblockhash&quot;: &quot;0f9188f13cb7b2c71f2a335e3a4fc328bf5beb436012afca590b1a11466e2206&quot;,</p>
<p>  &quot;difficulty&quot;: 4.656542373906925e-10,</p>
<p>  &quot;mediantime&quot;: 1296688602,</p>
<p>  &quot;verificationprogress&quot;: 1,</p>
<p>  &quot;chainwork&quot;: &quot;0000000000000000000000000000000000000000000000000000000000000002&quot;,</p>
<p>  &quot;pruned&quot;: false,</p>
<p>  [...]</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x533A;&#x5757;&#x3002; &#x8BA9;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x6316;&#x4E00;&#x4E9B;&#xFF08;500&#x5757;&#xFF09;&#xFF0C;&#x8D5A;&#x53D6;&#x5956;&#x52B1;&#xFF1A;</p>
<p>$ bitcoin-cli -regtest generate 500</p>
<p>[
  &quot;7afed70259f22c2bf11e406cb12ed5c0657b6e16a6477a9f8b28e2046b5ba1ca&quot;,</p>
<p>  &quot;1aca2f154a80a9863a9aac4c72047a6d3f385c4eec5441a4aafa6acaa1dada14&quot;,</p>
<p>  &quot;4334ecf6fb022f30fbd764c3ee778fabbd53b4a4d1950eae8a91f1f5158ed2d1&quot;,</p>
<p>  &quot;5f951d34065efeaf64e54e91d00b260294fcdfc7f05dbb5599aec84b957a7766&quot;,</p>
<p>  &quot;43744b5e77c1dfece9d05ab5f0e6796ebe627303163547e69e27f55d0f2b9353&quot;,</p>
<p>   [...]</p>
<p>  &quot;6c31585a48d4fc2b3fd25521f4515b18aefb59d0def82bd9c2185c4ecb754327&quot;</p>
<p>]</p>
<p>&#x6316;&#x6398;&#x6240;&#x6709;&#x8FD9;&#x4E9B;&#x5757;&#x53EA;&#x9700;&#x8981;&#x51E0;&#x79D2;&#x949F;&#xFF0C;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5F88;&#x5BB9;&#x6613;&#x5730;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#x3002; &#x5982;&#x679C;&#x60A8;&#x68C0;&#x67E5;&#x60A8;&#x7684;&#x94B1;&#x5305;&#x4F59;&#x989D;&#xFF0C;&#x60A8;&#x5C06;&#x770B;&#x5230;&#x60A8;&#x83B7;&#x5F97;&#x4E86;&#x524D;400&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5956;&#x52B1;&#xFF08;Coinbase&#x7684;&#x5956;&#x52B1;&#x5FC5;&#x987B;&#x6316;&#x6EE1;100&#x5757;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x82B1;&#x8D39;&#xFF09;&#xFF1A;</p>
<p>$ bitcoin-cli -regtest getbalance</p>
<p>12462.50000000</p>
<h2 id="910&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x5757;&#x94FE;&#x8FDB;&#x884C;&#x5F00;&#x53D1;">9.10&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x5757;&#x94FE;&#x8FDB;&#x884C;&#x5F00;&#x53D1;</h2>
<p>Bitcoin&#x7684;&#x5404;&#x79CD;&#x533A;&#x5757;&#x94FE;&#xFF08;regtest&#xFF0C;segnet&#xFF0C;testnet3&#xFF0C;&#x4EE5;&#x53CA;&#x4E3B;<strong>&#x5E72;</strong>&#x7F51;&#xFF09;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x53D1;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x6D4B;&#x8BD5;&#x73AF;&#x5883;&#x3002; &#x65E0;&#x8BBA;&#x60A8;&#x662F;&#x5F00;&#x53D1;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x8FD8;&#x662F;&#x53E6;&#x4E00;&#x4E2A;&#x5168;&#x8282;&#x70B9;&#x5171;&#x8BC6;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8BF8;&#x5982;&#x94B1;&#x5305;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#xFF0C;&#x7535;&#x5B50;&#x5546;&#x52A1;&#x7F51;&#x7AD9;&#x7B49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x751A;&#x81F3;&#x5F00;&#x53D1;&#x65B0;&#x9896;&#x7684;&#x667A;&#x80FD;&#x5408;&#x540C;&#x548C;&#x590D;&#x6742;&#x7684;&#x811A;&#x672C;&#x7B49;&#x7B49;&#xFF0C;&#x8BF7;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;&#x7F51;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#x3002;</p>
<p>&#x60A8;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6D4B;&#x8BD5;&#x533A;&#x5757;&#x94FE;&#x6765;&#x5EFA;&#x7ACB;&#x5F00;&#x53D1;&#x7BA1;&#x9053;&#x3002; &#x5728;&#x5F00;&#x53D1;&#x5B83;&#x65F6;&#xFF0C;&#x5EFA;&#x8BAE;&#x5728;&#x672C;&#x5730;&#x6D4B;&#x8BD5;&#x4EE3;&#x7801;&#x3002; &#x4E00;&#x65E6;&#x60A8;&#x51C6;&#x5907;&#x597D;&#x5728;&#x516C;&#x5171;&#x7F51;&#x7EDC;&#x4E0A;&#x5C1D;&#x8BD5;&#xFF0C;&#x8BF7;&#x5207;&#x6362;&#x5230;testnet&#xFF0C;&#x5C06;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x66B4;&#x9732;&#x5728;&#x66F4;&#x52A0;&#x52A8;&#x6001;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5E76;&#x63D0;&#x4F9B;&#x66F4;&#x591A;&#x6837;&#x5316;&#x7684;&#x4EE3;&#x7801;&#x548C;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; &#x6700;&#x540E;&#xFF0C;&#x4E00;&#x65E6;&#x60A8;&#x786E;&#x4FE1;&#x60A8;&#x7684;&#x4EE3;&#x7801;&#x6B63;&#x5E38;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BF7;&#x5207;&#x6362;&#x5230;&#x4E3B;&#x7F51;&#x4EE5;&#x5B9E;&#x73B0;&#x751F;&#x4EA7;&#x90E8;&#x7F72;&#x3002; &#x5F53;&#x60A8;&#x8FDB;&#x884C;&#x53D8;&#x66F4;&#xFF0C;&#x6539;&#x8FDB;&#xFF0C;&#x9519;&#x8BEF;&#x4FEE;&#x590D;&#x7B49;&#x64CD;&#x4F5C;&#x65F6;&#xFF0C;&#x518D;&#x6B21;&#x542F;&#x52A8;&#x8FD9;&#x4E2A;&#x5F00;&#x53D1;&#x7BA1;&#x9053;&#xFF0C;&#x9996;&#x5148;&#x5728;regtest&#x4E0A;&#x90E8;&#x7F72;&#x6BCF;&#x4E2A;&#x53D8;&#x66F4;&#xFF0C;&#x7136;&#x540E;&#x5728;testnet&#x4E0A;&#x8FDB;&#x884C;&#x6D4B;&#x8BD5;&#xFF0C;&#x6700;&#x540E;&#x5B9E;&#x73B0;&#x751F;&#x4EA7;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch08.html" class="navigation navigation-prev " aria-label="Previous page: 第八章比特币网络">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch10.html" class="navigation navigation-next " aria-label="Next page: 第十章挖矿和共识">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第九章区块链","level":"1.15","depth":1,"next":{"title":"第十章挖矿和共识","level":"1.16","depth":1,"path":"ch10.md","ref":"ch10.md","articles":[]},"previous":{"title":"第八章比特币网络","level":"1.14","depth":1,"path":"ch08.md","ref":"ch08.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch09.md","mtime":"2018-12-14T06:26:05.581Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

