
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十章挖矿和共识 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch11.html" />
    
    
    <link rel="prev" href="ch09.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十章挖矿和共识</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="101-&#x7B80;&#x4ECB;">10.1 &#x7B80;&#x4ECB;</h2>
<p>&#x201C;&#x6316;&#x77FF;&#x201D;&#x8FD9;&#x4E2A;&#x8BCD;&#x6709;&#x70B9;&#x8BEF;&#x5BFC;&#x3002; &#x4E00;&#x822C;&#x610F;&#x4E49;&#x7684;&#x6316;&#x77FF;&#x7C7B;&#x4F3C;&#x8D35;&#x91D1;&#x5C5E;&#x7684;&#x63D0;&#x53D6;&#xFF0C;&#x66F4;&#x591A;&#x5C06;&#x4EBA;&#x4EEC;&#x7684;&#x6CE8;&#x610F;&#x529B;&#x96C6;&#x4E2D;&#x5230;&#x521B;&#x9020;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x3002; &#x867D;&#x7136;&#x6316;&#x77FF;&#x80FD;&#x591F;&#x83B7;&#x5F97;&#x8FD9;&#x79CD;&#x5956;&#x52B1;&#x4F5C;&#x4E3A;&#x6FC0;&#x52B1;&#xFF0C;&#x4F46;&#x6316;&#x77FF;&#x7684;&#x4E3B;&#x8981;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x8FD9;&#x4E2A;&#x5956;&#x52B1;&#x6216;&#x8005;&#x4EA7;&#x751F;&#x65B0;&#x5E01;&#x3002; &#x5982;&#x679C;&#x60A8;&#x53EA;&#x662F;&#x628A;&#x6316;&#x77FF;&#x89C6;&#x4E3A;&#x521B;&#x5EFA;&#x65B0;&#x5E01;&#x7684;&#x8FC7;&#x7A0B;&#xFF0C;&#x5219;&#x4F1A;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x8FD9;&#x4E2A;&#x624B;&#x6BB5;&#xFF08;&#x6FC0;&#x52B1;&#xFF09;&#x4F5C;&#x4E3A;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x7684;&#x76EE;&#x6807;&#x3002; &#x6316;&#x77FF;&#x6700;&#x91CD;&#x8981;&#x7684;&#x4F5C;&#x7528;&#x662F;&#x5DE9;&#x56FA;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6E05;&#x7B97;&#x4EA4;&#x6613;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x4EA4;&#x6613;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x548C;&#x6E05;&#x7B97;//&#x6E05;&#x9664;&#x3002; &#x6316;&#x77FF;&#x662F;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x4F17;&#x4E0D;&#x540C;&#x7684;&#x53D1;&#x660E;&#xFF0C;&#x5B83;&#x5B9E;&#x73B0;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5B89;&#x5168;&#x673A;&#x5236;&#xFF0C;&#x662F;P2P&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x7684;&#x57FA;&#x7840;&#x3002;</p>
<p>&#x200B;&#x6316;&#x77FF;&#x786E;&#x4FDD;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6CA1;&#x6709;&#x4E2D;&#x592E;&#x6743;&#x529B;&#x673A;&#x6784;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x4E86;&#x5168;&#x7F51;&#x7EDC;&#x8303;&#x56F4;&#x7684;&#x5171;&#x8BC6;&#x3002; &#x65B0;&#x5E01;&#x53D1;&#x884C;&#x548C;&#x4EA4;&#x6613;&#x8D39;&#x7684;&#x5956;&#x52B1;&#x662F;&#x5C06;&#x77FF;&#x5DE5;&#x7684;&#x884C;&#x52A8;&#x4E0E;&#x7F51;&#x7EDC;&#x5B89;&#x5168;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x7684;&#x6FC0;&#x52B1;&#x8BA1;&#x5212;&#xFF0C;&#x540C;&#x65F6;&#x5B9E;&#x73B0;&#x4E86;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#xFF1A;&#x6316;&#x77FF;&#x7684;&#x76EE;&#x7684;&#x4E0D;&#x662F;&#x521B;&#x9020;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002; &#x8FD9;&#x662F;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#x3002; &#x6316;&#x77FF;&#x662F;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x5B9E;&#x73B0;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5B89;&#x5168;&#x3002;</p>
<p>&#x200B;&#x77FF;&#x5DE5;&#x4EEC;&#x9A8C;&#x8BC1;&#x6BCF;&#x7B14;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x5E76;&#x628A;&#x5B83;&#x4EEC;&#x8BB0;&#x5F55;&#x5728;&#x603B;&#x5E10;&#x7C3F;&#x4E0A;&#x3002;&#x6BCF;10&#x5206;&#x949F;&#x5C31;&#x4F1A;&#x6709;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x88AB;&#x201C;&#x6316;&#x6398;&#x201D;&#x51FA;&#x6765;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x91CC;&#x5305;&#x542B;&#x7740;&#x4ECE; &#x4E0A;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x5230;&#x76EE;&#x524D;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x53D1;&#x751F;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x88AB;&#x4F9D;&#x6B21;&#x6DFB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x6211;&#x4EEC;&#x628A;&#x5305;&#x542B;&#x5728;&#x533A;&#x5757;&#x5185;&#x4E14;&#x88AB;&#x6DFB;&#x52A0;&#x5230; &#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x4EA4;&#x6613;&#x79F0;&#x4E3A;&#x201C;&#x786E;&#x8BA4;&#x201D;&#xFF08;confirmed&#xFF09;&#x4EA4;&#x6613;&#xFF0C;&#x4EA4;&#x6613;&#x7ECF;&#x8FC7;&#x201C;&#x786E;&#x8BA4;&#x201D;&#x4E4B;&#x540E;&#xFF0C;&#x65B0;&#x7684;&#x62E5;&#x6709;&#x8005;&#x624D;&#x80FD;&#x591F;&#x82B1;&#x8D39;&#x4ED6;&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#x5F97;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x77FF;&#x5DE5;&#x4EEC;&#x5728;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x4E2D;&#x4F1A;&#x5F97;&#x5230;&#x4E24;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x5956;&#x52B1;&#xFF1A;&#x521B;&#x5EFA;&#x65B0;&#x533A;&#x5757;&#x7684;&#x65B0;&#x5E01;&#x5956;&#x52B1;&#xFF0C;&#x4EE5;&#x53CA;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x542B;&#x4EA4;&#x6613;&#x7684;&#x4EA4;&#x6613;&#x8D39;&#x3002;&#x4E3A;&#x4E86;&#x5F97;&#x5230;&#x8FD9;&#x4E9B;&#x5956; &#x52B1;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x4E89;&#x76F8;&#x5B8C;&#x6210;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x7684;&#x6570;&#x5B66;&#x96BE;&#x9898;&#xFF0C;&#x8FD9;&#x4E9B;&#x96BE;&#x9898;&#x7684;&#x7B54;&#x6848;&#x5305;&#x62EC;&#x5728;&#x65B0;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x4F5C;&#x4E3A;&#x77FF;&#x5DE5;&#x7684;&#x8BA1;&#x7B97;&#x5DE5;&#x4F5C;&#x91CF;&#x7684;&#x8BC1; &#x660E;&#xFF0C;&#x88AB;&#x79F0;&#x4E3A;&#x201D;&#x201C;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x201D;&#x3002;&#x8BE5;&#x7B97;&#x6CD5;&#x7684;&#x7ADE;&#x4E89;&#x673A;&#x5236;&#x4EE5;&#x53CA;&#x83B7;&#x80DC;&#x8005;&#x6709;&#x6743;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x4E8C;&#x8005;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x5B89;&#x5168;&#x7684;&#x57FA;&#x77F3;&#x3002;</p>
<p>&#x65B0;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x751F;&#x6210;&#x8FC7;&#x7A0B;&#x88AB;&#x79F0;&#x4E3A;&#x6316;&#x77FF;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x5956;&#x52B1;&#x673A;&#x5236;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x901F;&#x5EA6;&#x9012;&#x51CF;&#x6A21;&#x5F0F;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x8D35;&#x91CD;&#x91D1;&#x5C5E;&#x7684;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D27;&#x5E01;&#x662F;&#x901A;&#x8FC7;&#x6316;&#x77FF;&#x53D1;&#x884C;&#x7684;&#xFF0C;&#x7C7B;&#x4F3C;&#x4E8E;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x901A;&#x8FC7;&#x5370;&#x5237;&#x94F6;&#x884C;&#x7EB8;&#x5E01;&#x6765;&#x53D1;&#x884C;&#x8D27;&#x5E01;&#x3002;&#x77FF;&#x5DE5;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x5F97;&#x5230;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6570;&#x91CF;&#x5927;&#x7EA6; &#x6BCF;&#x56DB;&#x5E74;&#xFF08;&#x6216;&#x51C6;&#x786E;&#x8BF4;&#x662F;&#x6BCF;210,000&#x4E2A;&#x5757;&#xFF09;&#x51CF;&#x5C11;&#x4E00;&#x534A;&#x3002;&#x5F00;&#x59CB;&#x65F6;&#x4E3A;2009&#x5E74;1&#x6708;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1;50&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x7136;&#x540E;&#x5230;2012&#x5E74;11&#x6708;&#x51CF;&#x534A;&#x4E3A;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x5956;&#x52B1;25&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E4B;&#x540E;&#x5728;2016&#x5E74;7&#x6708; &#x518D;&#x6B21;&#x51CF;&#x534A;&#x4E3A;&#x6BCF;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x5956;&#x52B1;12.5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x57FA;&#x4E8E;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x5956;&#x52B1;&#x4EE5;&#x6307;&#x6570;&#x65B9;&#x5F0F;&#x9012;&#x51CF;&#xFF0C;&#x76F4;&#x5230;2140&#x5E74;&#x3002;&#x5C4A;&#x65F6;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF08;20,999,999,980&#xFF09;&#x5168;&#x90E8;&#x53D1;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4; &#x5728;2140&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x4E0D;&#x4F1A;&#x518D;&#x6709;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA7;&#x751F;&#x3002;</p>
<p>&#x77FF;&#x5DE5;&#x4EEC;&#x540C;&#x65F6;&#x4E5F;&#x4F1A;&#x83B7;&#x53D6;&#x4EA4;&#x6613;&#x8D39;&#x3002;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x90FD;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x8D39;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x662F;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x5DEE;&#x989D;&#x3002;&#x5728;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x4E2D;&#x6210;&#x529F;&#x201C;&#x6316;&#x51FA;&#x201D;&#x65B0;&#x533A;&#x5757;&#x7684;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x5F97;&#x5230;&#x8BE5;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x201C;&#x5C0F;&#x8D39;&#x201D;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8FD9;&#x7B14;&#x8D39;&#x7528;&#x5360;&#x77FF;&#x5DE5;&#x6536;&#x5165;&#x7684;0.5%&#x6216;&#x66F4;&#x5C11;&#xFF0C;&#x5927; &#x90E8;&#x5206;&#x6536;&#x76CA;&#x4ECD;&#x6765;&#x81EA;&#x6316;&#x77FF;&#x6240;&#x5F97;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5956;&#x52B1;&#x3002;&#x7136;&#x800C;&#x968F;&#x7740;&#x6316;&#x77FF;&#x5956;&#x52B1;&#x7684;&#x9012;&#x51CF;&#xFF0C;&#x4EE5;&#x53CA;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x5305;&#x542B;&#x7684;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x589E;&#x52A0;&#xFF0C;&#x4EA4;&#x6613;&#x8D39;&#x5728;&#x77FF; &#x5DE5;&#x6536;&#x76CA;&#x4E2D;&#x6240;&#x5360;&#x7684;&#x6BD4;&#x91CD;&#x5C06;&#x4F1A;&#x9010;&#x6E10;&#x589E;&#x52A0;&#x3002;&#x5728;2140&#x5E74;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x77FF;&#x5DE5;&#x6536;&#x76CA;&#x90FD;&#x5C06;&#x7531;&#x4EA4;&#x6613;&#x8D39;&#x6784;&#x6210;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5148;&#x6765;&#x5BA1;&#x89C6;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x673A;&#x5236;&#xFF0C;&#x7136;&#x540E;&#x518D;&#x6765;&#x4E86;&#x89E3;&#x6316;&#x77FF;&#x7684;&#x6700;&#x91CD;&#x8981;&#x7684;&#x529F;&#x80FD;&#xFF1A;&#x652F;&#x6491;&#x6BD4;&#x7279;&#x5E01;&#x5B89;&#x5168;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x3002;</p>
<p>&#x200B;&#x4E3A;&#x4E86;&#x4E86;&#x89E3;&#x6316;&#x77FF;&#x548C;&#x5171;&#x8BC6;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x8DDF;&#x968F;Alice&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x53CA;&#x4E0A;&#x6D77;&#x7684;&#x77FF;&#x5DE5;Jing&#x5982;&#x4F55;&#x6536;&#x5230;&#x5E76;&#x5229;&#x7528;&#x6316;&#x77FF;&#x8BBE;&#x5907;&#x5C06;&#x4EA4;&#x6613;&#x52A0;&#x5165;&#x533A;&#x5757;&#x3002; &#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7EE7;&#x7EED;&#x8DDF;&#x8E2A;&#x533A;&#x5757;&#x88AB;&#x6316;&#x77FF;&#xFF0C;&#x52A0;&#x5165;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x5171;&#x8BC6;&#x88AB;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x63A5;&#x53D7;&#x3002;</p>
<h3 id="1011-&#x6BD4;&#x7279;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;&#x8D27;&#x5E01;&#x521B;&#x9020;">10.1.1 &#x6BD4;&#x7279;&#x5E01;&#x7ECF;&#x6D4E;&#x5B66;&#x548C;&#x8D27;&#x5E01;&#x521B;&#x9020;</h3>
<p>&#x200B;&#x901A;&#x8FC7;&#x521B;&#x9020;&#x51FA;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4EE5;&#x4E00;&#x4E2A;&#x786E;&#x5B9A;&#x7684;&#x4F46;&#x4E0D;&#x65AD;&#x51CF;&#x6162;&#x7684;&#x901F;&#x7387;&#x88AB;&#x94F8;&#x9020;&#x51FA;&#x6765;&#x3002;&#x5927;&#x7EA6;&#x6BCF;&#x5341;&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757; &#x90FD;&#x4F34;&#x968F;&#x7740;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x4ECE;&#x65E0;&#x5230;&#x6709;&#x7684;&#x5168;&#x65B0;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x6BCF;&#x5F00;&#x91C7;210,000&#x4E2A;&#x5757;&#xFF0C;&#x5927;&#x7EA6;&#x8017;&#x65F6;4&#x5E74;&#xFF0C;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x901F;&#x7387;&#x964D;&#x4F4E;50%&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x8FD0; &#x884C;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x56DB;&#x5E74;&#x4E2D;&#xFF0C;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x521B;&#x9020;&#x51FA;50&#x4E2A;&#x65B0;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>2012&#x5E74;11&#x6708;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B0;&#x53D1;&#x884C;&#x901F;&#x5EA6;&#x964D;&#x4F4E;&#x5230;&#x6BCF;&#x533A;&#x5757;25&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;2016&#x5E74;7&#x6708;&#xFF0C;&#x964D;&#x4F4E;&#x5230;12.5&#x6BD4;&#x7279;&#x5E01;/&#x533A;&#x5757;&#x3002;2020&#x5E74;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;&#x533A;&#x5757;630,000&#xFF0C;&#x5B83;&#x5C06;&#x518D;&#x6B21;&#x4E0B;&#x964D;&#x81F3;6.25&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x65B0;&#x5E01;&#x7684;&#x53D1;&#x884C;&#x901F;&#x5EA6;&#x4F1A;&#x4EE5;&#x6307;&#x6570;&#x7EA7;&#x8FDB;&#x884C;32&#x6B21;&#x201C;&#x7B49;&#x5206;&#x201D;&#xFF0C;&#x76F4;&#x5230;&#x7B2C;6,720,000&#x5757;&#xFF08;&#x5927;&#x7EA6;&#x5728;2137&#x5E74;&#x5F00;&#x91C7;&#xFF09;&#xFF0C;&#x8FBE;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6700;&#x5C0F;&#x8D27;&#x5E01;&#x5355;&#x4F4D;1 satoshi&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x5728;&#x7ECF;&#x8FC7;693&#x4E07;&#x4E2A;&#x533A;&#x5757;&#x4E4B;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x5171; 2,099,999,997,690,000&#x806A;&#x6BD4;&#x7279;&#x5E01;&#x5C06;&#x5168;&#x90E8;&#x53D1;&#x884C;&#x5B8C;&#x6BD5;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#xFF0C;&#x5230;2140&#x5E74;&#x5DE6;&#x53F3;&#xFF0C;&#x4F1A;&#x5B58;&#x5728;&#x63A5;&#x8FD1; 2,100&#x4E07;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5728;&#x90A3;&#x4E4B;&#x540E;&#xFF0C;&#x65B0;&#x7684;&#x533A;&#x5757;&#x4E0D;&#x518D;&#x5305;&#x542B;&#x6BD4;&#x7279;&#x5E01;&#x5956;&#x52B1;&#xFF0C;&#x77FF;&#x5DE5;&#x7684;&#x6536;&#x76CA;&#x5168;&#x90E8;&#x6765;&#x81EA;&#x4EA4;&#x6613;&#x8D39;&#x3002;&#x56FE;10-1&#x5C55;&#x793A;&#x4E86;&#x5728;&#x53D1;&#x884C;&#x901F;&#x5EA6;&#x4E0D;&#x65AD;&#x964D;&#x4F4E;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x603B;&#x6D41;&#x901A;&#x91CF;&#x4E0E;&#x65F6;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-8940ef3f6c6357d4.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-1 &#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x884C;&#x4E0E;&#x65F6;&#x95F4;&#x7684;&#x5173;&#x7CFB;</p>
<p><strong>&#x6CE8;&#x610F;</strong>&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x53D1;&#x884C;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#x4E5F;&#x5C31;&#x6210;&#x4E3A;&#x6316;&#x77FF;&#x5956;&#x52B1;&#x7684;&#x4E0A;&#x9650;&#x3002; &#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x77FF;&#x5DE5;&#x53EF;&#x80FD;&#x6545;&#x610F;&#x6316;&#x6398;&#x54EA;&#x4E9B;&#x4E0D;&#x8DB3;&#x5168;&#x989D;&#x5956;&#x52B1;&#x7684;&#x533A;&#x5757;&#x3002; &#x8FD9;&#x4E9B;&#x5757;&#x5DF2;&#x7ECF;&#x5F00;&#x91C7;&#x4E86;&#xFF0C;&#x672A;&#x6765;&#x53EF;&#x80FD;&#x4F1A;&#x6709;&#x66F4;&#x591A;&#x88AB;&#x5F00;&#x91C7;&#xFF0C;&#x8FD9;&#x6837;&#x5BFC;&#x81F4;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x603B;&#x91CF;&#x7684;&#x4E0B;&#x964D;&#x3002;</p>
<p>&#x200B; &#x5728;&#x4F8B;10-1&#x7684;&#x4EE3;&#x7801;&#x5C55;&#x793A;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x8BA1;&#x7B97;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x603B;&#x53D1;&#x884C;&#x91CF;</p>
<p>&#x200B; &#x4F8B;10-1 &#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x884C;&#x603B;&#x91CF;&#x7684;&#x8BA1;&#x7B97;&#x811A;&#x672C;</p>
<pre><code>code/max_money.py[]
</code></pre><p>&#x200B;<a href="https://github.com/bitcoinbook/bitcoinbook/blob/second_edition/ch10.asciidoc#max_money_run" target="_blank">Running the max_money.py script</a>&#x8BF4;&#x660E;&#x4E86;&#x8FD0;&#x884C;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;&#x7ED3;&#x679C;</p>
<p>&#x4F8B;10-2 &#x663E;&#x793A;&#x4E0A;&#x8FF0;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;</p>
<pre><code>$ python max_money.pyTotal BTC to ever be created: 2099999997690000 Satoshis
</code></pre><p>&#x603B;&#x91CF;&#x6709;&#x9650;&#x5E76;&#x4E14;&#x53D1;&#x884C;&#x901F;&#x5EA6;&#x9012;&#x51CF;&#x521B;&#x9020;&#x4E86;&#x4E00;&#x79CD;&#x6297;&#x901A;&#x80C0;&#x7684;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x6A21;&#x5F0F;&#x3002;&#x6CD5;&#x5E01;&#x53EF;&#x88AB;&#x4E2D;&#x592E;&#x94F6;&#x884C;&#x65E0;&#x9650;&#x5236;&#x5730;&#x5370;&#x5237;&#x51FA;&#x6765;&#xFF0C;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x56E0;&#x8D85;&#x989D;&#x5370;&#x53D1;&#x800C;&#x51FA;&#x73B0;&#x901A;&#x80C0;&#x3002;</p>
<p>&#x901A;&#x8D27;&#x7D27;&#x7F29;</p>
<p>&#x6700;&#x91CD;&#x8981;&#x5E76;&#x4E14;&#x6700;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x4E00;&#x4E2A;&#x7ED3;&#x8BBA;&#x662F;&#x4E00;&#x79CD;&#x4E8B;&#x5148;&#x786E;&#x5B9A;&#x7684;&#x53D1;&#x884C;&#x901F;&#x7387;&#x9012;&#x51CF;&#x7684;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x6A21;&#x5F0F;&#x4F1A;&#x5BFC;&#x81F4;&#x8D27;&#x5E01;&#x901A;&#x8D27;&#x7D27;&#x7F29;&#xFF08;&#x7B80;&#x79F0;&#x901A;&#x7F29;&#xFF09;&#x3002;&#x901A;&#x7F29;&#x662F;&#x4E00;&#x79CD;&#x7531;&#x4E8E;&#x8D27;&#x5E01;&#x7684;&#x4F9B;&#x5E94;&#x548C;&#x9700;&#x6C42;&#x4E0D;&#x5339;&#x914D;&#x5BFC;&#x81F4;&#x7684;&#x8D27;&#x5E01;&#x589E;&#x503C;&#x7684;&#x73B0;&#x8C61;&#x3002;&#x5B83;&#x4E0E;&#x901A;&#x80C0;&#x76F8;&#x53CD;&#xFF0C;&#x4EF7;&#x683C;&#x901A;&#x7F29;&#x610F;&#x5473;&#x7740;&#x8D27;&#x5E01;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x6709;&#x8D8A;&#x6765;&#x8D8A;&#x5F3A;&#x7684;&#x8D2D;&#x4E70;&#x529B;&#x3002;</p>
<p>&#x8BB8;&#x591A;&#x7ECF;&#x6D4E;&#x5B66;&#x5BB6;&#x63D0;&#x51FA;&#x901A;&#x7F29;&#x7ECF;&#x6D4E;&#x662F;&#x4E00;&#x79CD;&#x65E0;&#x8BBA;&#x5982;&#x4F55;&#x90FD;&#x8981;&#x907F;&#x514D;&#x7684;&#x707E;&#x96BE;&#x578B;&#x7ECF;&#x6D4E;&#x3002;&#x56E0;&#x4E3A;&#x5728;&#x5FEB;&#x901F;&#x901A;&#x7F29;&#x65F6;&#x671F;&#xFF0C;&#x4EBA;&#x4EEC;&#x9884;&#x671F;&#x7740;&#x5546;&#x54C1;&#x4EF7;&#x683C;&#x4F1A;&#x4E0B;&#x8DCC;&#xFF0C;&#x4EBA;&#x4EEC;&#x5C06;&#x4F1A;&#x50A8;&#x5B58;&#x8D27;&#x5E01;&#xFF0C;&#x907F;&#x514D;&#x82B1;&#x6389;&#x5B83;&#x3002;&#x8FD9;&#x79CD;&#x73B0;&#x8C61;&#x5145;&#x65A5;&#x4E86;&#x65E5;&#x672C;&#x7ECF;&#x6D4E;&#x201C;&#x5931;&#x53BB;&#x7684;&#x5341;&#x5E74;&#x201D;&#xFF0C;&#x5C31;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x9700;&#x6C42;&#x574D;&#x584C;&#x4E4B;&#x540E;&#x5BFC;&#x81F4;&#x4E86;&#x6EDE;&#x6DA8;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x4E13;&#x5BB6;&#x4EEC;&#x8BA4;&#x4E3A;&#x901A;&#x7F29;&#x672C;&#x8EAB;&#x5E76;&#x4E0D;&#x574F;&#x3002;&#x66F4;&#x786E;&#x5207;&#x5730;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x7F29;&#x4E0E;&#x9700;&#x6C42;&#x574D;&#x584C;&#x8054;&#x7CFB;&#x5728;&#x4E00;&#x8D77;&#x662F;&#x56E0;&#x4E3A;&#x8FC7;&#x53BB;&#x51FA;&#x73B0;&#x7684;&#x4E00;&#x4E2A;&#x7279;&#x4F8B;&#x3002;&#x5728;&#x6CD5;&#x5E01;&#x5C4A;&#xFF0C;&#x8D27;&#x5E01;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x88AB;&#x65E0;&#x9650;&#x5236;&#x5370;&#x5237;&#x51FA;&#x6765;&#x7684;&#xFF0C;&#x9664;&#x975E;&#x9047;&#x5230;&#x9700;&#x6C42;&#x5B8C;&#x5168;&#x5D29;&#x584C;&#x5E76;&#x4E14;&#x6BEB;&#x65E0;&#x53D1;&#x884C;&#x8D27;&#x5E01;&#x610F;&#x613F;&#x7684;&#x60C5;&#x5F62;&#xFF0C;&#x56E0;&#x6B64;&#x7ECF;&#x6D4E;&#x5F88;&#x96BE;&#x8FDB;&#x5165;&#x6EDE;&#x6DA8;&#x671F;&#x3002;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x901A;&#x7F29;&#x5E76;&#x4E0D;&#x662F;&#x9700;&#x6C42;&#x574D;&#x584C;&#x5F15;&#x8D77;&#x7684;&#xFF0C;&#x5B83;&#x9075;&#x5FAA;&#x4E00;&#x79CD;&#x9884;&#x5B9A;&#x4E14;&#x6709;&#x8282;&#x5236;&#x7684;&#x8D27;&#x5E01;&#x4F9B;&#x5E94;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x200B;&#x901A;&#x8D27;&#x7D27;&#x7F29;&#x7684;&#x79EF;&#x6781;&#x56E0;&#x7D20;&#x5F53;&#x7136;&#x662F;&#x4E0E;&#x901A;&#x8D27;&#x81A8;&#x80C0;&#x76F8;&#x53CD;&#x3002; &#x901A;&#x8D27;&#x81A8;&#x80C0;&#x5BFC;&#x81F4;&#x8D27;&#x5E01;&#x7F13;&#x6162;&#x4F46;&#x4E0D;&#x53EF;&#x907F;&#x514D;&#x7684;&#x8D2C;&#x503C;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x79CD;&#x9690;&#x6027;&#x7A0E;&#x6536;&#x7684;&#x5F62;&#x5F0F;&#xFF0C;&#x60E9;&#x7F5A;&#x5728;&#x94F6;&#x884C;&#x5B58;&#x94B1;&#x7684;&#x4EBA;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x89E3;&#x6551;&#x503A;&#x52A1;&#x4EBA;&#xFF08;&#x5305;&#x62EC;&#x653F;&#x5E9C;&#x8FD9;&#x4E2A;&#x6700;&#x5927;&#x7684;&#x503A;&#x52A1;&#x4EBA;&#xFF09;&#x3002; &#x653F;&#x5E9C;&#x63A7;&#x5236;&#x4E0B;&#x7684;&#x8D27;&#x5E01;&#x5BB9;&#x6613;&#x906D;&#x53D7;&#x503A;&#x52A1;&#x53D1;&#x884C;&#x7684;&#x9053;&#x5FB7;&#x98CE;&#x9669;&#xFF0C;&#x4E4B;&#x540E;&#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x727A;&#x7272;&#x50A8;&#x84C4;&#x8005;&#x4E3A;&#x4EE3;&#x4EF7;&#xFF0C;&#x901A;&#x8FC7;&#x8D2C;&#x503C;&#x6765;&#x62B9;&#x53BB;&#x503A;&#x52A1;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x79CD;&#x4E0D;&#x662F;&#x56E0;&#x7ECF;&#x6D4E;&#x5FEB;&#x901F;&#x8870;&#x9000;&#x800C;&#x5F15;&#x8D77;&#x7684;&#x901A;&#x7F29;&#xFF0C;&#x662F;&#x5426;&#x4F1A;&#x5F15;&#x53D1;&#x5176;&#x4ED6;&#x95EE;&#x9898;&#xFF0C;&#x4ECD;&#x6709;&#x5F85;&#x89C2;&#x5BDF;&#x3002;</p>
<h2 id="102-&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;">10.2 &#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;</h2>
<p>&#x200B;&#x5728;&#x4E0A;&#x4E00;&#x7AE0;&#x4E2D;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x3002;&#x53EF;&#x4EE5;&#x5C06;&#x533A;&#x5757;&#x94FE;&#x770B;&#x4F5C;&#x4E00;&#x672C;&#x8BB0;&#x5F55;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x7684;&#x516C;&#x5F00;&#x603B;&#x5E10;&#x7C3F;&#xFF08;&#x5217;&#x8868;&#xFF09;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E; &#x8005;&#x90FD;&#x628A;&#x80FD;&#x63A5;&#x53D7;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x628A;&#x5B83;&#x770B;&#x4F5C;&#x4E00;&#x672C;&#x8BC1;&#x660E;&#x6240;&#x6709;&#x6743;&#x7684;&#x6743;&#x5A01;&#x8BB0;&#x5F55;&#x3002;</p>
<p>&#x200B;&#x4F46;&#x5728;&#x4E0D;&#x8003;&#x8651;&#x76F8;&#x4FE1;&#x4EFB;&#x4F55;&#x4EBA;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x5982;&#x4F55;&#x8FBE;&#x6210;&#x5BF9;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x6240;&#x6709;&#x6743;&#x7684;&#x5171;&#x8BC6;&#x5462;&#xFF1F;&#x6240;&#x6709;&#x7684;&#x4F20;&#x7EDF;&#x652F;&#x4ED8;&#x7CFB; &#x7EDF;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x8BA4;&#x8BC1;&#x673A;&#x6784;&#xFF0C;&#x4F9D;&#x9760;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#x63D0;&#x4F9B;&#x7684;&#x7ED3;&#x7B97;&#x670D;&#x52A1;&#x6765;&#x9A8C;&#x8BC1;&#x5E76;&#x5904;&#x7406;&#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x6CA1;&#x6709;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#xFF0C;&#x51E0;&#x4E4E;&#x6240; &#x6709;&#x7684;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x4E00;&#x4EFD;&#x516C;&#x5171;&#x603B;&#x5E10;&#x7684;&#x5907;&#x4EFD;&#xFF0C;&#x8FD9;&#x4EFD;&#x603B;&#x5E10;&#x53EF;&#x4EE5;&#x88AB;&#x89C6;&#x4E3A;&#x6743;&#x5A01;&#x8BB0;&#x5F55;&#x3002;&#x533A;&#x5757;&#x94FE;&#x5E76;&#x4E0D;&#x662F;&#x7531;&#x4E00;&#x4E2A;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#x521B;&#x9020;&#x7684;&#xFF0C;&#x5B83;&#x662F;&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#x7ADE;&#x4E89;&#x5B8C;&#x6210;&#x7684;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#xFF0C;&#x4F9D;&#x9760;&#x7740;&#x8282;&#x70B9;&#x95F4;&#x7684;&#x4E0D;&#x7A33;&#x5B9A;&#x7684;&#x7F51;&#x7EDC;&#x8FDE;&#x63A5;&#x6240;&#x4F20;&#x8F93;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x6700;&#x7EC8;&#x5F97;&#x51FA;&#x540C;&#x6837;&#x7684;&#x7ED3;&#x679C;&#x5E76;&#x7EF4;&#x62A4;&#x4E86;&#x540C;&#x4E00;&#x4E2A;&#x516C;&#x5171;&#x603B;&#x5E10;&#x3002;&#x8FD9;&#x4E00;&#x7AE0;&#x5C06;&#x4ECB;&#x7ECD;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0D;&#x4F9D;&#x9760;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#x800C;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x7684;&#x673A;&#x5236;&#x3002;</p>
<p>&#x200B;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x4E3B;&#x8981;&#x53D1;&#x660E;&#x5C31;&#x662F;&#x8FD9;&#x79CD;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x81EA;&#x53D1;&#x5171;&#x8BC6;&#xFF08;emergent consensus&#xFF09;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x79CD;&#x81EA;&#x53D1;&#xFF0C;&#x662F;&#x6307;&#x5171;&#x8BC6;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x5B8C;&#x6210;&#x70B9;&#xFF0C;&#x56E0;&#x4E3A;&#x5171;&#x8BC6;&#x8FBE;&#x6210;&#x65F6;&#xFF0C;&#x6CA1;&#x6709;&#x660E;&#x786E;&#x7684;&#x9009;&#x4E3E;&#x548C;&#x56FA;&#x5B9A;&#x65F6;&#x523B;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5171;&#x8BC6;&#x662F;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x72EC;&#x7ACB;&#x8282;&#x70B9;&#x9075;&#x5B88;&#x4E86;&#x7B80;&#x5355;&#x7684;&#x89C4;&#x5219;&#x901A;&#x8FC7;&#x5F02;&#x6B65;&#x4EA4;&#x4E92;&#x81EA;&#x53D1;&#x5F62;&#x6210;&#x7684;&#x4EA7;&#x7269;&#x3002;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5C5E;&#x6027;&#xFF0C;&#x5305;&#x62EC;&#x8D27;&#x5E01;&#x3001;&#x4EA4;&#x6613;&#x3001;&#x652F;&#x4ED8;&#x4EE5;&#x53CA;&#x4E0D;&#x4F9D;&#x9760;&#x4E2D;&#x5FC3;&#x673A;&#x6784;&#x548C;&#x4FE1;&#x4EFB;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x7B49;&#x90FD;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x4E2A;&#x53D1;&#x660E;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x7531;&#x6240;&#x6709;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x7684;4&#x79CD;&#x72EC;&#x7ACB;&#x8FC7;&#x7A0B;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x800C;&#x4EA7;&#x751F;&#xFF1A;</p>
<p>&#x25B7; &#x6BCF;&#x4E2A;&#x5168;&#x8282;&#x70B9;&#x4F9D;&#x636E;&#x7EFC;&#x5408;&#x6807;&#x51C6;&#x5BF9;&#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x72EC;&#x7ACB;&#x9A8C;&#x8BC1;</p>
<p>&#x25B7; &#x901A;&#x8FC7;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x7684;&#x9A8C;&#x7B97;&#xFF0C;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x5C06;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x72EC;&#x7ACB;&#x6253;&#x5305;&#x8FDB;&#x65B0;&#x533A;&#x5757;</p>
<p>&#x25B7; &#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x72EC;&#x7ACB;&#x7684;&#x5BF9;&#x65B0;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#x5E76;&#x7EC4;&#x88C5;&#x8FDB;&#x533A;&#x5757;&#x94FE;</p>
<p>&#x25B7; &#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5BF9;&#x533A;&#x5757;&#x94FE;&#x8FDB;&#x884C;&#x72EC;&#x7ACB;&#x9009;&#x62E9;&#xFF0C;&#x5728;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x673A;&#x5236;&#x4E0B;&#x9009;&#x62E9;&#x7D2F;&#x8BA1;&#x5DE5;&#x4F5C;&#x91CF;&#x6700;&#x5927;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
<p>&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5BA1;&#x89C6;&#x8FD9;&#x4E9B;&#x8FC7;&#x7A0B;&#xFF0C;&#x4E86;&#x89E3;&#x5B83;&#x4EEC;&#x4E4B;&#x95F4;&#x5982;&#x4F55;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x5E76;&#x8FBE;&#x6210;&#x5168;&#x7F51;&#x7684;&#x81EA;&#x53D1;&#x5171;&#x8BC6;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x4EFB;&#x610F;&#x8282;&#x70B9;&#x7EC4;&#x5408;&#x51FA; &#x5B83;&#x81EA;&#x5DF1;&#x7684;&#x6743;&#x5A01;&#x3001;&#x53EF;&#x4FE1;&#x3001;&#x516C;&#x5F00;&#x7684;&#x603B;&#x5E10;&#x526F;&#x672C;&#x3002;</p>
<h2 id="103-&#x4EA4;&#x6613;&#x7684;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;">10.3 &#x4EA4;&#x6613;&#x7684;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;</h2>
<p>&#x200B;&#x5728;&#x7B2C;6&#x7AE0;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x77E5;&#x9053;&#x4E86;&#x94B1;&#x5305;&#x8F6F;&#x4EF6;&#x901A;&#x8FC7;&#x6536;&#x96C6;UTXO&#x3001;&#x63D0;&#x4F9B;&#x6B63;&#x786E;&#x7684;&#x89E3;&#x9501;&#x811A;&#x672C;&#x3001;&#x6784;&#x9020;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x652F;&#x51FA;&#xFF08;&#x652F;&#x4ED8;&#xFF09;&#x7ED9;&#x63A5;&#x6536;&#x8005;&#x8FD9;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x521B;&#x5EFA;&#x4EA4;&#x6613;&#x3002;&#x4EA7;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x968F;&#x540E;&#x5C06;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E34;&#x8FD1;&#x7684;&#x8282;&#x70B9;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x8BE5;&#x4EA4;&#x6613;&#x80FD;&#x591F;&#x5728;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#x3002;</p>
<p>&#x200B;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x4EA4;&#x6613;&#x4F20;&#x9012;&#x5230;&#x4E34;&#x8FD1;&#x7684;&#x8282;&#x70B9;&#x524D;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x6536;&#x5230;&#x4EA4;&#x6613;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x5C06;&#x4F1A;&#x9996;&#x5148;&#x9A8C;&#x8BC1;&#x8BE5;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x5C06;&#x786E;&#x4FDD;&#x53EA;&#x6709;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#x624D;&#x4F1A; &#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#xFF0C;&#x800C;&#x65E0;&#x6548;&#x7684;&#x4EA4;&#x6613;&#x5C06;&#x4F1A;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5904;&#x88AB;&#x5E9F;&#x5F03;&#x3002;</p>
<p>&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x6821;&#x9A8C;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x90FD;&#x9700;&#x8981;&#x5BF9;&#x7167;&#x4E00;&#x4E2A;&#x957F;&#x957F;&#x7684;&#x6807;&#x51C6;&#x5217;&#x8868;&#xFF1A;</p>
<p>&#x25B7;&#x4EA4;&#x6613;&#x7684;&#x8BED;&#x6CD5;&#x548C;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x5FC5;&#x987B;&#x6B63;&#x786E;&#x3002;</p>
<p>&#x25B7;&#x8F93;&#x5165;&#x4E0E;&#x8F93;&#x51FA;&#x5217;&#x8868;&#x90FD;&#x4E0D;&#x80FD;&#x4E3A;&#x7A7A;&#x3002;</p>
<p>&#x25B7;&#x4EA4;&#x6613;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x662F;&#x5C0F;&#x4E8E; MAX_BLOCK_SIZE &#x7684;&#x3002;</p>
<p>&#x25B7;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x503C;&#xFF0C;&#x4EE5;&#x53CA;&#x603B;&#x91CF;&#xFF0C;&#x5FC5;&#x987B;&#x5728;&#x89C4;&#x5B9A;&#x503C;&#x7684;&#x8303;&#x56F4;&#x5185; &#xFF08;&#x5C0F;&#x4E8E;2,100&#x4E07;&#x4E2A;&#x5E01;&#xFF0C;&#x5927;&#x4E8E;0&#xFF09;&#x3002;</p>
<p>&#x25B7;&#x6CA1;&#x6709;&#x54C8;&#x5E0C;&#x7B49;&#x4E8E;0&#xFF0C;N&#x7B49;&#x4E8E;-1&#x7684;&#x8F93;&#x5165;&#xFF08;coinbase&#x4EA4;&#x6613;&#x4E0D;&#x5E94;&#x5F53;&#x88AB;&#x4F20;&#x9012;&#xFF09;&#x3002;</p>
<p>&#x25B7;nLockTime&#x662F;&#x5C0F;&#x4E8E;&#x6216;&#x7B49;&#x4E8E; INT_MAX &#x7684;&#x3002;&#x6216;&#x8005;nLocktime and nSequence&#x7684;&#x503C;&#x6EE1;&#x8DB3;MedianTimePast&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;MedianTime&#x662F;&#x8FD9;&#x4E2A;&#x5757;&#x7684;&#x524D;&#x9762;11&#x4E2A;&#x5757;&#x6309;&#x7167;block time&#x6392;&#x5E8F;&#x540E;&#x7684;&#x4E2D;&#x95F4;&#x65F6;&#x95F4;&#xFF09;</p>
<p>&#x25B7;&#x4EA4;&#x6613;&#x7684;&#x5B57;&#x8282;&#x5927;&#x5C0F;&#x662F;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;100&#x7684;&#x3002;</p>
<p>&#x25B7;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x7B7E;&#x540D;&#x6570;&#x91CF;(SIGOPS)&#x5E94;&#x5C0F;&#x4E8E;&#x7B7E;&#x540D;&#x64CD;&#x4F5C;&#x6570;&#x91CF;&#x4E0A;&#x9650;&#x3002;</p>
<p>&#x25B7;&#x89E3;&#x9501;&#x811A;&#x672C;&#xFF08; scriptSig &#xFF09;&#x53EA;&#x80FD;&#x591F;&#x5C06;&#x6570;&#x5B57;&#x538B;&#x5165;&#x6808;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x9501;&#x5B9A;&#x811A;&#x672C;&#xFF08; scriptPubkey &#xFF09;&#x5FC5;&#x987B;&#x8981;&#x7B26;&#x5408;isStandard&#x7684;&#x683C;&#x5F0F; &#xFF08;&#x8BE5;&#x683C;&#x5F0F;&#x5C06;&#x4F1A;&#x62D2;&#x7EDD;&#x975E;&#x6807;&#x51C6;&#x4EA4;&#x6613;&#xFF09;&#x3002;</p>
<p>&#x25B7;&#x6C60;&#x4E2D;&#x6216;&#x4F4D;&#x4E8E;&#x4E3B;&#x5206;&#x652F;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5339;&#x914D;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x662F;&#x5B58;&#x5728;&#x7684;&#x3002;</p>
<p>&#x25B7;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x5FC5;&#x987B;&#x5B58;&#x5728;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x6CA1;&#x6709;&#x88AB;&#x82B1;&#x8D39;&#x3002;</p>
<p>&#x25B7;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x5B58;&#x5728;&#x4E8E;&#x6C60;&#x4E2D;&#x4EFB;&#x4F55;&#x522B;&#x7684;&#x4EA4;&#x6613;&#x4E2D;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x8FD9;&#x7B14;&#x8F93;&#x5165;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x6709;&#x4EBA;&#x5BB6;&#x81EA;&#x5DF1;&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4E0D;&#x662F;&#x4F60;&#xFF09;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x5C06;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x25B7;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5728;&#x4E3B;&#x5206;&#x652F;&#x548C;&#x4EA4;&#x6613;&#x6C60;&#x4E2D;&#x5BFB;&#x627E;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x8F93;&#x51FA;&#x4EA4;&#x6613;&#x7F3A;&#x5C11;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x5C06;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5B64; &#x7ACB;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x4E0E;&#x5176;&#x5339;&#x914D;&#x7684;&#x4EA4;&#x6613;&#x8FD8;&#x6CA1;&#x6709;&#x51FA;&#x73B0;&#x5728;&#x6C60;&#x4E2D;&#xFF0C;&#x90A3;&#x4E48;&#x5C06;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x5B64;&#x7ACB;&#x4EA4;&#x6613;&#x6C60;&#x4E2D;&#x3002;</p>
<p>&#x25B7;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#xFF0C;&#x5982;&#x679C;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x4EA4;&#x6613;&#x662F;&#x4E00;&#x4E2A;coinbase&#x8F93;&#x51FA;&#xFF0C;&#x8BE5;&#x8F93;&#x5165;&#x5FC5;&#x987B;&#x81F3;&#x5C11;&#x83B7;&#x5F97; COINBASE_MATURITY(100)&#x4E2A;&#x786E;&#x8BA4;&#x3002;</p>
<p>&#x25B7;&#x4F7F;&#x7528;&#x5F15;&#x7528;&#x7684;&#x8F93;&#x51FA;&#x4EA4;&#x6613;&#x83B7;&#x5F97;&#x8F93;&#x5165;&#x503C;&#xFF0C;&#x5E76;&#x68C0;&#x67E5;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x503C;&#x548C;&#x603B;&#x503C;&#x662F;&#x5426;&#x5728;&#x89C4;&#x5B9A;&#x503C;&#x7684;&#x8303;&#x56F4;&#x5185; &#xFF08;&#x5C0F;&#x4E8E;2100&#x4E07;&#x4E2A;&#x5E01;&#xFF0C;&#x5927;&#x4E8E;0&#xFF09;&#x3002;</p>
<p>&#x25B7;&#x5982;&#x679C;&#x8F93;&#x5165;&#x503C;&#x7684;&#x603B;&#x548C;&#x5C0F;&#x4E8E;&#x8F93;&#x51FA;&#x503C;&#x7684;&#x603B;&#x548C;&#xFF0C;&#x4EA4;&#x6613;&#x5C06;&#x88AB;&#x4E2D;&#x6B62;&#x3002;</p>
<p>&#x25B7;&#x5982;&#x679C;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x592A;&#x4F4E;&#x4EE5;&#x81F3;&#x4E8E;&#x65E0;&#x6CD5;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x7A7A;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4EA4;&#x6613;&#x5C06;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x25B7;&#x6BCF;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x7684;&#x89E3;&#x9501;&#x811A;&#x672C;&#x5FC5;&#x987B;&#x4F9D;&#x636E;&#x76F8;&#x5E94;&#x8F93;&#x51FA;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x6765;&#x9A8C;&#x8BC1;&#x3002;</p>
<p>&#x200B;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x80FD;&#x591F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x6807;&#x51C6;&#x5BA2;&#x6237;&#x7AEF;&#x4E0B;&#x7684; AcceptToMemoryPool &#x3001; CheckTransaction &#x548C; CheckInputs &#x51FD;&#x6570;&#x4E2D;&#x83B7;&#x5F97;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x9610;&#x8FF0;&#x3002; &#x8BF7;&#x6CE8;&#x610F;&#xFF0C;&#x8FD9;&#x4E9B;&#x6761;&#x4EF6;&#x4F1A;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x53D1;&#x751F;&#x53D8;&#x5316;&#xFF0C;&#x4E3A;&#x4E86;&#x5904;&#x7406;&#x65B0;&#x578B;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4E5F;&#x4E3A;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x591A;&#x6837;&#x5316;&#x800C;&#x653E;&#x5BBD;&#x89C4;&#x5219;&#x3002;</p>
<p>&#x200B;&#x5728;&#x6536;&#x5230;&#x4EA4;&#x6613;&#x540E;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x5728;&#x5168;&#x7F51;&#x5E7F;&#x64AD;&#x524D;&#x5BF9;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#xFF0C;&#x5E76;&#x4EE5;&#x63A5;&#x6536;&#x65F6;&#x7684;&#x76F8;&#x5E94;&#x987A;&#x5E8F;&#xFF0C;&#x4E3A;&#x6709;&#x6548;&#x7684;&#x65B0;&#x4EA4;&#x6613;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x9A8C;&#x8BC1;&#x6C60;&#xFF08;&#x8FD8;&#x672A;&#x786E;&#x8BA4;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x6C60;&#x53EF;&#x4EE5;&#x53EB;&#x505A;&#x4EA4;&#x6613;&#x6C60;&#xFF0C;&#x6216;&#x8005;memory pool&#x6216;&#x8005;mempool&#x3002;</p>
<h2 id="104-&#x6316;&#x77FF;&#x8282;&#x70B9;">10.4 &#x6316;&#x77FF;&#x8282;&#x70B9;</h2>
<p>&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x88AB;&#x79F0;&#x4E3A;&#x4E13;&#x4E1A;&#x8282;&#x70B9;&#x201C;&#x77FF;&#x5DE5;&#x201D;&#x3002;&#x7B2C;1&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x4E86;Jing&#xFF0C;&#x5728;&#x4E2D;&#x56FD;&#x4E0A;&#x6D77;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x7A0B;&#x4E13;&#x4E1A;&#x5B66;&#x751F;&#xFF0C;&#x4ED6; &#x5C31;&#x662F;&#x4E00;&#x4F4D;&#x77FF;&#x5DE5;&#x3002;Jing&#x901A;&#x8FC7;&#x77FF;&#x673A;&#x6316;&#x77FF;&#x83B7;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x77FF;&#x673A;&#x662F;&#x4E13;&#x95E8;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x6316;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x786C;&#x4EF6;&#x7CFB;&#x7EDF;&#x3002;Jing&#x7684;&#x8FD9;&#x53F0;&#x4E13;&#x4E1A;&#x6316;&#x77FF;&#x8BBE;&#x5907;&#x8FDE;&#x63A5;&#x7740;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x5B8C;&#x6574;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x7684;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4E0E;Jing&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x4E9B;&#x77FF;&#x5DE5;&#x662F;&#x5728;&#x6CA1;&#x6709;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x7684;&#x6761;&#x4EF6;&#x4E0B;&#x8FDB;&#x884C;&#x6316;&#x77FF;&#xFF0C;&#x6B63;&#x5982;&#x6211;&#x4EEC; &#x5728;&#x201C;&#x77FF;&#x6C60;&#x201D;&#x4E00;&#x8282;&#x4E2D;&#x6240;&#x8FF0;&#x7684;&#x3002;&#x4E0E;&#x5176;&#x4ED6;&#x4EFB;&#x4E00;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x76F8;&#x540C;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E2D;&#x8FDB;&#x884C;&#x63A5;&#x6536;&#x548C;&#x4F20;&#x64AD;&#x672A;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x3002;&#x7136;&#x800C;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x4E5F;&#x80FD;&#x591F;&#x628A;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x6253;&#x5305;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x3002;</p>
<p>&#x200B;&#x540C;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E00;&#x6837;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x65F6;&#x523B;&#x76D1;&#x542C;&#x7740;&#x4F20;&#x64AD;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x65B0;&#x533A;&#x5757;&#x3002;&#x800C;&#x8FD9;&#x4E9B;&#x65B0;&#x52A0;&#x5165;&#x7684;&#x533A;&#x5757;&#x5BF9;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x6709;&#x7740;&#x7279;&#x6B8A;&#x7684;&#x610F; &#x4E49;&#x3002;&#x77FF;&#x5DE5;&#x95F4;&#x7684;&#x7ADE;&#x4E89;&#x4EE5;&#x65B0;&#x533A;&#x5757;&#x7684;&#x4F20;&#x64AD;&#x800C;&#x7ED3;&#x675F;&#xFF0C;&#x5982;&#x540C;&#x5BA3;&#x5E03;&#x8C01;&#x662F;&#x6700;&#x540E;&#x7684;&#x8D62;&#x5BB6;&#x3002;&#x5BF9;&#x4E8E;&#x77FF;&#x5DE5;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x610F;&#x5473;&#x7740;&#x522B;&#x4EBA;&#x5DF2;&#x7ECF;&#x8D62;&#x4E86;&#xFF0C;&#x800C;&#x81EA;&#x5DF1;&#x5219;&#x8F93;&#x4E86;&#x8FD9;&#x573A;&#x7ADE;&#x4E89;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4E00;&#x8F6E;&#x7ADE;&#x4E89;&#x7684;&#x7ED3;&#x675F;&#x4E5F;&#x4EE3;&#x8868;&#x7740;&#x4E0B;&#x4E00;&#x8F6E;&#x7ADE;&#x4E89;&#x7684;&#x5F00;&#x59CB;&#x3002;&#x65B0;&#x533A;&#x5757;&#x5E76;&#x4E0D;&#x4EC5;&#x4EC5;&#x662F;&#x8C61;&#x5F81;&#x7740;&#x7ADE;&#x8D5B;&#x7ED3;&#x675F;&#x7684;&#x65B9;&#x683C;&#x65D7;&#xFF1B;&#x5B83;&#x4E5F;&#x662F;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7ADE;&#x8D5B;&#x7684;&#x53D1;&#x4EE4;&#x67AA;&#x3002;</p>
<h2 id="105-&#x6253;&#x5305;&#x4EA4;&#x6613;&#x81F3;&#x533A;&#x5757;">10.5 &#x6253;&#x5305;&#x4EA4;&#x6613;&#x81F3;&#x533A;&#x5757;</h2>
<p>&#x9A8C;&#x8BC1;&#x4EA4;&#x6613;&#x540E;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x6DFB;&#x52A0;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x3002;&#x5185;&#x5B58;&#x6C60;&#x4E5F;&#x79F0;&#x4F5C;&#x4EA4;&#x6613;&#x6C60;&#xFF0C;&#x7528;&#x6765;&#x6682;&#x5B58;&#x5C1A;&#x672A;&#x88AB;&#x52A0;&#x5165;&#x5230;&#x533A;&#x5757;&#x7684;&#x4EA4; &#x6613;&#x8BB0;&#x5F55;&#x3002;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E00;&#x6837;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x4F1A;&#x6536;&#x96C6;&#x3001;&#x9A8C;&#x8BC1;&#x5E76;&#x4F20;&#x9012;&#x65B0;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x800C;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4E0D;&#x540C;&#x7684;&#x662F;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x4F1A;&#x628A;&#x8FD9;&#x4E9B;&#x4EA4; &#x6613;&#x6574;&#x5408;&#x5230;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#x4E2D;&#x3002;</p>
<p>&#x200B;&#x8BA9;&#x6211;&#x4EEC;&#x7EE7;&#x7EED;&#x8DDF;&#x8FDB;&#xFF0C;&#x770B;&#x4E0B;Alice&#x4ECE;Bob&#x5496;&#x5561;&#x5E97;&#x8D2D;&#x4E70;&#x5496;&#x5561;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#x90A3;&#x4E2A;&#x533A;&#x5757;&#x3002;Alice&#x7684;&#x4EA4;&#x6613;&#x5728;&#x533A;&#x5757; 277,316&#x3002;&#x4E3A;&#x4E86;&#x6F14;&#x793A;&#x672C;&#x7AE0;&#x4E2D;&#x63D0;&#x5230;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x7531;Jing&#x7684;&#x6316;&#x77FF;&#x7CFB;&#x7EDF;&#x6316;&#x51FA;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x7EE7;&#x7EED;&#x8DDF;&#x8FDB;Alice&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x56E0; &#x4E3A;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x5DF2;&#x7ECF;&#x6210;&#x4E3A;&#x4E86;&#x65B0;&#x533A;&#x5757;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;</p>
<p>Jing&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x7EF4;&#x62A4;&#x4E86;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x672C;&#x5730;&#x526F;&#x672C;&#x3002;&#x5F53;Alice&#x4E70;&#x5496;&#x5561; &#x7684;&#x65F6;&#x5019;&#xFF0C;Jing&#x8282;&#x70B9;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5DF2;&#x7ECF;&#x6536;&#x96C6;&#x5230;&#x4E86;&#x533A;&#x5757;277,314&#xFF0C;&#x5E76;&#x7EE7;&#x7EED;&#x76D1;&#x542C;&#x7740;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5728;&#x5C1D;&#x8BD5;&#x6316;&#x6398;&#x65B0;&#x533A;&#x5757;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x4E5F;&#x76D1; &#x542C;&#x7740;&#x7531;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x53D1;&#x73B0;&#x7684;&#x533A;&#x5757;&#x3002;&#x5F53;Jing&#x7684;&#x8282;&#x70B9;&#x5728;&#x6316;&#x77FF;&#x65F6;&#xFF0C;&#x5B83;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6536;&#x5230;&#x4E86;&#x533A;&#x5757;277,315&#x3002;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5230;&#x6765;&#x6807;&#x5FD7;&#x7740;&#x7EC8; &#x7ED3;&#x4E86;&#x4EA7;&#x51FA;&#x533A;&#x5757;277,315&#x7ADE;&#x8D5B;&#xFF0C;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x4EA7;&#x51FA;&#x533A;&#x5757;277,316&#x7ADE;&#x8D5B;&#x7684;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x5728;&#x4E0A;&#x4E00;&#x4E2A;10&#x5206;&#x949F;&#x5185;&#xFF0C;&#x5F53;Jing&#x7684;&#x8282;&#x70B9;&#x6B63;&#x5728;&#x5BFB;&#x627E;&#x533A;&#x5757;277,315&#x7684;&#x89E3;&#x7684;&#x540C;&#x65F6;&#xFF0C;&#x5B83;&#x4E5F;&#x5728;&#x6536;&#x96C6;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x505A;&#x51C6;&#x5907;&#x3002;&#x76EE;&#x524D; &#x5B83;&#x5DF2;&#x7ECF;&#x6536;&#x5230;&#x4E86;&#x51E0;&#x767E;&#x7B14;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x653E;&#x8FDB;&#x4E86;&#x5185;&#x5B58;&#x6C60;&#x3002;&#x76F4;&#x5230;&#x63A5;&#x6536;&#x5E76;&#x9A8C;&#x8BC1;&#x533A;&#x5757;277,315&#x540E;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x4F1A;&#x68C0;&#x67E5;&#x5185;&#x5B58;&#x6C60;&#x4E2D; &#x7684;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x79FB;&#x9664;&#x5DF2;&#x7ECF;&#x5728;&#x533A;&#x5757;277,315&#x4E2D;&#x51FA;&#x73B0;&#x8FC7;&#x7684;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#xFF0C;&#x786E;&#x4FDD;&#x4EFB;&#x4F55;&#x7559;&#x5728;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x672A;&#x786E;&#x8BA4;&#x7684;&#xFF0C;&#x7B49;&#x5F85;&#x88AB;&#x8BB0; &#x5F55;&#x5230;&#x65B0;&#x533A;&#x5757;&#x4E2D;&#x3002;</p>
<p>&#x200B;Jing&#x7684;&#x8282;&#x70B9;&#x7ACB;&#x523B;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x7A7A;&#x533A;&#x5757;&#xFF0C;&#x505A;&#x4E3A;&#x533A;&#x5757;277,316&#x7684;&#x5019;&#x9009;&#x533A;&#x5757;&#x3002;&#x79F0;&#x4F5C;&#x5019;&#x9009;&#x533A;&#x5757;&#x662F;&#x56E0;&#x4E3A;&#x5B83;&#x8FD8;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x4E0D;&#x662F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x53EA;&#x6709;&#x5728;&#x77FF;&#x5DE5;&#x6210;&#x529F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x89E3;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x624D;&#x751F;&#x6548;&#x3002;</p>
<p>&#x200B;&#x73B0;&#x5728;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x4ECE;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x6574;&#x5408;&#x5230;&#x4E86;&#x5168;&#x90E8;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x65B0;&#x7684;&#x5019;&#x9009;&#x533A;&#x5757;&#x5305;&#x542B;&#x6709;418&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x603B;&#x7684;&#x77FF;&#x5DE5;&#x8D39;&#x4E3A;0.09094925&#x4E2A;&#x6BD4;&#x7279; &#x5E01;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x547D;&#x4EE4;&#x884C;&#x6765;&#x67E5;&#x770B;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5982;&#x4F8B;10-3&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x4F8B;10-3 &#x4F7F;&#x7528;&#x547D;&#x4EE4;&#x884C;&#x68C0;&#x7D22;&#x533A;&#x5757;277,316</p>
<pre><code>$ bitcoin-cli get blockhash 277316
0000000000000001b6b9a13b095e96db41c4a928b97ef2d944a9b31b2cc7bdc4

$ bitcoin-cli getblock 0000000000000001b6b9a13b095e96db41c4a928b97ef2d9\44a9b31b2cc7bdc4
</code></pre><pre><code>{
&quot;hash&quot; : &quot;0000000000000001b6b9a13b095e96db41c4a928b97ef2d944a9b31b2cc7bdc4&quot;,


&quot;confirmations&quot; : 35561,


&quot;size&quot; : 218629,


&quot;height&quot; : 277316,


&quot;version&quot; : 2,


&quot;merkleroot&quot; : &quot;c91c008c26e50763e9f548bb8b2fc323735f73577effbc55502c51eb4cc7cf2e&quot;,


&quot;tx&quot; : [


  &quot;d5ada064c6417ca25c4308bd158c34b77e1c0eca2a73cda16c737e7424afba2f&quot;,


  &quot;b268b45c59b39d759614757718b9918caf0ba9d97c56f3b91956ff877c503fbe&quot;,


  ... 417 more transactions ...//&#x8FD9;&#x4E00;&#x884C;&#x663E;&#x793A;&#x4EA4;&#x6613;&#x6570;&#x91CF;


 ],


&quot;time&quot; : 1388185914,


&quot;nonce&quot; : 924591752,


&quot;bits&quot; : &quot;1903a30c&quot;,


&quot;difficulty&quot; : 1180923195.25802612,


&quot;chainwork&quot; : &quot;000000000000000000000000000000000000000000000934695e92aaf53afa1a&quot;,


&quot;previousblockhash&quot; : &quot;0000000000000002a7bbd25a417c0374cc55261021e8a9ca74442b01284f0569&quot;
}
</code></pre><h3 id="1051-&#x521B;&#x5E01;&#x4EA4;&#x6613;">10.5.1 &#x521B;&#x5E01;&#x4EA4;&#x6613;</h3>
<p>&#x533A;&#x5757;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x662F;&#x7B14;&#x7279;&#x6B8A;&#x4EA4;&#x6613;&#xFF0C;&#x79F0;&#x4E3A;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x6216;&#x8005;coinbase&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x662F;&#x7531;Jing&#x7684;&#x8282;&#x70B9;&#x6784;&#x9020;&#x5E76;&#x7528;&#x6765;&#x5956;&#x52B1;&#x77FF;&#x5DE5;&#x4EEC;&#x6240;&#x505A;&#x7684;&#x8D21;&#x732E;&#x7684;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;</strong>:&#x5F53;&#x5757;277,316&#x5F00;&#x91C7;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x5757;&#x7684;&#x5956;&#x52B1;&#x662F;25&#x6BD4;&#x7279;&#x5E01;&#x3002; &#x6B64;&#x540E;&#xFF0C;&#x5DF2;&#x7ECF;&#x8FC7;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x51CF;&#x534A;&#x201D;&#x65F6;&#x671F;&#x3002; 2016&#x5E74;&#x4E03;&#x6708;&#x4EFD;&#x7684;&#x5956;&#x52B1;&#x4E3A;12.5&#x6BD4;&#x7279;&#x5E01;&#xFF0C;2020&#x5E74;&#x8FBE;&#x5230;210000&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x5C06;&#x518D;&#x6B21;&#x51CF;&#x534A;&#x3002;</p>
<p>&#x200B;Jing&#x7684;&#x8282;&#x70B9;&#x4F1A;&#x521B;&#x5EFA;&#x201C;&#x5411;Jing&#x7684;&#x5730;&#x5740;&#x652F;&#x4ED8;25.09094928&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x201D;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x628A;&#x751F;&#x6210;&#x4EA4;&#x6613;&#x7684;&#x5956;&#x52B1;&#x53D1;&#x9001;&#x5230;&#x81EA;&#x5DF1;&#x7684;&#x94B1;&#x5305;&#x3002;Jing&#x6316;&#x51FA;&#x533A;&#x5757;&#x83B7;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x91D1;&#x989D;&#x662F;coinbase&#x5956;&#x52B1;&#xFF08;25&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF09;&#x548C;&#x533A;&#x5757;&#x4E2D;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x77FF;&#x5DE5;&#x8D39;&#x7684;&#x603B;&#x548C;&#x3002;</p>
<p>&#x5982; &#x4F8B;10-4&#x6240;&#x793A;&#xFF1A;coinbase&#x4EA4;&#x6613;</p>
<pre><code>$ bitcoin-cli getrawtransaction d5ada064c6417ca25c4308bd158c34b77e1c0eca2a73cda16c737e7424afba2f 1
</code></pre><pre><code>{

&quot;hex&quot; : &quot;01000000010000000000000000000000000000000000000000000000000000000000000000ffffffff0f03443b0403858402062f503253482fffffffff0110c08d9500000000232102aa970c592640d19de03ff6f329d6fd2eecb023263b9ba5d1b81c29b523da8b21ac00000000&quot;,


&quot;txid&quot; : &quot;d5ada064c6417ca25c4308bd158c34b77e1c0eca2a73cda16c737e7424afba2f&quot;,


&quot;version&quot; : 1,


&quot;locktime&quot; : 0,


&quot;vin&quot; : [


  {


  &quot;coinbase&quot; : &quot;03443b0403858402062f503253482f&quot;,


  &quot;sequence&quot; : 4294967295


  }


],


&quot;vout&quot; : [


  {


  &quot;value&quot; : 25.09094928,


  &quot;n&quot; : 0,


  &quot;scriptPubKey&quot; : {


  &quot;asm&quot; : &quot;02aa970c592640d19de03ff6f329d6fd2eecb023263b9ba5d1b81c29b523da8b21OP_CHECKSIG&quot;,


  &quot;hex&quot; : &quot;2102aa970c592640d19de03ff6f329d6fd2eecb023263b9ba5d1b81c29b523da8b21ac&quot;,


  &quot;reqSigs&quot; : 1,


  &quot;type&quot; : &quot;pubkey&quot;,


  &quot;addresses&quot; : [&quot;1MxTkeEP2PmHSMze5tUZ1hAV3YTKu2Gh1N&quot;

  ]
  }
  }
]
}
</code></pre><p>&#x4E0E;&#x5E38;&#x89C4;&#x4EA4;&#x6613;&#x4E0D;&#x540C;&#xFF0C;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x6CA1;&#x6709;&#x8F93;&#x5165;&#xFF0C;&#x4E0D;&#x6D88;&#x8017;UTXO&#x3002;&#x5B83;&#x53EA;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x88AB;&#x79F0;&#x4F5C;coinbase&#x7684;&#x8F93;&#x5165;&#xFF0C;&#x4EC5;&#x4EC5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x65B0;&#x7684;&#x6BD4;&#x7279; &#x5E01;&#x3002;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x6709;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x652F;&#x4ED8;&#x5230;&#x8FD9;&#x4E2A;&#x77FF;&#x5DE5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x51FA;&#x5C06;&#x8FD9;25.09094928&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x9001;&#x5230;&#x77FF;&#x5DE5;&#x7684;&#x6BD4; &#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x5982;&#x672C;&#x4F8B;&#x6240;&#x793A;&#x7684;1MxTkeEP2PmHSMze5tUZ1hAV3YTKu2Gh1N&#x3002;</p>
<h3 id="1052-coinbase&#x5956;&#x52B1;&#x4E0E;&#x77FF;&#x5DE5;&#x8D39;">10.5.2 Coinbase&#x5956;&#x52B1;&#x4E0E;&#x77FF;&#x5DE5;&#x8D39;</h3>
<p>&#x4E3A;&#x4E86;&#x6784;&#x9020;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x77FF;&#x5DE5;&#x8D39;&#x7684;&#x603B;&#x989D;&#xFF0C;&#x5C06;&#x8FD9;418&#x4E2A;&#x5DF2;&#x6DFB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x5206;&#x522B;&#x8FDB;&#x884C;&#x6C42;&#x548C;&#xFF0C;&#x7136; &#x540E;&#x7528;&#x8F93;&#x5165;&#x603B;&#x989D;&#x51CF;&#x53BB;&#x8F93;&#x51FA;&#x603B;&#x989D;&#x5F97;&#x5230;&#x77FF;&#x5DE5;&#x8D39;&#x603B;&#x989D;&#xFF0C;&#x516C;&#x5F0F;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>Total Fees = Sum(Inputs) - Sum(Outputs)
</code></pre><p>&#x200B;&#x5728;&#x533A;&#x5757;277,316&#x4E2D;&#xFF0C;&#x77FF;&#x5DE5;&#x8D39;&#x7684;&#x603B;&#x989D;&#x662F;0.09094925&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x7D27;&#x63A5;&#x7740;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x8BA1;&#x7B97;&#x51FA;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x6B63;&#x786E;&#x7684;&#x5956;&#x52B1;&#x989D;&#x3002;&#x5956;&#x52B1;&#x989D;&#x7684;&#x8BA1;&#x7B97;&#x662F;&#x57FA;&#x4E8E;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x7684;&#xFF0C;&#x4EE5;&#x6BCF;&#x4E2A;&#x533A;&#x5757;50&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x4E3A;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x4EA7;&#x751F;210,000&#x4E2A;&#x533A;&#x5757;&#x51CF;&#x534A;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x662F;277,316&#xFF0C;&#x6240;&#x4EE5;&#x6B63;&#x786E;&#x7684;&#x5956;&#x52B1;&#x989D;&#x662F;25&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x200B;&#x8BE6;&#x7EC6;&#x7684;&#x8BA1;&#x7B97;&#x8FC7;&#x7A0B;&#x53EF;&#x4EE5;&#x53C2;&#x770B;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x7684;GetBlockValue&#x51FD;&#x6570;&#xFF0C;&#x5982;&#x4F8B;10-5&#x6240;&#x793A;&#xFF1A;</p>
<p>&#x200B;&#x4F8B;10-5 &#x8BA1;&#x7B97;&#x533A;&#x5757;&#x5956;&#x52B1;&#x2014;&#x51FD;&#x6570;GetBlockValue, Bitcoin Core Client, main.cpp</p>
<pre><code>CAmount GetBlockSubsidy(int nHeight, const Consensus::Params
&amp;
 consensusParams){
int halvings = nHeight / consensusParams.nSubsidyHalvingInterval;
// Force block reward to zero when right shift is undefined.
if (halvings 
&gt;
= 64)
    return 0;

CAmount nSubsidy = 50 * COIN;
// Subsidy is cut in half every 210,000 blocks which will occur approximately every 4 years.
nSubsidy 
&gt;
&gt;
 = halvings;
return nSubsidy;
}
</code></pre><p>&#x200B;&#x53D8;&#x91CF;Subsidy&#x8868;&#x793A;&#x521D;&#x59CB;&#x5956;&#x52B1;&#x989D;&#xFF0C;&#x503C;&#x4E3A; COIN &#x5E38;&#x91CF;&#xFF08;100,000,000&#x806A;)&#x4E0E;50&#x7684;&#x4E58;&#x79EF;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x521D;&#x59CB;&#x5956;&#x52B1;&#x989D;&#x4E3A;50&#x4EBF;&#x806A;&#x3002;</p>
<p>&#x7D27;&#x63A5;&#x7740;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x7528;&#x5F53;&#x524D;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x9664;&#x4EE5;&#x51CF;&#x534A;&#x95F4;&#x9694;(SubsidyHalvingInterval &#x51FD;&#x6570;)&#x5F97;&#x5230;&#x51CF;&#x534A;&#x6B21;&#x6570;&#xFF08;&#x53D8;&#x91CF; halvings &#xFF09;&#x3002;&#x6BCF; 210,000&#x4E2A;&#x533A;&#x5757;&#x4E3A;&#x4E00;&#x4E2A;&#x51CF;&#x534A;&#x95F4;&#x9694;&#xFF0C;&#x5BF9;&#x5E94;&#x672C;&#x4F8B;&#x4E2D;&#x7684;&#x533A;&#x5757;277316&#xFF0C;&#x6240;&#x4EE5;&#x51CF;&#x534A;&#x6B21;&#x6570;&#x4E3A;1&#x3002;</p>
<p>&#x53D8;&#x91CF; halvings &#x6700;&#x5927;&#x503C;64&#xFF0C;&#x5982;&#x679C;&#x8D85;&#x51FA;&#x8FD9;&#x4E2A;&#x503C;&#xFF0C;&#x4EE3;&#x7801;&#x7B97;&#x5F97;&#x7684;&#x5956;&#x52B1;&#x989D;&#x4E3A;0&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;&#x8FD9;&#x4E2A;&#x51FD;&#x6570;&#x4F1A;&#x4F7F;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x53F3;&#x79FB;&#x64CD;&#x4F5C;&#x5C06;&#x5956;&#x52B1;&#x989D;(&#x53D8;&#x91CF; nSubsidy)&#x53F3;&#x79FB;&#x4E00;&#x4F4D;&#xFF08;&#x7B49;&#x540C;&#x4E0E;&#x9664;&#x4EE5;2&#xFF09;&#xFF0C;&#x6BCF;&#x4E00;&#x8F6E;&#x51CF;&#x534A;&#x53F3;&#x79FB;&#x4E00;&#x6B21;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x5BF9;&#x4E8E;&#x533A;&#x5757;277,316&#x53EA;&#x9700;&#x8981;&#x5C06;&#x503C;&#x4E3A;50&#x4EBF;&#x806A;&#x7684;&#x5956;&#x52B1;&#x989D;&#x53F3;&#x79FB;&#x4E00;&#x6B21;&#xFF0C;&#x5F97;&#x5230;25&#x4EBF;&#x806A;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;25&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5956;&#x52B1;&#x989D;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x91C7;&#x7528;&#x4E8C;&#x8FDB;&#x5236;&#x53F3;&#x79FB;&#x64CD;&#x4F5C;&#xFF0C;&#x662F;&#x56E0;&#x4E3A;&#x76F8;&#x6BD4;&#x4E8E;&#x6574;&#x6570;&#x6216;&#x6D6E;&#x70B9;&#x6570;&#x9664;&#x6CD5;&#xFF0C;&#x53F3;&#x79FB;&#x64CD;&#x4F5C;&#x7684;&#x6548;&#x7387;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x200B;&#x6700;&#x540E;&#xFF0C;&#x5C06;coinbase&#x5956;&#x52B1;&#x989D;&#xFF08;&#x53D8;&#x91CF; nSubsidy &#xFF09;&#x4E0E;&#x77FF;&#x5DE5;&#x8D39;(nFee)&#x603B;&#x989D;&#x6C42;&#x548C;&#xFF0C;&#x5E76;&#x8FD4;&#x56DE;&#x8FD9;&#x4E2A;&#x503C;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;</strong>: &#x5982;&#x679C;Jing&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x628A;coinbase&#x4EA4;&#x6613;&#x5199;&#x5165;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5982;&#x4F55;&#x9632;&#x6B62;Jing&#x5956;&#x52B1;&#x81EA;&#x5DF1;100&#x751A;&#x81F3;1000&#x6BD4;&#x7279;&#x5E01;&#xFF1F; &#x7B54;&#x6848;&#x662F;&#xFF0C;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x5956;&#x52B1;&#x5C06;&#x88AB;&#x5176;&#x4ED6;&#x4EBA;&#x89C6;&#x4E3A;&#x65E0;&#x6548;&#xFF0C;&#x6D6A;&#x8D39;&#x4E86;Jing&#x7528;&#x4E8E;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x7684;&#x6295;&#x5165;&#x3002; &#x53EA;&#x6709;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x5927;&#x5BB6;&#x8BA4;&#x53EF;&#xFF0C;Jing&#x624D;&#x80FD;&#x5F97;&#x5230;&#x62A5;&#x916C;&#x3002;</p>
<h3 id="1053&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x7ED3;&#x6784;">10.5.3&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x7ED3;&#x6784;</h3>
<p>&#x7ECF;&#x8FC7;&#x8BA1;&#x7B97;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x6784;&#x9020;&#x4E86;&#x4E00;&#x4E2A;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#xFF0C;&#x652F;&#x4ED8;&#x7ED9;&#x81EA;&#x5DF1;25.09094928&#x679A;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x4F8B;10-4&#x6240;&#x793A;&#xFF0C;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x7ED3;&#x6784;&#x6BD4;&#x8F83;&#x7279;&#x6B8A;&#xFF0C;&#x4E0E;&#x4E00;&#x822C;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x9700;&#x8981;&#x6307;&#x5B9A;&#x4E00;&#x4E2A;&#x5148;&#x524D;&#x7684;UTXO&#x4E0D;&#x540C;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x201C;coinbase&#x201C;&#x8F93; &#x5165;&#x3002;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x7ED9;&#x51FA;&#x4E86;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7684;&#x7ED3;&#x6784;&#x3002;&#x73B0;&#x5728;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x6BD4;&#x8F83;&#x4E00;&#x4E0B;&#x5E38;&#x89C4;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x4E0E;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x3002;&#x8868;10-1&#x7ED9;&#x51FA;&#x4E86;&#x5E38;&#x89C4;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7684;&#x7ED3;&#x6784;&#xFF0C;&#x8868;10-2&#x7ED9;&#x51FA;&#x7684;&#x662F;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7684;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x200B;&#x8868;10-1 &#x5E38;&#x89C4;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7ED3;&#x6784;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4b0689f622fae44f.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x8868;10-2&#xFF0C;coinbase&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7ED3;&#x6784;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-dfe0a126593d1973.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x5728;Coinbase&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x201C;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x201D;&#x5B57;&#x6BB5;32&#x4E2A;&#x5B57;&#x8282;&#x5168;&#x90E8;&#x586B;&#x5145;0&#xFF0C;&#x201C;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x7D22;&#x5F15;&#x201D;&#x5B57;&#x6BB5;&#x5168;&#x90E8;&#x586B;&#x5145;0xFF(&#x5341;&#x8FDB;&#x5236;&#x7684;255)&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x503C;&#x8868;&#x793A;&#x4E0D;&#x5F15;&#x7528;UTXO&#x3002;&#x201C;&#x89E3;&#x9501;&#x811A;&#x672C;&#x201D;&#x7531;coinbase&#x6570;&#x636E;&#x4EE3;&#x66FF;&#xFF0C;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x7531;&#x77FF;&#x5DE5;&#x81EA;&#x5B9A;&#x4E49;&#x3002;</p>
<h3 id="1054-coinbase&#x6570;&#x636E;">10.5.4 Coinbase&#x6570;&#x636E;</h3>
<p>&#x200B;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x4E0D;&#x5305;&#x542B;&#x201C;&#x89E3;&#x9501;&#x811A;&#x672C;&#x201C;(&#x53C8;&#x79F0;&#x4F5C; scriptSig)&#x5B57;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x88AB;coinbase&#x6570;&#x636E;&#x66FF;&#x4EE3;&#xFF0C;&#x957F;&#x5EA6;&#x6700;&#x5C0F;2&#x5B57;&#x8282;&#xFF0C;&#x6700;&#x5927;100&#x5B57;&#x8282;&#x3002;&#x9664; &#x4E86;&#x5F00;&#x59CB;&#x7684;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x5916;&#xFF0C;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x4F7F;&#x7528;coinbase&#x7684;&#x5176;&#x4ED6;&#x90E8;&#x5206;&#xFF0C;&#x968F;&#x610F;&#x586B;&#x5145;&#x4EFB;&#x4F55;&#x6570;&#x636E;&#x3002;</p>
<p>&#x4EE5;&#x521B;&#x4E16;&#x5757;&#x4E3A;&#x4F8B;&#xFF0C;&#x4E2D;&#x672C;&#x806A;&#x5728;coinbase&#x4E2D;&#x586B;&#x5165;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x6570;&#x636E;&#x201C;The Times 03/Jan/ 2009 Chancellor on brink of second bailout for banks&#x201C;(&#x6CF0;&#x6664;&#x58EB;&#x62A5; 2009&#x5E74;1&#x6708;3&#x65E5; &#x8D22;&#x653F;&#x5927;&#x81E3;&#x5C06;&#x518D;&#x6B21;&#x5BF9;&#x94F6;&#x884C;&#x65BD;&#x4EE5;&#x63F4;&#x624B;)&#xFF0C;&#x8868;&#x793A;&#x5BF9;&#x65E5;&#x671F;&#x7684;&#x8BC1;&#x660E;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x8868;&#x8FBE;&#x4E86;&#x5BF9;&#x94F6;&#x884C;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x4FE1;&#x4EFB;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x77FF;&#x5DE5;&#x4F7F;&#x7528;coinbase&#x6570;&#x636E;&#x5B9E;&#x73B0;extra nonce&#x529F;&#x80FD;&#xFF0C;&#x5E76;&#x5D4C;&#x5165;&#x5B57;&#x7B26;&#x4E32;&#x6765;&#x6807;&#x8BC6;&#x6316;&#x51FA;&#x5B83;&#x7684;&#x77FF;&#x6C60;&#xFF0C;&#x8FD9;&#x90E8;&#x5206;&#x5185;&#x5BB9;&#x4F1A;&#x5728;&#x540E;&#x9762;&#x7684;&#x5C0F;&#x8282;&#x63CF;&#x8FF0;&#x3002;</p>
<p>coinbase&#x524D;&#x51E0;&#x4E2A;&#x5B57;&#x8282;&#x4E5F;&#x66FE;&#x662F;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x586B;&#x5199;&#x7684;&#xFF0C;&#x4E0D;&#x8FC7;&#x5728;&#x540E;&#x6765;&#x7684;&#x7B2C;34&#x53F7;&#x6BD4;&#x7279;&#x5E01;&#x6539;&#x8FDB;&#x63D0;&#x8BAE;(BIP34)&#x4E2D; &#x89C4;&#x5B9A;&#x4E86;&#x7248;&#x672C;2&#x7684;&#x533A;&#x5757;&#xFF08;&#x7248;&#x672C;&#x5B57;&#x6BB5;&#x4E3A;2&#x7684;&#x533A;&#x5757;&#xFF09;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x9AD8;&#x5EA6;&#x5FC5;&#x987B;&#x8DDF;&#x5728;&#x811A;&#x672C;&#x64CD;&#x4F5C;&#x201C;push&#x201C;&#x4E4B;&#x540E;&#xFF0C;&#x586B;&#x5145;&#x5728;coinbase&#x5B57;&#x6BB5;&#x7684;&#x8D77;&#x59CB;&#x5904;&#x3002;</p>
<p>&#x200B;&#x6211;&#x4EEC;&#x4EE5;&#x4F8B;10-4&#x4E2D;&#x7684;&#x533A;&#x5757;277,316&#x4E3A;&#x4F8B;&#xFF0C;coinbase&#x5C31;&#x662F;&#x4EA4;&#x6613;&#x8F93;&#x5165;&#x7684;&#x201C;&#x89E3;&#x9501;&#x811A;&#x672C;&#x201C;&#xFF08;&#x6216;scriptSig&#xFF09;&#x5B57;&#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x503C; &#x4E3A;03443b0403858402062f503253482f&#x3002;&#x4E0B;&#x9762;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x89E3;&#x7801;&#x8FD9;&#x6BB5;&#x6570;&#x636E;&#x3002;</p>
<p>&#x200B;&#x7B2C;&#x4E00;&#x4E2A;&#x5B57;&#x8282;&#x662F;03&#xFF0C;&#x811A;&#x672C;&#x6267;&#x884C;&#x5F15;&#x64CE;&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x6307;&#x4EE4;&#x5C06;&#x540E;&#x9762;3&#x4E2A;&#x5B57;&#x8282;&#x538B;&#x5165;&#x811A;&#x672C;&#x6808;,&#x7D27;&#x63A5;&#x7740;&#x7684;3&#x4E2A;&#x5B57;&#x8282;&#x2014;&#x2014;0x443b04&#xFF0C; &#x662F;&#x4EE5;&#x5C0F;&#x7AEF;&#x683C;&#x5F0F;(&#x6700;&#x4F4E;&#x6709;&#x6548;&#x5B57;&#x8282;&#x5728;&#x5148;)&#x7F16;&#x7801;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x3002;&#x7FFB;&#x8F6C;&#x5B57;&#x8282;&#x5E8F;&#x5F97;&#x5230;0x043b44&#xFF0C;&#x8868;&#x793A;&#x4E3A;&#x5341;&#x8FDB;&#x5236;&#x662F;277,316&#x3002;</p>
<p>&#x200B;&#x7D27;&#x63A5;&#x7740;&#x7684;&#x51E0;&#x4E2A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#xFF08;03858402062&#xFF09;&#x7528;&#x4E8E;&#x7F16;&#x7801;extra nonce(&#x53C2;&#x89C1;&quot;10.11.1 &#x968F;&#x673A;&#x503C;&#x5347;&#x4F4D;&#x65B9;&#x6848;&quot;)&#xFF0C;&#x6216;&#x8005;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x503C;&#xFF0C;&#x4ECE;&#x800C;&#x6C42;&#x89E3;&#x4E00;&#x4E2A;&#x9002;&#x5F53;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;</p>
<p>&#x200B;coinbase&#x6570;&#x636E;&#x7ED3;&#x5C3E;&#x90E8;&#x5206;(2f503253482f)&#x662F;ASCII&#x7F16;&#x7801;&#x5B57;&#x7B26; /P2SH/&#xFF0C;&#x8868;&#x793A;&#x6316;&#x51FA;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x652F;&#x6301;BIP0016&#x6240;&#x5B9A;&#x4E49;&#x7684; pay-to-script-hash(P2SH)&#x6539;&#x8FDB;&#x65B9;&#x6848;&#x3002;&#x5728;P2SH&#x529F;&#x80FD;&#x5F15;&#x5165;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x66FE;&#x7ECF;&#x6709;&#x8FC7;&#x4E00;&#x573A;&#x5BF9;P2SH&#x4E0D;&#x540C;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x7684;&#x6295;&#x7968;&#xFF0C; &#x5019;&#x9009;&#x8005;&#x662F;BIP0016&#x548C;BIP0017&#x3002;&#x652F;&#x6301;BIP0016&#x7684;&#x77FF;&#x5DE5;&#x5C06;/P2SH/&#x653E;&#x5165;coinbase&#x6570;&#x636E;&#x4E2D;&#xFF0C;&#x652F;&#x6301;BIP0017&#x7684;&#x77FF;&#x5DE5;&#x5C06; p2sh/CHV &#x653E;&#x5165;&#x4ED6;&#x4EEC;&#x7684;coinbase&#x6570;&#x636E;&#x4E2D;&#x3002;&#x6700;&#x540E;&#xFF0C;BIP0016&#x5728;&#x9009;&#x4E3E;&#x4E2D;&#x80DC;&#x51FA;&#xFF0C;&#x76F4;&#x5230;&#x73B0;&#x5728;&#x4F9D;&#x7136;&#x6709;&#x5F88;&#x591A;&#x77FF;&#x5DE5;&#x5728;&#x4ED6;&#x4EEC;&#x7684;coinbase&#x4E2D;&#x586B; &#x5165;/P2SH/&#x4EE5;&#x8868;&#x793A;&#x652F;&#x6301;&#x8FD9;&#x4E2A;&#x529F;&#x80FD;&#x3002;</p>
<p>10-6&#x4F7F;&#x7528;&#x4E86;libbitcoin&#x5E93;&#xFF08;&#x5728;&#x4E4B;&#x524D;&#x201C;&#x5176;&#x4ED6;&#x66FF;&#x4EE3;&#x5BA2;&#x6237;&#x7AEF;&#x3001;&#x8D44;&#x6599;&#x5E93;&#x3001;&#x5DE5;&#x5177;&#x5305;&#x201D;&#x4E2D;&#x63D0;&#x5230;&#xFF09;&#x4ECE;&#x521B;&#x4E16;&#x5757;&#x4E2D;&#x63D0;&#x53D6;coinbase&#x6570;&#x636E;&#xFF0C;&#x5E76;&#x663E;&#x793A; &#x51FA;&#x4E2D;&#x672C;&#x806A;&#x7559;&#x4E0B;&#x7684;&#x4FE1;&#x606F;&#x3002;libbitcoin&#x5E93;&#x4E2D;&#x81EA;&#x5E26;&#x4E86;&#x4E00;&#x4EFD;&#x521B;&#x4E16;&#x5757;&#x7684;&#x9759;&#x6001;&#x62F7;&#x8D1D;&#xFF0C;&#x6240;&#x4EE5;&#x8FD9;&#x6BB5;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x53D6;&#x81EA;&#x5E93;&#x4E2D;&#x7684;&#x521B;&#x4E16;&#x5757;&#x6570; &#x636E;&#x3002;</p>
<p>&#x200B;&#x4F8B;10-6 &#x4ECE;&#x521B;&#x4E16;&#x533A;&#x5757;&#x4E2D;&#x63D0;&#x53D6;coinbase&#x6570;&#x636E;&#x200B;</p>
<pre><code>code/satoshi-words.cpp\[\]
</code></pre><p>&#x200B;&#x4F8B;8-7&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x4F7F;&#x7528;GNU C++&#x7F16;&#x8BD1;&#x5668;&#x7F16;&#x8BD1;&#x6E90;&#x4EE3;&#x7801;&#x5E76;&#x8FD0;&#x884C;&#x5F97;&#x5230;&#x7684;&#x53EF;&#x6267;&#x884C;&#x6587;&#x4EF6;,</p>
<p>&#x200B;&#x4F8B;8-7 &#x7F16;&#x8BD1;&#x5E76;&#x8FD0;&#x884C;satoshi-words&#x793A;&#x4F8B;&#x4EE3;&#x7801;</p>
<pre><code>$ # Compile the code
$  g++ -o satoshi-words satoshi-words.cpp $(pkg-config --cflags --libs libbitcoin)
$ # Run the executable
$ ./satoshi-words
^D&#xFFFD;&#xFFFD;
&lt;
GS
&gt;
^A^DEThe Times 03/Jan/2009 Chancellor on brink of second bailout for banks
</code></pre><h2 id="106-&#x6784;&#x9020;&#x533A;&#x5757;&#x5934;">10.6 &#x6784;&#x9020;&#x533A;&#x5757;&#x5934;</h2>
<p>&#x4E3A;&#x4E86;&#x6784;&#x9020;&#x533A;&#x5757;&#x5934;&#xFF0C;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x9700;&#x8981;&#x586B;&#x5145;&#x516D;&#x4E2A;&#x5B57;&#x6BB5;&#xFF0C;&#x5982;&#x8868;10-3&#x4E2D;&#x6240;&#x793A;&#x3002;</p>
<p>&#x8868;10-3 &#x533A;&#x5757;&#x5934;&#x7ED3;&#x6784;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-1815d9f1d57ee8f6.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B;&#x5728;&#x533A;&#x5757;277,316&#x88AB;&#x6316;&#x51FA;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x533A;&#x5757;&#x7ED3;&#x6784;&#x4E2D;&#x7528;&#x6765;&#x8868;&#x793A;&#x7248;&#x672C;&#x53F7;&#x7684;&#x5B57;&#x6BB5;&#x503C;&#x4E3A;2&#xFF0C;&#x957F;&#x5EA6;&#x4E3A;4&#x5B57;&#x8282;&#xFF0C;&#x4EE5;&#x5C0F;&#x7AEF;&#x683C;&#x5F0F;&#x7F16;&#x7801;&#x503C;&#x4E3A; 0x20000000&#x3002;</p>
<p>&#x200B;&#x63A5;&#x7740;&#xFF0C;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x9700;&#x8981;&#x586B;&#x5145;&#x201C;&#x524D;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x201D;&#xFF0C;&#x5728;&#x672C;&#x4F8B;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x503C;&#x4E3A;Jing&#x7684;&#x8282;&#x70B9;&#x4ECE;&#x7F51;&#x7EDC;&#x4E0A;&#x63A5;&#x6536;&#x5230;&#x7684;&#x533A;&#x5757;277,315 &#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5B83;&#x662F;&#x533A;&#x5757;277316&#x5019;&#x9009;&#x533A;&#x5757;&#x7684;&#x7236;&#x533A;&#x5757;&#x3002;&#x533A;&#x5757;277,315&#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x4E3A;&#xFF1A;</p>
<pre><code>0000000000000002a7bbd25a417c0374cc55261021e8a9ca74442b01284f0569
</code></pre><p><strong>&#x63D0;&#x793A;</strong>&#xFF1A;&#x901A;&#x8FC7;&#x9009;&#x62E9;&#x5019;&#x9009;&#x5757;&#x5934;&#x4E2D;&#x7684;&#x5148;&#x524D;&#x5757;&#x54C8;&#x5E0C;&#x5B57;&#x6BB5;&#x6307;&#x5B9A;&#x7684;&#x7279;&#x5B9A;&#x7236;&#x533A;&#x5757;&#xFF0C;Jing&#x6B63;&#x5728;&#x901A;&#x8FC7;&#x786E;&#x8BA4;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x6765;&#x6269;&#x5C55;&#x533A;&#x5757;&#x94FE;&#x3002; &#x4ECE;&#x672C;&#x8D28;&#x4E0A;&#x8BB2;&#xFF0C;&#x8FD9;&#x662F;&#x7528;&#x4ED6;&#x7684;&#x91C7;&#x77FF;&#x6743;&#x4E3A;&#x6700;&#x957F;&#x96BE;&#x5EA6;&#x7684;&#x6709;&#x6548;&#x94FE;&#x8FDB;&#x884C;&#x7684;&#x201C;&#x6295;&#x7968;&#x201D;&#x3002;</p>
<p>&#x200B;&#x4E3A;&#x4E86;&#x5411;&#x533A;&#x5757;&#x5934;&#x586B;&#x5145;merkle&#x6839;&#x5B57;&#x6BB5;&#xFF0C;&#x8981;&#x5C06;&#x5168;&#x90E8;&#x7684;&#x4EA4;&#x6613;&#x7EC4;&#x6210;&#x4E00;&#x4E2A;merkle&#x6811;&#x3002;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x9996;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x540E;&#x5C06;&#x4F59;&#x4E0B;&#x7684; 418&#x7B14;&#x4EA4;&#x6613;&#x6DFB;&#x81F3;&#x5176;&#x540E;&#xFF0C;&#x8FD9;&#x6837;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x4E00;&#x5171;&#x6709;419&#x7B14;&#x3002;&#x5728;&#x4E4B;&#x524D;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x89C1;&#x5230;&#x8FC7;&#x201C;Merkle&#x6811;&#x201D;&#xFF0C;&#x6811;&#x4E2D;&#x5FC5;&#x987B;&#x6709;&#x5076;&#x6570;&#x4E2A;&#x53F6;&#x5B50; &#x8282;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x9700;&#x8981;&#x590D;&#x5236;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x7B2C;420&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#xFF0C;&#x6BCF;&#x4E2A;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x662F;&#x5BF9;&#x5E94;&#x4EA4;&#x6613;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x9010;&#x5C42;&#x5730;&#x3001;&#x6210;&#x5BF9;&#x5730;&#x7EC4;&#x5408;&#xFF0C;&#x76F4;&#x5230;&#x6700;&#x7EC8;&#x7EC4;&#x5408;&#x5E76;&#x6210;&#x4E00;&#x4E2A;&#x6839;&#x8282;&#x70B9;&#x3002;merkle&#x6570;&#x7684;&#x6839;&#x8282;&#x70B9;&#x5C06;&#x5168;&#x90E8;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x6458;&#x8981;&#x4E3A;&#x4E00;&#x4E2A;32&#x5B57;&#x8282;&#x957F;&#x5EA6;&#x7684;&#x503C;&#xFF0C;&#x4F8B;10-3&#x4E2D; merkel&#x6839;&#x7684;&#x503C;&#x5982;&#x4E0B;&#xFF1A;</p>
<pre><code>c91c008c26e50763e9f548bb8b2fc323735f73577effbc55502c51eb4cc7cf2e
</code></pre><p>&#x200B;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x4F1A;&#x7EE7;&#x7EED;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;4&#x5B57;&#x8282;&#x7684;&#x65F6;&#x95F4;&#x6233;&#xFF0C;&#x4EE5;Unix&#x7EAA;&#x5143;&#x65F6;&#x95F4;&#x7F16;&#x7801;&#xFF0C;&#x5373;&#x81EA;1970&#x5E74;1&#x6708;1&#x65E5;0&#x70B9;&#x5230;&#x5F53;&#x4E0B;&#x603B;&#x5171;&#x6D41;&#x901D;&#x7684;&#x79D2;&#x6570;&#x3002;&#x672C;&#x4F8B; &#x4E2D;&#x7684;1388185914&#x5BF9;&#x5E94;&#x7684;&#x65F6;&#x95F4;&#x662F;2013&#x5E74;12&#x6708;27&#x65E5;&#xFF0C;&#x661F;&#x671F;&#x4E94;&#xFF0C;UTC/GMT&#x3002;</p>
<p>&#x63A5;&#x4E0B;&#x6765;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x9700;&#x8981;&#x586B;&#x5145;Target&#x5B57;&#x6BB5;&#xFF08;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x503C;&#xFF09;&#xFF0C;&#x4E3A;&#x4E86;&#x4F7F;&#x5F97;&#x8BE5;&#x533A;&#x5757;&#x6709;&#x6548;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x5B9A;&#x4E49;&#x4E86;&#x6240;&#x9700;&#x6EE1;&#x8DB3;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x96BE;&#x5EA6;&#x3002;&#x96BE;&#x5EA6;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x4EE5;&#x201C;&#x5C3E;&#x6570;-&#x6307;&#x6570;&#x201D;&#x7684;&#x683C;&#x5F0F;&#xFF0C;&#x7F16;&#x7801;&#x5E76;&#x5B58;&#x50A8;&#xFF0C;&#x8FD9;&#x79CD;&#x683C;&#x5F0F;&#x79F0;&#x4F5C;target bits&#xFF08;&#x96BE;&#x5EA6;&#x4F4D;&#xFF09;&#x3002;&#x8FD9;&#x79CD;&#x7F16;&#x7801;&#x7684;&#x9996;&#x5B57;&#x8282;&#x8868;&#x793A;&#x6307;&#x6570;&#xFF0C;&#x540E;&#x9762;&#x7684;3&#x5B57;&#x8282;&#x8868;&#x793A;&#x5C3E;&#x6570;(&#x7CFB; &#x6570;)&#x3002;&#x4EE5;&#x533A;&#x5757;277316&#x4E3A;&#x4F8B;&#xFF0C;&#x96BE;&#x5EA6;&#x4F4D;&#x7684;&#x503C;&#x4E3A;0x1903a30c&#xFF0C;0x19&#x662F;&#x6307;&#x6570;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x683C;&#x5F0F;&#xFF0C;&#x540E;&#x534A;&#x90E8;0x03a30c&#x662F;&#x7CFB;&#x6570;&#x3002;&#x8FD9;&#x90E8;&#x5206;&#x7684;&#x6982;&#x5FF5;&#x5728;&#x540E;&#x9762;&#x7684;&#x201C;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x4E0E;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x201D;&#x548C;&#x201C;&#x96BE;&#x5EA6;&#x8868;&#x793A;&#x201D;&#x6709;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#x3002;</p>
<p>&#x200B;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5B57;&#x6BB5;&#x662F;nonce&#xFF0C;&#x521D;&#x59CB;&#x503C;&#x4E3A;0&#x3002;</p>
<p>&#x200B;&#x533A;&#x5757;&#x5934;&#x5B8C;&#x6210;&#x5168;&#x90E8;&#x7684;&#x5B57;&#x6BB5;&#x586B;&#x5145;&#x540E;&#xFF0C;&#x6316;&#x77FF;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x8FDB;&#x884C;&#x4E86;&#x3002;&#x6316;&#x77FF;&#x7684;&#x76EE;&#x6807;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x4F7F;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x5C0F;&#x4E8E;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x7684; nonce&#x3002;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x901A;&#x5E38;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x6570;&#x5341;&#x4EBF;&#x751A;&#x81F3;&#x6570;&#x4E07;&#x4EBF;&#x4E2A;&#x4E0D;&#x540C;&#x7684;nonce&#x53D6;&#x503C;&#xFF0C;&#x76F4;&#x5230;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;nonce&#x503C;&#x3002;</p>
<h2 id="107-&#x6784;&#x5EFA;&#x533A;&#x5757;">10.7 &#x6784;&#x5EFA;&#x533A;&#x5757;</h2>
<p>&#x65E2;&#x7136;Jing&#x7684;&#x8282;&#x70B9;&#x5DF2;&#x7ECF;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x8F6E;&#x5230;Jing&#x7684;&#x77FF;&#x673A;&#x5BF9;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x201C;&#x6316;&#x6398;&#x201D;&#xFF0C;&#x6C42;&#x89E3;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x4EE5;&#x4F7F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x6709;&#x6548;&#x3002;&#x4ECE;&#x672C;&#x4E66;&#x4E2D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B66;&#x4E60;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x4E0D;&#x540C;&#x5730;&#x65B9;&#x7528;&#x5230;&#x7684;&#x54C8;&#x5E0C;&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x8FC7;&#x7A0B;&#x4F7F;&#x7528;&#x7684;&#x662F; SHA256&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x3002;</p>
<p>&#x200B;&#x7528;&#x6700;&#x7B80;&#x5355;&#x7684;&#x672F;&#x8BED;&#x6765;&#x8BF4;&#xFF0C;&#x6316;&#x77FF;&#x5C31;&#x662F;&#x91CD;&#x590D;&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x5934;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x4E0D;&#x65AD;&#x4FEE;&#x6539;&#x8BE5;&#x53C2;&#x6570;&#xFF0C;&#x76F4;&#x5230;&#x4E0E;&#x54C8;&#x5E0C;&#x503C;&#x5339;&#x914D;&#x7684;&#x4E00;&#x4E2A;&#x8FC7;&#x7A0B;&#x3002;&#x54C8;&#x5E0C;&#x51FD;&#x6570; &#x7684;&#x7ED3;&#x679C;&#x65E0;&#x6CD5;&#x63D0;&#x524D;&#x5F97;&#x77E5;&#xFF0C;&#x4E5F;&#x6CA1;&#x6709;&#x80FD;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x6A21;&#x5F0F;&#x3002;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x8FD9;&#x4E2A;&#x7279;&#x6027;&#x610F;&#x5473;&#x7740;&#xFF1A;&#x5F97;&#x5230;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x4E0D;&#x65AD;&#x7684;&#x5C1D;&#x8BD5;&#xFF0C;&#x6BCF;&#x6B21;&#x968F;&#x673A;&#x4FEE;&#x6539;&#x8F93;&#x5165;&#xFF0C;&#x76F4;&#x5230;&#x51FA;&#x73B0;&#x9002;&#x5F53;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<h3 id="1071-&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;">10.7.1 &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;</h3>
<p>&#x200B;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x8F93;&#x5165;&#x4E00;&#x4E2A;&#x4EFB;&#x610F;&#x957F;&#x5EA6;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8F93;&#x51FA;&#x4E00;&#x4E2A;&#x957F;&#x5EA6;&#x56FA;&#x5B9A;&#x4E14;&#x7EDD;&#x4E0D;&#x96F7;&#x540C;&#x7684;&#x503C;&#xFF0C;&#x53EF;&#x5C06;&#x5176;&#x89C6;&#x4E3A;&#x8F93;&#x5165;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x3002;&#x5BF9;&#x4E8E;&#x7279;&#x5B9A;&#x8F93;&#x5165;&#xFF0C;&#x54C8;&#x5E0C;&#x7684;&#x7ED3;&#x679C;&#x6BCF;&#x6B21;&#x90FD;&#x4E00;&#x6837;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#xFF0C;&#x8BA1;&#x7B97;&#x548C;&#x9A8C;&#x8BC1;&#x54C8;&#x5E0C;&#x7ED3;&#x679C;&#x3002;&#x4E00;&#x4E2A;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x4E3B;&#x8981;&#x7279;&#x5F81;&#x5C31;&#x662F;&#x4E0D;&#x540C;&#x7684; &#x8F93;&#x5165;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6709;&#x610F;&#x7684;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x53BB;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x60F3;&#x8981;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x503C;&#x662F;&#x51E0;&#x4E4E;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x66F4;&#x522B;&#x63D0;&#x7528;&#x968F;&#x673A;&#x7684;&#x65B9;&#x5F0F;&#x751F;&#x6210;&#x60F3;&#x8981;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4E86;&#x3002;</p>
<p>&#x200B;&#x65E0;&#x8BBA;&#x8F93;&#x5165;&#x7684;&#x5927;&#x5C0F;&#x662F;&#x591A;&#x5C11;&#xFF0C;SHA256&#x51FD;&#x6570;&#x7684;&#x8F93;&#x51FA;&#x7684;&#x957F;&#x5EA6;&#x603B;&#x662F;256bit&#x3002;&#x5728;&#x4F8B;10-8&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;Python&#x89E3;&#x91CA;&#x5668;&#x6765;&#x8BA1;&#x7B97;&#x8BED;&#x53E5; &quot;I am Satoshi Nakamoto&quot; &#x7684;SHA256&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x200B;&#x4F8B;10-8 SHA256&#x793A;&#x4F8B;</p>
<pre><code>$ python
Python 2.7.1

&gt;
&gt;
&gt;
 import hashlib

&gt;
&gt;
&gt;
 print hashlib.sha256(&quot;I am Satoshi Nakamoto&quot;).hexdigest()
5d7c7ba21cbbcd75d14800b100252d5b428e5b1213d27c385bc141ca6b47989e
</code></pre><p>&#x5728;&#x4F8B;10-8&#x4E2D;&#xFF0C; 5d7c7ba21cbbcd75d14800b100252d5b428e5b1213d27c385bc141ca6b47989e &#x662F;&quot;I am Satoshi Nakamoto&quot;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x6539;&#x53D8;&#x539F;&#x53E5;&#x4E2D;&#x7684;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x5B57;&#x6BCD;&#x3001;&#x6807;&#x70B9;&#x3001;&#x6216;&#x589E;&#x52A0;&#x5B57;&#x6BCD;&#x90FD;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x6539;&#x53D8;&#x539F;&#x53E5;&#xFF0C;&#x5F97;&#x5230;&#x7684;&#x5E94;&#x8BE5;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x53E5;&#x5B50;&#x672B;&#x5C3E;&#x52A0;&#x4E0A;&#x4E00;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x8FD0;&#x884C;&#x4F8B;10-9&#x4E2D;&#x7684;Python&#x811A;&#x672C;&#x3002;&#x4F8B;10-9 &#x901A;&#x8FC7;&#x53CD;&#x590D;&#x4FEE;&#x6539; nonce &#x6765;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x811A;&#x672C;&#xFF08;SHA256&#xFF09;</p>
<pre><code>code/hash\_example.py\[\]
</code></pre><p>&#x6267;&#x884C;&#x8FD9;&#x4E2A;&#x811A;&#x672C;&#x5C31;&#x80FD;&#x751F;&#x6210;&#x8FD9;&#x4E9B;&#x53EA;&#x662F;&#x672B;&#x5C3E;&#x6570;&#x5B57;&#x4E0D;&#x540C;&#x7684;&#x8BED;&#x53E5;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x4F8B;10-10 &#x4E2D;&#x663E;&#x793A;&#x4E86;&#x6211;&#x4EEC;&#x53EA;&#x662F;&#x589E;&#x52A0;&#x4E86;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#xFF0C;&#x5374;&#x5F97;&#x5230;&#x4E86;&#x975E; &#x5E38;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x4F8B;10-10 &#x901A;&#x8FC7;&#x53CD;&#x590D;&#x4FEE;&#x6539;nonce &#x6765;&#x751F;&#x6210;&#x4E0D;&#x540C;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x811A;&#x672C;&#x7684;&#x8F93;&#x51FA;</p>
<pre><code>$ python hash_example.py
I am Satoshi Nakamoto0 =
&gt;
 a80a81401765c8eddee25df36728d732...
I am Satoshi Nakamoto1 =
&gt;
 f7bc9a6304a4647bb41241a677b5345f...
I am Satoshi Nakamoto2 =
&gt;
 ea758a8134b115298a1583ffb80ae629...
I am Satoshi Nakamoto3 =
&gt;
 bfa9779618ff072c903d773de30c99bd...
I am Satoshi Nakamoto4 =
&gt;
 bce8564de9a83c18c31944a66bde992f...
I am Satoshi Nakamoto5 =
&gt;
 eb362c3cf3479be0a97a20163589038e...
I am Satoshi Nakamoto6 =
&gt;
 4a2fd48e3be420d0d28e202360cfbaba...
I am Satoshi Nakamoto7 =
&gt;
 790b5a1349a5f2b909bf74d0d166b17a...
I am Satoshi Nakamoto8 =
&gt;
 702c45e5b15aa54b625d68dd947f1597...
I am Satoshi Nakamoto9 =
&gt;
 7007cf7dd40f5e933cd89fff5b791ff0...
I am Satoshi Nakamoto10 =
&gt;
 c2f38c81992f4614206a21537bd634a...
I am Satoshi Nakamoto11 =
&gt;
 7045da6ed8a914690f087690e1e8d66...
I am Satoshi Nakamoto12 =
&gt;
 60f01db30c1a0d4cbce2b4b22e88b9b...
I am Satoshi Nakamoto13 =
&gt;
 0ebc56d59a34f5082aaef3d66b37a66...
I am Satoshi Nakamoto14 =
&gt;
 27ead1ca85da66981fd9da01a8c6816...
I am Satoshi Nakamoto15 =
&gt;
 394809fb809c5f83ce97ab554a2812c...
I am Satoshi Nakamoto16 =
&gt;
 8fa4992219df33f50834465d3047429...
I am Satoshi Nakamoto17 =
&gt;
 dca9b8b4f8d8e1521fa4eaa46f4f0cd...
I am Satoshi Nakamoto18 =
&gt;
 9989a401b2a3a318b01e9ca9a22b0f3...
I am Satoshi Nakamoto19 =
&gt;
 cda56022ecb5b67b2bc93a2d764e75f...
</code></pre><p>&#x6BCF;&#x4E2A;&#x8BED;&#x53E5;&#x90FD;&#x751F;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x4E0D;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x5B83;&#x4EEC;&#x770B;&#x8D77;&#x6765;&#x662F;&#x5B8C;&#x5168;&#x968F;&#x673A;&#x7684;&#xFF0C;&#x4F46;&#x4F60;&#x5728;&#x4EFB;&#x4F55;&#x8BA1;&#x7B97;&#x673A;&#x4E0A;&#x7528;Python&#x6267;&#x884C;&#x4E0A;&#x9762;&#x7684;&#x811A;&#x672C;&#x90FD; &#x80FD;&#x91CD;&#x73B0;&#x8FD9;&#x4E9B;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x200B;&#x7C7B;&#x4F3C;&#x8FD9;&#x6837;&#x5728;&#x8BED;&#x53E5;&#x672B;&#x5C3E;&#x7684;&#x53D8;&#x5316;&#x7684;&#x6570;&#x5B57;&#x53EB;&#x505A;nonce&#xFF08;&#x968F;&#x673A;&#x6570;&#xFF09;&#x3002;Nonce&#x662F;&#x7528;&#x6765;&#x6539;&#x53D8;&#x52A0;&#x5BC6;&#x51FD;&#x6570;&#x8F93;&#x51FA;&#x7684;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x4E2D;&#x6539;&#x53D8;&#x4E86;&#x8FD9;&#x4E2A;&#x8BED;&#x53E5;&#x7684; SHA256&#x6307;&#x7EB9;&#x3002;</p>
<p>&#x200B;&#x4E3A;&#x4E86;&#x4F7F;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x7B97;&#x6CD5;&#x53D8;&#x5F97;&#x5BCC;&#x6709;&#x6311;&#x6218;&#xFF0C;&#x6211;&#x4EEC;&#x6765;&#x8BBE;&#x5B9A;&#x4E00;&#x4E2A;&#x5177;&#x6709;&#x4EFB;&#x610F;&#x6027;&#x7684;&#x76EE;&#x6807;&#xFF1A;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x8BED;&#x53E5;&#xFF0C;&#x4F7F;&#x4E4B;&#x54C8;&#x5E0C;&#x503C;&#x7684;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x4EE5; 0&#x5F00;&#x5934;&#x3002;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x5F88;&#x5BB9;&#x6613;&#xFF01;&#x5728;&#x4F8B;10-10&#x4E2D;&#x8BED;&#x53E5; &quot;I am Satoshi Nakamoto13&quot; &#x7684;&#x54C8;&#x5E0C;&#x503C;&#x662F; 0ebc56d59a34f5082aaef3d66b37a661696c2b618e62432727216ba9531041a5 &#xFF0C;&#x521A;&#x597D;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x3002;&#x6211;&#x4EEC;&#x5F97;&#x5230;&#x5B83;&#x7528;&#x4E86;13&#x6B21;&#x3002;&#x7528;&#x6982;&#x7387;&#x7684;&#x89D2;&#x5EA6; &#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;&#x8F93;&#x51FA;&#x662F;&#x5E73;&#x5747;&#x5206;&#x5E03;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x671F;&#x671B;&#x6BCF;16&#x6B21;&#x5F97;&#x5230;&#x4E00;&#x4E2A;&#x4EE5;0&#x5F00;&#x5934;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF08;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x4E2A;&#x4F4D;&#x6570;&#x5B57;&#x4E3A;0&#x5230; F&#xFF09;&#x3002;&#x4ECE;&#x6570;&#x5B57;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x627E;&#x7684;&#x662F;&#x5C0F;&#x4E8E; 0x1000000000000000000000000000000000000000000000000000000000000000 &#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x79F0;&#x8FD9;&#x4E2A;&#x4E3A;Target&#x76EE;&#x6807;&#x9608;&#x503C;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x76EE;&#x7684;&#x662F;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x5982;&#x679C;&#x6211;&#x4EEC;&#x51CF;&#x5C0F;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x503C;&#xFF0C;&#x90A3;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;&#x5B83;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x4F1A;&#x8D8A;&#x6765;&#x8D8A;&#x96BE;&#x3002;</p>
<p>&#x7B80;&#x5355;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x60F3;&#x8C61;&#x4EBA;&#x4EEC;&#x4E0D;&#x65AD;&#x6254;&#x4E00;&#x5BF9;&#x9AB0;&#x5B50;&#x4EE5;&#x5F97;&#x5230;&#x5C0F;&#x4E8E;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x70B9;&#x6570;&#x7684;&#x6E38;&#x620F;&#x3002;&#x7B2C;&#x4E00;&#x5C40;&#xFF0C;&#x76EE;&#x6807;&#x662F;12&#x3002;&#x53EA;&#x8981;&#x4F60;&#x4E0D;&#x6254;&#x51FA;&#x4E24;&#x4E2A;6&#xFF0C; &#x4F60;&#x5C31;&#x4F1A;&#x8D62;&#x3002;&#x7136;&#x540E;&#x4E0B;&#x4E00;&#x5C40;&#x76EE;&#x6807;&#x4E3A;11&#x3002;&#x73A9;&#x5BB6;&#x53EA;&#x80FD;&#x6254;10&#x6216;&#x66F4;&#x5C0F;&#x7684;&#x70B9;&#x6570;&#x624D;&#x80FD;&#x8D62;&#xFF0C;&#x4E0D;&#x8FC7;&#x4E5F;&#x5F88;&#x7B80;&#x5355;&#x3002;&#x5047;&#x5982;&#x51E0;&#x5C40;&#x4E4B;&#x540E;&#x76EE;&#x6807;&#x964D;&#x4F4E;&#x4E3A;&#x4E86;5&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6709;&#x4E00;&#x534A;&#x673A;&#x7387;&#x4EE5;&#x4E0A;&#x6254;&#x51FA;&#x6765;&#x7684;&#x9AB0;&#x5B50;&#x52A0;&#x8D77;&#x6765;&#x70B9;&#x6570;&#x4F1A;&#x8D85;&#x8FC7;5&#xFF0C;&#x56E0;&#x6B64;&#x65E0;&#x6548;&#x3002;&#x968F;&#x7740;&#x76EE;&#x6807;&#x8D8A;&#x6765;&#x8D8A;&#x5C0F;&#xFF0C;&#x8981;&#x60F3;&#x8D62;&#x7684;&#x8BDD;&#xFF0C;&#x6254;&#x9AB0;&#x5B50;&#x7684;&#x6B21;&#x6570;&#x4F1A; &#x6307;&#x6570;&#x7EA7;&#x7684;&#x4E0A;&#x5347;&#x3002;&#x6700;&#x7EC8;&#x5F53;&#x76EE;&#x6807;&#x4E3A;2&#x65F6;&#xFF08;&#x6700;&#x5C0F;&#x53EF;&#x80FD;&#x70B9;&#x6570;&#xFF09;&#xFF0C;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x4EBA;&#x5E73;&#x5747;&#x6254;36&#x6B21;&#x6216;2%&#x6254;&#x7684;&#x6B21;&#x6570;&#x4E2D;&#xFF0C;&#x4ED6;&#x624D;&#x80FD;&#x8D62;&#x3002;&#x4ECE;&#x4E00;&#x4E2A;&#x77E5;&#x9053;&#x9AB0;&#x5B50;&#x6E38;&#x620F;&#x76EE;&#x6807;&#x4E3A;2&#x7684;&#x89C2;&#x5BDF;&#x8005;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x6709;&#x4EBA;&#x8981;&#x6210;&#x529F;&#x4E2D;&#x5956;&#xFF0C;&#x5047;&#x8BBE;&#x4ED6;&#x5E73;&#x5747;&#x5C1D;&#x8BD5;&#x4E86;36&#x6B21;&#x3002;</p>
<p>&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x53EF;&#x4EE5;&#x4F30;&#x8BA1;&#x4ECE;&#x5B9E;&#x73B0;&#x76EE;&#x6807;&#x96BE;&#x5EA6;&#x53D6;&#x5F97;&#x6210;&#x529F;&#x6240;&#x9700;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002; &#x5F53;&#x7B97;&#x6CD5;&#x662F;&#x57FA;&#x4E8E;&#x8BF8;&#x5982;SHA256&#x7684;&#x786E;&#x5B9A;&#x6027;&#x51FD;&#x6570;&#x65F6;&#xFF0C;&#x8F93;&#x5165;&#x672C;&#x8EAB;&#x5C31;&#x6210;&#x4E3A;&#x8BC1;&#x636E;&#xFF0C;&#x5FC5;&#x987B;&#x8981;&#x4E00;&#x5B9A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x624D;&#x80FD;&#x4EA7;&#x751F;&#x4F4E;&#x4E8E;&#x76EE;&#x6807;&#x7684;&#x7ED3;&#x679C;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x79F0;&#x4E4B;&#x4E3A;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;</p>
<p>&#x200B;<strong>&#x63D0;&#x793A;</strong>&#xFF1A;&#x5C3D;&#x7BA1;&#x6BCF;&#x6B21;&#x5C1D;&#x8BD5;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x968F;&#x673A;&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x4F46;&#x662F;&#x4EFB;&#x4F55;&#x53EF;&#x80FD;&#x7684;&#x7ED3;&#x679C;&#x7684;&#x6982;&#x7387;&#x53EF;&#x4EE5;&#x9884;&#x5148;&#x8BA1;&#x7B97;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6307;&#x5B9A;&#x7279;&#x5B9A;&#x96BE;&#x5EA6;&#x7684;&#x7ED3;&#x679C;&#x6784;&#x6210;&#x4E86;&#x5177;&#x4F53;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;</p>
<p>&#x200B;&#x5728;&#x4F8B;10-10&#x4E2D;&#xFF0C;&#x6210;&#x529F;&#x7684;nonce&#x4E3A;13&#xFF0C;&#x4E14;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x80FD;&#x88AB;&#x6240;&#x6709;&#x4EBA;&#x72EC;&#x7ACB;&#x786E;&#x8BA4;&#x3002;&#x4EFB;&#x4F55;&#x4EBA;&#x5C06;13&#x52A0;&#x5230;&#x8BED;&#x53E5; &quot;I am Satoshi Nakamoto&quot; &#x540E;&#x9762;&#x518D;&#x8BA1;&#x7B97;&#x54C8;&#x5E0C;&#x503C;&#x90FD;&#x80FD;&#x786E;&#x8BA4;&#x5B83;&#x6BD4;&#x76EE;&#x6807;&#x503C;&#x8981;&#x5C0F;&#x3002;&#x8FD9;&#x4E2A;&#x6B63;&#x786E;&#x7684;&#x7ED3;&#x679C;&#x540C;&#x65F6;&#x4E5F;&#x662F;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF08;Proof of Work&#xFF09;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8BC1;&#x660E;&#x6211;&#x4EEC;&#x7684;&#x786E;&#x82B1;&#x65F6;&#x95F4;&#x627E;&#x5230;&#x4E86;&#x8FD9;&#x4E2A;nonce&#x3002;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x8BA1;&#x7B97;&#xFF0C;&#x800C;&#x6211;&#x4EEC;&#x627E;&#x5230;&#x5B83;&#x5374;&#x82B1;&#x4E86;13&#x6B21;&#x3002;&#x5982;&#x679C;&#x76EE;&#x6807;&#x503C;&#x66F4;&#x5C0F;&#xFF08;&#x96BE;&#x5EA6;&#x66F4;&#x5927;&#xFF09;&#xFF0C;&#x90A3;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x591A;&#x5F97;&#x591A;&#x7684;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x624D;&#x80FD;&#x627E;&#x5230;&#x5408;&#x9002;&#x7684;nonce&#xFF0C;&#x4F46;&#x5176;&#x4ED6;&#x4EBA;&#x9A8C;&#x8BC1;&#x5B83;&#x65F6;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6B21;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x77E5;&#x9053;&#x76EE;&#x6807;&#x503C;&#x540E;&#xFF0C;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x7EDF;&#x8BA1;&#x5B66;&#x6765;&#x4F30;&#x7B97;&#x5176;&#x96BE;&#x5EA6;&#xFF0C;&#x56E0;&#x6B64;&#x5C31;&#x80FD;&#x77E5;&#x9053;&#x627E;&#x5230;&#x8FD9;&#x4E2A;nonce&#x9700;&#x8981;&#x591A;&#x5C11;&#x5DE5;&#x4F5C;&#x3002;</p>
<p><strong>&#x63D0;&#x793A;</strong>&#xFF1A;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x5FC5;&#x987B;&#x4EA7;&#x751F;&#x5C0F;&#x4E8E;&#x76EE;&#x6807;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002; &#x66F4;&#x9AD8;&#x7684;&#x76EE;&#x6807;&#x610F;&#x5473;&#x7740;&#x627E;&#x5230;&#x4F4E;&#x4E8E;&#x76EE;&#x6807;&#x7684;&#x54C8;&#x5E0C;&#x662F;&#x4E0D;&#x592A;&#x56F0;&#x96BE;&#x7684;&#x3002; &#x8F83;&#x4F4E;&#x7684;&#x76EE;&#x6807;&#x610F;&#x5473;&#x7740;&#x5728;&#x76EE;&#x6807;&#x4E0B;&#x65B9;&#x627E;&#x5230;&#x54C8;&#x5E0C;&#x66F4;&#x96BE;&#x3002; &#x76EE;&#x6807;&#x548C;&#x96BE;&#x5EA6;&#x662F;&#x6210;&#x53CD;&#x6BD4;&#x3002;</p>
<p>&#x200B;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x548C;&#x4F8B;10-10&#x4E2D;&#x7684;&#x6311;&#x6218;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x3002;&#x77FF;&#x5DE5;&#x7528;&#x4E00;&#x4E9B;&#x4EA4;&#x6613;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x8FD9;&#x4E2A;&#x77FF;&#x5DE5;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x5934;&#x4FE1;&#x606F;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x770B;&#x5176;&#x662F;&#x5426;&#x5C0F;&#x4E8E;&#x5F53;&#x524D;&#x76EE;&#x6807;&#x503C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x54C8;&#x5E0C;&#x503C;&#x4E0D;&#x5C0F;&#x4E8E;&#x76EE;&#x6807;&#x503C;&#xFF0C;&#x77FF;&#x5DE5;&#x5C31;&#x4F1A;&#x4FEE;&#x6539;&#x8FD9;&#x4E2A;nonce&#xFF08;&#x901A;&#x5E38;&#x5C06;&#x4E4B;&#x52A0; 1&#xFF09;&#x7136;&#x540E;&#x518D;&#x8BD5;&#x4E00;&#x6B21;&#x3002;&#x6309;&#x5F53;&#x524D;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x77FF;&#x5DE5;&#x5F97;&#x8BD5;10^15&#x6B21;&#xFF08;10&#x7684;15&#x6B21;&#x65B9;&#xFF09;&#x624D;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x5408;&#x9002;&#x7684;nonce&#x4F7F;&#x533A;&#x5757;&#x5934;&#x4FE1;&#x606F;&#x54C8;&#x5E0C;&#x503C;&#x8DB3;&#x591F;&#x5C0F;&#x3002;</p>
<p>&#x200B; &#x4F8B;10-11&#x662F;&#x4E00;&#x4E2A;&#x7B80;&#x5316;&#x5F88;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x7684;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x200B; &#x4F8B;10-11 &#x7B80;&#x5316;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;</p>
<pre><code>code/proof-of-work-example.py\[]
</code></pre><p>&#x4F60;&#x53EF;&#x4EE5;&#x4EFB;&#x610F;&#x8C03;&#x6574;&#x96BE;&#x5EA6;&#x503C;&#xFF08;&#x6309;&#x4E8C;&#x8FDB;&#x5236;bit&#x6570;&#x6765;&#x8BBE;&#x5B9A;&#xFF0C;&#x5373;&#x54C8;&#x5E0C;&#x503C;&#x5F00;&#x5934;&#x591A;&#x5C11;&#x4E2A;bit&#x5FC5;&#x987B;&#x662F;0&#xFF09;&#x3002;&#x7136;&#x540E;&#x6267;&#x884C;&#x4EE3;&#x7801;&#xFF0C;&#x770B;&#x770B;&#x5728;&#x4F60;&#x7684;&#x8BA1;&#x7B97;&#x673A; &#x4E0A;&#x6C42;&#x89E3;&#x9700;&#x8981;&#x591A;&#x4E45;&#x3002;&#x5728;&#x4F8B;10-12&#x4E2D;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8BE5;&#x7A0B;&#x5E8F;&#x5728;&#x4E00;&#x4E2A;&#x666E;&#x901A;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x6267;&#x884C;&#x60C5;&#x51B5;&#x3002;</p>
<p>&#x4F8B;10-12 &#x591A;&#x79CD;&#x96BE;&#x5EA6;&#x503C;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x7684;&#x8FD0;&#x884C;&#x8F93;&#x51FA;</p>
<pre><code>$ python proof-of-work-example.py*
</code></pre><pre><code>Difficulty: 1 (0 bits)

[...]

Difficulty: 8 (3 bits)
Starting search...
Success with nonce 9
Hash is 1c1c105e65b47142f028a8f93ddf3dabb9260491bc64474738133ce5256cb3c1
Elapsed Time: 0.0004 seconds
Hashing Power: 25065 hashes per second
Difficulty: 16 (4 bits)
Starting search...
Success with nonce 25
Hash is 0f7becfd3bcd1a82e06663c97176add89e7cae0268de46f94e7e11bc3863e148
Elapsed Time: 0.0005 seconds
Hashing Power: 52507 hashes per second
Difficulty: 32 (5 bits)
Starting search...
Success with nonce 36
Hash is 029ae6e5004302a120630adcbb808452346ab1cf0b94c5189ba8bac1d47e7903
Elapsed Time: 0.0006 seconds
Hashing Power: 58164 hashes per second

[...]

Difficulty: 4194304 (22 bits)
Starting search...
Success with nonce 1759164
Hash is 0000008bb8f0e731f0496b8e530da984e85fb3cd2bd81882fe8ba3610b6cefc3
Elapsed Time: 13.3201 seconds
Hashing Power: 132068 hashes per second
Difficulty: 8388608 (23 bits)
Starting search...
Success with nonce 14214729
Hash is 000001408cf12dbd20fcba6372a223e098d58786c6ff93488a9f74f5df4df0a3
Elapsed Time: 110.1507 seconds
Hashing Power: 129048 hashes per second
Difficulty: 16777216 (24 bits)
Starting search...
Success with nonce 24586379
Hash is 0000002c3d6b370fccd699708d1b7cb4a94388595171366b944d68b2acce8b95
Elapsed Time: 195.2991 seconds
Hashing Power: 125890 hashes per second

[...]

Difficulty: 67108864 (26 bits)
Starting search...
Success with nonce 84561291
Hash is 0000001f0ea21e676b6dde5ad429b9d131a9f2b000802ab2f169cbca22b1e21a
Elapsed Time: 665.0949 seconds
Hashing Power: 127141 hashes per second
</code></pre><p>&#x200B;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x968F;&#x7740;&#x96BE;&#x5EA6;&#x4F4D;&#x4E00;&#x4F4D;&#x4E00;&#x4F4D;&#x5730;&#x589E;&#x52A0;&#xFF0C;&#x67E5;&#x627E;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#x7684;&#x65F6;&#x95F4;&#x4F1A;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x589E;&#x957F;&#x3002;&#x5982;&#x679C;&#x4F60;&#x8003;&#x8651;&#x6574;&#x4E2A;256bit&#x6570;&#x5B57;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x6B21;&#x8981;&#x6C42;&#x591A;&#x4E00;&#x4E2A;0&#xFF0C;&#x4F60;&#x5C31;&#x628A;&#x54C8;&#x5E0C;&#x67E5;&#x627E;&#x7A7A;&#x95F4;&#x7F29;&#x51CF;&#x4E86;&#x4E00;&#x534A;&#x3002;&#x5728;&#x4F8B;10-12&#x4E2D;&#xFF0C;&#x4E3A;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;nonce&#x4F7F;&#x5F97;&#x54C8;&#x5E0C;&#x503C;&#x5F00;&#x5934;&#x7684;26&#x4F4D;&#x503C;&#x4E3A;0&#xFF0C;&#x4E00;&#x5171;&#x5C1D;&#x8BD5;&#x4E86;8&#x5343;&#x591A;&#x4E07;&#x6B21;&#x3002;&#x5373;&#x4F7F;&#x5BB6;&#x7528;&#x7B14;&#x8BB0;&#x672C;&#x6BCF;&#x79D2;&#x53EF;&#x4EE5;&#x8FBE;270,000&#x591A;&#x6B21;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#xFF0C;&#x8FD9;&#x4E2A;&#x67E5;&#x627E;&#x4F9D;&#x7136;&#x9700;&#x8981;10&#x5206;&#x949F;&#x3002;</p>
<p>&#x200B;&#x5728;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x8981;&#x5BFB;&#x627E;&#x533A;&#x5757;&#x5934;&#x4FE1;&#x606F;&#x54C8;&#x5E0C;&#x503C;&#x5C0F;&#x4E8E;</p>
<pre><code>0000000000000000029AB9000000000000000000000000000000000000000000
</code></pre><p>&#x200B;&#x53EF;&#x4EE5;&#x770B;&#x51FA;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x54C8;&#x5E0C;&#x503C;&#x5F00;&#x5934;&#x7684;0&#x591A;&#x4E86;&#x5F88;&#x591A;&#x3002;&#x8FD9;&#x610F;&#x5473; &#x7740;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x8303;&#x56F4;&#x5927;&#x5E45;&#x7F29;&#x51CF;&#xFF0C;&#x56E0;&#x800C;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#x3002;&#x751F;&#x6210;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x9700;&#x8981;&#x7F51;&#x7EDC;&#x6BCF;&#x79D2;&#x8BA1;&#x7B97;1.8 septa-hashes&#xFF08;(thousand billion billion&#x6B21;&#x54C8;&#x5E0C;&#xFF09;&#x3002;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4E0D;&#x53EF;&#x80FD;&#x7684;&#x4EFB;&#x52A1;&#xFF0C;&#x4F46;&#x5E78;&#x8FD0;&#x7684;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x62E5;&#x6709;3EH/sec&#x7684;&#x5904;&#x7406;&#x80FD;&#x529B;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;10&#x5206;&#x949F;&#x5C31;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x3002;</p>
<h3 id="1072-&#x96BE;&#x5EA6;&#x8868;&#x793A;">10.7.2 &#x96BE;&#x5EA6;&#x8868;&#x793A;</h3>
<p>&#x200B;&#x5728;&#x4F8B;10-3&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5728;&#x533A;&#x5757;&#x4E2D;&#x770B;&#x5230;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#xFF0C;&#x5176;&#x88AB;&#x6807;&#x4E3A;&quot;&#x96BE;&#x5EA6;&#x4F4D;&quot;&#x6216;&#x7B80;&#x79F0;&quot;bits&quot;&#x3002;&#x5728;&#x533A;&#x5757;277,316&#x4E2D;&#xFF0C;&#x5B83;&#x7684;&#x503C;&#x4E3A; 0x1903a30c&#x3002; &#x8FD9;&#x4E2A;&#x6807;&#x8BB0;&#x7684;&#x503C;&#x88AB;&#x5B58;&#x4E3A;&#x7CFB;&#x6570;/&#x6307;&#x6570;&#x683C;&#x5F0F;&#xFF0C;&#x524D;&#x4E24;&#x4F4D;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x6570;&#x5B57;&#x4E3A;&#x5E42;&#xFF08;exponent&#xFF09;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x5F97;&#x516D;&#x4F4D;&#x4E3A;&#x7CFB;&#x6570;&#xFF08;coefficient&#xFF09;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x91CC;&#xFF0C;0x19&#x4E3A;&#x5E42;&#xFF0C;&#x800C; 0x03a30c&#x4E3A;&#x7CFB;&#x6570;&#x3002;</p>
<p>&#x8BA1;&#x7B97;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x7684;&#x516C;&#x5F0F;&#x4E3A;&#xFF1A;</p>
<pre><code>target = coefficient \* 2^\(8 \* \(exponent &#x2013; 3\)\)
</code></pre><p>&#x200B;&#x7531;&#x6B64;&#x516C;&#x5F0F;&#x53CA;&#x96BE;&#x5EA6;&#x4F4D;&#x7684;&#x503C; 0x1903a30c&#xFF0C;&#x53EF;&#x5F97;&#xFF1A;</p>
<pre><code>    target = 0x03a30c * 2^(0x08 * (0x19 - 0x03))^

     =
&gt;
 target = 0x03a30c * 2^(0x08 * 0x16)^

    =
&gt;
 target = 0x03a30c * 2^0xB0^
</code></pre><p>&#x200B;&#x6309;&#x5341;&#x8FDB;&#x5236;&#x8BA1;&#x7B97;&#x4E3A;&#xFF1A;</p>
<pre><code>=
&gt;
 target = 238,348 * 2^176^

=
&gt;
 target = 22,829,202,948,393,929,850,749,706,076,701,368,331,072,452,018,388,575,715,328
</code></pre><p>&#x8F6C;&#x5316;&#x4E3A;&#x5341;&#x516D;&#x8FDB;&#x5236;&#x540E;&#x4E3A;&#xFF1A;</p>
<pre><code>=
&gt;
 target = 0x0000000000000003A30C00000000000000000000000000000000000000000000
</code></pre><p>&#x200B;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x9AD8;&#x5EA6;&#x4E3A;277,316&#x7684;&#x6709;&#x6548;&#x533A;&#x5757;&#x7684;&#x5934;&#x4FE1;&#x606F;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x5C0F;&#x4E8E;&#x8FD9;&#x4E2A;&#x76EE;&#x6807;&#x503C;&#x7684;&#x3002;&#x8FD9;&#x4E2A;&#x6570;&#x5B57;&#x7684;&#x4E8C;&#x8FDB;&#x5236;&#x8868;&#x793A;&#x4E2D;&#x524D;60&#x4F4D;&#x90FD;&#x662F;0&#x3002;&#x5728; &#x8FD9;&#x4E2A;&#x96BE;&#x5EA6;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x6BCF;&#x79D2;&#x53EF;&#x4EE5;&#x5904;&#x7406;1&#x4E07;&#x4EBF;&#x4E2A;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x7684;&#x77FF;&#x5DE5;&#xFF08;1 tera-hash per second &#x6216; 1 TH/sec&#xFF09;&#x5E73;&#x5747;&#x6BCF;8,496&#x4E2A;&#x533A;&#x5757;&#x624D;&#x80FD;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x7ED3;&#x679C;&#xFF0C;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;59&#x5929;&#xFF0C;&#x624D;&#x80FD;&#x4E3A;&#x67D0;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x627E;&#x5230;&#x6B63;&#x786E;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x3002;</p>
<h3 id="1073-&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x4E0E;&#x96BE;&#x5EA6;&#x8C03;&#x6574;">10.7.3 &#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x4E0E;&#x96BE;&#x5EA6;&#x8C03;&#x6574;</h3>
<p>&#x200B;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x76EE;&#x6807;&#x51B3;&#x5B9A;&#x4E86;&#x96BE;&#x5EA6;&#xFF0C;&#x8FDB;&#x800C;&#x5F71;&#x54CD;&#x6C42;&#x89E3;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x6240;&#x9700;&#x8981;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x90A3;&#x4E48;&#x95EE;&#x9898;&#x6765;&#x4E86;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x8FD9;&#x4E2A;&#x96BE;&#x5EA6;&#x503C;&#x662F;&#x53EF;&#x8C03;&#x6574; &#x7684;&#xFF1F;&#x7531;&#x8C01;&#x6765;&#x8C03;&#x6574;&#xFF1F;&#x5982;&#x4F55;&#x8C03;&#x6574;&#xFF1F;</p>
<p>&#x200B;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x533A;&#x5757;&#x5E73;&#x5747;&#x6BCF;10&#x5206;&#x949F;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5FC3;&#x8DF3;&#xFF0C;&#x662F;&#x8D27;&#x5E01;&#x53D1;&#x884C;&#x901F;&#x7387;&#x548C;&#x4EA4;&#x6613;&#x8FBE;&#x6210;&#x901F;&#x5EA6;&#x7684;&#x57FA;&#x7840;&#x3002;&#x4E0D;&#x4EC5;&#x662F;&#x5728;&#x77ED;&#x671F;&#x5185;&#xFF0C;&#x800C;&#x662F;&#x5728;&#x51E0;&#x5341;&#x5E74;&#x5185;&#x5B83;&#x90FD;&#x5FC5;&#x987B;&#x8981;&#x4FDD;&#x6301;&#x6052;&#x5B9A;&#x3002;&#x5728;&#x6B64;&#x671F;&#x95F4;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x6027;&#x80FD;&#x5C06;&#x98DE;&#x901F;&#x63D0;&#x5347;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x53C2;&#x4E0E;&#x6316;&#x77FF;&#x7684;&#x4EBA;&#x548C;&#x8BA1;&#x7B97;&#x673A;&#x4E5F;&#x4F1A;&#x4E0D;&#x65AD; &#x53D8;&#x5316;&#x3002;&#x4E3A;&#x4E86;&#x80FD;&#x8BA9;&#x65B0;&#x533A;&#x5757;&#x7684;&#x4FDD;&#x6301;10&#x5206;&#x949F;&#x4E00;&#x4E2A;&#x7684;&#x4EA7;&#x751F;&#x901F;&#x7387;&#xFF0C;&#x6316;&#x77FF;&#x7684;&#x96BE;&#x5EA6;&#x5FC5;&#x987B;&#x6839;&#x636E;&#x8FD9;&#x4E9B;&#x53D8;&#x5316;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x96BE;&#x5EA6;&#x662F;&#x4E00;&#x4E2A;&#x52A8; &#x6001;&#x7684;&#x53C2;&#x6570;&#xFF0C;&#x4F1A;&#x5B9A;&#x671F;&#x8C03;&#x6574;&#x4EE5;&#x8FBE;&#x5230;&#x6BCF;10&#x5206;&#x949F;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x7684;&#x76EE;&#x6807;&#x3002;&#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x96BE;&#x5EA6;&#x88AB;&#x8BBE;&#x5B9A;&#x5728;&#xFF0C;&#x65E0;&#x8BBA;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x5982;&#x4F55;&#xFF0C;&#x65B0;&#x533A;&#x5757;&#x4EA7;&#x751F; &#x901F;&#x7387;&#x90FD;&#x4FDD;&#x6301;&#x5728;10&#x5206;&#x949F;&#x4E00;&#x4E2A;&#x3002;</p>
<p>&#x200B;&#x90A3;&#x4E48;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8C03;&#x6574;&#x662F;&#x5982;&#x4F55;&#x505A;&#x5230;&#x7684;&#x5462;&#xFF1F;&#x96BE;&#x5EA6;&#x7684;&#x8C03;&#x6574;&#x662F;&#x5728;&#x6BCF;&#x4E2A;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x4E2D;&#x72EC;&#x7ACB;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#x7684;&#x3002; &#x6BCF;2,016&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x8C03;&#x6574;&#x96BE;&#x5EA6;&#x3002;&#x96BE;&#x5EA6;&#x7684;&#x8C03;&#x6574;&#x516C;&#x5F0F;&#x662F;&#x7531;&#x6700;&#x65B0;2,016&#x4E2A;&#x533A;&#x5757;&#x7684;&#x82B1;&#x8D39;&#x65F6;&#x957F;&#x4E0E;20,160&#x5206;&#x949F;&#xFF08;&#x5373; &#x8FD9;&#x4E9B;&#x533A;&#x5757;&#x4EE5;10&#x5206;&#x949F;&#x4E00;&#x4E2A;&#x901F;&#x7387;&#x6240;&#x671F;&#x671B;&#x82B1;&#x8D39;&#x7684;&#x65F6;&#x957F;&#xFF09;&#x6BD4;&#x8F83;&#x5F97;&#x51FA;&#x7684;&#x3002;&#x96BE;&#x5EA6;&#x662F;&#x6839;&#x636E;&#x5B9E;&#x9645;&#x65F6;&#x957F;&#x4E0E;&#x671F;&#x671B;&#x65F6;&#x957F;&#x7684;&#x6BD4;&#x503C;&#x8FDB;&#x884C;&#x76F8;&#x5E94;&#x8C03;&#x6574;&#x7684; &#xFF08;&#x6216;&#x53D8;&#x96BE;&#x6216;&#x53D8;&#x6613;&#xFF09;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x5982;&#x679C;&#x7F51;&#x7EDC;&#x53D1;&#x73B0;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x901F;&#x7387;&#x6BD4;10&#x5206;&#x949F;&#x8981;&#x5FEB;&#x65F6;&#x4F1A;&#x589E;&#x52A0;&#x96BE;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x53D1;&#x73B0;&#x6BD4;10&#x5206;&#x949F;&#x6162;&#x65F6;&#x5219;&#x964D;&#x4F4E;&#x96BE;&#x5EA6;&#x3002;</p>
<p>&#x200B;&#x8FD9;&#x4E2A;&#x516C;&#x5F0F;&#x53EF;&#x4EE5;&#x603B;&#x7ED3;&#x4E3A;&#x5982;&#x4E0B;&#x5F62;&#x5F0F;&#xFF1A;</p>
<pre><code>New Difficulty = Old Difficulty \* \(Actual Time of Last 2016 Blocks / 20160 minutes\)
</code></pre><p>&#x200B; &#x4F8B;10-13&#x5C55;&#x793A;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x7684;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x4EE3;&#x7801;&#x3002;</p>
<p>&#x4F8B;10-13 &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x96BE;&#x5EA6;&#x8C03;&#x6574; &#x6E90;&#x6587;&#x4EF6;<strong>( pow.cpp&#x6587;&#x4EF6;&#x949F;&#x7684;CalculateNextWorkRequired() &#x51FD;&#x6570;)</strong></p>
<p>&#x7B2C;43&#x884C;&#x51FD;&#x6570; GetNextWorkRequired()// Limit adjustment step</p>
<pre><code>// Limit adjustment step
    int64_t nActualTimespan = pindexLast-
&gt;
GetBlockTime() - nFirstBlockTime;
    LogPrintf(&quot;  nActualTimespan = %d  before bounds\n&quot;, nActualTimespan);
    if (nActualTimespan 
&lt;
 params.nPowTargetTimespan/4)
        nActualTimespan = params.nPowTargetTimespan/4;
    if (nActualTimespan 
&gt;
 params.nPowTargetTimespan*4)
        nActualTimespan = params.nPowTargetTimespan*4;

    // Retarget
    const arith_uint256 bnPowLimit = UintToArith256(params.powLimit);
    arith_uint256 bnNew;
    arith_uint256 bnOld;
    bnNew.SetCompact(pindexLast-
&gt;
nBits);
    bnOld = bnNew;
    bnNew *= nActualTimespan;
    bnNew /= params.nPowTargetTimespan;

    if (bnNew 
&gt;
 bnPowLimit)
        bnNew = bnPowLimit;
</code></pre><p><strong>&#x6CE8;&#x610F;</strong>&#xFF1A;&#x867D;&#x7136;&#x76EE;&#x6807;&#x6821;&#x51C6;&#x6BCF;2,016&#x4E2A;&#x5757;&#x53D1;&#x751F;&#xFF0C;&#x4F46;&#x662F;&#x7531;&#x4E8E;Bitcoin Core&#x5BA2;&#x6237;&#x7AEF;&#x7684;&#x4E00;&#x4E2A;&#x9519;&#x8BEF;&#xFF0C;&#x5B83;&#x662F;&#x57FA;&#x4E8E;&#x4E4B;&#x524D;&#x7684;2,015&#x4E2A;&#x5757;&#x7684;&#x603B;&#x65F6;&#x95F4;&#xFF08;&#x4E0D;&#x5E94;&#x8BE5;&#x662F;2,016&#x4E2A;&#xFF09;&#xFF0C;&#x5BFC;&#x81F4;&#x91CD;&#x5B9A;&#x5411;&#x504F;&#x5DEE;&#x5411;&#x8F83;&#x9AD8;&#x96BE;&#x5EA6;&#x63D0;&#x9AD8;0.05&#xFF05;&#x3002;</p>
<p>&#x200B;&#x53C2;&#x6570;Interval(2,016&#x533A;&#x5757;)&#x548C;TargetTimespan(1,209,600&#x79D2;&#x5373;&#x4E24;&#x5468;)&#x7684;&#x5B9A;&#x4E49;&#x5728;&#x6587;&#x4EF6;chainparams.cpp&#x4E2D;&#x3002;</p>
<p>&#x200B;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x96BE;&#x5EA6;&#x7684;&#x53D8;&#x5316;&#x8FC7;&#x5FEB;&#xFF0C;&#x6BCF;&#x4E2A;&#x5468;&#x671F;&#x7684;&#x8C03;&#x6574;&#x5E45;&#x5EA6;&#x5FC5;&#x987B;&#x5C0F;&#x4E8E;&#x4E00;&#x4E2A;&#x56E0;&#x5B50;&#xFF08;&#x503C;&#x4E3A;4&#xFF09;&#x3002;&#x5982;&#x679C;&#x8981;&#x8C03;&#x6574;&#x7684;&#x5E45;&#x5EA6;&#x5927;&#x4E8E;4&#x500D;&#xFF0C;&#x5219;&#x6309;4&#x500D;&#x8C03; &#x6574;&#x3002;&#x7531;&#x4E8E;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;2,016&#x533A;&#x5757;&#x7684;&#x5468;&#x671F;&#x4E0D;&#x5E73;&#x8861;&#x7684;&#x60C5;&#x51B5;&#x4F1A;&#x7EE7;&#x7EED;&#x5B58;&#x5728;&#xFF0C;&#x6240;&#x4EE5;&#x8FDB;&#x4E00;&#x6B65;&#x7684;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x4F1A;&#x5728;&#x4E0B;&#x4E00;&#x5468;&#x671F;&#x8FDB;&#x884C;&#x3002;&#x56E0;&#x6B64;&#x5E73;&#x8861;&#x54C8; &#x5E0C;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x548C;&#x96BE;&#x5EA6;&#x7684;&#x5DE8;&#x5927;&#x5DEE;&#x5F02;&#x6709;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x82B1;&#x8D39;&#x51E0;&#x4E2A;2,016&#x533A;&#x5757;&#x5468;&#x671F;&#x624D;&#x4F1A;&#x5B8C;&#x6210;&#x3002;</p>
<p>&#x200B;<strong>&#x63D0;&#x793A;</strong>&#xFF1A;&#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x9700;&#x8981;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x82B1;&#x8D39;10&#x5206;&#x949F;&#x6765;&#x5904;&#x7406;&#xFF0C;&#x6BCF;&#x53D1;&#x73B0;2,016&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x4F1A;&#x6839;&#x636E;&#x524D;2,016&#x4E2A;&#x533A;&#x5757;&#x5B8C;&#x6210;&#x7684;&#x65F6;&#x95F4;&#x5BF9;&#x96BE;&#x5EA6;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#x3002;</p>
<p>&#x200B;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x76EE;&#x6807;&#x96BE;&#x5EA6;&#x4E0E;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x91CF;&#x548C;&#x91D1;&#x989D;&#x65E0;&#x5173;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x7684;&#x5F3A;&#x5F31;&#xFF0C;&#x5373;&#x8BA9;&#x6BD4;&#x7279;&#x5E01;&#x66F4;&#x5B89;&#x5168;&#x7684;&#x7535;&#x529B;&#x6295;&#x5165;&#x91CF;&#xFF0C;&#x4E0E;&#x4EA4;&#x6613; &#x7684;&#x6570;&#x91CF;&#x5B8C;&#x5168;&#x65E0;&#x5173;&#x3002;&#x6362;&#x53E5;&#x8BDD;&#x8BF4;&#xFF0C;&#x5F53;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x89C4;&#x6A21;&#x53D8;&#x5F97;&#x66F4;&#x5927;&#xFF0C;&#x4F7F;&#x7528;&#x5B83;&#x7684;&#x4EBA;&#x6570;&#x66F4;&#x591A;&#x65F6;&#xFF0C;&#x5373;&#x4F7F;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x4FDD;&#x6301;&#x5F53;&#x524D;&#x7684;&#x6C34;&#x5E73;&#xFF0C;&#x6BD4;&#x7279;&#x5E01; &#x7684;&#x5B89;&#x5168;&#x6027;&#x4E5F;&#x4E0D;&#x4F1A;&#x53D7;&#x5230;&#x5F71;&#x54CD;&#x3002;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x7684;&#x589E;&#x52A0;&#x8868;&#x660E;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x4E3A;&#x5F97;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x56DE;&#x62A5;&#x800C;&#x52A0;&#x5165;&#x4E86;&#x6316;&#x77FF;&#x961F;&#x4F0D;&#x3002;&#x53EA;&#x8981;&#x4E3A;&#x4E86;&#x56DE;&#x62A5;&#xFF0C;&#x516C;&#x5E73;&#x6B63; &#x5F53;&#x5730;&#x4ECE;&#x4E8B;&#x6316;&#x77FF;&#x7684;&#x77FF;&#x5DE5;&#x7FA4;&#x4F53;&#x4FDD;&#x6301;&#x8DB3;&#x591F;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#xFF0C;&quot;&#x63A5;&#x7BA1;&quot;&#x653B;&#x51FB;&#x5C31;&#x4E0D;&#x4F1A;&#x5F97;&#x901E;&#xFF0C;&#x8BA9;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x65E0;&#x865E;&#x3002;</p>
<p>&#x200B;&#x76EE;&#x6807;&#x96BE;&#x5EA6;&#x548C;&#x6316;&#x77FF;&#x7535;&#x529B;&#x6D88;&#x8017;&#x4E0E;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x5151;&#x6362;&#x6210;&#x73B0;&#x91D1;&#x4EE5;&#x652F;&#x4ED8;&#x8FD9;&#x4E9B;&#x7535;&#x529B;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x5BC6;&#x5207;&#x76F8;&#x5173;&#x3002;&#x9AD8;&#x6027;&#x80FD;&#x6316;&#x77FF;&#x7CFB;&#x7EDF;&#x5C31;&#x662F;&#x8981;&#x7528;&#x5F53;&#x524D;&#x7845; &#x82AF;&#x7247;&#x4EE5;&#x6700;&#x9AD8;&#x6548;&#x7684;&#x65B9;&#x5F0F;&#x5C06;&#x7535;&#x529B;&#x8F6C;&#x5316;&#x4E3A;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x3002;&#x6316;&#x77FF;&#x5E02;&#x573A;&#x7684;&#x5173;&#x952E;&#x56E0;&#x7D20;&#x5C31;&#x662F;&#x6BCF;&#x5EA6;&#x7535;&#x8F6C;&#x6362;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x540E;&#x7684;&#x4EF7;&#x683C;&#x3002;&#x56E0;&#x4E3A;&#x8FD9;&#x51B3;&#x5B9A;&#x7740;&#x6316; &#x77FF;&#x6D3B;&#x52A8;&#x7684;&#x8425;&#x5229;&#x6027;&#xFF0C;&#x4E5F;&#x56E0;&#x6B64;&#x523A;&#x6FC0;&#x7740;&#x4EBA;&#x4EEC;&#x9009;&#x62E9;&#x8FDB;&#x5165;&#x6216;&#x9000;&#x51FA;&#x6316;&#x77FF;&#x5E02;&#x573A;&#x3002;</p>
<h2 id="108-&#x6210;&#x529F;&#x6784;&#x5EFA;&#x533A;&#x5757;">10.8 &#x6210;&#x529F;&#x6784;&#x5EFA;&#x533A;&#x5757;</h2>
<p>&#x524D;&#x9762;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#xFF0C;Jing&#x7684;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x51C6;&#x5907;&#x62FF;&#x5B83;&#x6765;&#x6316;&#x77FF;&#x3002;Jing&#x6709;&#x51E0;&#x4E2A;&#x5B89;&#x88C5;&#x4E86;ASIC&#xFF08;&#x4E13;&#x7528;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#xFF09;&#x7684;&#x77FF;&#x673A;&#xFF0C; &#x4E0A;&#x9762;&#x6709;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x4E2A;&#x96C6;&#x6210;&#x7535;&#x8DEF;&#x53EF;&#x4EE5;&#x8D85;&#x9AD8;&#x901F;&#x5730;&#x5E76;&#x884C;&#x8FD0;&#x884C;SHA256&#x7B97;&#x6CD5;&#x3002;&#x8FD9;&#x4E9B;&#x5B9A;&#x5236;&#x7684;&#x786C;&#x4EF6;&#x901A;&#x8FC7;USB&#x8FDE;&#x63A5;&#x5230;&#x4ED6;&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x4E0A;&#x3002;&#x63A5; &#x4E0B;&#x6765;&#xFF0C;&#x8FD0;&#x884C;&#x5728;Jing&#x7684;&#x684C;&#x9762;&#x7535;&#x8111;&#x4E0A;&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x5C06;&#x533A;&#x5757;&#x5934;&#x4FE1;&#x606F;&#x4F20;&#x9001;&#x7ED9;&#x8FD9;&#x4E9B;&#x786C;&#x4EF6;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x4EE5;&#x6BCF;&#x79D2;&#x4EBF;&#x4E07;&#x6B21;&#x7684;&#x901F;&#x5EA6;&#x8FDB;&#x884C;nonce&#x6D4B; &#x8BD5;&#x3002;</p>
<p>&#x200B;&#x5728;&#x5BF9;&#x533A;&#x5757;277,316&#x7684;&#x6316;&#x77FF;&#x5DE5;&#x4F5C;&#x5F00;&#x59CB;&#x5927;&#x6982;11&#x5206;&#x949F;&#x540E;&#xFF0C;&#x8FD9;&#x4E9B;&#x786C;&#x4EF6;&#x91CC;&#x7684;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6C42;&#x5F97;&#x4E86;&#x89E3;&#x5E76;&#x53D1;&#x56DE;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x3002;&#x5F53;&#x628A;&#x8FD9;&#x4E2A;&#x7ED3;&#x679C;&#x653E;&#x8FDB; &#x533A;&#x5757;&#x5934;&#x65F6;&#xFF0C;nonce 4,215,469,401 &#x5C31;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x54C8;&#x5E0C;&#x503C;&#xFF1A;</p>
<pre><code>0000000000000002a7bbd25a417c0374cc55261021e8a9ca74442b01284f0569
</code></pre><p>&#x800C;&#x8FD9;&#x4E2A;&#x503C;&#x5C0F;&#x4E8E;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x503C;&#xFF1A;</p>
<pre><code>0000000000000003A30C00000000000000000000000000000000000000000000
</code></pre><p>&#x200B;Jing&#x7684;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x7ACB;&#x523B;&#x5C06;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x53D1;&#x7ED9;&#x5B83;&#x7684;&#x6240;&#x6709;&#x76F8;&#x90BB;&#x8282;&#x70B9;&#x3002;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x5728;&#x63A5;&#x6536;&#x5E76;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x540E;&#xFF0C;&#x4E5F;&#x4F1A;&#x7EE7;&#x7EED;&#x4F20;&#x64AD;&#x6B64;&#x533A;&#x5757;&#x3002;&#x5F53;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x6269;&#x6563;&#x65F6;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x5C06;&#x5B83;&#x4F5C;&#x4E3A;&#x533A;&#x5757;277,316&#x52A0;&#x5230;&#x81EA;&#x8EAB;&#x8282;&#x70B9;&#x7684;&#x533A;&#x5757;&#x94FE;&#x526F;&#x672C;&#x4E2D;&#x3002;&#x5F53;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x6536;&#x5230;&#x5E76;&#x9A8C;&#x8BC1;&#x4E86;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x540E;&#xFF0C;&#x5B83;&#x4EEC;&#x4F1A;&#x653E;&#x5F03;&#x4E4B;&#x524D;&#x5BF9;&#x6784;&#x5EFA;&#x8FD9;&#x4E2A;&#x76F8; &#x540C;&#x9AD8;&#x5EA6;&#x533A;&#x5757;&#x7684;&#x8BA1;&#x7B97;&#xFF0C;&#x5E76;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x4E0B;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x200B;&#x4E0B;&#x8282;&#x5C06;&#x4ECB;&#x7ECD;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x3001;&#x6700;&#x957F;&#x94FE;&#x9009;&#x62E9;&#x3001;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#xFF0C;&#x5E76;&#x4EE5;&#x6B64;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x533A;&#x5757;&#x94FE;&#x7684;&#x8FC7;&#x7A0B;&#x3002;</p>
<h2 id="109-&#x6821;&#x9A8C;&#x65B0;&#x533A;&#x5757;">10.9 &#x6821;&#x9A8C;&#x65B0;&#x533A;&#x5757;</h2>
<p>&#x200B;&#x6BD4;&#x7279;&#x5E01;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x7684;&#x7B2C;&#x4E09;&#x6B65;&#x662F;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#x6BCF;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x3002;&#x5F53;&#x65B0;&#x533A;&#x5757;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#x65F6;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5728;&#x5C06;&#x5B83;&#x8F6C;&#x53D1;&#x5230;&#x5176;&#x8282;&#x70B9;&#x4E4B;&#x524D;&#xFF0C;&#x4F1A;&#x8FDB;&#x884C;&#x4E00;&#x7CFB;&#x5217;&#x7684;&#x6D4B;&#x8BD5;&#x53BB;&#x9A8C;&#x8BC1;&#x5B83;&#x3002;&#x8FD9;&#x786E;&#x4FDD;&#x4E86;&#x53EA;&#x6709;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x4F1A;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x4F20;&#x64AD;&#x3002;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#x8FD8;&#x786E;&#x4FDD;&#x4E86;&#x8BDA;&#x5B9E; &#x7684;&#x77FF;&#x5DE5;&#x751F;&#x6210;&#x7684;&#x533A;&#x5757;&#x53EF;&#x4EE5;&#x88AB;&#x7EB3;&#x5165;&#x5230;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x4ECE;&#x800C;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#x3002;&#x884C;&#x4E3A;&#x4E0D;&#x8BDA;&#x5B9E;&#x7684;&#x77FF;&#x5DE5;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x5C06;&#x88AB;&#x62D2;&#x7EDD;&#xFF0C;&#x8FD9;&#x4E0D;&#x4F46;&#x4F7F;&#x4ED6;&#x4EEC;&#x5931; &#x53BB;&#x4E86;&#x5956;&#x52B1;&#xFF0C;&#x800C;&#x4E14;&#x4E5F;&#x6D6A;&#x8D39;&#x4E86;&#x672C;&#x6765;&#x53EF;&#x4EE5;&#x53BB;&#x5BFB;&#x627E;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x89E3;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x800C;&#x5BFC;&#x81F4;&#x5176;&#x7535;&#x8D39;&#x4E8F;&#x635F;&#x3002;</p>
<p>&#x200B;&#x5F53;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5B83;&#x5C06;&#x5BF9;&#x7167;&#x4E00;&#x4E2A;&#x957F;&#x957F;&#x7684;&#x6807;&#x51C6;&#x6E05;&#x5355;&#x5BF9;&#x8BE5;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#xFF0C;&#x82E5;&#x6CA1;&#x6709;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#xFF0C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x5C06;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x8FD9;&#x4E9B;&#x6807;&#x51C6;&#x53EF;&#x4EE5;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5BA2;&#x6237;&#x7AEF;&#x7684;CheckBlock&#x51FD;&#x6570;&#x548C;CheckBlockHead&#x51FD;&#x6570;&#x4E2D;&#x83B7;&#x5F97;&#xFF0C;</p>
<p>&#x5B83;&#x5305;&#x62EC;&#xFF1A;</p>
<p>&#x25B7; &#x533A;&#x5757;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x8BED;&#x6CD5;&#x4E0A;&#x6709;&#x6548;</p>
<p>&#x25B7; &#x533A;&#x5757;&#x5934;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#x5C0F;&#x4E8E;&#x76EE;&#x6807;&#x96BE;&#x5EA6;&#xFF08;&#x786E;&#x8BA4;&#x5305;&#x542B;&#x8DB3;&#x591F;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF09;</p>
<p>&#x25B7; &#x533A;&#x5757;&#x65F6;&#x95F4;&#x6233;&#x65E9;&#x4E8E;&#x9A8C;&#x8BC1;&#x65F6;&#x523B;&#x672A;&#x6765;&#x4E24;&#x4E2A;&#x5C0F;&#x65F6;&#xFF08;&#x5141;&#x8BB8;&#x65F6;&#x95F4;&#x9519;&#x8BEF;&#xFF09;</p>
<p>&#x25B7; &#x533A;&#x5757;&#x5927;&#x5C0F;&#x5728;&#x957F;&#x5EA6;&#x9650;&#x5236;&#x4E4B;&#x5185;</p>
<p>&#x25B7; &#x7B2C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF08;&#x4E14;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#xFF09;&#x662F;coinbase&#x4EA4;&#x6613;</p>
<p>&#x25B7; &#x4F7F;&#x7528;&#x68C0;&#x67E5;&#x6E05;&#x5355;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x5185;&#x7684;&#x4EA4;&#x6613;&#x5E76;&#x786E;&#x4FDD;&#x5B83;&#x4EEC;&#x7684;&#x6709;&#x6548;&#x6027;</p>
<p>&#x53C2;&#x89C1;&#x4E4B;&#x524D;&#x7AE0;&#x8282; &#x201C;&#x4EA4;&#x6613;&#x7684;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#x201D;&#x4E00;&#x8282;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x8FC7;&#x8FD9;&#x4E2A;&#x6E05;&#x5355;&#x3002;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x5BF9;&#x6BCF;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x7684;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#xFF0C;&#x786E;&#x4FDD;&#x4E86;&#x77FF;&#x5DE5;&#x65E0;&#x6CD5;&#x6B3A;&#x8BC8;&#x3002;&#x5728;&#x524D;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E86;&#x77FF;&#x5DE5;&#x4EEC;&#x5982;&#x4F55;&#x53BB;&#x8BB0;&#x5F55;&#x4E00;&#x7B14;&#x4EA4; &#x6613;&#xFF0C;&#x4EE5;&#x83B7;&#x5F97;&#x5728;&#x6B64;&#x533A;&#x5757;&#x4E2D;&#x521B;&#x9020;&#x7684;&#x65B0;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x4EA4;&#x6613;&#x8D39;&#x3002;&#x4E3A;&#x4EC0;&#x4E48;&#x77FF;&#x5DE5;&#x4E0D;&#x4E3A;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x8BB0;&#x5F55;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x53BB;&#x83B7;&#x5F97;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF1F;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x6839;&#x636E;&#x76F8;&#x540C;&#x7684;&#x89C4;&#x5219;&#x5BF9;&#x533A;&#x5757;&#x8FDB;&#x884C;&#x6821;&#x9A8C;&#x3002;&#x4E00;&#x4E2A;&#x65E0;&#x6548;&#x7684;coinbase&#x4EA4;&#x6613;&#x5C06;&#x4F7F;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x65E0;&#x6548;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x8BE5;&#x533A;&#x5757;&#x88AB;&#x62D2; &#x7EDD;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x5C31;&#x4E0D;&#x4F1A;&#x6210;&#x4E3A;&#x603B;&#x8D26;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x77FF;&#x5DE5;&#x4EEC;&#x5FC5;&#x987B;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x5B8C;&#x7F8E;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x57FA;&#x4E8E;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5171;&#x4EAB;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x5E76;&#x4E14;&#x6839;&#x636E;&#x6B63; &#x786E;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x8FDB;&#x884C;&#x6316;&#x77FF;&#xFF0C;&#x4ED6;&#x4EEC;&#x8981;&#x82B1;&#x8D39;&#x5927;&#x91CF;&#x7684;&#x7535;&#x529B;&#x6316;&#x77FF;&#x624D;&#x80FD;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x4F5C;&#x5F0A;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x7535;&#x529B;&#x548C;&#x52AA;&#x529B;&#x90FD; &#x4F1A;&#x6D6A;&#x8D39;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x72EC;&#x7ACB;&#x6821;&#x9A8C;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5171;&#x8BC6;&#x7684;&#x91CD;&#x8981;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#x3002;</p>
<h2 id="1010-&#x533A;&#x5757;&#x94FE;&#x7684;&#x7EC4;&#x88C5;&#x4E0E;&#x9009;&#x62E9;">10.10 &#x533A;&#x5757;&#x94FE;&#x7684;&#x7EC4;&#x88C5;&#x4E0E;&#x9009;&#x62E9;</h2>
<p>&#x200B;&#x6BD4;&#x7279;&#x5E01;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x7684;&#x6700;&#x540E;&#x4E00;&#x6B65;&#x662F;&#x5C06;&#x533A;&#x5757;&#x96C6;&#x5408;&#x81F3;&#x6709;&#x6700;&#x5927;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x94FE;&#x4E2D;&#x3002;&#x4E00;&#x65E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x9A8C;&#x8BC1;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#xFF0C; &#x5B83;&#x5C06;&#x5C1D;&#x8BD5;&#x5C06;&#x65B0;&#x7684;&#x533A;&#x5757;&#x8FDE;&#x63A5;&#x5230;&#x5230;&#x73B0;&#x5B58;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x7EC4;&#x88C5;&#x8D77;&#x6765;&#x3002;</p>
<p>&#x8282;&#x70B9;&#x7EF4;&#x62A4;&#x4E09;&#x79CD;&#x533A;&#x5757;&#xFF1A;&#x7B2C;&#x4E00;&#x79CD;&#x662F;&#x8FDE;&#x63A5;&#x5230;&#x4E3B;&#x94FE;&#x4E0A;&#x7684;&#xFF0C;&#x7B2C;&#x4E8C;&#x79CD;&#x662F;&#x4ECE;&#x4E3B;&#x94FE;&#x4E0A;&#x4EA7;&#x751F;&#x5206;&#x652F;&#x7684;&#xFF08;&#x5907;&#x7528;&#x94FE;&#xFF09;&#xFF0C;&#x6700;&#x540E;&#x4E00;&#x79CD;&#x662F;&#x5728;&#x5DF2;&#x77E5;&#x94FE;&#x4E2D;&#x6CA1;&#x6709; &#x627E;&#x5230;&#x5DF2;&#x77E5;&#x7236;&#x533A;&#x5757;&#x7684;&#x3002;&#x5728;&#x9A8C;&#x8BC1;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4E00;&#x65E6;&#x53D1;&#x73B0;&#x6709;&#x4E0D;&#x7B26;&#x5408;&#x6807;&#x51C6;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x9A8C;&#x8BC1;&#x5C31;&#x4F1A;&#x5931;&#x8D25;&#xFF0C;&#x8FD9;&#x6837;&#x533A;&#x5757;&#x4F1A;&#x88AB;&#x8282;&#x70B9;&#x62D2;&#x7EDD;&#xFF0C;&#x6240;&#x4EE5;&#x4E5F;&#x4E0D; &#x4F1A;&#x52A0;&#x5165;&#x5230;&#x4EFB;&#x4F55;&#x4E00;&#x6761;&#x94FE;&#x4E2D;&#x3002;</p>
<p>&#x200B;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x4E3B;&#x94FE;&#x90FD;&#x662F;&#x7D2F;&#x8BA1;&#x4E86;&#x6700;&#x591A;&#x96BE;&#x5EA6;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5728;&#x4E00;&#x822C;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x4E3B;&#x94FE;&#x4E5F;&#x662F;&#x5305;&#x542B;&#x6700;&#x591A;&#x533A;&#x5757;&#x7684;&#x90A3;&#x4E2A;&#x94FE;&#xFF0C;&#x9664;&#x975E;&#x6709;&#x4E24;&#x4E2A;&#x7B49;&#x957F;&#x7684;&#x94FE; &#x5E76;&#x4E14;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x6709;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x3002;&#x4E3B;&#x94FE;&#x4E5F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x5206;&#x652F;&#xFF0C;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x4E2D;&#x7684;&#x533A;&#x5757;&#x4E0E;&#x4E3B;&#x94FE;&#x4E0A;&#x7684;&#x533A;&#x5757;&#x4E92;&#x4E3A;&#x201C;&#x5144;&#x5F1F;&#x201D;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x4E9B;&#x533A; &#x5757;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x4E0D;&#x662F;&#x4E3B;&#x94FE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002; &#x4FDD;&#x7559;&#x8FD9;&#x4E9B;&#x5206;&#x652F;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5982;&#x679C;&#x5728;&#x672A;&#x6765;&#x7684;&#x67D0;&#x4E2A;&#x65F6;&#x523B;&#x5B83;&#x4EEC;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x5EF6;&#x957F;&#x4E86;&#x5E76;&#x5728;&#x96BE;&#x5EA6;&#x503C;&#x4E0A;&#x8D85; &#x8FC7;&#x4E86;&#x4E3B;&#x94FE;&#xFF0C;&#x90A3;&#x4E48;&#x540E;&#x7EED;&#x7684;&#x533A;&#x5757;&#x5C31;&#x4F1A;&#x5F15;&#x7528;&#x5B83;&#x4EEC;&#x3002;&#x5728;&#x201C;10.10.1 &#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x770B;&#x5230;&#x5728;&#x540C;&#x6837;&#x7684;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#xFF0C;&#x51E0;&#x4E4E;&#x540C;&#x65F6;&#x6316;&#x51FA;&#x533A; &#x5757;&#x65F6;&#xFF0C;&#x5019;&#x9009;&#x94FE;&#x662F;&#x5982;&#x4F55;&#x4EA7;&#x751F;&#x7684;&#x3002;</p>
<p>&#x200B;&#x5F53;&#x8282;&#x70B9;&#x63A5;&#x6536;&#x5230;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x5B83;&#x4F1A;&#x5C1D;&#x8BD5;&#x5C06;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x63D2;&#x5165;&#x5230;&#x73B0;&#x6709;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x8282;&#x70B9;&#x4F1A;&#x770B;&#x4E00;&#x4E0B;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x201C;previous block hash&#x201D;&#x5B57; &#x6BB5;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B57;&#x6BB5;&#x662F;&#x8BE5;&#x533A;&#x5757;&#x5BF9;&#x5176;&#x7236;&#x533A;&#x5757;&#x7684;&#x5F15;&#x7528;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x65B0;&#x7684;&#x8282;&#x70B9;&#x5C06;&#x5C1D;&#x8BD5;&#x5728;&#x5DF2;&#x5B58;&#x5728;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x627E;&#x51FA;&#x8FD9;&#x4E2A;&#x7236;&#x533A;&#x5757;&#x3002;&#x5927;&#x591A;&#x6570;&#x60C5;&#x51B5; &#x4E0B;&#xFF0C;&#x7236;&#x533A;&#x5757;&#x662F;&#x4E3B;&#x5757;&#x94FE;&#x7684;&#x201C;&#x9876;&#x70B9;&#x201D;&#xFF0C;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8FD9;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x5EF6;&#x957F;&#x4E86;&#x4E3B;&#x94FE;&#x3002;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x533A;&#x5757;&#x2014;&#x2014;&#x533A;&#x5757;277,316&#x5F15;&#x7528; &#x4E86;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#x2014;&#x2014;&#x533A;&#x5757;277,315&#x3002;&#x6536;&#x5230;277316&#x533A;&#x5757;&#x7684;&#x5927;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x90FD;&#x5DF2;&#x7ECF;&#x5C06;277315&#x6700;&#x4E3A;&#x4E3B;&#x94FE;&#x7684;&#x9876;&#x7AEF;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8FDE;&#x63A5;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x5E76;&#x5EF6;&#x957F;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
<p>&#x200B;&#x6709;&#x65F6;&#x5019;&#xFF0C;&#x65B0;&#x533A;&#x5757;&#x6240;&#x5EF6;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5E76;&#x4E0D;&#x662F;&#x4E3B;&#x94FE;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x201C;10.10.1 &#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x201D;&#x4E2D;&#x770B;&#x5230;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8282;&#x70B9;&#x5C06;&#x65B0;&#x7684;&#x533A;&#x5757;&#x6DFB;&#x52A0;&#x5230;&#x5907;&#x7528;&#x94FE;&#xFF0C;&#x540C;&#x65F6;&#x6BD4;&#x8F83;&#x5907;&#x7528;&#x94FE;&#x4E0E;&#x4E3B;&#x94FE;&#x7684;&#x96BE;&#x5EA6;&#x3002;&#x5982;&#x679C;&#x5907;&#x7528;&#x94FE;&#x6BD4;&#x4E3B;&#x94FE;&#x79EF;&#x7D2F;&#x4E86;&#x66F4;&#x591A;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x8282;&#x70B9;&#x5C06;&#x6536;&#x655B;&#x4E8E;&#x5907;&#x7528;&#x94FE;&#xFF0C;&#x610F;&#x5473; &#x7740;&#x8282;&#x70B9;&#x5C06;&#x9009;&#x62E9;&#x5907;&#x7528;&#x94FE;&#x4F5C;&#x4E3A;&#x5176;&#x65B0;&#x7684;&#x4E3B;&#x94FE;&#xFF0C;&#x800C;&#x4E4B;&#x524D;&#x90A3;&#x4E2A;&#x8001;&#x7684;&#x4E3B;&#x94FE;&#x5219;&#x6210;&#x4E3A;&#x4E86;&#x5907;&#x7528;&#x94FE;&#x3002;&#x5982;&#x679C;&#x8282;&#x70B9;&#x662F;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#xFF0C;&#x5B83;&#x5C06;&#x5F00;&#x59CB;&#x6784;&#x9020;&#x65B0;&#x7684; &#x533A;&#x5757;&#xFF0C;&#x6765;&#x5EF6;&#x957F;&#x8FD9;&#x4E2A;&#x66F4;&#x65B0;&#x66F4;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;</p>
<p>&#x200B;&#x5982;&#x679C;&#x8282;&#x70B9;&#x6536;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x5728;&#x73B0;&#x6709;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x5374;&#x672A;&#x627E;&#x5230;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x5B64;&#x5757;&#x201D;&#x3002;&#x5B64;&#x5757;&#x4F1A;&#x88AB; &#x4FDD;&#x5B58;&#x5728;&#x5B64;&#x5757;&#x6C60;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x5B83;&#x4EEC;&#x7684;&#x7236;&#x533A;&#x5757;&#x88AB;&#x8282;&#x70B9;&#x6536;&#x5230;&#x3002;&#x4E00;&#x65E6;&#x6536;&#x5230;&#x4E86;&#x7236;&#x533A;&#x5757;&#x5E76;&#x4E14;&#x5C06;&#x5176;&#x8FDE;&#x63A5;&#x5230;&#x73B0;&#x6709;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#xFF0C;&#x8282;&#x70B9;&#x5C31;&#x4F1A;&#x5C06;&#x5B64;&#x5757;&#x4ECE; &#x5B64;&#x5757;&#x6C60;&#x4E2D;&#x53D6;&#x51FA;&#xFF0C;&#x5E76;&#x4E14;&#x8FDE;&#x63A5;&#x5230;&#x5B83;&#x7684;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x8BA9;&#x5B83;&#x4F5C;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x3002;&#x5F53;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x5728;&#x5F88;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x95F4;&#x9694;&#x5185;&#x88AB;&#x6316;&#x51FA;&#x6765;&#xFF0C;&#x8282;&#x70B9;&#x6709; &#x53EF;&#x80FD;&#x4F1A;&#x4EE5;&#x76F8;&#x53CD;&#x7684;&#x987A;&#x5E8F;&#x63A5;&#x6536;&#x5230;&#x5B83;&#x4EEC;&#xFF0C;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x5B64;&#x5757;&#x73B0;&#x8C61;&#x5C31;&#x4F1A;&#x51FA;&#x73B0;&#x3002;</p>
<p>&#x9009;&#x62E9;&#x4E86;&#x6700;&#x5927;&#x96BE;&#x5EA6;&#x7684;&#x533A;&#x5757;&#x94FE;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x6700;&#x7EC8;&#x5728;&#x5168;&#x7F51;&#x8303;&#x56F4;&#x5185;&#x8FBE;&#x6210;&#x5171;&#x8BC6;&#x3002;&#x968F;&#x7740;&#x66F4;&#x591A;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x88AB;&#x6DFB;&#x52A0;&#x5230;&#x94FE;&#x4E2D;&#xFF0C;&#x94FE;&#x7684;&#x6682;&#x65F6; &#x6027;&#x5DEE;&#x5F02;&#x6700;&#x7EC8;&#x4F1A;&#x5F97;&#x5230;&#x89E3;&#x51B3;&#x3002;&#x6316;&#x77FF;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x201C;&#x6295;&#x7968;&#x201D;&#x6765;&#x9009;&#x62E9;&#x5B83;&#x4EEC;&#x60F3;&#x8981;&#x5EF6;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5F53;&#x5B83;&#x4EEC;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x65B0;&#x5757;&#x5E76;&#x4E14;&#x5EF6;&#x957F;&#x4E86;&#x4E00;&#x4E2A;&#x94FE;&#xFF0C; &#x65B0;&#x5757;&#x672C;&#x8EAB;&#x5C31;&#x4EE3;&#x8868;&#x5B83;&#x4EEC;&#x7684;&#x6295;&#x7968;&#x3002;</p>
<p>&#x200B;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x94FE;&#x4E4B;&#x95F4;&#x662F;&#x5B58;&#x5728;&#x5DEE;&#x5F02;&#x7684;&#xFF0C;&#x4E0B;&#x8282;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x8282;&#x70B9;&#x662F;&#x600E;&#x6837;&#x901A;&#x8FC7;&#x72EC;&#x7ACB;&#x9009;&#x62E9;&#x6700;&#x957F;&#x96BE;&#x5EA6;&#x94FE;&#x6765;&#x89E3;&#x51B3;&#x8FD9;&#x79CD;&#x5DEE;&#x5F02;&#x7684;&#x3002;</p>
<h3 id="10101-&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;">10.10.1 &#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;</h3>
<p>&#x56E0;&#x4E3A;&#x533A;&#x5757;&#x94FE;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF0C;&#x6240;&#x4EE5;&#x4E0D;&#x540C;&#x526F;&#x672C;&#x4E4B;&#x95F4;&#x4E0D;&#x80FD;&#x603B;&#x662F;&#x4FDD;&#x6301;&#x4E00;&#x81F4;&#x3002;&#x533A;&#x5757;&#x6709;&#x53EF;&#x80FD;&#x5728;&#x4E0D;&#x540C;&#x65F6;&#x95F4;&#x5230;&#x8FBE;&#x4E0D;&#x540C;&#x8282;&#x70B9;&#xFF0C;&#x5BFC;&#x81F4;&#x8282;&#x70B9;&#x6709;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5168;&#x8C8C;&#x3002;&#x89E3;&#x51B3;&#x7684;&#x529E;&#x6CD5;&#x662F;&#xFF0C;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x603B;&#x662F;&#x9009;&#x62E9;&#x5E76;&#x5C1D;&#x8BD5;&#x5EF6;&#x957F;&#x4EE3;&#x8868;&#x7D2F;&#x8BA1;&#x4E86;&#x6700;&#x5927;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x4E5F;&#x5C31; &#x662F;&#x6700;&#x957F;&#x7684;&#x6216;&#x6700;&#x5927;&#x7D2F;&#x8BA1;&#x5DE5;&#x4F5C;&#x7684;&#x94FE;&#xFF08;greatest cumulative work chain&#xFF09;&#x3002;&#x8282;&#x70B9;&#x901A;&#x8FC7;&#x7D2F;&#x52A0;&#x94FE;&#x4E0A;&#x7684;&#x6BCF;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#xFF0C;&#x5F97;&#x5230;&#x5EFA;&#x7ACB;&#x8FD9;&#x4E2A;&#x94FE;&#x6240;&#x8981;&#x4ED8;&#x51FA;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x603B;&#x91CF;&#x3002;&#x53EA;&#x8981;&#x6240;&#x6709;&#x7684;&#x8282;&#x70B9;&#x9009;&#x62E9;&#x6700;&#x957F;&#x7D2F;&#x8BA1;&#x5DE5;&#x4F5C;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6700;&#x7EC8;&#x4F1A;&#x6536;&#x655B;&#x5230;&#x4E00;&#x81F4;&#x7684;&#x72B6;&#x6001;&#x3002;&#x5206;&#x53C9;&#x5373;&#x5728;&#x4E0D;&#x540C;&#x533A;&#x5757;&#x94FE;&#x95F4;&#x53D1;&#x751F;&#x7684;&#x4E34;&#x65F6;&#x5DEE;&#x5F02;&#xFF0C;&#x5F53;&#x66F4;&#x591A;&#x7684;&#x533A;&#x5757;&#x6DFB;&#x52A0;&#x5230;&#x4E86;&#x67D0;&#x4E2A;&#x5206;&#x53C9;&#x4E2D;&#xFF0C;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x4FBF;&#x4F1A;&#x8FCE;&#x5203;&#x800C;&#x89E3;&#x3002;</p>
<p>&#x200B;<strong>&#x63D0;&#x793A;</strong>&#x7531;&#x4E8E;&#x5168;&#x7403;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4F20;&#x8F93;&#x5EF6;&#x8FDF;&#xFF0C;&#x672C;&#x8282;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x81EA;&#x52A8;&#x4F1A;&#x53D1;&#x751F;&#x3002; &#x6211;&#x4EEC;&#x4E5F;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7A0D;&#x540E;&#x518D;&#x770B;&#x770B;&#x6545;&#x610F;&#x5F15;&#x8D77;&#x7684;&#x5206;&#x53C9;&#x3002;</p>
<p>&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x51E0;&#x4E2A;&#x56FE;&#x8868;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x8DDF;&#x8E2A;&#x201C;fork&#x201D;&#x4E8B;&#x4EF6;&#x7684;&#x8FDB;&#x5C55;&#x3002; &#x8BE5;&#x56FE;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x7B80;&#x5316;&#x8868;&#x793A;&#x3002; &#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x63CF;&#x8FF0;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x5757;&#x88AB;&#x663E;&#x793A;&#x4E3A;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x72B6;&#xFF08;&#x661F;&#x5F62;&#xFF0C;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x5012;&#x7F6E;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x83F1;&#x5F62;&#xFF09;&#xFF0C;&#x904D;&#x5E03;&#x7F51;&#x7EDC;&#x3002; &#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x6BCF;&#x4E2A;&#x5706;&#x8868;&#x793A;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x6709;&#x81EA;&#x5DF1;&#x7684;&#x5168;&#x5C40;&#x533A;&#x5757;&#x94FE;&#x89C6;&#x56FE;&#x3002; &#x5F53;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x4ECE;&#x5176;&#x90BB;&#x5C45;&#x63A5;&#x6536;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x66F4;&#x65B0;&#x5176;&#x81EA;&#x5DF1;&#x7684;&#x533A;&#x5757;&#x94FE;&#x526F;&#x672C;&#xFF0C;&#x9009;&#x62E9;&#x6700;&#x5927;&#x7D2F;&#x79EF;&#x5DE5;&#x4F5C;&#x94FE;&#x3002; &#x4E3A;&#x4FBF;&#x4E8E;&#x63CF;&#x8FF0;&#xFF0C;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5305;&#x542B;&#x4E00;&#x4E2A;&#x56FE;&#x5F62;&#x5F62;&#x72B6;&#xFF0C;&#x8868;&#x793A;&#x5B83;&#x76F8;&#x4FE1;&#x7684;&#x533A;&#x5757;&#x5904;&#x4E8E;&#x4E3B;&#x94FE;&#x7684;&#x9876;&#x7AEF;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x8282;&#x70B9;&#x91CC;&#x9762;&#x770B;&#x5230;&#x661F;&#x5F62;&#xFF0C;&#x90A3;&#x5C31;&#x610F;&#x5473;&#x7740;&#x8BE5;&#x8282;&#x70B9;&#x8BA4;&#x4E3A;&#x661F;&#x5F62;&#x533A;&#x5757;&#x5904;&#x4E8E;&#x4E3B;&#x94FE;&#x7684;&#x9876;&#x7AEF;&#x3002;</p>
<p>&#x5728;&#x7B2C;&#x4E00;&#x5F20;&#x56FE;&#xFF08;&#x56FE;10-2&#xFF09;&#x4E2D;&#xFF0C;&#x7F51;&#x7EDC;&#x6709;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x533A;&#x5757;&#x94FE;&#x89C6;&#x89D2;&#xFF0C;&#x4EE5;&#x661F;&#x5F62;&#x533A;&#x5757;&#x4E3A;&#x4E3B;&#x94FE;&#x7684;&#x201C;&#x9876;&#x70B9;&#x201D;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-e8e7c3fd9aea73a2.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-2</p>
<p>&#x200B;&#x5F53;&#x6709;&#x4E24;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#x540C;&#x65F6;&#x60F3;&#x8981;&#x5EF6;&#x957F;&#x6700;&#x957F;&#x533A;&#x5757;&#x94FE;&#x65F6;&#xFF0C;&#x5206;&#x53C9;&#x4E8B;&#x4EF6;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x3002;&#x6B63;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5206;&#x53C9;&#x53D1;&#x751F;&#x5728;&#x4E24;&#x540D;&#x77FF;&#x5DE5;&#x5728;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4; &#x5185;&#xFF0C;&#x5404;&#x81EA;&#x90FD;&#x7B97;&#x5F97;&#x4E86;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x89E3;&#x7684;&#x65F6;&#x5019;&#x3002;&#x4E24;&#x4E2A;&#x77FF;&#x5DE5;&#x5728;&#x5404;&#x81EA;&#x7684;&#x5019;&#x9009;&#x533A;&#x5757;&#x4E00;&#x53D1;&#x73B0;&#x89E3;&#xFF0C;&#x4FBF;&#x7ACB;&#x5373;&#x4F20;&#x64AD;&#x81EA;&#x5DF1;&#x7684;&#x201C;&#x83B7;&#x80DC;&#x201D;&#x533A;&#x5757;&#x5230;&#x7F51;&#x7EDC; &#x4E2D;&#xFF0C;&#x5148;&#x662F;&#x4F20;&#x64AD;&#x7ED9;&#x90BB;&#x8FD1;&#x7684;&#x8282;&#x70B9;&#x800C;&#x540E;&#x4F20;&#x64AD;&#x5230;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x3002;&#x6BCF;&#x4E2A;&#x6536;&#x5230;&#x6709;&#x6548;&#x533A;&#x5757;&#x7684;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x5C06;&#x5176;&#x5E76;&#x5165;&#x5E76;&#x5EF6;&#x957F;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5982;&#x679C;&#x8BE5;&#x8282;&#x70B9;&#x5728; &#x968F;&#x540E;&#x53C8;&#x6536;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x53C8;&#x62E5;&#x6709;&#x540C;&#x6837;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x8282;&#x70B9;&#x4F1A;&#x5C06;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x8FDE;&#x63A5;&#x5230;&#x5019;&#x9009;&#x94FE;&#x4E0A;&#x3002;&#x5176;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x4E00; &#x4E9B;&#x8282;&#x70B9;&#x6536;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x6536;&#x5230;&#x4E86;&#x53E6;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x65F6;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7248;&#x672C;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5C31;&#x51FA;&#x73B0;&#x4E86;&#x3002;&#x5728;&#x56FE;10-3&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x77FF;&#x5DE5;&#xFF08;NodeX&#x548C;NodeY&#xFF09;&#x51E0;&#x4E4E;&#x540C;&#x65F6;&#x6316;&#x5230;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x9876;&#x70B9;&#x533A;&#x5757;&#x2014;&#x2014;&#x661F;&#x5F62;&#x533A;&#x5757;&#x7684;&#x5B50;&#x533A;&#x5757;&#xFF0C;&#x53EF;&#x4EE5; &#x5EF6;&#x957F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x3002;&#x4E3A;&#x4E86;&#x65B9;&#x4FBF;&#x67E5;&#x770B;&#xFF0C;&#x6211;&#x4EEC;&#x628A;&#x8282;&#x70B9;X&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x6807;&#x8BB0;&#x4E3A;&#x4E09;&#x89D2;&#x5F62;&#xFF0C;&#x628A;&#x8282;&#x70B9;Y&#x751F;&#x4EA7;&#x7684;&#x533A;&#x5757;&#x6807;&#x8BB0;&#x4E3A;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-7eb26bd9bb741ebd.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-3</p>
<p>&#x200B;&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x77FF;&#x5DE5;&#x8282;&#x70B9;X&#x627E;&#x5230;&#x6269;&#x5C55;&#x533A;&#x5757;&#x94FE;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x89E3;&#xFF0C;&#x5373;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#xFF0C;&#x6784;&#x5EFA;&#x5728;&#x661F;&#x5F62;&#x7236;&#x533A;&#x5757;&#x7684;&#x9876;&#x7AEF;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x540C;&#x6837;&#x8FDB;&#x884C;&#x661F;&#x5F62;&#x533A;&#x5757;&#x6269;&#x5C55;&#x7684;&#x8282;&#x70B9;Y&#x4E5F;&#x627E;&#x5230;&#x4E86;&#x6269;&#x5C55;&#x533A;&#x5757;&#x94FE;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x89E3;&#xFF0C;&#x5373;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x5019;&#x9009;&#x533A;&#x5757;&#x3002;&#x73B0;&#x5728;&#x6709;&#x4E24;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x5757;&#xFF0C;&#x8282;&#x70B9;X&#x7684;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x548C;&#x8282;&#x70B9;Y&#x7684;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#xFF0C;&#x8FD9;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5747;&#x5305;&#x542B;&#x6709;&#x6548;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x89E3;&#x5E76;&#x5EF6;&#x957F;&#x540C;&#x4E00; &#x4E2A;&#x7236;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x53EF;&#x80FD;&#x5305;&#x542B;&#x4E86;&#x51E0;&#x4E4E;&#x76F8;&#x540C;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x53EA;&#x662F;&#x5728;&#x4EA4;&#x6613;&#x7684;&#x6392;&#x5E8F;&#x4E0A;&#x6709;&#x4E9B;&#x8BB8;&#x4E0D;&#x540C;&#x3002;</p>
<p>&#x200B;&#x5F53;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x5F00;&#x59CB;&#x5728;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#x65F6;&#xFF0C;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x9996;&#x5148;&#x63A5;&#x6536;&#x5230;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#xFF0C;&#x53E6;&#x5916;&#x4E00;&#x4E9B;&#x8282;&#x70B9;&#x9996;&#x5148;&#x63A5;&#x6536;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x3002;&#x5982;&#x4E0B;&#x56FE;10-4&#x6240;&#x793A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E0A;&#x7684;&#x8282;&#x70B9;&#x5BF9;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x9876;&#x70B9;&#x4EA7;&#x751F;&#x4E86;&#x5206;&#x6B67;&#xFF0C;&#x4E00;&#x6D3E;&#x4EE5;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x4E3A;&#x9876;&#x70B9;&#xFF0C;&#x800C;&#x53E6;&#x4E00;&#x6D3E;&#x4EE5;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x4E3A;&#x9876;&#x70B9;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4590443fa1d0f846.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-4</p>
<p>&#x200B;&#x5728;&#x56FE;&#x4E2D;&#xFF0C;&#x5047;&#x8BBE;&#x8282;&#x70B9;X&#x9996;&#x5148;&#x63A5;&#x6536;&#x5230;&#x4E09;&#x89D2;&#x5F62;&#x5757;&#xFF0C;&#x5E76;&#x7528;&#x5B83;&#x6269;&#x5C55;&#x661F;&#x5F62;&#x94FE;&#x3002;&#x8282;&#x70B9;X&#x9009;&#x62E9;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x4E3A;&#x4E3B;&#x94FE;&#x3002;&#x4E4B;&#x540E;&#xFF0C;&#x8282;&#x70B9;X&#x4E5F;&#x6536;&#x5230;&#x5012;&#x4E09;&#x89D2;&#x533A;&#x5757;&#x3002;&#x7531;&#x4E8E;&#x662F;&#x7B2C;&#x4E8C;&#x6B21;&#x6536;&#x5230;&#xFF0C;&#x56E0;&#x6B64;&#x5B83;&#x5224;&#x5B9A;&#x8FD9;&#x4E2A;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x662F;&#x7ADE;&#x4E89;&#x5931;&#x8D25;&#x7684;&#x4EA7;&#x7269;&#xFF0C;&#x8BA4;&#x4E3A;&#x662F;&#x65E0;&#x6548;&#x533A;&#x5757;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x533A;&#x5757;&#x4E0D;&#x4F1A;&#x88AB;&#x4E22;&#x5F03;&#x3002;&#x5B83;&#x88AB;&#x94FE;&#x63A5;&#x5230;&#x661F;&#x5F62;&#x94FE;&#x7684;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x5F62;&#x6210;&#x5907;&#x7528;&#x94FE;&#x3002;&#x867D;&#x7136;&#x8282;&#x70B9;X&#x8BA4;&#x4E3A;&#x81EA;&#x5DF1;&#x5DF2;&#x7ECF;&#x6B63;&#x786E;&#x9009;&#x62E9;&#x4E86;&#x83B7;&#x80DC;&#x94FE;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x8FD8;&#x4F1A;&#x4FDD;&#x5B58;&#x201C;&#x4E22;&#x5931;&#x201D;&#x94FE;&#xFF0C;&#x4F7F;&#x5F97;&#x201C;&#x4E22;&#x5931;&#x201D;&#x94FE;&#x5982;&#x679C;&#x53EF;&#x80FD;&#x6700;&#x7EC8;&#x201C;&#x83B7;&#x80DC;&#x201D;&#xFF0C;&#x5B83;&#x8FD8;&#x5177;&#x6709;&#x91CD;&#x65B0;&#x6253;&#x5305;&#x7684;&#x6240;&#x9700;&#x7684;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x200B;&#x5728;&#x7F51;&#x7EDC;&#x7684;&#x53E6;&#x4E00;&#x7AEF;&#xFF0C;&#x8282;&#x70B9;Y&#x6839;&#x636E;&#x81EA;&#x5DF1;&#x7684;&#x89C6;&#x89D2;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x3002;&#x9996;&#x5148;&#x83B7;&#x5F97;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x9009;&#x62E9;&#x8FD9;&#x6761;&#x94FE;&#x4F5C;&#x4E3A;&#x201C;&#x8D62;&#x5BB6;&#x201D;&#x3002;&#x5F53;&#x5B83;&#x7A0D;&#x540E;&#x6536;&#x5230;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x5B83;&#x4E5F;&#x5C06;&#x4E09;&#x89D2;&#x5F62;&#x533A;&#x5757;&#x8FDE;&#x63A5;&#x5230;&#x661F;&#x5F62;&#x94FE;&#x7684;&#x7236;&#x533A;&#x5757;&#x4F5C;&#x4E3A;&#x5907;&#x7528;&#x94FE;&#x3002;</p>
<p>&#x200B;&#x53CC;&#x65B9;&#x90FD;&#x662F;&#x201C;&#x6B63;&#x786E;&#x7684;&#x201D;&#x6216;&#x201C;&#x4E0D;&#x6B63;&#x786E;&#x7684;&#x201D;&#x3002;&#x4E24;&#x8005;&#x90FD;&#x662F;&#x81EA;&#x5DF1;&#x5173;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x6709;&#x6548;&#x7ACB;&#x573A;&#x3002;&#x53EA;&#x6709;&#x4E8B;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x7406;&#x89E3;&#x8FD9;&#x4E24;&#x4E2A;&#x7ADE;&#x4E89;&#x94FE;&#x5982;&#x4F55;&#x901A;&#x8FC7;&#x989D;&#x5916;&#x7684;&#x5DE5;&#x4F5C;&#x5F97;&#x5230;&#x5EF6;&#x4F38;&#x3002;</p>
<p>&#x8282;&#x70B9;X&#x9635;&#x8425;&#x7684;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x5C06;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x6316;&#x6398;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x4EE5;&#x201C;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x4F5C;&#x4E3A;&#x6269;&#x5C55;&#x533A;&#x5757;&#x94FE;&#x7684;&#x9876;&#x7AEF;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x4E09;&#x89D2;&#x5F62;&#x4F5C;&#x4E3A;&#x5019;&#x9009;&#x533A;&#x5757;&#x7684;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x5B83;&#x4EEC;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x8FDB;&#x884C;&#x6295;&#x7968;&#x3002;&#x5B83;&#x4EEC;&#x7684;&#x6295;&#x7968;&#x6807;&#x660E;&#x652F;&#x6301;&#x81EA;&#x5DF1;&#x9009;&#x62E9;&#x7684;&#x94FE;&#x4E3A;&#x4E3B;&#x94FE;&#x3002;</p>
<p>&#x200B;&#x540C;&#x6837;&#xFF0C;&#x8282;&#x70B9;Y&#x9635;&#x8425;&#x7684;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#xFF0C;&#x5C06;&#x5F00;&#x59CB;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x4EE5;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x4F5C;&#x4E3A;&#x5176;&#x7236;&#x8282;&#x70B9;&#x7684;&#x5019;&#x9009;&#x8282;&#x70B9;&#xFF0C;&#x6269;&#x5C55;&#x5B83;&#x4EEC;&#x8BA4;&#x4E3A;&#x662F;&#x4E3B;&#x94FE;&#x7684;&#x94FE;&#x3002;&#x6BD4;&#x8D5B;&#x518D;&#x6B21;&#x5F00;&#x59CB;&#x3002;&#x5206;&#x53C9;&#x95EE;&#x9898;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5185;&#x5C31;&#x88AB;&#x89E3;&#x51B3;&#x4E86;&#x3002;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x7B97;&#x529B;&#x4E13;&#x6CE8;&#x4E8E;&#x201C;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x533A;&#x5757;&#x4E3A;&#x7236;&#x533A;&#x5757;&#xFF0C;&#x5728;&#x5176;&#x4E4B;&#x4E0A;&#x5EFA;&#x7ACB;&#x65B0;&#x7684;&#x533A; &#x5757;&#xFF1B;&#x53E6;&#x4E00;&#x90E8;&#x5206;&#x7B97;&#x529B;&#x5219;&#x4E13;&#x6CE8;&#x5728;&#x201C;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x533A;&#x5757;&#x4E0A;&#x3002;&#x5373;&#x4FBF;&#x7B97;&#x529B;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x9635;&#x8425;&#x4E2D;&#x5E73;&#x5747;&#x5206;&#x914D;&#xFF0C;&#x4E5F;&#x603B;&#x6709;&#x4E00;&#x4E2A;&#x9635;&#x8425;&#x62A2;&#x5728;&#x53E6;&#x4E00;&#x4E2A;&#x9635;&#x8425;&#x524D;&#x53D1;&#x73B0;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x89E3;&#x5E76;&#x5C06;&#x5176;&#x4F20;&#x64AD;&#x51FA;&#x53BB;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x5047;&#x5982;&#x5DE5;&#x4F5C;&#x5728;&#x201C;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x533A;&#x5757;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x627E;&#x5230;&#x4E86;&#x4E00;&#x4E2A;&#x201C;&#x83F1;&#x5F62;&#x201D;&#x533A;&#x5757; &#x5EF6;&#x957F;&#x4E86;&#x533A;&#x5757;&#x94FE;(&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;)&#xFF0C;&#x4ED6;&#x4EEC;&#x4F1A;&#x7ACB;&#x523B;&#x4F20;&#x64AD;&#x8FD9;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#xFF0C;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x90FD;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5982;&#x4E0B;&#x56FE;10-5&#x6240;&#x793A;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-f3150701b88a4b49.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-5</p>
<p>&#x200B;&#x9009;&#x62E9;&#x201C;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x4F5C;&#x4E3A;&#x4E0A;&#x4E00;&#x8F6E;&#x4E2D;&#x80DC;&#x51FA;&#x8005;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5C06;&#x7B80;&#x5355;&#x5730;&#x5C06;&#x533A;&#x5757;&#x94FE;&#x6269;&#x5C55;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x9009;&#x62E9;&#x201C;&#x5012;&#x4E09;&#x89D2;&#x201D;&#x7684;&#x8282;&#x70B9;&#x73B0;&#x5728;&#x5C06;&#x770B;&#x5230;&#x4E24;&#x4E2A;&#x94FE;&#xFF1A;&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;&#x548C;&#x661F;&#x578B;-&#x5230;&#x4E09;&#x89D2;&#x5F62;&#x3002;&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;&#x8FD9;&#x6761;&#x94FE;&#x73B0;&#x5728;&#x6BD4;&#x5176;&#x4ED6;&#x94FE;&#x6761;&#x66F4;&#x957F;&#xFF08;&#x66F4;&#x591A;&#x7D2F;&#x79EF;&#x7684;&#x5DE5;&#x4F5C;&#xFF09;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x5C06;&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;&#x8BBE;&#x7F6E;&#x4E3A;&#x4E3B;&#x94FE;&#xFF0C;&#x5E76;&#x5C06;&#x661F;&#x578B;-&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x94FE;&#x53D8;&#x4E3A;&#x5907;&#x7528;&#x94FE;&#xFF0C;&#x5982;&#x56FE;10-6&#x6240;&#x793A;&#x3002;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x94FE;&#x7684;&#x91CD;&#x65B0;&#x5171;&#x8BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x88AB;&#x8FEB;&#x4FEE;&#x6539;&#x4ED6;&#x4EEC;&#x5BF9;&#x5757;&#x94FE;&#x7684;&#x7ACB;&#x573A;&#xFF0C;&#x628A;&#x81EA;&#x5DF1;&#x7EB3;&#x5165;&#x66F4;&#x957F;&#x7684;&#x94FE;&#x3002;&#x4EFB;&#x4F55;&#x4ECE;&#x4E8B;&#x5EF6;&#x4F38;&#x661F;&#x5F62;-&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x7684;&#x77FF;&#x5DE5;&#x73B0;&#x5728;&#x90FD;&#x5C06;&#x505C;&#x6B62;&#x8FD9;&#x9879;&#x5DE5;&#x4F5C;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x5019;&#x9009;&#x4EBA;&#x662F;&#x201C;&#x5B64;&#x513F;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x7684;&#x7236;&#x6BCD;&#x201C;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x4E0D;&#x518D;&#x662F;&#x6700;&#x957F;&#x7684;&#x8FDE;&#x9501;&#x3002; &#x201C;&#x5012;&#x4E09;&#x89D2;&#x5F62;&#x201D;&#x5185;&#x7684;&#x4EA4;&#x6613;&#x91CD;&#x65B0;&#x63D2;&#x5165;&#x5230;&#x5185;&#x5B58;&#x6C60;&#x4E2D;&#x7528;&#x6765;&#x5305;&#x542B;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x5757;&#x4E2D;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x6240;&#x5728;&#x7684;&#x5757;&#x4E0D;&#x518D;&#x4F4D;&#x4E8E;&#x4E3B;&#x94FE;&#x4E2D;&#x3002;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x91CD;&#x65B0;&#x56DE;&#x5230;&#x5355;&#x4E00;&#x94FE;&#x72B6;&#x6001;&#xFF0C;&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;&#xFF0C;&#x201C;&#x83F1;&#x5F62;&#x201D;&#x6210;&#x4E3A;&#x94FE;&#x4E2D;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x6240;&#x6709;&#x77FF;&#x5DE5;&#x7ACB;&#x5373;&#x5F00;&#x59CB;&#x7814;&#x7A76;&#x4EE5;&#x201C;&#x83F1;&#x5F62;&#x201D;&#x4E3A;&#x7236;&#x533A;&#x5757;&#x7684;&#x5019;&#x9009;&#x5757;&#xFF0C;&#x4EE5;&#x6269;&#x5C55;&#x8FD9;&#x6761;&#x661F;&#x5F62;-&#x4E09;&#x89D2;&#x5F62;-&#x83F1;&#x5F62;&#x94FE;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-272e80704cfe9f76.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x200B; &#x56FE;10-6</p>
<p>&#x4ECE;&#x7406;&#x8BBA;&#x4E0A;&#x6765;&#x8BF4;&#xFF0C;&#x4E24;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5206;&#x53C9;&#x662F;&#x6709;&#x53EF;&#x80FD;&#x7684;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x5728;&#x56E0;&#x5148;&#x524D;&#x5206;&#x53C9;&#x800C;&#x76F8;&#x4E92;&#x5BF9;&#x7ACB;&#x8D77;&#x6765;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x53C8;&#x51E0;&#x4E4E;&#x540C;&#x65F6;&#x53D1;&#x73B0;&#x4E86;&#x4E24; &#x4E2A;&#x4E0D;&#x540C;&#x533A;&#x5757;&#x7684;&#x89E3;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x53D1;&#x751F;&#x7684;&#x51E0;&#x7387;&#x662F;&#x5F88;&#x4F4E;&#x7684;&#x3002;&#x5355;&#x533A;&#x5757;&#x5206;&#x53C9;&#x6BCF;&#x5468;&#x90FD;&#x4F1A;&#x53D1;&#x751F;&#xFF0C;&#x800C;&#x53CC;&#x5757;&#x5206;&#x53C9;&#x5219;&#x975E;&#x5E38;&#x7F55;&#x89C1;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5C06;&#x533A;&#x5757;&#x95F4;&#x9694;&#x8BBE;&#x8BA1;&#x4E3A;10&#x5206;&#x949F;&#xFF0C;&#x662F;&#x5728;&#x66F4;&#x5FEB;&#x901F;&#x7684;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x548C;&#x66F4;&#x4F4E;&#x7684;&#x5206;&#x53C9;&#x6982;&#x7387;&#x95F4;&#x4F5C;&#x51FA;&#x7684;&#x59A5;&#x534F;&#x3002;&#x66F4;&#x77ED;&#x7684;&#x533A;&#x5757;&#x4EA7;&#x751F;&#x95F4;&#x9694;&#x4F1A;&#x8BA9;&#x4EA4; &#x6613;&#x6E05;&#x7B97;&#x66F4;&#x5FEB;&#x5730;&#x5B8C;&#x6210;&#xFF0C;&#x4E5F;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x52A0;&#x9891;&#x7E41;&#x5730;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x3002;&#x4E0E;&#x4E4B;&#x76F8;&#x5BF9;&#x5730;&#xFF0C;&#x66F4;&#x957F;&#x7684;&#x95F4;&#x9694;&#x4F1A;&#x51CF;&#x5C11;&#x5206;&#x53C9;&#x6570;&#x91CF;&#xFF0C;&#x5374;&#x4F1A;&#x5BFC;&#x81F4;&#x66F4;&#x957F;&#x7684;&#x6E05;&#x7B97;&#x65F6;&#x95F4;&#x3002;</p>
<h2 id="1011-&#x6316;&#x77FF;&#x548C;&#x7B97;&#x529B;&#x7ADE;&#x8D5B;">10.11 &#x6316;&#x77FF;&#x548C;&#x7B97;&#x529B;&#x7ADE;&#x8D5B;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x662F;&#x4E00;&#x4E2A;&#x6781;&#x5BCC;&#x7ADE;&#x4E89;&#x6027;&#x7684;&#x884C;&#x4E1A;&#x3002;&#x81EA;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x5B58;&#x5728;&#x5F00;&#x59CB;&#xFF0C;&#x6BCF;&#x5E74;&#x6BD4;&#x7279;&#x5E01;&#x7B97;&#x529B;&#x90FD;&#x6210;&#x6307;&#x6570;&#x589E;&#x957F;&#x3002;&#x4E00;&#x4E9B;&#x5E74;&#x4EFD;&#x7684;&#x589E;&#x957F;&#x8FD8;&#x4F53;&#x73B0;&#x51FA;&#x6280;&#x672F;&#x7684;&#x53D8;&#x9769;&#xFF0C;&#x6BD4;&#x5982;&#x5728;2010&#x5E74;&#x548C;2011&#x5E74;&#xFF0C;&#x5F88;&#x591A;&#x77FF;&#x5DE5;&#x5F00;&#x59CB;&#x4ECE;&#x4F7F;&#x7528;CPU&#x5347;&#x7EA7;&#x5230;&#x4F7F;&#x7528;GPU&#xFF0C;&#x8FDB;&#x800C;&#x4F7F;&#x7528;FGPA&#xFF08;&#x73B0;&#x573A;&#x53EF;&#x7F16;&#x7A0B;&#x95E8;&#x9635; &#x5217;&#xFF09;&#x6316;&#x77FF;&#x3002;&#x5728;2013&#x5E74;&#xFF0C;ASIC&#x6316;&#x77FF;&#x7684;&#x5F15;&#x5165;&#xFF0C;&#x628A;SHA256&#x7B97;&#x6CD5;&#x76F4;&#x63A5;&#x56FA;&#x5316;&#x5728;&#x6316;&#x77FF;&#x4E13;&#x7528;&#x7684;&#x7845;&#x82AF;&#x7247;&#x4E0A;&#xFF0C;&#x5F15;&#x8D77;&#x4E86;&#x7B97;&#x529B;&#x7684;&#x53E6;&#x4E00;&#x6B21;&#x5DE8;&#x5927;&#x98DE; &#x8DC3;&#x3002;&#x4E00;&#x53F0;&#x91C7;&#x7528;&#x8FD9;&#x79CD;&#x82AF;&#x7247;&#x7684;&#x77FF;&#x673A;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7684;&#x7B97;&#x529B;&#xFF0C;&#x6BD4;2010&#x5E74;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x6574;&#x4F53;&#x7B97;&#x529B;&#x8FD8;&#x8981;&#x5927;&#x3002;</p>
<p>&#x4E0B;&#x8868;&#x8868;&#x793A;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x5F00;&#x59CB;&#x8FD0;&#x884C;&#x540E;&#x6700;&#x521D;&#x4E94;&#x5E74;&#x7684;&#x603B;&#x7B97;&#x529B;&#xFF1A;</p>
<p>2009</p>
<p>0.5 MH/sec&#x2013;8 MH/sec (16&#xD7; growth)</p>
<p>2010</p>
<p>8 MH/sec&#x2013;116 GH/sec (14,500&#xD7; growth)</p>
<p>2011</p>
<p>16 GH/sec&#x2013;9 TH/sec (562&#xD7; growth)</p>
<p>2012</p>
<p>9 TH/sec&#x2013;23 TH/sec (2.5&#xD7; growth)</p>
<p>2013</p>
<p>23 TH/sec&#x2013;10 PH/sec (450&#xD7; growth)</p>
<p>2014</p>
<p>10 PH/sec&#x2013;300 PH/sec (3000&#xD7; growth)</p>
<p>2015</p>
<p>300 PH/sec-800 PH/sec (266&#xD7; growth)</p>
<p>2016</p>
<p>800 PH/sec-2.5 EH/sec (312&#xD7; growth))</p>
<p>&#x5728;&#x56FE;10-7&#x7684;&#x56FE;&#x8868;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x8FD1;&#x4E24;&#x5E74;&#x91CC;&#xFF0C;&#x77FF;&#x4E1A;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6210;&#x957F;&#x5F15;&#x8D77;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7B97;&#x529B;&#x7684;&#x6307;&#x6570;&#x589E;&#x957F;&#xFF08;&#x6BCF;&#x79D2;&#x7F51;&#x7EDC;&#x603B;&#x7B97; &#x529B;&#xFF09;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-9c09f7243c5849cc.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x7B97;&#x529B;&#x7684;&#x7206;&#x70B8;&#x6027;&#x589E;&#x957F;&#xFF0C;&#x4E0E;&#x4E4B;&#x5339;&#x914D;&#x7684;&#x96BE;&#x5EA6;&#x4E5F;&#x76F8;&#x5E94;&#x589E;&#x957F;&#x3002;&#x56FE;10-8&#x4E2D;&#x7684;&#x76F8;&#x5BF9;&#x96BE;&#x5EA6;&#x503C;&#x663E;&#x793A;&#x4E86;&#x5F53;&#x524D;&#x96BE;&#x5EA6;&#x4E0E;&#x6700;&#x5C0F;&#x96BE;&#x5EA6; &#xFF08;&#x7B2C;&#x4E00;&#x4E2A;&#x5757;&#x7684;&#x96BE;&#x5EA6;&#xFF09;&#x7684;&#x6BD4;&#x4F8B;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-64a274ed95aebf3d.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x8FD1;&#x4E24;&#x5E74;&#xFF0C;ASIC&#x82AF;&#x7247;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x5BC6;&#x96C6;&#xFF0C;&#x7279;&#x5F81;&#x5C3A;&#x5BF8;&#x63A5;&#x8FD1;&#x82AF;&#x7247;&#x5236;&#x9020;&#x4E1A;&#x524D;&#x6CBF;&#x7684;16&#x7EB3;&#x7C73;&#x3002;&#x6316;&#x77FF;&#x7684;&#x5229;&#x6DA6;&#x7387;&#x9A71;&#x52A8;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x4EE5;&#x6BD4;&#x901A;&#x7528;&#x8BA1;&#x7B97; &#x66F4;&#x5FEB;&#x7684;&#x901F;&#x5EA6;&#x53D1;&#x5C55;&#x3002;</p>
<p>&#x76EE;&#x524D;&#xFF0C;ASIC&#x5236;&#x9020;&#x5546;&#x7684;&#x76EE;&#x6807;&#x662F;&#x8D85;&#x8D8A;&#x901A;&#x7528;CPU&#x82AF;&#x7247;&#x5236;&#x9020;&#x5546;&#xFF0C;&#x8BBE;&#x8BA1;&#x7279;&#x5F81;&#x5C3A;&#x5BF8;&#x4E3A;14&#x7EB3;&#x7C73;&#x7684;&#x82AF;&#x7247;&#x3002;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x800C;&#x8A00;&#xFF0C;&#x5DF2;&#x7ECF;&#x6CA1;&#x6709;&#x66F4;&#x591A;&#x98DE;&#x8DC3;&#x7684;&#x7A7A;&#x95F4;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x5DF2;&#x7ECF;&#x89E6;&#x53CA;&#x4E86;&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#x7684;&#x6700;&#x524D;&#x6CBF;&#x3002;&#x6469;&#x5C14;&#x5B9A;&#x5F8B;&#x6307;&#x51FA;&#x8BA1;&#x7B97;&#x80FD;&#x529B;&#x6BCF;18&#x4E2A;&#x6708;&#x589E;&#x52A0;&#x4E00;&#x500D;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x5982;&#x6B64;&#xFF0C;&#x968F;&#x7740;&#x66F4;&#x9AD8;&#x5BC6;&#x5EA6;&#x7684;&#x82AF;&#x7247;&#x548C;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x7684;&#x90E8;&#x7F72;&#x7ADE;&#x8D5B;&#xFF0C;&#x7F51;&#x7EDC;&#x7B97;&#x529B;&#x7EE7;&#x7EED;&#x4FDD;&#x6301;&#x540C;&#x6B65;&#x7684;&#x6307;&#x6570;&#x589E;&#x957F;&#x3002;&#x73B0;&#x5728;&#x7684;&#x7ADE;&#x4E89;&#x5DF2;&#x7ECF;&#x4E0D;&#x518D;&#x662F;&#x6BD4;&#x8F83;&#x5355;&#x4E00;&#x82AF;&#x7247;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x4E2A;&#x77FF;&#x573A;&#x80FD;&#x585E;&#x8FDB;&#x591A;&#x5C11;&#x82AF;&#x7247;&#xFF0C;&#x5E76;&#x5904;&#x7406;&#x597D;&#x6563;&#x70ED;&#x548C;&#x4F9B;&#x7535;&#x95EE;&#x9898;&#x3002;</p>
<h3 id="10111-&#x968F;&#x673A;&#x503C;&#x5347;&#x4F4D;&#x65B9;&#x6848;-the-extra-nonce-solution">10.11.1 &#x968F;&#x673A;&#x503C;&#x5347;&#x4F4D;&#x65B9;&#x6848; the extra nonce solution</h3>
<p>2012&#x5E74;&#x4EE5;&#x6765;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6316;&#x77FF;&#x53D1;&#x5C55;&#x51FA;&#x4E00;&#x4E2A;&#x89E3;&#x51B3;&#x533A;&#x5757;&#x5934;&#x57FA;&#x672C;&#x7ED3;&#x6784;&#x9650;&#x5236;&#x7684;&#x65B9;&#x6848;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65E9;&#x671F;&#xFF0C;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x904D;&#x5386;&#x968F;&#x673A;&#x6570;(Nonce)&#x83B7;&#x5F97;&#x7B26;&#x5408;&#x8981;&#x6C42;&#x7684;hash&#x6765;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x5757;&#x3002;</p>
<p>&#x96BE;&#x5EA6;&#x589E;&#x957F;&#x540E;&#xFF0C;&#x77FF;&#x5DE5;&#x7ECF;&#x5E38;&#x5728;&#x5C1D;&#x8BD5;&#x4E86;40&#x4EBF;&#x4E2A;&#x503C;&#x540E;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x51FA;&#x5757;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8FD9;&#x5F88;&#x5BB9; &#x6613;&#x901A;&#x8FC7;&#x8BFB;&#x53D6;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x5E76;&#x8BA1;&#x7B97;&#x7ECF;&#x8FC7;&#x7684;&#x65F6;&#x95F4;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x56E0;&#x4E3A;&#x65F6;&#x95F4;&#x6233;&#x662F;&#x533A;&#x5757;&#x5934;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5B83;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x4EE5;&#x8BA9;&#x77FF;&#x5DE5;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x968F;&#x673A;&#x503C; &#x518D;&#x6B21;&#x904D;&#x5386;&#x3002;&#x5F53;&#x6316;&#x77FF;&#x786C;&#x4EF6;&#x7684;&#x901F;&#x5EA6;&#x8FBE;&#x5230;&#x4E86;4GH/&#x79D2;&#xFF0C;&#x8FD9;&#x79CD;&#x65B9;&#x6CD5;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#xFF0C;&#x56E0;&#x4E3A;&#x968F;&#x673A;&#x6570;&#x7684;&#x53D6;&#x503C;&#x5728;&#x4E00;&#x79D2;&#x5185;&#x5C31;&#x88AB;&#x7528;&#x5C3D;&#x4E86;&#x3002;</p>
<p>&#x5F53;&#x51FA;&#x73B0;ASIC&#x77FF;&#x673A;&#x5E76;&#x5F88;&#x5FEB;&#x8FBE;&#x5230;&#x4E86;TH/&#x79D2;&#x7684;hash&#x901F;&#x7387;&#x540E;&#xFF0C;&#x6316;&#x77FF;&#x8F6F;&#x4EF6;&#x4E3A;&#x4E86;&#x627E;&#x5230;&#x6709;&#x6548;&#x7684;&#x5757;&#xFF0C;&#x9700;&#x8981;&#x66F4;&#x591A;&#x7684;&#x7A7A;&#x95F4;&#x6765;&#x50A8;&#x5B58;nonce&#x503C;&#x3002;&#x53EF;&#x4EE5;&#x628A; &#x65F6;&#x95F4;&#x6233;&#x5EF6;&#x540E;&#x4E00;&#x70B9;&#xFF0C;&#x4F46;&#x5C06;&#x6765;&#x5982;&#x679C;&#x628A;&#x5B83;&#x79FB;&#x52A8;&#x5F97;&#x592A;&#x8FDC;&#xFF0C;&#x4F1A;&#x5BFC;&#x81F4;&#x533A;&#x5757;&#x53D8;&#x4E3A;&#x65E0;&#x6548;&#x3002;</p>
<p>&#x533A;&#x5757;&#x5934;&#x9700;&#x8981;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#x7684;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x201C;&#x53D8;&#x9769;&#x201D;&#x3002;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x662F;&#x4F7F;&#x7528;coinbase&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x989D;&#x5916;&#x7684;&#x968F;&#x673A;&#x503C;&#x6765;&#x6E90;&#xFF0C;&#x56E0;&#x4E3A;coinbase&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x50A8;&#x5B58;2-100&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x7A7A;&#x95F4;&#x4F5C;&#x4E3A;&#x989D;&#x5916;&#x968F;&#x673A;&#x503C;&#x7684;&#x6765;&#x6E90;&#xFF0C;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x53BB;&#x63A2;&#x7D22;&#x4E00;&#x4E2A;&#x5927;&#x5F97;&#x591A;&#x7684;&#x533A;&#x5757;&#x5934;&#x503C;&#x8303;&#x56F4;&#x6765;&#x627E;&#x5230;&#x6709;&#x6548;&#x7684;&#x5757;&#x3002;&#x8FD9;&#x4E2A;coinbase&#x4EA4;&#x6613;&#x5305;&#x542B;&#x5728;merkle&#x6811;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;coinbase&#x811A;&#x672C;&#x7684;&#x53D8;&#x5316;&#x5C06;&#x5BFC;&#x81F4;Merkle&#x6839;&#x7684;&#x53D8;&#x5316;&#x3002;</p>
<p>8&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x989D;&#x5916;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x52A0;&#x4E0A;4&#x4E2A;&#x5B57;&#x8282;&#x7684;&#x201C;&#x6807;&#x51C6;&#x201D;&#x968F;&#x673A;&#x6570;&#xFF0C;&#x5141;&#x8BB8;&#x77FF;&#x5DE5;&#x6BCF;&#x79D2;&#x5C1D;&#x8BD5;2^96&#xFF08;8&#x540E;&#x9762;&#x8DDF;28&#x4E2A;&#x96F6;&#xFF09;&#x79CD;&#x53EF;&#x80FD;&#x6027;&#x800C;&#x65E0;&#x9700;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#x6233;&#x3002;&#x5982;&#x679C;&#x672A;&#x6765;&#x77FF;&#x5DE5;&#x7A7F;&#x8FC7;&#x4E86;&#x4EE5;&#x4E0A;&#x6240;&#x6709;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4FEE;&#x6539;&#x65F6;&#x95F4;&#x6233;&#x6765;&#x89E3;&#x51B3;&#x3002;&#x540C;&#x6837;&#xFF0C;coinbase&#x811A;&#x672C;&#x4E2D;&#x4E5F;&#x6709;&#x66F4;&#x591A;&#x989D;&#x5916;&#x7684;&#x7A7A;&#x95F4;&#x53EF;&#x4EE5;&#x4E3A;&#x5C06;&#x6765;&#x968F;&#x673A;&#x6570;&#x7684;&#x6269;&#x5C55;&#x505A;&#x51C6;&#x5907;&#x3002;</p>
<h3 id="10112-&#x77FF;&#x6C60;">10.11.2 &#x77FF;&#x6C60;</h3>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x6FC0;&#x70C8;&#x7ADE;&#x4E89;&#x7684;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x4E2A;&#x4F53;&#x77FF;&#x5DE5;&#x72EC;&#x7ACB;&#x5DE5;&#x4F5C;&#xFF08;&#x4E5F;&#x5C31;&#x662F;solo&#x6316;&#x77FF;&#xFF09;&#x6CA1;&#x6709;&#x4E00;&#x70B9;&#x673A;&#x4F1A;&#x3002;&#x4ED6;&#x4EEC;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4EE5;&#x62B5;&#x6D88;&#x7535;&#x529B;&#x548C;&#x786C;&#x4EF6; &#x6210;&#x672C;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x975E;&#x5E38;&#x5C0F;&#xFF0C;&#x4EE5;&#x81F3;&#x4E8E;&#x53EF;&#x4EE5;&#x79F0;&#x5F97;&#x4E0A;&#x662F;&#x8D4C;&#x535A;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x4E70;&#x5F69;&#x7968;&#x3002;&#x5C31;&#x7B97;&#x662F;&#x6700;&#x5FEB;&#x7684;&#x6D88;&#x8D39;&#x578B;ASIC&#x4E5F;&#x4E0D;&#x80FD;&#x548C;&#x90A3;&#x4E9B;&#x5728;&#x5DE8;&#x5927;&#x673A;&#x623F;&#x91CC;&#x62E5;&#x6709;&#x6570;&#x4E07;&#x82AF;&#x7247;&#x5E76;&#x9760;&#x8FD1;&#x6C34;&#x7535;&#x7AD9;&#x7684;&#x5546;&#x4E1A;&#x77FF;&#x573A;&#x7ADE;&#x4E89;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x77FF;&#x5DE5;&#x4EEC;&#x5408;&#x4F5C;&#x7EC4;&#x6210;&#x77FF;&#x6C60;&#xFF0C;&#x6C47;&#x96C6;&#x6570;&#x4EE5;&#x5343;&#x8BA1;&#x53C2;&#x4E0E;&#x8005;&#x4EEC;&#x7684;&#x7B97;&#x529B;&#x5E76;&#x5206;&#x4EAB;&#x5956;&#x52B1;&#x3002;&#x901A; &#x8FC7;&#x53C2;&#x52A0;&#x77FF;&#x6C60;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x5F97;&#x5230;&#x6574;&#x4F53;&#x56DE;&#x62A5;&#x7684;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x901A;&#x5E38;&#x6BCF;&#x5929;&#x90FD;&#x80FD;&#x5F97;&#x5230;&#xFF0C;&#x56E0;&#x800C;&#x51CF;&#x5C11;&#x4E86;&#x4E0D;&#x786E;&#x5B9A;&#x6027;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x5047;&#x8BBE;&#x4E00;&#x540D;&#x77FF;&#x5DE5;&#x5DF2;&#x7ECF;&#x8D2D;&#x4E70;&#x4E86;&#x7B97;&#x529B;&#x5171;&#x8BA1;14,000GH/S&#xFF0C;&#x6216;14TH/S&#x7684;&#x8BBE;&#x5907;&#xFF0C;&#x5728;2017&#x5E74;&#xFF0C;&#x5B83;&#x7684;&#x4EF7; &#x503C;&#x5927;&#x7EA6;&#x662F;2500&#x7F8E;&#x5143;&#x3002;</p>
<p>&#x8BE5;&#x8BBE;&#x5907;&#x8FD0;&#x884C;&#x529F;&#x7387;&#x4E3A;1.3&#x5343;&#x74E6;&#xFF08;KW&#xFF09;&#xFF0C;&#x6BCF;&#x65E5;&#x8017;&#x7535;32&#x5EA6;&#xFF0C;&#x6BCF;&#x65E5;&#x5E73;&#x5747;&#x6210;&#x672C;1&#x6216;2&#x7F8E;&#x5143;&#x3002;&#x4EE5;&#x76EE;&#x524D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x96BE;&#x5EA6;&#xFF0C; &#x8BE5;&#x77FF;&#x5DE5;solo&#x65B9;&#x5F0F;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x5757;&#x5E73;&#x5747;&#x9700;&#x8981;4&#x5E74;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x77FF;&#x5DE5;&#x786E;&#x5B9E;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x9650;&#x5185;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5956;&#x52B1;12.5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5982;&#x679C; &#x6BCF;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x683C;&#x7EA6;&#x4E3A;1000&#x7F8E;&#x5143;&#xFF08;&#x8BD1;&#x8005;&#xFF1A;&#x8FD9;&#x662F;&#x4F5C;&#x8005;&#x51FA;&#x7248;&#x6B64;&#x4E66;&#x7684;&#x4EF7;&#x683C;&#xFF0C;2017&#x5E74;10&#x6708;22&#x65E5;&#x8BD1;&#x8005;&#x770B;&#x5230;&#x7684;&#x4EF7;&#x683C;&#x662F;5880&#x7F8E;&#x5143;&#xFF09;&#xFF0C;&#x53EF;&#x4EE5;&#x5F97;&#x5230;12,500&#x7F8E;&#x5143;&#x7684;&#x6536;&#x5165;&#x3002;&#x8FD9;&#x751A;&#x81F3;&#x4E0D;&#x80FD;&#x8986;&#x76D6;&#x6574;&#x4E2A;&#x786C;&#x4EF6;&#x548C;&#x6574;&#x4E2A;&#x65F6;&#x95F4;&#x6BB5;&#x7684;&#x7535;&#x529B;&#x6D88;&#x8017;&#xFF0C;&#x51C0;&#x4E8F;&#x635F;&#x7EA6;&#x4E3A;1,000&#x7F8E;&#x5143;&#x3002;&#x800C;&#x4E14;&#xFF0C;&#x5728;4&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x5468;&#x671F;&#x5185;&#x80FD;&#x5426;&#x6316;&#x51FA;&#x4E00;&#x4E2A;&#x5757;&#x8FD8;&#x4E3B;&#x8981;&#x9760;&#x77FF;&#x5DE5;&#x7684;&#x8FD0;&#x6C14;&#x3002;&#x4ED6;&#x6709;&#x53EF;&#x80FD;&#x5728;4&#x5E74;&#x4E2D;&#x5F97;&#x5230;&#x4E24;&#x4E2A;&#x5757;&#x4ECE;&#x800C;&#x8D5A;&#x5230;&#x975E;&#x5E38;&#x5927;&#x7684;&#x5229;&#x6DA6;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x4ED6;&#x53EF;&#x80FD;5&#x5E74;&#x90FD;&#x627E;&#x4E0D;&#x5230;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x906D;&#x53D7;&#x7ECF;&#x6D4E;&#x635F;&#x5931;&#x3002;</p>
<p>&#x66F4;&#x7CDF;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E; &#xFF08;POW&#xFF09;&#x7B97;&#x6CD5;&#x7684;&#x96BE;&#x5EA6;&#x53EF;&#x80FD;&#x5728;&#x8FD9;&#x6BB5;&#x65F6;&#x95F4;&#x5185;&#x663E;&#x8457;&#x4E0A;&#x5347;&#xFF0C;&#x6309;&#x7167;&#x76EE;&#x524D;&#x7B97;&#x529B;&#x589E;&#x957F;&#x7684;&#x901F;&#x5EA6;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x77FF;&#x5DE5;&#x5728;&#x8BBE;&#x5907;&#x88AB;&#x4E0B;&#x4E00;&#x4EE3;&#x66F4;&#x6709;&#x6548;&#x7387;&#x7684;&#x77FF;&#x673A;&#x53D6;&#x4EE3;&#x4E4B;&#x524D;&#xFF0C;&#x6700;&#x591A;&#x6709;1&#x5E74;&#x7684;&#x65F6;&#x95F4;&#x53D6;&#x5F97;&#x6210;&#x679C;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x4E2A;&#x77FF;&#x5DE5;&#x52A0;&#x5165;&#x77FF;&#x6C60;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B49;&#x5F85;4&#x5E74;&#x5185;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x4E00;&#x6B21;&#x7684;&#x66B4;&#x5229;&#xFF0C;&#x4ED6;&#x6BCF;&#x5468;&#x80FD;&#x8D5A;&#x53D6;&#x5927;&#x7EA6;50-60&#x7F8E;&#x5143;&#x3002;&#x77FF;&#x6C60;&#x7684;&#x5E38;&#x89C4;&#x6536;&#x5165;&#x80FD;&#x5E2E;&#x4ED6;&#x968F;&#x65F6;&#x95F4;&#x644A;&#x9500;&#x786C;&#x4EF6;&#x548C;&#x7535;&#x529B;&#x7684;&#x6210;&#x672C;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x7528;&#x627F;&#x62C5;&#x5DE8;&#x5927;&#x7684;&#x98CE;&#x9669;&#x3002;&#x5728;1-2&#x5E74;&#x540E;&#xFF0C;&#x786C;&#x4EF6;&#x4ECD;&#x7136;&#x4F1A;&#x8FC7;&#x65F6;&#xFF0C;&#x98CE;&#x9669;&#x4ECD;&#x7136;&#x5F88;&#x9AD8;&#xFF0C;&#x4F46;&#x5728;&#x6B64;&#x671F;&#x95F4;&#x7684;&#x6536;&#x5165;&#x81F3;&#x5C11;&#x662F;&#x5B9A;&#x671F;&#x7684;&#x548C;&#x53EF;&#x9760;&#x7684;&#x3002;</p>
<p>&#x4ECE;&#x8D22;&#x52A1;&#x6570;&#x636E;&#x5206;&#x6790;&#xFF0C;&#x8FD9;&#x53EA;&#x6709;&#x975E;&#x5E38;&#x4F4E;&#x7684;&#x7535;&#x529B;&#x6210;&#x672C;&#xFF08;&#x6BCF;&#x5343;&#x74E6;&#x4E0D;&#x5230;1&#x7F8E;&#x5206;&#xFF09;&#xFF0C;&#x975E;&#x5E38;&#x5927;&#x7684;&#x89C4;&#x6A21;&#x65F6;&#x624D;&#x6709;&#x610F;&#x4E49;&#x3002;&#x77FF;&#x6C60;&#x901A;&#x8FC7;&#x4E13;&#x7528;&#x6316;&#x77FF;&#x534F;&#x8BAE;&#x534F;&#x8C03;&#x6210;&#x767E;&#x4E0A;&#x5343;&#x7684;&#x77FF;&#x5DE5;&#x3002;</p>
<p>&#x4E2A;&#x4EBA;&#x77FF;&#x5DE5;&#x5728;&#x5EFA;&#x7ACB;&#x77FF;&#x6C60;&#x8D26;&#x53F7;&#x540E;&#xFF0C;&#x8BBE;&#x7F6E;&#x4ED6;&#x4EEC;&#x7684;&#x77FF;&#x673A;&#x8FDE;&#x63A5;&#x5230;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x3002;&#x4ED6;&#x4EEC;&#x7684; &#x6316;&#x77FF;&#x8BBE;&#x5907;&#x5728;&#x6316;&#x77FF;&#x65F6;&#x4FDD;&#x6301;&#x548C;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x7684;&#x8FDE;&#x63A5;&#xFF0C;&#x548C;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x540C;&#x6B65;&#x5404;&#x81EA;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x77FF;&#x6C60;&#x4E2D;&#x7684;&#x77FF;&#x5DE5;&#x5206;&#x4EAB;&#x6316;&#x77FF;&#x4EFB;&#x52A1;&#xFF0C;&#x4E4B;&#x540E;&#x5206; &#x4EAB;&#x5956;&#x52B1;&#x3002;&#x6210;&#x529F;&#x51FA;&#x5757;&#x7684;&#x5956;&#x52B1;&#x652F;&#x4ED8;&#x5230;&#x77FF;&#x6C60;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5355;&#x4E2A;&#x77FF;&#x5DE5;&#x7684;&#x3002;&#x4E00;&#x65E6;&#x5956;&#x52B1;&#x8FBE;&#x5230;&#x4E00;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x9608;&#x503C;&#xFF0C;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x4FBF;&#x4F1A;&#x5B9A;&#x671F;&#x652F; &#x4ED8;&#x5956;&#x52B1;&#x5230;&#x77FF;&#x5DE5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;</p>
<p>&#x901A;&#x5E38;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x4F1A;&#x4E3A;&#x63D0;&#x4F9B;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x6536;&#x53D6;&#x4E00;&#x4E2A;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x8D39;&#x7528;&#x3002;&#x53C2;&#x52A0;&#x77FF;&#x6C60;&#x7684;&#x77FF;&#x5DE5;&#x628A;&#x641C;&#x5BFB;&#x5019;&#x9009;&#x533A;&#x5757;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x5206;&#x5272;&#xFF0C;&#x5E76;&#x6839;&#x636E;&#x4ED6;&#x4EEC;&#x6316;&#x77FF;&#x7684;&#x8D21;&#x732E;&#x8D5A;&#x53D6;&#x201C;&#x4EFD;&#x989D;&#x201D;&#x3002;&#x77FF;&#x6C60;&#x4E3A;&#x8D5A;&#x53D6;&#x201C;&#x4EFD;&#x989D;&#x201D;&#x8BBE;&#x7F6E;&#x4E86;&#x4E00;&#x4E2A;&#x4F4E;&#x96BE;&#x5EA6; &#x7684;&#x76EE;&#x6807;&#xFF0C;&#x901A;&#x5E38;&#x6BD4;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x96BE;&#x5EA6;&#x4F4E;1000&#x500D;&#x4EE5;&#x4E0A;&#x3002;</p>
<p>&#x5F53;&#x77FF;&#x6C60;&#x4E2D;&#x6709;&#x4EBA;&#x6210;&#x529F;&#x6316;&#x51FA;&#x4E00;&#x5757;&#xFF0C;&#x77FF;&#x6C60;&#x83B7;&#x5F97;&#x5956;&#x52B1;&#xFF0C;&#x5E76;&#x548C;&#x6240;&#x6709;&#x77FF;&#x5DE5;&#x6309;&#x7167;&#x4ED6;&#x4EEC;&#x505A; &#x51FA;&#x8D21;&#x732E;&#x7684;&#x201C;&#x4EFD;&#x989D;&#x201D;&#x6570;&#x7684;&#x6BD4;&#x4F8B;&#x5206;&#x914D;&#x3002;&#x77FF;&#x6C60;&#x5BF9;&#x4EFB;&#x4F55;&#x77FF;&#x5DE5;&#x5F00;&#x653E;&#xFF0C;&#x65E0;&#x8BBA;&#x5927;&#x5C0F;&#x3001;&#x4E13;&#x4E1A;&#x6216;&#x4E1A;&#x4F59;&#x3002;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x4E2D;&#xFF0C;&#x6709;&#x4EBA;&#x53EA;&#x6709;&#x4E00;&#x53F0;&#x5C0F;&#x77FF;&#x673A;&#xFF0C;&#x800C;&#x6709;&#x4E9B;&#x4EBA;&#x6709;&#x4E00;&#x8F66;&#x5E93;&#x9AD8;&#x7AEF;&#x6316; &#x77FF;&#x786C;&#x4EF6;&#x3002;&#x6709;&#x4EBA;&#x53EA;&#x7528;&#x51E0;&#x5341;&#x5EA6;&#x7535;&#x6316;&#x77FF;&#xFF0C;&#x4E5F;&#x6709;&#x4EBA;&#x4F1A;&#x7528;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x6D88;&#x8017;&#x5146;&#x74E6;&#x7EA7;&#x7684;&#x7535;&#x91CF;&#x3002;&#x77FF;&#x6C60;&#x5982;&#x4F55;&#x8861;&#x91CF;&#x6BCF;&#x4E2A;&#x4EBA;&#x7684;&#x8D21;&#x732E;&#xFF0C;&#x65E2;&#x80FD;&#x516C;&#x5E73; &#x5206;&#x914D;&#x5956;&#x52B1;&#xFF0C;&#x53C8;&#x907F;&#x514D;&#x4F5C;&#x5F0A;&#x7684;&#x53EF;&#x80FD;&#xFF1F;&#x7B54;&#x6848;&#x662F;&#x5728;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x8F83;&#x4F4E;&#x96BE;&#x5EA6;&#x7684;&#x524D;&#x63D0;&#x4E0B;&#xFF0C;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7B97;&#x6CD5;&#x6765;&#x8861;&#x91CF;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x7684; &#x8D21;&#x732E;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x5373;&#x4F7F;&#x662F;&#x6C60;&#x4E2D;&#x6700;&#x5C0F;&#x7684;&#x77FF;&#x5DE5;&#x4E5F;&#x7ECF;&#x5E38;&#x80FD;&#x5206;&#x5F97;&#x5956;&#x52B1;&#xFF0C;&#x8FD9;&#x8DB3;&#x4EE5;&#x6FC0;&#x52B1;&#x4ED6;&#x4EEC;&#x4E3A;&#x77FF;&#x6C60;&#x505A;&#x51FA;&#x8D21;&#x732E;&#x3002;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x8F83;&#x4F4E;&#x7684;&#x53D6;&#x5F97;&#x4EFD; &#x989D;&#x7684;&#x96BE;&#x5EA6;&#xFF0C;&#x77FF;&#x6C60;&#x53EF;&#x4EE5;&#x8BA1;&#x91CF;&#x51FA;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x5B8C;&#x6210;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x3002;&#x6BCF;&#x5F53;&#x77FF;&#x5DE5;&#x53D1;&#x73B0;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;&#x77FF;&#x6C60;&#x96BE;&#x5EA6;&#x7684;&#x533A;&#x5757;&#x5934;hash&#xFF0C;&#x5C31;&#x8BC1;&#x660E;&#x4E86;&#x5B83;&#x5DF2;&#x7ECF;&#x5B8C; &#x6210;&#x4E86;&#x5BFB;&#x627E;&#x7ED3;&#x679C;&#x6240;&#x9700;&#x7684;hash&#x8BA1;&#x7B97;&#x3002;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x4E3A;&#x53D6;&#x5F97;&#x4EFD;&#x989D;&#x8D21;&#x732E;&#x800C;&#x505A;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x80FD;&#x4EE5;&#x4E00;&#x4E2A;&#x7EDF;&#x8BA1;&#x5B66;&#x4E0A;&#x53EF;&#x8861;&#x91CF;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;&#x6574;&#x4F53; &#x5BFB;&#x627E;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x76EE;&#x6807;&#x6563;&#x5217;&#x503C;&#x3002;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x77FF;&#x5DE5;&#x5C1D;&#x8BD5;&#x8F83;&#x5C0F;&#x533A;&#x95F4;&#x7684;hash&#x503C;&#xFF0C;&#x6700;&#x7EC8;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x7B26;&#x5408;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x8981;&#x6C42;&#x7684;&#x7ED3; &#x679C;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x56DE;&#x5230;&#x9AB0;&#x5B50;&#x6E38;&#x620F;&#x7684;&#x6BD4;&#x55BB;&#x3002;&#x5982;&#x679C;&#x9AB0;&#x5B50;&#x73A9;&#x5BB6;&#x7684;&#x76EE;&#x6807;&#x662F;&#x6254;&#x9AB0;&#x5B50;&#x7ED3;&#x679C;&#x90FD;&#x5C0F;&#x4E8E;4&#xFF08;&#x6574;&#x4F53;&#x7F51;&#x7EDC;&#x96BE;&#x5EA6;&#xFF09;&#xFF0C;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x53EF;&#x4EE5;&#x8BBE;&#x7F6E;&#x4E00;&#x4E2A;&#x66F4; &#x5BB9;&#x6613;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x7EDF;&#x8BA1;&#x6709;&#x591A;&#x5C11;&#x6B21;&#x6C60;&#x4E2D;&#x7684;&#x73A9;&#x5BB6;&#x6254;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x5C0F;&#x4E8E;8&#x3002;&#x5F53;&#x6C60;&#x4E2D;&#x7684;&#x73A9;&#x5BB6;&#x6254;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x5C0F;&#x4E8E;8&#xFF08;&#x77FF;&#x6C60;&#x4EFD;&#x989D;&#x76EE;&#x6807;&#xFF09;&#xFF0C;&#x4ED6;&#x4EEC;&#x5F97;&#x5230;&#x4EFD;&#x989D;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x8D62;&#x5F97;&#x6E38;&#x620F;&#xFF0C;&#x56E0;&#x4E3A;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x6E38;&#x620F;&#x76EE;&#x6807;&#xFF08;&#x5C0F;&#x4E8E;4&#xFF09;&#x3002;&#x4F46;&#x6C60;&#x4E2D;&#x7684;&#x73A9;&#x5BB6;&#x4F1A;&#x66F4;&#x7ECF;&#x5E38;&#x7684;&#x8FBE;&#x5230;&#x8F83;&#x5BB9;&#x6613;&#x7684;&#x77FF;&#x6C60;&#x4EFD;&#x989D;&#x76EE; &#x6807;&#xFF0C;&#x89C4;&#x5F8B;&#x5730;&#x8D5A;&#x53D6;&#x4ED6;&#x4EEC;&#x7684;&#x4EFD;&#x989D;&#xFF0C;&#x5C3D;&#x7BA1;&#x4ED6;&#x4EEC;&#x6CA1;&#x6709;&#x5B8C;&#x6210;&#x66F4;&#x96BE;&#x7684;&#x8D62;&#x5F97;&#x6BD4;&#x8D5B;&#x7684;&#x76EE;&#x6807;&#x3002;&#x65F6;&#x4E0D;&#x65F6;&#x5730;&#xFF0C;&#x6C60;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x6210;&#x5458;&#x6709;&#x53EF;&#x80FD;&#x4F1A;&#x6254;&#x51FA;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;4&#x7684;&#x7ED3;&#x679C;&#xFF0C;&#x77FF;&#x6C60;&#x83B7;&#x80DC;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6536;&#x76CA;&#x53EF;&#x4EE5;&#x5728;&#x6C60;&#x4E2D;&#x73A9;&#x5BB6;&#x83B7;&#x5F97;&#x7684;&#x4EFD;&#x989D;&#x57FA;&#x7840;&#x4E0A;&#x5206;&#x914D;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x76EE;&#x6807;&#x8BBE;&#x7F6E;&#x4E3A;8&#x6216;&#x66F4;&#x5C11;&#x5E76;&#x6CA1;&#x6709;&#x8D62;&#x5F97;&#x6E38;&#x620F;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x8861;&#x91CF;&#x73A9;&#x5BB6;&#x4EEC;&#x6254;&#x51FA;&#x7684;&#x70B9;&#x6570;&#x7684;&#x516C;&#x5E73;&#x65B9;&#x6CD5;&#xFF0C;&#x540C;&#x65F6;&#x5B83;&#x5076;&#x5C14;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x5C0F;&#x4E8E;4&#x7684;&#x7ED3;&#x679C;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x4F1A;&#x5C06;&#x77FF;&#x6C60;&#x96BE;&#x5EA6;&#x8BBE;&#x7F6E;&#x5728;&#x4FDD;&#x8BC1;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x77FF;&#x5DE5;&#x80FD;&#x591F;&#x9891;&#x7E41;&#x5730;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x77FF;&#x6C60;&#x96BE;&#x5EA6;&#x7684;&#x533A;&#x5757;&#x5934;hash&#x6765;&#x8D62;&#x53D6;&#x4EFD; &#x989D;&#x3002;&#x65F6;&#x4E0D;&#x65F6;&#x7684;&#xFF0C;&#x67D0;&#x6B21;&#x5C1D;&#x8BD5;&#x4F1A;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7B26;&#x5408;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x76EE;&#x6807;&#x7684;&#x533A;&#x5757;&#x5934;hash&#xFF0C;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x6574;&#x4E2A;&#x77FF;&#x6C60;&#x83B7;&#x80DC;&#x3002;</p>
<h4 id="101121-&#x6258;&#x7BA1;&#x77FF;&#x6C60;">10.11.2.1 &#x6258;&#x7BA1;&#x77FF;&#x6C60;</h4>
<p>&#x5927;&#x90E8;&#x5206;&#x77FF;&#x6C60;&#x662F;&#x201C;&#x6258;&#x7BA1;&#x7684;&#x201D;&#xFF0C;&#x610F;&#x601D;&#x662F;&#x6709;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6216;&#x8005;&#x4E2A;&#x4EBA;&#x7ECF;&#x8425;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x3002;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x7684;&#x6240;&#x6709;&#x8005;&#x53EB;&#x77FF;&#x6C60;&#x7BA1;&#x7406;&#x5458;&#xFF0C;&#x540C;&#x65F6;&#x4ED6; &#x4ECE;&#x77FF;&#x5DE5;&#x7684;&#x6536;&#x5165;&#x4E2D;&#x6536;&#x53D6;&#x4E00;&#x4E2A;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x8D39;&#x7528;&#x3002;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x8FD0;&#x884C;&#x4E13;&#x4E1A;&#x8F6F;&#x4EF6;&#x4EE5;&#x53CA;&#x534F;&#x8C03;&#x6C60;&#x4E2D;&#x77FF;&#x5DE5;&#x4EEC;&#x6D3B;&#x52A8;&#x7684;&#x77FF;&#x6C60;&#x91C7;&#x77FF;&#x534F;&#x8BAE;&#x3002;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x540C;&#x65F6;&#x4E5F;&#x8FDE;&#x63A5;&#x5230;&#x4E00;&#x4E2A;&#x6216;&#x66F4;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x5B8C;&#x5168;&#x8282; &#x70B9;&#x5E76;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x4E00;&#x4E2A;&#x5757;&#x94FE;&#x6570;&#x636E;&#x5E93;&#x7684;&#x5B8C;&#x6574;&#x526F;&#x672C;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x53EF;&#x4EE5;&#x4EE3;&#x66FF;&#x77FF;&#x6C60;&#x4E2D;&#x7684;&#x77FF;&#x5DE5;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x548C;&#x4EA4;&#x6613;&#xFF0C;&#x7F13;&#x89E3;&#x4ED6;&#x4EEC;&#x8FD0;&#x884C;&#x4E00; &#x4E2A;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x7684;&#x8D1F;&#x62C5;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x6C60;&#x4E2D;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7684;&#x8003;&#x91CF;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x8981;&#x6C42;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x6700;&#x5C11;100-150GB&#x7684;&#x6C38;&#x4E45;&#x50A8;&#x5B58;&#x7A7A;&#x95F4;&#xFF08;&#x78C1;&#x76D8;&#xFF09;&#x548C;&#x6700;&#x5C11;2GB&#x5230;4GB&#x5185;&#x5B58;&#xFF08;RAM&#xFF09;&#x7684;&#x4E13;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x8FD0;&#x884C;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8F6F;&#x4EF6;&#x9700;&#x8981;&#x76D1;&#x63A7;&#x3001;&#x7EF4;&#x62A4;&#x548C;&#x9891;&#x7E41;&#x5347;&#x7EA7;&#x3002;&#x7531;&#x4E8E;&#x7F3A;&#x4E4F;&#x7EF4;&#x62A4;&#x6216;&#x8D44;&#x6E90;&#x5BFC;&#x81F4;&#x7684;&#x4EFB;&#x4F55;&#x5B95;&#x673A;&#x90FD;&#x4F1A;&#x4F24;&#x5BB3;&#x5230;&#x77FF;&#x5DE5;&#x7684;&#x5229;&#x6DA6;&#x3002;&#x5BF9;&#x4E8E;&#x5F88;&#x591A;&#x77FF;&#x5DE5;&#x6765;&#x8BF4;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x8DD1;&#x4E00;&#x4E2A;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x5C31;&#x80FD;&#x91C7;&#x77FF;&#xFF0C;&#x4E5F;&#x662F;&#x52A0;&#x5165;&#x6258;&#x7BA1;&#x77FF;&#x6C60;&#x7684;&#x4E00;&#x5927;&#x597D;&#x5904;&#x3002;</p>
<p>&#x77FF;&#x5DE5;&#x8FDE;&#x63A5;&#x5230;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x4F7F;&#x7528;&#x4E00;&#x4E2A;&#x91C7;&#x77FF;&#x534F;&#x8BAE;&#x6BD4;&#x5982;Stratum(STM)&#x6216;&#x8005; GetBlockTemplate(GBT)&#x3002;&#x4E00;&#x4E2A;&#x65E7;&#x6807;&#x51C6;GetWork(GWK)&#x81EA;&#x4ECE;2012&#x5E74;&#x5E95;&#x5DF2;&#x7ECF;&#x57FA;&#x672C;&#x4E0A;&#x8FC7;&#x65F6;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x652F;&#x6301;&#x5728;hash&#x901F;&#x5EA6;&#x8D85;&#x8FC7;4GH/S&#x65F6;&#x91C7;&#x77FF;&#x3002;STM&#x548C;GBT&#x534F;&#x8BAE;&#x90FD;&#x521B;&#x5EFA;&#x5305;&#x542B;&#x5019;&#x9009;&#x533A;&#x5757;&#x5934;&#x6A21;&#x677F;&#x7684;&#x533A;&#x5757;&#x6A21;&#x677F;&#x3002;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x901A;&#x8FC7;&#x6253;&#x5305;&#x4EA4;&#x6613;&#xFF0C;&#x6DFB;&#x52A0;coinbase&#x4EA4;&#x6613;&#xFF08;&#x548C;&#x989D;&#x5916;&#x7684;&#x968F;&#x673A;&#x503C;&#x7A7A;&#x95F4;&#xFF09;&#xFF0C;&#x8BA1;&#x7B97;MERKLE&#x6839;&#xFF0C; &#x5E76;&#x8FDE;&#x63A5;&#x5230;&#x4E0A;&#x4E00;&#x4E2A;&#x5757;hash&#x6765;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#x3002;&#x8FD9;&#x4E2A;&#x5019;&#x9009;&#x533A;&#x5757;&#x7684;&#x5934;&#x90E8;&#x4F5C;&#x4E3A;&#x6A21;&#x677F;&#x5206;&#x53D1;&#x7ED9;&#x6BCF;&#x4E2A;&#x77FF;&#x5DE5;&#x3002;&#x77FF;&#x5DE5;&#x7528;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x6A21;&#x677F;&#x5728;&#x4F4E;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x96BE;&#x5EA6;&#x4E0B;&#x91C7;&#x77FF;&#xFF0C;&#x5E76;&#x53D1;&#x9001;&#x6210;&#x529F;&#x7684;&#x7ED3;&#x679C;&#x8FD4;&#x56DE;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x8D5A;&#x53D6;&#x4EFD;&#x989D;&#x3002;</p>
<h4 id="101122-p2p&#x77FF;&#x6C60;">10.11.2.2 P2P&#x77FF;&#x6C60;</h4>
<p>&#x6258;&#x7BA1;&#x77FF;&#x6C60;&#x5B58;&#x5728;&#x7BA1;&#x7406;&#x4EBA;&#x4F5C;&#x5F0A;&#x7684;&#x53EF;&#x80FD;&#xFF0C;&#x7BA1;&#x7406;&#x4EBA;&#x53EF;&#x4EE5;&#x5229;&#x7528;&#x77FF;&#x6C60;&#x8FDB;&#x884C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x6216;&#x4F7F;&#x533A;&#x5757;&#x65E0;&#x6548;&#x3002;&#xFF08;&#x53C2;&#x89C1;&#x201C;10.12 &#x5171;&#x8BC6;&#x653B;&#x51FB;&#x201D;&#xFF09; &#x6B64;&#x5916;&#xFF0C;&#x4E2D; &#x5FC3;&#x5316;&#x7684;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x4EE3;&#x8868;&#x7740;&#x5355;&#x70B9;&#x6545;&#x969C;&#x3002;&#x5982;&#x679C;&#x56E0;&#x4E3A;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x653B;&#x51FB;&#x670D;&#x52A1;&#x5668;&#x6302;&#x4E86;&#x6216;&#x8005;&#x88AB;&#x51CF;&#x6162;&#xFF0C;&#x6C60;&#x4E2D;&#x77FF;&#x5DE5;&#x5C31;&#x4E0D;&#x80FD;&#x91C7;&#x77FF;&#x3002;</p>
<p>&#x5728;2011&#x5E74;&#xFF0C; &#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x7531;&#x4E2D;&#x5FC3;&#x5316;&#x9020;&#x6210;&#x7684;&#x8FD9;&#x4E9B;&#x95EE;&#x9898;&#xFF0C;&#x63D0;&#x51FA;&#x548C;&#x5B9E;&#x65BD;&#x4E86;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x77FF;&#x6C60;&#x6316;&#x77FF;&#x65B9;&#x6CD5;&#x3002;P2Pool&#x662F;&#x4E00;&#x4E2A;&#x70B9;&#x5BF9;&#x70B9;&#x7684;&#x77FF;&#x6C60;&#xFF0C;&#x6CA1;&#x6709;&#x4E2D;&#x5FC3;&#x7BA1;&#x7406; &#x4EBA;&#x3002;P2Pool&#x901A;&#x8FC7;&#x5C06;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x7684;&#x529F;&#x80FD;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x5E76;&#x884C;&#x7684;&#x7C7B;&#x4F3C;&#x533A;&#x5757;&#x94FE;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x540D;&#x53EB;&#x4EFD;&#x989D;&#x94FE;&#xFF08;share chain&#xFF09;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x4EFD;&#x989D;&#x94FE;&#x662F;&#x4E00;&#x4E2A;&#x96BE;&#x5EA6;&#x4F4E; &#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x3002;&#x4EFD;&#x989D;&#x94FE;&#x5141;&#x8BB8;&#x6C60;&#x4E2D;&#x77FF;&#x5DE5;&#x5728;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6C60;&#x4E2D;&#x5408;&#x4F5C;&#xFF0C;&#x4EE5;&#x6BCF;30&#x79D2;&#x4E00;&#x4E2A;&#x4EFD;&#x989D;&#x533A;&#x5757;&#x7684;&#x901F;&#x5EA6;&#x5728;&#x4EFD;&#x989D; &#x94FE;&#x4E0A;&#x91C7;&#x77FF;&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x4EFD;&#x989D;&#x3002;&#x4EFD;&#x989D;&#x94FE;&#x4E0A;&#x7684;&#x533A;&#x5757;&#x8BB0;&#x5F55;&#x4E86;&#x8D21;&#x732E;&#x5DE5;&#x4F5C;&#x7684;&#x77FF;&#x5DE5;&#x7684;&#x4EFD;&#x989D;&#xFF0C;&#x5E76;&#x4E14;&#x7EE7;&#x627F;&#x4E86;&#x4E4B;&#x524D;&#x4EFD;&#x989D;&#x533A;&#x5757;&#x4E0A;&#x7684;&#x4EFD;&#x989D;&#x8BB0;&#x5F55;&#x3002;&#x5F53;&#x4E00; &#x4E2A;&#x4EFD;&#x989D;&#x533A;&#x5757;&#x4E0A;&#x8FD8;&#x5B9E;&#x73B0;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x65F6;&#xFF0C;&#x5B83;&#x5C06;&#x88AB;&#x5E7F;&#x64AD;&#x5E76;&#x5305;&#x542B;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#xFF0C;&#x5E76;&#x5956;&#x52B1;&#x6240;&#x6709;&#x5DF2;&#x7ECF;&#x5728;&#x4EFD;&#x989D;&#x94FE;&#x533A; &#x5757;&#x4E2D;&#x53D6;&#x5F97;&#x4EFD;&#x989D;&#x7684;&#x6C60;&#x4E2D;&#x77FF;&#x5DE5;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x4E0A;&#x8BF4;&#xFF0C;&#x6BD4;&#x8D77;&#x7528;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x8BB0;&#x5F55;&#x77FF;&#x5DE5;&#x7684;&#x4EFD;&#x989D;&#x548C;&#x5956;&#x52B1;&#xFF0C;&#x4EFD;&#x989D;&#x94FE;&#x5141;&#x8BB8;&#x6240;&#x6709;&#x77FF;&#x5DE5;&#x901A;&#x8FC7;&#x7C7B;&#x4F3C;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7CFB;&#x7EDF;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x8DDF;&#x8E2A;&#x6240;&#x6709;&#x4EFD;&#x989D;&#x3002;P2Pool&#x91C7;&#x77FF;&#x65B9;&#x5F0F;&#x6BD4;&#x5728;&#x77FF;&#x6C60;&#x4E2D;&#x91C7;&#x77FF;&#x8981;&#x590D;&#x6742;&#x7684;&#x591A;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x8981;&#x6C42;&#x77FF;&#x5DE5;&#x8FD0;&#x884C;&#x7A7A;&#x95F4;&#x3001;&#x5185;&#x5B58;&#x3001;&#x5E26;&#x5BBD;&#x5145;&#x8DB3;&#x7684;&#x4E13;&#x7528;&#x8BA1;&#x7B97;&#x673A;&#x6765;&#x652F;&#x6301;&#x4E00;&#x4E2A;&#x6BD4;&#x7279; &#x5E01;&#x7684;&#x5B8C;&#x6574;&#x8282;&#x70B9;&#x548C;P2Pool&#x8282;&#x70B9;&#x8F6F;&#x4EF6;&#x3002;P2Pool&#x77FF;&#x5DE5;&#x8FDE;&#x63A5;&#x4ED6;&#x4EEC;&#x7684;&#x91C7;&#x77FF;&#x786C;&#x4EF6;&#x5230;&#x672C;&#x5730;P2Pool&#x8282;&#x70B9;&#xFF0C;&#x5B83;&#x901A;&#x8FC7;&#x53D1;&#x9001;&#x533A;&#x5757;&#x6A21;&#x677F;&#x5230;&#x77FF;&#x673A;&#x6765; &#x6A21;&#x62DF;&#x4E00;&#x4E2A;&#x77FF;&#x6C60;&#x670D;&#x52A1;&#x5668;&#x7684;&#x529F;&#x80FD;&#x3002;&#x5728;P2Pool&#x4E2D;&#xFF0C;&#x5355;&#x72EC;&#x7684;&#x77FF;&#x5DE5;&#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x5019;&#x9009;&#x533A;&#x5757;&#xFF0C;&#x6253;&#x5305;&#x4EA4;&#x6613;&#xFF0C;&#x975E;&#x5E38;&#x7C7B;&#x4F3C;&#x4E8E;solo&#x77FF;&#x5DE5;&#xFF0C;&#x4F46;&#x662F;&#x4ED6; &#x4EEC;&#x5728;&#x4EFD;&#x989D;&#x94FE;&#x4E0A;&#x5408;&#x4F5C;&#x91C7;&#x77FF;&#x3002;</p>
<p>P2Pool&#x662F;&#x4E00;&#x79CD;&#x6BD4;&#x5355;&#x72EC;&#x6316;&#x77FF;&#x6709;&#x66F4;&#x7EC6;&#x7C92;&#x5EA6;&#x6536;&#x5165;&#x4F18;&#x52BF;&#x7684;&#x6DF7;&#x5408;&#x65B9;&#x6CD5;&#x3002;&#x4F46;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x50CF;&#x6258;&#x7BA1;&#x77FF;&#x6C60;&#x90A3;&#x6837;&#x7ED9;&#x7BA1;&#x7406; &#x4EBA;&#x592A;&#x591A;&#x6743;&#x529B;&#x3002;&#x5373;&#x4F7F;P2Pool&#x51CF;&#x5C11;&#x4E86;&#x91C7;&#x77FF;&#x6C60;&#x8FD0;&#x8425;&#x5546;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x7A0B;&#x5EA6;&#xFF0C;&#x4F46;&#x4E5F;&#x53EF;&#x80FD;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x4EFD;&#x989D;&#x94FE;&#x672C;&#x8EAB;&#x7684;51&#xFF05;&#x7684;&#x653B;&#x51FB;&#x3002; P2Pool&#x7684;&#x5E7F;&#x6CDB;&#x91C7;&#x7528;&#x5E76;&#x4E0D;&#x80FD;&#x89E3;&#x51B3;&#x6BD4;&#x7279;&#x5E01;&#x672C;&#x8EAB;&#x7684;51&#xFF05;&#x653B;&#x51FB;&#x95EE;&#x9898;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x4F5C;&#x4E3A;&#x591A;&#x6837;&#x5316;&#x91C7;&#x77FF;&#x751F;&#x6001;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;P2Pool&#x6574;&#x4F53;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x66F4;&#x52A0;&#x5F3A;&#x5927;&#x3002;</p>
<h2 id="1012-&#x5171;&#x8BC6;&#x653B;&#x51FB;">10.12 &#x5171;&#x8BC6;&#x653B;&#x51FB;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x6307;&#x7684;&#x662F;&#xFF0C;&#x88AB;&#x77FF;&#x5DE5;&#xFF08;&#x6216;&#x77FF;&#x6C60;&#xFF09;&#x8BD5;&#x56FE;&#x4F7F;&#x7528;&#x81EA;&#x5DF1;&#x7684;&#x7B97;&#x529B;&#x5B9E;&#x884C;&#x6B3A;&#x9A97;&#x6216;&#x7834;&#x574F;&#x7684;&#x96BE;&#x5EA6;&#x5F88;&#x5927;&#xFF0C;&#x81F3;&#x5C11;&#x7406;&#x8BBA;&#x4E0A;&#x662F;&#x8FD9;&#x6837;&#x3002;&#x5C31;&#x50CF;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x8BB2;&#x7684;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x4F9D;&#x8D56;&#x4E8E;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x524D;&#x63D0;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x51FA;&#x4E8E;&#x81EA;&#x5DF1;&#x5229;&#x76CA;&#x6700;&#x5927;&#x5316;&#x7684;&#x8003;&#x8651;&#xFF0C;&#x90FD;&#x4F1A; &#x901A;&#x8FC7;&#x8BDA;&#x5B9E;&#x5730;&#x6316;&#x77FF;&#x6765;&#x7EF4;&#x6301;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5F53;&#x4E00;&#x4E2A;&#x6216;&#x8005;&#x4E00;&#x7FA4;&#x62E5;&#x6709;&#x4E86;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x5927;&#x91CF;&#x7B97;&#x529B;&#x7684;&#x77FF;&#x5DE5;&#x51FA;&#x73B0;&#x4E4B;&#x540E;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x53EF; &#x4EE5;&#x901A;&#x8FC7;&#x653B;&#x51FB;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#x6765;&#x8FBE;&#x5230;&#x7834;&#x574F;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x5B89;&#x5168;&#x6027;&#x548C;&#x53EF;&#x9760;&#x6027;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x53EA;&#x80FD;&#x5F71;&#x54CD;&#x6574;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x672A;&#x6765;&#x7684;&#x5171;&#x8BC6;&#xFF0C;&#x6216;&#x8005;&#x8BF4;&#xFF0C;&#x6700;&#x591A;&#x80FD;&#x5F71;&#x54CD;&#x4E0D;&#x4E45;&#x7684;&#x8FC7;&#x53BB;&#x51E0;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x5171;&#x8BC6;&#xFF08;&#x6700;&#x591A;&#x5F71;&#x54CD; &#x8FC7;&#x53BB;10&#x4E2A;&#x5757;&#xFF09;&#x3002;&#x800C;&#x4E14;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5757;&#x94FE;&#x88AB;&#x7BE1;&#x6539;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x8D8A;&#x6765;&#x8D8A;&#x4F4E;&#x3002;</p>
<p>&#x7406;&#x8BBA;&#x4E0A;&#xFF0C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x53EF;&#x4EE5;&#x53D8;&#x5F97;&#x5F88; &#x957F;&#xFF0C;&#x4F46;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x8981;&#x60F3;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x957F;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x9700;&#x8981;&#x7684;&#x7B97;&#x529B;&#x975E;&#x5E38;&#x975E;&#x5E38;&#x5927;&#xFF0C;&#x968F;&#x7740;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x9010;&#x6E10;&#x589E;&#x957F;&#xFF0C;&#x8FC7;&#x53BB;&#x7684;&#x533A; &#x5757;&#x57FA;&#x672C;&#x53EF;&#x4EE5;&#x8BA4;&#x4E3A;&#x662F;&#x65E0;&#x6CD5;&#x88AB;&#x5206;&#x53C9;&#x7BE1;&#x6539;&#x7684;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x4E5F;&#x4E0D;&#x4F1A;&#x5F71;&#x54CD;&#x7528;&#x6237;&#x7684;&#x79C1;&#x94A5;&#x4EE5;&#x53CA;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF08;ECDSA&#xFF09;&#x3002;</p>
<p>&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x4E5F; &#x4E0D;&#x80FD;&#x4ECE;&#x5176;&#x4ED6;&#x7684;&#x94B1;&#x5305;&#x90A3;&#x91CC;&#x5077;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x3001;&#x4E0D;&#x7B7E;&#x540D;&#x5730;&#x652F;&#x4ED8;&#x6BD4;&#x7279;&#x5E01;&#x3001;&#x91CD;&#x65B0;&#x5206;&#x914D;&#x6BD4;&#x7279;&#x5E01;&#x3001;&#x6539;&#x53D8;&#x8FC7;&#x53BB;&#x7684;&#x4EA4;&#x6613;&#x6216;&#x8005;&#x6539;&#x53D8;&#x6BD4;&#x7279;&#x5E01;&#x6301;&#x6709;&#x7EAA; &#x5F55;&#x3002;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x80FD;&#x591F;&#x9020;&#x6210;&#x7684;&#x552F;&#x4E00;&#x5F71;&#x54CD;&#x662F;&#x5F71;&#x54CD;&#x6700;&#x8FD1;&#x7684;&#x533A;&#x5757;&#xFF08;&#x6700;&#x591A;10&#x4E2A;&#xFF09;&#x5E76;&#x4E14;&#x901A;&#x8FC7;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x6765;&#x5F71;&#x54CD;&#x672A;&#x6765;&#x533A;&#x5757;&#x7684;&#x751F;&#x6210;&#x3002;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x7684;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x573A;&#x666F;&#x5C31;&#x662F;&#x201C;51%&#x653B;&#x51FB;&#x201D;&#x3002;&#x60F3;&#x8C61;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x573A;&#x666F;&#xFF0C;&#x4E00;&#x7FA4;&#x77FF;&#x5DE5;&#x63A7;&#x5236;&#x4E86;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;51&#xFF05;&#x7684;&#x7B97;&#x529B;&#xFF0C;&#x4ED6;&#x4EEC;&#x8054;&#x5408; &#x8D77;&#x6765;&#x6253;&#x7B97;&#x653B;&#x51FB;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x3002;&#x7531;&#x4E8E;&#x8FD9;&#x7FA4;&#x77FF;&#x5DE5;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x5757;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6545;&#x610F;&#x5236;&#x9020;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x6765;&#x5B9E;&#x73B0;&#x201C;&#x53CC;&#x91CD;&#x652F; &#x4ED8;&#x201D;&#x6216;&#x8005;&#x901A;&#x8FC7;&#x62D2;&#x7EDD;&#x670D;&#x52A1;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x963B;&#x6B62;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x6216;&#x8005;&#x653B;&#x51FB;&#x7279;&#x5B9A;&#x7684;&#x94B1;&#x5305;&#x5730;&#x5740;&#x3002;</p>
<p>&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;/&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x653B;&#x51FB;&#x6307;&#x7684;&#x662F;&#x653B;&#x51FB;&#x8005;&#x901A;&#x8FC7; &#x4E0D;&#x627F;&#x8BA4;&#x6700;&#x8FD1;&#x7684;&#x67D0;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x5728;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x91CD;&#x6784;&#x65B0;&#x7684;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x751F;&#x6210;&#x65B0;&#x7684;&#x5206;&#x53C9;&#xFF0C;&#x7EE7;&#x800C;&#x5B9E;&#x73B0;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;&#x6709;&#x4E86;&#x5145;&#x8DB3;&#x7B97;&#x529B;&#x7684;&#x4FDD; &#x8BC1;&#xFF0C;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x53EF;&#x4EE5;&#x4E00;&#x6B21;&#x6027;&#x7BE1;&#x6539;&#x6700;&#x8FD1;&#x7684;6&#x4E2A;&#x6216;&#x8005;&#x66F4;&#x591A;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x4F7F;&#x5F97;&#x8FD9;&#x4E9B;&#x533A;&#x5757;&#x5305;&#x542B;&#x7684;&#x672C;&#x5E94;&#x65E0;&#x6CD5;&#x7BE1;&#x6539;&#x7684;&#x4EA4;&#x6613;&#x6D88;&#x5931;&#x3002;&#x503C;&#x5F97;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x53EA;&#x80FD;&#x5728;&#x653B;&#x51FB;&#x8005;&#x62E5;&#x6709;&#x7684;&#x94B1;&#x5305;&#x6240;&#x53D1;&#x751F;&#x7684;&#x4EA4;&#x6613;&#x4E0A;&#x8FDB;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x53EA;&#x6709;&#x94B1;&#x5305;&#x7684;&#x62E5;&#x6709;&#x8005;&#x624D;&#x80FD;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x5408;&#x6CD5;&#x7684;&#x7B7E;&#x540D;&#x7528; &#x4E8E;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x3002;&#x653B;&#x51FB;&#x8005;&#x5728;&#x81EA;&#x5DF1;&#x7684;&#x4EA4;&#x6613;&#x4E0A;&#x8FDB;&#x884C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x653B;&#x51FB;&#xFF0C;&#x5982;&#x679C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F7F;&#x4EA4;&#x6613;&#x65E0;&#x6548;&#x800C;&#x5B9E;&#x73B0;&#x5BF9;&#x4E8E;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x8D2D;&#x4E70;&#x884C;&#x4E3A;&#x4E0D;&#x4E88;&#x4ED8;&#x6B3E;&#xFF0C; &#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x5C31;&#x662F;&#x6709;&#x5229;&#x53EF;&#x56FE;&#x7684;&#x3002;</p>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x4E00;&#x4E2A;&#x201C;51%&#x653B;&#x51FB;&#x201D;&#x7684;&#x5B9E;&#x9645;&#x6848;&#x4F8B;&#x5427;&#x3002;&#x5728;&#x7B2C;1&#x7AE0;&#x6211;&#x4EEC;&#x8BB2;&#x5230;&#xFF0C;Alice &#x548C; Bob &#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x5B8C;&#x6210;&#x4E86;&#x4E00;&#x676F;&#x5496;&#x5561;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5496;&#x5561; &#x5E97;&#x8001;&#x677F; Bob &#x613F;&#x610F;&#x5728; Alice &#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x8F6C;&#x8D26;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x6570;&#x4E3A;&#x96F6;&#x7684;&#x65F6;&#x5019;&#x5C31;&#x5411;&#x5176;&#x63D0;&#x4F9B;&#x5496;&#x5561;&#xFF0C;&#x8FD9;&#x662F;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5C0F;&#x989D;&#x4EA4;&#x6613;&#x906D;&#x9047;&#x201C;51%&#x653B; &#x51FB;&#x201D;&#x7684;&#x98CE;&#x9669;&#x548C;&#x987E;&#x5BA2;&#x8D2D;&#x7269;&#x7684;&#x5373;&#x65F6;&#x6027;&#xFF08;Alice &#x80FD;&#x7ACB;&#x5373;&#x62FF;&#x5230;&#x5496;&#x5561;&#xFF09;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x663E;&#x5F97;&#x5FAE;&#x4E0D;&#x8DB3;&#x9053;&#x3002;&#x8FD9;&#x5C31;&#x548C;&#x5927;&#x90E8;&#x5206;&#x7684;&#x5496;&#x5561;&#x5E97;&#x5BF9;&#x4F4E;&#x4E8E;25&#x7F8E;&#x5143; &#x7684;&#x4FE1;&#x7528;&#x5361;&#x6D88;&#x8D39;&#x4E0D;&#x4F1A;&#x8D39;&#x65F6;&#x8D39;&#x529B;&#x5730;&#x5411;&#x987E;&#x5BA2;&#x7D22;&#x8981;&#x7B7E;&#x540D;&#x662F;&#x4E00;&#x6837;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x548C;&#x987E;&#x5BA2;&#x6709;&#x53EF;&#x80FD;&#x64A4;&#x9500;&#x8FD9;&#x7B14;&#x4FE1;&#x7528;&#x5361;&#x652F;&#x4ED8;&#x7684;&#x98CE;&#x9669;&#x6BD4;&#x8D77;&#x6765;&#xFF0C;&#x5411;&#x7528;&#x6237; &#x7D22;&#x8981;&#x4FE1;&#x7528;&#x5361;&#x7B7E;&#x540D;&#x7684;&#x6210;&#x672C;&#x66F4;&#x9AD8;&#x3002;</p>
<p>&#x76F8;&#x5E94;&#x7684;&#xFF0C;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x652F;&#x4ED8;&#x7684;&#x5927;&#x989D;&#x4EA4;&#x6613;&#x88AB;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x7684;&#x98CE;&#x9669;&#x5C31;&#x9AD8;&#x5F97;&#x591A;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x4E70;&#x5BB6;&#xFF08;&#x653B;&#x51FB;&#x8005;&#xFF09; &#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5728;&#x5168;&#x7F51;&#x5E7F;&#x64AD;&#x4E00;&#x4E2A;&#x548C;&#x771F;&#x5B9E;&#x4EA4;&#x6613;&#x7684;UTXO&#x4E00;&#x6837;&#x7684;&#x4F2A;&#x9020;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x53D6;&#x6D88;&#x771F;&#x5B9E;&#x4EA4;&#x6613;&#x7684;&#x76EE;&#x7684;&#x3002;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x53EF;&#x4EE5;&#x6709;&#x4E24;&#x79CD;&#x65B9; &#x5F0F;&#xFF1A;&#x8981;&#x4E48;&#x662F;&#x5728;&#x4EA4;&#x6613;&#x88AB;&#x786E;&#x8BA4;&#x4E4B;&#x524D;&#xFF0C;&#x8981;&#x4E48;&#x653B;&#x51FB;&#x8005;&#x901A;&#x8FC7;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x6765;&#x5B8C;&#x6210;&#x3002;&#x8FDB;&#x884C;51%&#x653B;&#x51FB;&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x53D6;&#x6D88;&#x5728;&#x65E7;&#x5206;&#x53C9;&#x4E0A;&#x7684;&#x4EA4;&#x6613;&#x8BB0; &#x5F55;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x65B0;&#x5206;&#x53C9;&#x4E0A;&#x91CD;&#x65B0;&#x751F;&#x6210;&#x4E00;&#x4E2A;&#x540C;&#x6837;&#x91D1;&#x989D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x3002;</p>
<p>&#x518D;&#x4E3E;&#x4E2A;&#x4F8B;&#x5B50;&#xFF1A;&#x653B;&#x51FB;&#x8005;Mallory&#x5728;Carol&#x7684;&#x753B;&#x5ECA;&#x4E70;&#x4E86;&#x63CF;&#x7ED8;&#x4F1F;&#x5927;&#x7684;&#x4E2D;&#x672C;&#x806A;&#x7684;&#x4E09;&#x8054;&#x7EC4;&#x753B;&#xFF08;The Great Fire&#xFF09;&#xFF0C;Mallory&#x901A;&#x8FC7;&#x8F6C;&#x8D26;&#x4EF7;&#x503C;25&#x4E07;&#x7F8E;&#x91D1;&#x7684;&#x6BD4;&#x7279;&#x5E01; &#x4E0E;Carol&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x7B49;&#x5230;&#x4E00;&#x4E2A;&#x800C;&#x4E0D;&#x662F;&#x516D;&#x4E2A;&#x4EA4;&#x6613;&#x786E;&#x8BA4;&#x4E4B;&#x540E;&#xFF0C;Carol&#x653E;&#x5FC3;&#x5730;&#x5C06;&#x8FD9;&#x5E45;&#x7EC4;&#x753B;&#x5305;&#x597D;&#xFF0C;&#x4EA4;&#x7ED9;&#x4E86;Mallory&#x3002;&#x8FD9;&#x65F6;&#xFF0C;Mallory &#x7684;&#x4E00;&#x4E2A;&#x540C;&#x4F19;&#xFF0C;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x5927;&#x91CF;&#x7B97;&#x529B;&#x7684;&#x77FF;&#x6C60;&#x7684;&#x4EBA;Paul&#xFF0C;&#x5728;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5199;&#x8FDB;&#x533A;&#x5757;&#x94FE;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5F00;&#x59CB;&#x4E86;51%&#x653B;&#x51FB;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;Paul&#x5229;&#x7528;&#x81EA;&#x5DF1;&#x77FF;&#x6C60;&#x7684;&#x7B97;&#x529B;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#x5305;&#x542B;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x65B0;&#x5757;&#x91CC;&#x5C06;&#x539F;&#x6765;&#x7684;&#x4EA4;&#x6613;&#x66FF;&#x6362;&#x6210;&#x4E86;&#x53E6;&#x5916;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF08;&#x6BD4;&#x5982;&#x76F4;&#x63A5;&#x8F6C;&#x7ED9;&#x4E86;Mallory &#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x800C;&#x4E0D;&#x662F;Carol&#x7684;&#xFF09;&#xFF0C;&#x4ECE;&#x800C;&#x5B9E;&#x73B0;&#x4E86;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x3002;&#x8FD9;&#x7B14;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x4EA4;&#x6613;&#x4F7F;&#x7528;&#x4E86;&#x8DDF;&#x539F;&#x6709;&#x4EA4;&#x6613;&#x4E00;&#x81F4;&#x7684;UTXO&#xFF0C;&#x4F46;&#x6536;&#x6B3E;&#x4EBA;&#x88AB;&#x66FF;&#x6362;&#x6210;&#x4E86;Mallory&#x7684;&#x94B1;&#x5305;&#x5730;&#x5740;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;Paul&#x5229;&#x7528;&#x77FF;&#x6C60;&#x5728;&#x4F2A;&#x9020;&#x7684;&#x5757;&#x7684;&#x57FA;&#x7840;&#x4E0A;&#xFF0C;&#x53C8;&#x8BA1;&#x7B97;&#x51FA;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x7684;&#x5757;&#xFF0C;&#x8FD9;&#x6837;&#xFF0C;&#x5305;&#x542B;&#x8FD9; &#x7B14;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x4EA4;&#x6613;&#x7684;&#x5757;&#x94FE;&#x6BD4;&#x539F;&#x6709;&#x7684;&#x5757;&#x94FE;&#x9AD8;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5757;&#x3002;&#x5230;&#x6B64;&#xFF0C;&#x9AD8;&#x5EA6;&#x66F4;&#x9AD8;&#x7684;&#x5206;&#x53C9;&#x533A;&#x5757;&#x94FE;&#x53D6;&#x4EE3;&#x4E86;&#x539F;&#x6709;&#x7684;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x4EA4; &#x6613;&#x53D6;&#x4EE3;&#x4E86;&#x539F;&#x6765;&#x7ED9;Carol&#x7684;&#x4EA4;&#x6613;&#xFF0C;Carol&#x65E2;&#x6CA1;&#x6709;&#x6536;&#x5230;&#x4EF7;&#x503C;25&#x4E07;&#x7F8E;&#x91D1;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x539F;&#x672C;&#x62E5;&#x6709;&#x7684;&#x4E09;&#x5E45;&#x4EF7;&#x503C;&#x8FDE;&#x57CE;&#x7684;&#x753B;&#x4E5F;&#x88AB;Mallory&#x767D;&#x767D; &#x62FF;&#x8D70;&#x4E86;&#x3002;</p>
<p>&#x5728;&#x6574;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;Paul&#x77FF;&#x6C60;&#x91CC;&#x7684;&#x5176;&#x4ED6;&#x77FF;&#x5DE5;&#x53EF;&#x80FD;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x6CA1;&#x6709;&#x89C9;&#x5BDF;&#x5230;&#x8FD9;&#x7B14;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x4EA4;&#x6613;&#x6709;&#x4EC0;&#x4E48;&#x5F02;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x6316;&#x77FF;&#x7A0B;&#x5E8F;&#x90FD;&#x662F;&#x81EA;&#x52A8;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x65F6;&#x65F6;&#x76D1;&#x63A7;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x907F;&#x514D;&#x8FD9;&#x7C7B;&#x653B;&#x51FB;&#xFF0C;&#x552E;&#x5356;&#x5927;&#x5B97;&#x5546;&#x54C1;&#x7684;&#x5546;&#x5BB6;&#x5E94;&#x8BE5;&#x5728;&#x4EA4;&#x6613;&#x5F97;&#x5230;&#x5168;&#x7F51;&#x7684;6&#x4E2A;&#x786E;&#x8BA4;&#x4E4B;&#x540E;&#x518D;&#x4EA4;&#x4ED8;&#x5546;&#x54C1;&#x3002;&#x6216;&#x8005;&#xFF0C;&#x5546;&#x5BB6;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x7B2C;&#x4E09;&#x65B9; &#x7684;&#x591A;&#x65B9;&#x7B7E;&#x540D;&#x7684;&#x8D26;&#x6237;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x4E14;&#x4E5F;&#x8981;&#x7B49;&#x5230;&#x4EA4;&#x6613;&#x8D26;&#x6237;&#x83B7;&#x5F97;&#x5168;&#x7F51;&#x591A;&#x4E2A;&#x786E;&#x8BA4;&#x4E4B;&#x540E;&#x518D;&#x4EA4;&#x4ED8;&#x5546;&#x54C1;&#x3002;&#x4E00;&#x6761;&#x4EA4;&#x6613;&#x7684;&#x786E;&#x8BA4;&#x6570;&#x8D8A;&#x591A;&#xFF0C;&#x8D8A;&#x96BE; &#x88AB;&#x653B;&#x51FB;&#x8005;&#x901A;&#x8FC7;51%&#x653B;&#x51FB;&#x7BE1;&#x6539;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x5927;&#x5B97;&#x5546;&#x54C1;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x4ED8;&#x6B3E;24&#x5C0F;&#x65F6;&#x4E4B;&#x540E;&#x518D;&#x53D1;&#x8D27;&#xFF0C;&#x5BF9;&#x4E70;&#x5356;&#x53CC;&#x65B9;&#x6765;&#x8BF4;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x652F;&#x4ED8;&#x4E5F; &#x662F;&#x65B9;&#x4FBF;&#x5E76;&#x4E14;&#x6709;&#x6548;&#x7387;&#x7684;&#x3002;&#x800C;24&#x5C0F;&#x65F6;&#x4E4B;&#x540E;&#xFF0C;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x7684;&#x5168;&#x7F51;&#x786E;&#x8BA4;&#x6570;&#x5C06;&#x8FBE;&#x5230;&#x81F3;&#x5C11;144&#x4E2A;&#xFF08;&#x80FD;&#x6709;&#x6548;&#x964D;&#x4F4E;&#x88AB;51%&#x653B;&#x51FB;&#x7684;&#x53EF;&#x80FD;&#x6027;&#xFF09;&#x3002;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x4E2D;&#x9664;&#x4E86;&#x201C;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x201D;&#x653B;&#x51FB;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x79CD;&#x653B;&#x51FB;&#x573A;&#x666F;&#x5C31;&#x662F;&#x62D2;&#x7EDD;&#x5BF9;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x63D0;&#x4F9B;&#x670D;&#x52A1;&#x3002;&#x4E00;&#x4E2A;&#x62E5;&#x6709;&#x4E86;&#x7CFB;&#x7EDF;&#x4E2D;&#x7EDD; &#x5927;&#x591A;&#x6570;&#x7B97;&#x529B;&#x7684;&#x653B;&#x51FB;&#x8005;&#xFF0C;&#x53EF;&#x4EE5;&#x8F7B;&#x6613;&#x5730;&#x5FFD;&#x7565;&#x67D0;&#x4E00;&#x7B14;&#x7279;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5B58;&#x5728;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x8BE5;&#x653B;&#x51FB;&#x8005; &#x53EF;&#x4EE5;&#x6545;&#x610F;&#x5206;&#x53C9;&#xFF0C;&#x7136;&#x540E;&#x91CD;&#x65B0;&#x4EA7;&#x751F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x628A;&#x60F3;&#x5FFD;&#x7565;&#x7684;&#x4EA4;&#x6613;&#x4ECE;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x79FB;&#x9664;&#x3002;&#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x9020;&#x6210;&#x7684;&#x7ED3;&#x679C;&#x5C31;&#x662F;&#xFF0C;&#x53EA;&#x8981;&#x8FD9;&#x540D; &#x653B;&#x51FB;&#x8005;&#x62E5;&#x6709;&#x7CFB;&#x7EDF;&#x4E2D;&#x7684;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7B97;&#x529B;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x5C31;&#x53EF;&#x4EE5;&#x6301;&#x7EED;&#x5730;&#x5E72;&#x9884;&#x67D0;&#x4E00;&#x4E2A;&#x6216;&#x67D0;&#x4E00;&#x6279;&#x7279;&#x5B9A;&#x94B1;&#x5305;&#x5730;&#x5740;&#x4EA7;&#x751F;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x4ECE;&#x800C;&#x8FBE;&#x5230; &#x62D2;&#x7EDD;&#x4E3A;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x670D;&#x52A1;&#x7684;&#x76EE;&#x7684;&#x3002;</p>
<p>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#xFF0C;51%&#x653B;&#x51FB;&#x5E76;&#x4E0D;&#x662F;&#x50CF;&#x5B83;&#x7684;&#x547D;&#x540D;&#x91CC;&#x8BF4;&#x7684;&#x90A3;&#x6837;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x9700;&#x8981;&#x81F3;&#x5C11;51%&#x7684;&#x7B97;&#x529B;&#x624D;&#x80FD;&#x53D1;&#x8D77;&#xFF0C;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5373;&#x4F7F;&#x5176;&#x62E5;&#x6709;&#x4E0D; &#x5230;51%&#x7684;&#x7CFB;&#x7EDF;&#x7B97;&#x529B;&#xFF0C;&#x4F9D;&#x7136;&#x53EF;&#x4EE5;&#x5C1D;&#x8BD5;&#x53D1;&#x8D77;&#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x3002;&#x4E4B;&#x6240;&#x4EE5;&#x547D;&#x540D;&#x4E3A;51&#xFF05;&#x653B;&#x51FB;&#xFF0C;&#x53EA;&#x662F;&#x56E0;&#x4E3A;&#x5728;&#x653B;&#x51FB;&#x8005;&#x7684;&#x7B97;&#x529B;&#x8FBE;&#x5230;51%&#x8FD9;&#x4E2A;&#x9608;&#x503C; &#x7684;&#x65F6;&#x5019;&#xFF0C;&#x5176;&#x53D1;&#x8D77;&#x7684;&#x653B;&#x51FB;&#x5C1D;&#x8BD5;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x4F1A;&#x6210;&#x529F;&#x3002;</p>
<p>&#x672C;&#x8D28;&#x4E0A;&#x6765;&#x770B;&#xFF0C;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#xFF0C;&#x5C31;&#x50CF;&#x662F;&#x7CFB;&#x7EDF;&#x4E2D;&#x6240;&#x6709;&#x77FF;&#x5DE5;&#x7684;&#x7B97;&#x529B;&#x88AB;&#x5206;&#x6210;&#x4E86;&#x4E24;&#x7EC4;&#xFF0C;&#x4E00; &#x7EC4;&#x4E3A;&#x8BDA;&#x5B9E;&#x7B97;&#x529B;&#xFF0C;&#x4E00;&#x7EC4;&#x4E3A;&#x653B;&#x51FB;&#x8005;&#x7B97;&#x529B;&#xFF0C;&#x4E24;&#x7EC4;&#x4EBA;&#x90FD;&#x5728;&#x4E89;&#x5148;&#x6050;&#x540E;&#x5730;&#x8BA1;&#x7B97;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x65B0;&#x5757;&#xFF0C;&#x53EA;&#x662F;&#x653B;&#x51FB;&#x8005;&#x7B97;&#x529B;&#x7B97;&#x51FA;&#x6765;&#x7684;&#x662F;&#x7CBE;&#x5FC3;&#x6784;&#x9020; &#x7684;&#x3001;&#x5305;&#x542B;&#x6216;&#x8005;&#x5254;&#x9664;&#x4E86;&#x67D0;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x5757;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x62E5;&#x6709;&#x7684;&#x7B97;&#x529B;&#x8D8A;&#x5C11;&#xFF0C;&#x5728;&#x8FD9;&#x573A;&#x51B3;&#x9010;&#x4E2D;&#x83B7;&#x80DC;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C31;&#x8D8A;&#x5C0F;&#x3002;</p>
<p>&#x4ECE;&#x53E6;&#x4E00;&#x4E2A;&#x89D2;&#x5EA6; &#x8BB2;&#xFF0C;&#x4E00;&#x4E2A;&#x653B;&#x51FB;&#x8005;&#x62E5;&#x6709;&#x7684;&#x7B97;&#x529B;&#x8D8A;&#x591A;&#xFF0C;&#x5176;&#x6545;&#x610F;&#x521B;&#x9020;&#x7684;&#x5206;&#x53C9;&#x5757;&#x94FE;&#x5C31;&#x53EF;&#x80FD;&#x8D8A;&#x957F;&#xFF0C;&#x53EF;&#x80FD;&#x88AB;&#x7BE1;&#x6539;&#x7684;&#x6700;&#x8FD1;&#x7684;&#x5757;&#x6216;&#x8005;&#x6216;&#x8005;&#x53D7;&#x5176;&#x63A7;&#x5236;&#x7684;&#x672A;&#x6765; &#x7684;&#x5757;&#x5C31;&#x4F1A;&#x8D8A;&#x591A;&#x3002;&#x4E00;&#x4E9B;&#x5B89;&#x5168;&#x7814;&#x7A76;&#x7EC4;&#x7EC7;&#x5229;&#x7528;&#x7EDF;&#x8BA1;&#x6A21;&#x578B;&#x5F97;&#x51FA;&#x7684;&#x7ED3;&#x8BBA;&#x662F;&#xFF0C;&#x7B97;&#x529B;&#x8FBE;&#x5230;&#x5168;&#x7F51;&#x7684;30%&#x5C31;&#x8DB3;&#x4EE5;&#x53D1;&#x52A8;51%&#x653B;&#x51FB;&#x4E86;&#x3002;&#x5168;&#x7F51;&#x7B97;&#x529B;&#x7684;&#x6025;&#x5267;&#x589E;&#x957F;&#x5DF2;&#x7ECF;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E0D;&#x518D;&#x53EF;&#x80FD;&#x88AB;&#x67D0;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x653B;&#x51FB;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x4E2A;&#x77FF;&#x5DE5;&#x5DF2;&#x7ECF;&#x4E0D;&#x53EF;&#x80FD;&#x5360;&#x636E;&#x5168;&#x7F51;&#x54EA;&#x6015;&#x7684;1%&#x7B97; &#x529B;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x4E2D;&#x5FC3;&#x5316;&#x63A7;&#x5236;&#x7684;&#x77FF;&#x6C60;&#x5219;&#x5F15;&#x5165;&#x4E86;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x51FA;&#x4E8E;&#x5229;&#x76CA;&#x800C;&#x65BD;&#x884C;&#x653B;&#x51FB;&#x7684;&#x98CE;&#x9669;&#x3002;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x63A7;&#x5236;&#x4E86;&#x5019;&#x9009;&#x5757;&#x7684;&#x751F;&#x6210;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x63A7;&#x5236;&#x54EA;&#x4E9B;&#x4EA4;&#x6613;&#x4F1A;&#x88AB;&#x653E;&#x5230;&#x65B0;&#x751F;&#x6210;&#x7684;&#x5757;&#x4E2D;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x5C31;&#x62E5;&#x6709;&#x4E86;&#x5254;&#x9664;&#x7279;&#x5B9A;&#x4EA4;&#x6613;&#x6216;&#x8005;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x7684;&#x6743;&#x529B;&#x3002;&#x5982;&#x679C;&#x8FD9;&#x79CD;&#x6743;&#x5229;&#x88AB;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x4EE5;&#x5FAE;&#x5999;&#x800C;&#x6709;&#x8282;&#x5236;&#x7684;&#x65B9;&#x5F0F;&#x6EE5;&#x7528;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x4E48;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x4E3A;&#x4EBA;&#x77E5;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x53D1;&#x52A8;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x5E76;&#x83B7;&#x76CA;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5E76;&#x4E0D;&#x662F;&#x6240;&#x6709;&#x7684;&#x653B;&#x51FB;&#x8005;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x5229;&#x76CA;&#x3002;</p>
<p>&#x4E00;&#x4E2A;&#x53EF;&#x80FD;&#x7684;&#x573A;&#x666F;&#x5C31;&#x662F;&#xFF0C;&#x653B;&#x51FB;&#x8005;&#x4EC5;&#x4EC5;&#x662F;&#x4E3A;&#x4E86;&#x7834;&#x574F;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x800C;&#x53D1;&#x52A8;&#x653B;&#x51FB;&#xFF0C; &#x800C;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x5229;&#x76CA;&#x3002;&#x8FD9;&#x79CD;&#x610F;&#x5728;&#x7834;&#x574F;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x653B;&#x51FB;&#x8005;&#x9700;&#x8981;&#x5DE8;&#x5927;&#x7684;&#x6295;&#x5165;&#x548C;&#x7CBE;&#x5FC3;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x56E0;&#x6B64;&#x53EF;&#x4EE5;&#x60F3;&#x8C61;&#xFF0C;&#x8FD9;&#x79CD;&#x653B;&#x51FB;&#x5F88;&#x6709;&#x53EF;&#x80FD; &#x6765;&#x81EA;&#x653F;&#x5E9C;&#x8D44;&#x52A9;&#x7684;&#x7EC4;&#x7EC7;&#x3002;&#x540C;&#x6837;&#x7684;&#xFF0C;&#x8FD9;&#x7C7B;&#x653B;&#x51FB;&#x8005;&#x6216;&#x8BB8;&#x4E5F;&#x4F1A;&#x8D2D;&#x4E70;&#x77FF;&#x673A;&#xFF0C;&#x8FD0;&#x8425;&#x77FF;&#x6C60;&#xFF0C;&#x901A;&#x8FC7;&#x6EE5;&#x7528;&#x77FF;&#x6C60;&#x64CD;&#x4F5C;&#x8005;&#x7684;&#x4E0A;&#x8FF0;&#x6743;&#x529B;&#x6765;&#x65BD;&#x884C;&#x62D2;&#x7EDD; &#x670D;&#x52A1;&#x7B49;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x7B97;&#x529B;&#x5448;&#x51E0;&#x4F55;&#x7EA7;&#x6570;&#x5FEB;&#x901F;&#x589E;&#x957F;&#xFF0C;&#x4E0A;&#x8FF0;&#x8FD9;&#x4E9B;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x884C;&#x7684;&#x653B;&#x51FB;&#x573A;&#x666F;&#xFF0C;&#x5B9E;&#x9645;&#x64CD;&#x4F5C;&#x8D77;&#x6765; &#x5DF2;&#x7ECF;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;</p>
<p>&#x8FD1;&#x671F;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x4E9B;&#x5347;&#x7EA7;&#xFF0C;&#x6BD4;&#x5982;&#x65E8;&#x5728;&#x8FDB;&#x4E00;&#x6B65;&#x5C06;&#x6316;&#x77FF;&#x63A7;&#x5236;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;P2Pool&#x6316;&#x77FF;&#x534F;&#x8BAE;&#xFF0C;&#x4E5F;&#x90FD;&#x6B63;&#x5728;&#x8BA9;&#x8FD9; &#x4E9B;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x884C;&#x7684;&#x653B;&#x51FB;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x56F0;&#x96BE;&#x3002;&#x6BEB;&#x65E0;&#x7591;&#x95EE;&#xFF0C;&#x4E00;&#x6B21;&#x4E25;&#x91CD;&#x7684;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x4E8B;&#x4EF6;&#x52BF;&#x5FC5;&#x4F1A;&#x964D;&#x4F4E;&#x4EBA;&#x4EEC;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x4FE1;&#x5FC3;&#xFF0C;&#x8FDB;&#x800C;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x683C;&#x7684;&#x8DF3;&#x6C34;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6BD4; &#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x548C;&#x76F8;&#x5173;&#x8F6F;&#x4EF6;&#x4E5F;&#x4E00;&#x76F4;&#x5728;&#x6301;&#x7EED;&#x6539;&#x8FDB;&#xFF0C;&#x6240;&#x4EE5;&#x6BD4;&#x7279;&#x5E01;&#x793E;&#x533A;&#x4E5F;&#x52BF;&#x5FC5;&#x4F1A;&#x5BF9;&#x4EFB;&#x4F55;&#x4E00;&#x6B21;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x5FEB;&#x901F;&#x505A;&#x51FA;&#x54CD;&#x5E94;&#xFF0C;&#x4EE5;&#x4F7F;&#x6574;&#x4E2A;&#x6BD4;&#x7279;&#x5E01; &#x7CFB;&#x7EDF;&#x6BD4;&#x4EE5;&#x5F80;&#x66F4;&#x52A0;&#x7A33;&#x5065;&#x548C;&#x53EF;&#x9760;&#x3002;</p>
<h2 id="1013&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;">10.13&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;</h2>
<p>&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x786E;&#x5B9A;&#x4EA4;&#x6613;&#x548C;&#x5757;&#x7684;&#x6709;&#x6548;&#x6027;&#x3002; &#x8FD9;&#x4E9B;&#x89C4;&#x5219;&#x662F;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x534F;&#x4F5C;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5E76;&#x4E14;&#x8D1F;&#x8D23;&#x5C06;&#x6240;&#x6709;&#x4E0D;&#x540C;&#x89D2;&#x8272;&#x7684;&#x672C;&#x5730;&#x89C6;&#x89D2;&#x878D;&#x5408;&#x5230;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x5355;&#x4E00;&#x4E00;&#x81F4;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x867D;&#x7136;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5728;&#x77ED;&#x671F;&#x5185;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x6240;&#x6709;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x5FC5;&#x987B;&#x4E00;&#x81F4;&#xFF0C;&#x4F46;&#x957F;&#x671F;&#x6765;&#x770B;&#x5B83;&#x4EEC;&#x5E76;&#x4E0D;&#x603B;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#x3002; &#x4E3A;&#x4E86;&#x6F14;&#x8FDB;&#x548C;&#x5F00;&#x53D1;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#xFF0C;&#x89C4;&#x5219;&#x5FC5;&#x987B;&#x968F;&#x65F6;&#x6539;&#x53D8;&#x4EE5;&#x9002;&#x5E94;&#x65B0;&#x529F;&#x80FD;&#xFF0C;&#x6539;&#x8FDB;&#x6216;&#x4FEE;&#x590D;&#x9519;&#x8BEF;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x4E0E;&#x4F20;&#x7EDF;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E0D;&#x540C;&#xFF0C;&#x5347;&#x7EA7;&#x5230;&#x5171;&#x8BC6;&#x7CFB;&#x7EDF;&#x8981;&#x56F0;&#x96BE;&#x5F97;&#x591A;&#xFF0C;&#x9700;&#x8981;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x8C03;&#x3002;</p>
<h3 id="10131&#x786C;&#x5206;&#x53C9;">10.13.1&#x786C;&#x5206;&#x53C9;</h3>
<p>&#x5728;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x7814;&#x7A76;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x5982;&#x4F55;&#x77ED;&#x6682;&#x5730;&#x5206;&#x53C9;&#xFF0C;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E24;&#x4E2A;&#x90E8;&#x5206;&#x5728;&#x77ED;&#x65F6;&#x95F4;&#x5185;&#x5904;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E24;&#x4E2A;&#x4E0D;&#x540C;&#x5206;&#x652F;&#x3002;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x662F;&#x5982;&#x4F55;&#x81EA;&#x7136;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x4F5C;&#x4E3A;&#x7F51;&#x7EDC;&#x7684;&#x6B63;&#x5E38;&#x8FD0;&#x884C;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5728;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x5757;&#x88AB;&#x6316;&#x6398;&#x4E4B;&#x540E;&#xFF0C;&#x7F51;&#x7EDC;&#x5728;&#x4E00;&#x4E2A;&#x7EDF;&#x4E00;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x91CD;&#x65B0;&#x6536;&#x655B;&#x3002;</p>
<p>&#x53E6;&#x4E00;&#x79CD;&#x60C5;&#x51B5;&#x662F;&#xFF0C;&#x7F51;&#x7EDC;&#x4E5F;&#x53EF;&#x80FD;&#x4F1A;&#x5206;&#x53C9;&#x5230;&#x4E24;&#x6761;&#x94FE;&#x6761;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x53D8;&#x5316;&#x3002;&#x8FD9;&#x79CD;&#x5206;&#x53C9;&#x79F0;&#x4E3A;&#x786C;&#x5206;&#x53C9;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x79CD;&#x5206;&#x53C9;&#x540E;&#xFF0C;&#x7F51;&#x7EDC;&#x4E0D;&#x4F1A;&#x91CD;&#x65B0;&#x6536;&#x655B;&#x5230;&#x5355;&#x4E2A;&#x94FE;&#x8DEF;&#x4E0A;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x8FD9;&#x4E24;&#x6761;&#x94FE;&#x5B50;&#x72EC;&#x7ACB;&#x53D1;&#x5C55;&#x3002;&#x5F53;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x6309;&#x7167;&#x4E0E;&#x7F51;&#x7EDC;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x8282;&#x70B9;&#x4E0D;&#x540C;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x89C4;&#x5219;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x786C;&#x5206;&#x53C9;&#x5C31;&#x4F1A;&#x53D1;&#x751F;&#x3002;</p>
<p>&#x8FD9;&#x53EF;&#x80FD;&#x662F;&#x7531;&#x4E8E;&#x9519;&#x8BEF;&#x6216;&#x8005;&#x7531;&#x4E8E;&#x6545;&#x610F;&#x6539;&#x53D8;&#x4E86;&#x534F;&#x5546;&#x4E00;&#x81F4;&#x89C4;&#x5219;&#x7684;&#x5B9E;&#x65BD;&#x800C;&#x53D1;&#x751F;&#x7684;&#x3002;&#x786C;&#x5206;&#x53C9;&#x53EF;&#x7528;&#x4E8E;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x9700;&#x8981;&#x5728;&#x7CFB;&#x7EDF;&#x4E2D;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x8FDB;&#x884C;&#x534F;&#x8C03;&#x3002;&#x6CA1;&#x6709;&#x5347;&#x7EA7;&#x5230;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x90FD;&#x4E0D;&#x80FD;&#x53C2;&#x4E0E;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x5728;&#x786C;&#x5206;&#x53C9;&#x65F6;&#x523B;&#x88AB;&#x5F3A;&#x5236;&#x5230;&#x5355;&#x72EC;&#x7684;&#x94FE;&#x4E0A;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x786C;&#x5206;&#x53C9;&#x5F15;&#x5165;&#x7684;&#x53D8;&#x5316;&#x53EF;&#x4EE5;&#x88AB;&#x8BA4;&#x4E3A;<strong>&#x4E0D;&#x662F;</strong>&#x201C;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x201D;&#xFF0C;&#x56E0;&#x4E3A;&#x672A;&#x5347;&#x7EA7;&#x7684;&#x7CFB;&#x7EDF;&#x4E0D;&#x80FD;&#x518D;&#x5904;&#x7406;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x3002;&#x8BA9;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E0B;&#x786C;&#x5206;&#x53C9;&#x7684;&#x6280;&#x5DE7;&#x548C;&#x5177;&#x4F53;&#x7684;&#x4F8B;&#x5B50;&#x3002;&#x4E0B;&#x56FE;10-9&#x663E;&#x793A;&#x533A;&#x5757;&#x94FE;&#x51FA;&#x73B0;&#x4E24;&#x4E2A;&#x5206;&#x53C9;&#x3002;&#x5728;&#x5757;&#x9AD8;&#x5EA6;4&#x5904;&#xFF0C;&#x53D1;&#x751F;&#x5355;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5206;&#x53C9;&#x3002;&#x8FD9;&#x662F;&#x6211;&#x4EEC;&#x5728;&#x524D;&#x9762;&#x7AE0;&#x8282;&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x53C9;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x81EA;&#x53D1;&#x5206;&#x53C9;&#x7684;&#x7C7B;&#x578B;&#x3002;&#x7ECF;&#x8FC7;&#x5757;5&#x7684;&#x6316;&#x6398;&#xFF0C;&#x7F51;&#x7EDC;&#x5728;&#x4E00;&#x6761;&#x94FE;&#x4E0A;&#x91CD;&#x65B0;&#x6536;&#x655B;&#xFF0C;&#x5206;&#x53C9;&#x88AB;&#x89E3;&#x51B3;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-99cfb8d4bef44855.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt="">
&#x7136;&#x800C;&#xFF0C;&#x540E;&#x6765;&#x5728;&#x5757;&#x9AD8;&#x5EA6;6&#x5904;&#x53D1;&#x751F;&#x4E86;&#x786C;&#x5206;&#x53C9;&#x3002;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x539F;&#x56E0;&#x662F;&#x7531;&#x4E8E;&#x65B0;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x53D8;&#x5316;&#x51FA;&#x73B0;&#x65B0;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7248;&#x672C;&#x3002;&#x4ECE;&#x5757;&#x9AD8;&#x5EA6;7&#x5F00;&#x59CB;&#xFF0C;&#x77FF;&#x5DE5;&#x8FD0;&#x884C;&#x65B0;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x9700;&#x8981;&#x63A5;&#x53D7;&#x65B0;&#x7C7B;&#x578B;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x6211;&#x4EEC;&#x79F0;&#x4E4B;&#x4E3A;&#x201C;Smores&#x201D;&#x7B7E;&#x540D;&#xFF0C;&#x5B83;&#x4E0D;&#x662F;&#x57FA;&#x4E8E;ECDSA&#x7684;&#x7B7E;&#x540D;&#x3002;&#x7D27;&#x63A5;&#x7740;&#xFF0C;&#x8FD0;&#x884C;&#x65B0;&#x7248;&#x672C;&#x7684;&#x8282;&#x70B9;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x7B14;&#x5305;&#x542B;Smores&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4E00;&#x4E2A;&#x66F4;&#x65B0;&#x4E86;&#x8F6F;&#x4EF6;&#x7684;&#x77FF;&#x5DE5;&#x6316;&#x77FF;&#x51FA;&#x4E86;&#x5305;&#x542B;&#x6B64;&#x4EA4;&#x6613;&#x7684;&#x533A;&#x5757;7b&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x5C1A;&#x672A;&#x5347;&#x7EA7;&#x8F6F;&#x4EF6;&#x4EE5;&#x9A8C;&#x8BC1;Smores&#x7B7E;&#x540D;&#x7684;&#x8282;&#x70B9;&#x6216;&#x77FF;&#x5DE5;&#x73B0;&#x5728;&#x90FD;&#x65E0;&#x6CD5;&#x5904;&#x533A;&#x5757;7b&#x3002;&#x4ECE;&#x4ED6;&#x4EEC;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5305;&#x542B;Smores&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x5305;&#x542B;&#x8BE5;&#x4EA4;&#x6613;&#x7684;&#x5757;7b&#x7684;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x65E0;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x662F;&#x6839;&#x636E;&#x65E7;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#x7684;&#x3002;</p>
<p>&#x8FD9;&#x4E9B;&#x8282;&#x70B9;&#x5C06;&#x62D2;&#x7EDD;&#x8BE5;&#x7B14;&#x4EA4;&#x6613;&#x548C;&#x533A;&#x5757;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x4F1A;&#x4F20;&#x64AD;&#x5B83;&#x4EEC;&#x3002;&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x65E7;&#x89C4;&#x5219;&#x7684;&#x4EFB;&#x4F55;&#x77FF;&#x5DE5;&#x90FD;&#x4E0D;&#x63A5;&#x53D7;&#x5757;7b&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x7EE7;&#x7EED;&#x6316;&#x6398;&#x5176;&#x7236;&#x7EA7;&#x4E3A;&#x5757;6&#x7684;&#x5019;&#x9009;&#x5757;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x4F7F;&#x7528;&#x5982;&#x679C;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x7684;&#x6240;&#x6709;&#x8282;&#x70B9;&#x90FD;&#x662F;&#x4E5F;&#x9075;&#x5B88;&#x65E7;&#x7684;&#x89C4;&#x5219;&#xFF0C;&#x9075;&#x5B88;&#x65E7;&#x89C4;&#x5219;&#x7684;&#x77FF;&#x5DE5;&#x751A;&#x81F3;&#x53EF;&#x80FD;&#x63A5;&#x6536;&#x4E0D;&#x5230;&#x5757;7b&#xFF0C;&#x56E0;&#x6B64;&#x4E0D;&#x4F1A;&#x4F20;&#x64AD;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x80FD;&#x591F;&#x5F00;&#x91C7;&#x533A;&#x5757;7a&#xFF0C;&#x8FD9;&#x4E2A;&#x65E7;&#x7684;&#x89C4;&#x5219;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x5176;&#x4E2D;&#x4E0D;&#x5305;&#x542B;&#x4E0E;Smores&#x7B7E;&#x540D;&#x7684;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x94FE;&#x6761;&#x4ECE;&#x8FD9;&#x4E00;&#x70B9;&#x7EE7;&#x7EED;&#x5206;&#x6B67;&#x3002; &#x201C;b&#x201D;&#x94FE;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x7EE7;&#x7EED;&#x63A5;&#x53D7;&#x5E76;&#x5F00;&#x91C7;&#x542B;&#x6709;Smores&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x201C;a&#x201D;&#x94FE;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x7EE7;&#x7EED;&#x5FFD;&#x89C6;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x3002;&#x5373;&#x4F7F;&#x5757;8b&#x4E0D;&#x5305;&#x542B;&#x4EFB;&#x4F55;Smores&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x201C;a&#x201D;&#x94FE;&#x4E0A;&#x7684;&#x77FF;&#x5DE5;&#x4E5F;&#x65E0;&#x6CD5;&#x5904;&#x7406;&#x3002;&#x5BF9;&#x4ED6;&#x4EEC;&#x6765;&#x8BF4;&#xFF0C;&#x5B83;&#x4F3C;&#x4E4E;&#x662F;&#x4E00;&#x4E2A;&#x5B64;&#x7ACB;&#x7684;&#x5757;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x7684;&#x7236;&#x201C;7b&#x201D;&#x4E0D;&#x88AB;&#x8BC6;&#x522B;&#x4E3A;&#x4E00;&#x4E2A;&#x6709;&#x6548;&#x7684;&#x5757;&#x3002;</p>
<h3 id="10132&#x786C;&#x5206;&#x53C9;&#xFF1A;&#x8F6F;&#x4EF6;&#xFF0C;&#x7F51;&#x7EDC;&#xFF0C;&#x91C7;&#x77FF;&#x548C;&#x94FE;">10.13.2&#x786C;&#x5206;&#x53C9;&#xFF1A;&#x8F6F;&#x4EF6;&#xFF0C;&#x7F51;&#x7EDC;&#xFF0C;&#x91C7;&#x77FF;&#x548C;&#x94FE;</h3>
<p>&#x5BF9;&#x4E8E;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x6765;&#x8BF4;&#xFF0C;&#x672F;&#x8BED;&#x201C;&#x5206;&#x53C9;&#x201D;&#x5177;&#x6709;&#x53E6;&#x4E00;&#x4E2A;&#x542B;&#x4E49;&#xFF0C;&#x5BF9;&#x201C;&#x786C;&#x5206;&#x53C9;&#x201D;&#x4E00;&#x8BCD;&#x589E;&#x52A0;&#x4E86;&#x6DF7;&#x6DC6;&#x3002;&#x5728;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x4E2D;&#xFF0C;&#x5F53;&#x4E00;&#x7EC4;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x9009;&#x62E9;&#x9075;&#x5FAA;&#x4E0D;&#x540C;&#x7684;&#x8F6F;&#x4EF6;&#x8DEF;&#x7EBF;&#x56FE;&#x5E76;&#x542F;&#x52A8;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x7684;&#x7ADE;&#x4E89;&#x5B9E;&#x65BD;&#x65F6;&#xFF0C;&#x4F1A;&#x53D1;&#x751F;&#x53C9;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x8BA8;&#x8BBA;&#x4E86;&#x4E24;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8FD9;&#x5C06;&#x5BFC;&#x81F4;&#x786C;&#x5206;&#x53C9;&#xFF1A;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x4E2D;&#x7684;&#x9519;&#x8BEF;&#xFF0C;&#x4EE5;&#x53CA;&#x5BF9;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x6545;&#x610F;&#x4FEE;&#x6539;&#x3002;&#x5728;&#x6545;&#x610F;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x8F6F;&#x4EF6;&#x53C9;&#x5728;&#x786C;&#x5206;&#x53C9;&#x4E4B;&#x524D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;&#x786C;&#x5206;&#x53C9;&#xFF0C;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5FC5;&#x987B;&#x901A;&#x8FC7;&#x5F00;&#x53D1;&#xFF0C;&#x91C7;&#x7528;&#x548C;&#x542F;&#x52A8;&#x65B0;&#x7684;&#x8F6F;&#x4EF6;&#x5B9E;&#x73B0;&#x3002;</p>
<p>&#x8BD5;&#x56FE;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x8F6F;&#x5206;&#x53C9;&#x7684;&#x4F8B;&#x5B50;&#x5305;&#x62EC;Bitcoin XT&#xFF0C;Bitcoin Classic&#x548C;&#x6700;&#x8FD1;&#x7684;Bitcoin Unlimited&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F6F;&#x5206;&#x53C9;&#x90FD;&#x6CA1;&#x6709;&#x4EA7;&#x751F;&#x786C;&#x5206;&#x53C9;&#x3002;&#x867D;&#x7136;&#x8F6F;&#x4EF6;&#x53C9;&#x662F;&#x4E00;&#x4E2A;&#x5FC5;&#x8981;&#x7684;&#x524D;&#x63D0;&#x6761;&#x4EF6;&#xFF0C;&#x4F46;&#x5B83;&#x672C;&#x8EAB;&#x4E0D;&#x8DB3;&#x4EE5;&#x53D1;&#x751F;&#x786C;&#x5206;&#x53C9;&#x3002;&#x5BF9;&#x4E8E;&#x786C;&#x5206;&#x53C9;&#x53D1;&#x751F;&#xFF0C;&#x5FC5;&#x987B;&#x662F;&#x7531;&#x4E8E;&#x91C7;&#x53D6;&#x76F8;&#x4E92;&#x7ADE;&#x4E89;&#x7684;&#x5B9E;&#x65BD;&#x65B9;&#x6848;&#xFF0C;&#x5E76;&#x4E14;&#x89C4;&#x5219;&#x9700;&#x8981;&#x7531;&#x77FF;&#x5DE5;&#xFF0C;&#x94B1;&#x5305;&#x548C;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x6FC0;&#x6D3B;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x7684;&#x66FF;&#x4EE3;&#x5B9E;&#x73B0;&#x65B9;&#x6848;&#xFF0C;&#x751A;&#x81F3;&#x8FD8;&#x6709;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x8FD9;&#x4E9B;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#xFF0C;&#x963B;&#x6B62;&#x53D1;&#x751F;&#x9519;&#x8BEF;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;&#x7F51;&#x7EDC;&#x4E0A;&#x5171;&#x5B58;&#x5E76;&#x4E92;&#x64CD;&#x4F5C;&#xFF0C;&#x6700;&#x7EC8;&#x5E76;&#x672A;&#x5BFC;&#x81F4;&#x786C;&#x5206;&#x53C9;&#x3002;</p>
<p>&#x4E0D;&#x540C;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5728;&#x4EA4;&#x6613;&#x6216;&#x5757;&#x7684;&#x9A8C;&#x8BC1;&#x4E2D;&#x4F1A;&#x4EE5;&#x660E;&#x786E;&#x7684;&#x548C;&#x6E05;&#x6670;&#x7684;&#x65B9;&#x5F0F;&#x6709;&#x6240;&#x4E0D;&#x540C;&#x3002;&#x8FD9;&#x79CD;&#x5DEE;&#x522B;&#x53EF;&#x80FD;&#x4EE5;&#x5FAE;&#x5999;&#x7684;&#x65B9;&#x5F0F;&#x8868;&#x73B0;&#xFF0C;&#x6BD4;&#x5982;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x9002;&#x7528;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x6216;&#x52A0;&#x5BC6;&#x539F;&#x8BED;&#xFF08;&#x5982;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF09;&#x65F6;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x5DEE;&#x522B;&#x8FD8;&#x53EF;&#x80FD;&#x4F1A;&#x7531;&#x4E8E;&#x610F;&#x6599;&#x4E4B;&#x5916;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x6BD4;&#x5982;&#x7531;&#x4E8E;&#x7CFB;&#x7EDF;&#x9650;&#x5236;&#x6216;&#x5B9E;&#x73B0;&#x7EC6;&#x8282;&#x6240;&#x4EA7;&#x751F;&#x7684;&#x9690;&#x542B;&#x5171;&#x8BC6;&#x7EA6;&#x675F;&#x3002;&#x5728;&#x5C06;Bitcoin Core 0.7&#x5347;&#x7EA7;&#x5230;0.8&#x4E4B;&#x524D;&#x7684;&#x610F;&#x6599;&#x4E4B;&#x4E2D;&#x7684;&#x786C;&#x5206;&#x53C9;&#x4E2D;&#x770B;&#x5230;&#x4E86;&#x540E;&#x8005;&#x7684;&#x4E00;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x8FD9;&#x662F;&#x7531;&#x4E8E;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5757;&#x7684;Berkley DB&#x5B9E;&#x73B0;&#x7684;&#x9650;&#x5236;&#x5F15;&#x8D77;&#x7684;&#x3002;</p>
<p>&#x4ECE;&#x6982;&#x5FF5;&#x4E0A;&#x8BB2;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5C06;&#x786C;&#x5206;&#x53C9;&#x5B50;&#x770B;&#x6210;&#x56DB;&#x4E2A;&#x9636;&#x6BB5;&#xFF1A;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x7F51;&#x7EDC;&#x5206;&#x53C9;&#xFF0C;&#x6316;&#x77FF;&#x5206;&#x53C9;&#x548C;&#x533A;&#x5757;&#x94FE;&#x5206;&#x53C9;&#x3002;&#x8BE5;&#x8FC7;&#x7A0B;&#x5F00;&#x59CB;&#x4E8E;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x521B;&#x5EFA;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8FD9;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5BF9;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x4E86;&#x4FEE;&#x6539;&#x3002;&#x5F53;&#x8FD9;&#x79CD;&#x65B0;&#x7248;&#x672C;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x90E8;&#x7F72;&#x5728;&#x7F51;&#x7EDC;&#x4E2D;&#x65F6;&#xFF0C;&#x4E00;&#x5B9A;&#x767E;&#x5206;&#x6BD4;&#x7684;&#x77FF;&#x5DE5;&#xFF0C;&#x94B1;&#x5305;&#x7528;&#x6237;&#x548C;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x5E76;&#x8FD0;&#x884C;&#x8BE5;&#x7248;&#x672C;&#x5BA2;&#x6237;&#x7AEF;&#x3002;&#x5F97;&#x5230;&#x7684;&#x5206;&#x53C9;&#x5C06;&#x53D6;&#x51B3;&#x4E8E;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x662F;&#x5426;&#x9002;&#x7528;&#x4E8E;&#x533A;&#x5757;&#xFF0C;&#x4EA4;&#x6613;&#x6216;&#x7CFB;&#x7EDF;&#x5176;&#x4ED6;&#x65B9;&#x9762;&#x3002;&#x5982;&#x679C;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x4E0E;&#x4EA4;&#x6613;&#x6709;&#x5173;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4EA4;&#x6613;&#x88AB;&#x6316;&#x6398;&#x6210;&#x4E00;&#x4E2A;&#x5757;&#x65F6;&#xFF0C;&#x6839;&#x636E;&#x65B0;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x4EA4;&#x6613;&#x7684;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x4EA7;&#x751F;&#x51FA;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#x5206;&#x53C9;&#xFF0C;&#x8FD9;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x786C;&#x5206;&#x53C9;&#x3002;&#x5982;&#x679C;&#x65B0;&#x89C4;&#x5219;&#x4E0E;&#x533A;&#x5757;&#x6709;&#x5173;&#xFF0C;&#x90A3;&#x4E48;&#x5F53;&#x4E00;&#x4E2A;&#x5757;&#x6839;&#x636E;&#x65B0;&#x89C4;&#x5219;&#x88AB;&#x6316;&#x6398;&#x65F6;&#xFF0C;&#x786C;&#x5206;&#x53C9;&#x8FDB;&#x7A0B;&#x5C06;&#x5F00;&#x59CB;&#x3002;</p>
<p>&#x9996;&#x5148;&#xFF0C;&#x662F;&#x7F51;&#x7EDC;&#x5206;&#x53C9;&#x3002;&#x57FA;&#x4E8E;&#x65E7;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x8282;&#x70B9;&#x5C06;&#x62D2;&#x7EDD;&#x6839;&#x636E;&#x65B0;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x7684;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x548C;&#x5757;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x9075;&#x5FAA;&#x65E7;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x8282;&#x70B9;&#x5C06;&#x6682;&#x65F6;&#x7981;&#x6B62;&#x548C;&#x65AD;&#x5F00;&#x53D1;&#x9001;&#x8FD9;&#x4E9B;&#x65E0;&#x6548;&#x4EA4;&#x6613;&#x548C;&#x5757;&#x7684;&#x4EFB;&#x4F55;&#x8282;&#x70B9;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x7F51;&#x7EDC;&#x5C06;&#x5206;&#x4E3A;&#x4E24;&#x90E8;&#x5206;&#xFF1A;&#x65E7;&#x8282;&#x70B9;&#x5C06;&#x53EA;&#x4FDD;&#x7559;&#x8FDE;&#x63A5;&#x5230;&#x65E7;&#x8282;&#x70B9;&#xFF0C;&#x65B0;&#x8282;&#x70B9;&#x53EA;&#x80FD;&#x8FDE;&#x63A5;&#x5230;&#x65B0;&#x8282;&#x70B9;&#x3002;&#x57FA;&#x4E8E;&#x65B0;&#x89C4;&#x5219;&#x7684;&#x5355;&#x4E2A;&#x4EA4;&#x6613;&#x6216;&#x5757;&#x5C06;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x6CE2;&#x52A8;&#xFF0C;&#x5B9E;&#x73B0;&#x5206;&#x533A;&#xFF0C;&#x5BFC;&#x81F4;&#x51FA;&#x73B0;&#x4E24;&#x4E2A;&#x7F51;&#x7EDC;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x4F7F;&#x7528;&#x65B0;&#x89C4;&#x5219;&#x7684;&#x77FF;&#x5DE5;&#x5F00;&#x91C7;&#x4E86;&#x4E00;&#x4E2A;&#x5757;&#xFF0C;&#x6316;&#x77FF;&#x548C;&#x533A;&#x5757;&#x94FE;&#x4E5F;&#x5C06;&#x5206;&#x53C9;&#x3002;&#x65B0;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x5728;&#x65B0;&#x533A;&#x5757;&#x4E4B;&#x4E0A;&#x6316;&#x6398;&#xFF0C;&#x800C;&#x8001;&#x77FF;&#x5DE5;&#x5C06;&#x6839;&#x636E;&#x65E7;&#x7684;&#x89C4;&#x5219;&#x6316;&#x6398;&#x4E00;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x94FE;&#x6761;&#x3002;&#x5904;&#x4E8E;&#x5206;&#x533A;&#x7684;&#x7F51;&#x7EDC;&#x5C06;&#x4F7F;&#x5F97;&#x6309;&#x7167;&#x5404;&#x81EA;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x8FD0;&#x884C;&#x7684;&#x77FF;&#x5DE5;&#x5C06;&#x4E0D;&#x4F1A;&#x63A5;&#x6536;&#x5F7C;&#x6B64;&#x7684;&#x5757;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x8FDE;&#x63A5;&#x5230;&#x4E24;&#x4E2A;&#x5355;&#x72EC;&#x7684;&#x7F51;&#x7EDC;&#x3002;</p>
<h3 id="10133&#x5206;&#x79BB;&#x77FF;&#x5DE5;&#x548C;&#x96BE;&#x5EA6;">10.13.3&#x5206;&#x79BB;&#x77FF;&#x5DE5;&#x548C;&#x96BE;&#x5EA6;</h3>
<p>&#x968F;&#x7740;&#x77FF;&#x5DE5;&#x4EEC;&#x88AB;&#x5206;&#x88C2;&#x5F00;&#x59CB;&#x5F00;&#x91C7;&#x4E24;&#x6761;&#x4E0D;&#x540C;&#x7684;&#x94FE;&#x6761;&#xFF0C;&#x94FE;&#x4E0A;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x4E5F;&#x88AB;&#x5206;&#x88C2;&#x3002;&#x4E24;&#x4E2A;&#x94FE;&#x4E4B;&#x95F4;&#x7684;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x53EF;&#x4EE5;&#x5206;&#x6210;&#x4EFB;&#x610F;&#x6BD4;&#x4F8B;&#x3002;&#x65B0;&#x7684;&#x89C4;&#x5219;&#x53EF;&#x80FD;&#x53EA;&#x6709;&#x5C11;&#x6570;&#x4EBA;&#x8DDF;&#x968F;&#xFF0C;&#x6216;&#x8005;&#x4E5F;&#x53EF;&#x80FD;&#x662F;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x77FF;&#x5DE5;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;80&#xFF05;-20&#xFF05;&#x7684;&#x5206;&#x5272;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x4F7F;&#x7528;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x3002;&#x6211;&#x4EEC;&#x8FD8;&#x5047;&#x8BBE;&#x5206;&#x53C9;&#x5728;&#x6539;&#x53D8;&#x76EE;&#x6807;&#xFF08;retarget&#xFF09;&#x540E;&#x7ACB;&#x5373;&#x51FA;&#x73B0;&#x3002;&#x8FD9;&#x4E24;&#x6761;&#x94FE;&#x5C06;&#x4ECE;&#x6539;&#x53D8;&#x76EE;&#x6807;&#x4E4B;&#x540E;&#x5404;&#x81EA;&#x63A5;&#x53D7;&#x81EA;&#x5DF1;&#x7684;&#x96BE;&#x5EA6;&#x3002;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x62E5;&#x6709;80&#xFF05;&#x7684;&#x4EE5;&#x524D;&#x53EF;&#x7528;&#x7684;&#x6316;&#x77FF;&#x6743;&#x7684;&#x627F;&#x8BFA;&#x3002;&#x4ECE;&#x8FD9;&#x4E2A;&#x94FE;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x4E0E;&#x4E0A;&#x4E00;&#x5468;&#x671F;&#x76F8;&#x6BD4;&#xFF0C;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x7A81;&#x7136;&#x4E0B;&#x964D;&#x4E86;20&#xFF05;&#x3002;&#x533A;&#x5757;&#x5C06;&#x4F1A;&#x5E73;&#x5747;&#x6BCF;12&#x5206;&#x949F;&#x53D1;&#x73B0;&#x4E00;&#x6B21;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x53EF;&#x4EE5;&#x6269;&#x5927;&#x8FD9;&#x6761;&#x94FE;&#x7684;&#x6316;&#x77FF;&#x80FD;&#x529B;&#x4E0B;&#x964D;&#x4E86;20&#xFF05;&#x3002;&#x8FD9;&#x4E2A;&#x5757;&#x53D1;&#x884C;&#x901F;&#x5EA6;&#x5C06;&#x6301;&#x7EED;&#x4E0B;&#x53BB;&#xFF08;&#x9664;&#x975E;&#x6709;&#x4EFB;&#x4F55;&#x6539;&#x53D8;&#x54C8;&#x5E0C;&#x529F;&#x7387;&#x7684;&#x56E0;&#x7D20;&#x51FA;&#x73B0;&#xFF09;&#xFF0C;&#x76F4;&#x5230;2016&#x5757;&#x5F00;&#x91C7;&#xFF0C;&#x8FD9;&#x5C06;&#x9700;&#x8981;&#x5927;&#x7EA6;24,192&#x5206;&#x949F;&#xFF08;&#x6BCF;&#x4E2A;&#x5757;&#x9700;&#x8981;12&#x5206;&#x949F;&#xFF09;&#x6216;16.8&#x5929;&#x3002; 16.8&#x5929;&#x540E;&#xFF0C;&#x57FA;&#x4E8E;&#x6B64;&#x94FE;&#x4E2D;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x7684;&#x51CF;&#x5C11;&#xFF0C;&#x6539;&#x53D8;&#x76EE;&#x6807;&#x5C06;&#x518D;&#x6B21;&#x53D1;&#x751F;&#xFF0C;&#x5E76;&#x5C06;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#xFF08;&#x51CF;&#x5C11;20&#xFF05;&#xFF09;&#x6BCF;10&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x3002;</p>
<p>&#x5C11;&#x6570;&#x4EBA;&#x8BA4;&#x53EF;&#x7684;&#x90A3;&#x6761;&#x94FE;&#xFF0C;&#x6839;&#x636E;&#x65E7;&#x89C4;&#x5219;&#x7EE7;&#x7EED;&#x6316;&#x77FF;&#xFF0C;&#x73B0;&#x5728;&#x53EA;&#x6709;20&#xFF05;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#xFF0C;&#x5C06;&#x9762;&#x4E34;&#x66F4;&#x52A0;&#x8270;&#x5DE8;&#x7684;&#x4EFB;&#x52A1;&#x3002;&#x5728;&#x8FD9;&#x6761;&#x94FE;&#x4E0A;&#xFF0C;&#x5E73;&#x5747;&#x6BCF;&#x9694;50&#x5206;&#x949F;&#x5F00;&#x91C7;&#x4E00;&#x6B21;&#x3002;&#x8FD9;&#x4E2A;&#x96BE;&#x5EA6;&#x5C06;&#x4E0D;&#x4F1A;&#x5728;2016&#x4E2A;&#x5757;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x8C03;&#x6574;&#xFF0C;&#x8FD9;&#x5C06;&#x9700;&#x8981;100,800&#x5206;&#x949F;&#xFF0C;&#x6216;&#x5927;&#x7EA6;10&#x5468;&#x7684;&#x65F6;&#x95F4;&#x3002;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x5757;&#x5177;&#x6709;&#x56FA;&#x5B9A;&#x5BB9;&#x91CF;&#xFF0C;&#x8FD9;&#x4E5F;&#x5C06;&#x5BFC;&#x81F4;&#x4EA4;&#x6613;&#x5BB9;&#x91CF;&#x51CF;&#x5C11;5&#x500D;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x5C0F;&#x65F6;&#x53EF;&#x7528;&#x4E8E;&#x8BB0;&#x5F55;&#x4EA4;&#x6613;&#x7684;&#x5757;&#x5927;&#x5E45;&#x51CF;&#x5C11;&#x4E86;&#x3002;</p>
<h3 id="10134&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x786C;&#x53C9;">10.13.4&#x6709;&#x4E89;&#x8BAE;&#x7684;&#x786C;&#x53C9;</h3>
<p>&#x8FD9;&#x662F;&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x9ECE;&#x660E;&#x3002;&#x6B63;&#x5982;&#x5F00;&#x6E90;&#x5F00;&#x53D1;&#x6539;&#x53D8;&#x4E86;&#x8F6F;&#x4EF6;&#x7684;&#x65B9;&#x6CD5;&#x548C;&#x4EA7;&#x54C1;&#xFF0C;&#x521B;&#x9020;&#x4E86;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x8BBA;&#xFF0C;&#x65B0;&#x5DE5;&#x5177;&#x548C;&#x65B0;&#x793E;&#x533A;&#xFF0C;&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E5F;&#x4EE3;&#x8868;&#x4E86;&#x8BA1;&#x7B97;&#x673A;&#x79D1;&#x5B66;&#x7684;&#x65B0;&#x524D;&#x6CBF;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x53D1;&#x5C55;&#x8DEF;&#x7EBF;&#x56FE;&#x7684;&#x8FA9;&#x8BBA;&#xFF0C;&#x5B9E;&#x9A8C;&#x548C;&#x7EA0;&#x7ED3;&#x4E4B;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x65B0;&#x7684;&#x5F00;&#x53D1;&#x5DE5;&#x5177;&#xFF0C;&#x5B9E;&#x8DF5;&#xFF0C;&#x65B9;&#x6CD5;&#x548C;&#x793E;&#x533A;&#x7684;&#x51FA;&#x73B0;&#x3002;&#x786C;&#x5206;&#x53C9;&#x88AB;&#x89C6;&#x4E3A;&#x6709;&#x98CE;&#x9669;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x8FEB;&#x4F7F;&#x5C11;&#x6570;&#x4EBA;&#x88AB;&#x8FEB;&#x9009;&#x62E9;&#x5347;&#x7EA7;&#x6216;&#x662F;&#x5FC5;&#x987B;&#x4FDD;&#x7559;&#x5728;&#x5C11;&#x6570;&#x6D3E;&#x94FE;&#x6761;&#x4E0A;&#x3002;&#x5C06;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x7ADE;&#x4E89;&#x7CFB;&#x7EDF;&#x7684;&#x98CE;&#x9669;&#x88AB;&#x8BB8;&#x591A;&#x4EBA;&#x8BA4;&#x4E3A;&#x662F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x98CE;&#x9669;&#x3002;&#x7ED3;&#x679C;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x4E0D;&#x613F;&#x4F7F;&#x7528;&#x786C;&#x5206;&#x53C9;&#x673A;&#x5236;&#x6765;&#x5B9E;&#x73B0;&#x5BF9;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x9664;&#x975E;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x90FD;&#x80FD;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x3002;</p>
<p>&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x88AB;&#x6240;&#x6709;&#x4EBA;&#x652F;&#x6301;&#x7684;&#x786C;&#x5206;&#x53C9;&#x5EFA;&#x8BAE;&#x4E5F;&#x88AB;&#x8BA4;&#x4E3A;&#x662F;&#x201C;&#x6709;&#x4E89;&#x8BAE;&#x201D;&#x7684;&#xFF0C;&#x4E0D;&#x613F;&#x5192;&#x9669;&#x5206;&#x88C2;&#x7CFB;&#x7EDF;&#x3002;&#x786C;&#x5206;&#x53C9;&#x7684;&#x95EE;&#x9898;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x53D1;&#x793E;&#x533A;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x6709;&#x4E89;&#x8BAE;&#x7684;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x4E0E;&#x63A7;&#x5236;&#x533A;&#x5757;&#x5927;&#x5C0F;&#x9650;&#x5236;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x4EFB;&#x4F55;&#x63D0;&#x8BAE;&#x76F8;&#x5173;&#x3002;&#x4E00;&#x4E9B;&#x5F00;&#x53D1;&#x5546;&#x53CD;&#x5BF9;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x786C;&#x53C9;&#xFF0C;&#x8BA4;&#x4E3A;&#x5B83;&#x592A;&#x5192;&#x9669;&#x4E86;&#x3002;&#x53E6;&#x4E00;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#x786C;&#x5206;&#x53C9;&#x673A;&#x5236;&#x662F;&#x63D0;&#x5347;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x91CD;&#x8981;&#x5DE5;&#x5177;&#xFF0C;&#x907F;&#x514D;&#x4E86;&#x201C;&#x6280;&#x672F;&#x503A;&#x52A1;&#x201D;&#xFF0C;&#x5E76;&#x4E0E;&#x8FC7;&#x53BB;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5E72;&#x51C0;&#x7684;&#x4E86;&#x65AD;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x6709;&#x4E9B;&#x5F00;&#x53D1;&#x5546;&#x770B;&#x5230;&#x786C;&#x5206;&#x53C9;&#x4F5C;&#x4E3A;&#x4E00;&#x79CD;&#x5E94;&#x8BE5;&#x5F88;&#x5C11;&#x4F7F;&#x7528;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x5E94;&#x8BE5;&#x7ECF;&#x8FC7;&#x8BA4;&#x771F;&#x7684;&#x8BA1;&#x5212;&#xFF0C;&#x5E76;&#x4E14;&#x53EA;&#x6709;&#x5728;&#x8FD1;&#x4E4E;&#x4E00;&#x81F4;&#x7684;&#x5171;&#x8BC6;&#x4E0B;&#x624D;&#x5EFA;&#x8BAE;&#x4F7F;&#x7528;&#x3002;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x51FA;&#x73B0;&#x4E86;&#x65B0;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x89E3;&#x51B3;&#x786C;&#x5206;&#x53C9;&#x7684;&#x5371;&#x9669;&#x3002;&#x5728;&#x4E0B;&#x4E00;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x4E00;&#x4E0B;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x4EE5;&#x53CA;BIP-34&#x548C;BIP-9&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;&#x5171;&#x8BC6;&#x4FEE;&#x6539;&#x7684;&#x65B9;&#x6CD5;&#x3002;</p>
<h3 id="10135&#x8F6F;&#x5206;&#x53C9;">10.13.5&#x8F6F;&#x5206;&#x53C9;</h3>
<p>&#x5E76;&#x975E;&#x6240;&#x6709;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x53D8;&#x5316;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x786C;&#x5206;&#x53C9;&#x3002;&#x53EA;&#x6709;&#x524D;&#x5411;&#x4E0D;&#x517C;&#x5BB9;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x53D8;&#x5316;&#x624D;&#x4F1A;&#x5BFC;&#x81F4;&#x5206;&#x53C9;&#x3002;&#x5982;&#x679C;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x6539;&#x53D8;&#x4E5F;&#x80FD;&#x591F;&#x8BA9;&#x672A;&#x4FEE;&#x6539;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4ECD;&#x7136;&#x6309;&#x7167;&#x5148;&#x524D;&#x7684;&#x89C4;&#x5219;&#x5BF9;&#x5F85;&#x4EA4;&#x6613;&#x6216;&#x8005;&#x533A;&#x5757;&#xFF0C;&#x90A3;&#x4E48;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4E0D;&#x8FDB;&#x884C;&#x5206;&#x53C9;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5B9E;&#x73B0;&#x5171;&#x8BC6;&#x4FEE;&#x6539;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x6765;&#x533A;&#x5206;&#x4E4B;&#x524D;&#x7684;&#x786C;&#x5206;&#x53C9;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x8F6F;&#x5206;&#x53C9;&#x4E0D;&#x662F;&#x5206;&#x53C9;&#x3002;&#x8F6F;&#x5206;&#x53C9;&#x662F;&#x4E0E;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x524D;&#x5411;&#x517C;&#x5BB9;&#x5E76;&#x4F5C;&#x4E9B;&#x53D8;&#x5316;&#xFF0C;&#x5141;&#x8BB8;&#x672A;&#x5347;&#x7EA7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x7A0B;&#x5E8F;&#x7EE7;&#x7EED;&#x4E0E;&#x65B0;&#x89C4;&#x5219;&#x540C;&#x65F6;&#x5DE5;&#x4F5C;&#x3002;</p>
<p>&#x8F6F;&#x5206;&#x53C9;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x5F88;&#x660E;&#x663E;&#x7684;&#x65B9;&#x9762;&#x5C31;&#x662F;&#xFF0C;&#x8F6F;&#x5206;&#x53C9;&#x7EA7;&#x53EA;&#x80FD;&#x7528;&#x4E8E;&#x589E;&#x52A0;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7EA6;&#x675F;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6269;&#x5C55;&#x5B83;&#x4EEC;&#x3002;&#x4E3A;&#x4E86;&#x5411;&#x524D;&#x517C;&#x5BB9;&#xFF0C;&#x6839;&#x636E;&#x65B0;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x5757;&#x4E5F;&#x5FC5;&#x987B;&#x5728;&#x65E7;&#x89C4;&#x5219;&#x4E0B;&#x6709;&#x6548;&#xFF0C;&#x4F46;&#x662F;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x65B0;&#x89C4;&#x5219;&#x53EA;&#x80FD;&#x589E;&#x52A0;&#x9650;&#x5236;&#xFF0C;&#x5426;&#x5219;&#xFF0C;&#x6839;&#x636E;&#x65E7;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x533A;&#x5757;&#x88AB;&#x62D2;&#x7EDD;&#x65F6;&#xFF0C;&#x8FD8;&#x662F;&#x4F1A;&#x5C06;&#x89E6;&#x53D1;&#x786C;&#x5206;&#x53C9;&#x3002;</p>
<p>&#x8F6F;&#x53C9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x591A;&#x79CD;&#x65B9;&#x5F0F;&#x5B9E;&#x73B0;&#xFF0C;&#x8BE5;&#x672F;&#x8BED;&#x4E0D;&#x5B9A;&#x4E49;&#x5355;&#x4E00;&#x65B9;&#x6CD5;&#xFF0C;&#x800C;&#x662F;&#x4E00;&#x7EC4;&#x65B9;&#x6CD5;&#xFF0C;&#x5B83;&#x4EEC;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x5171;&#x540C;&#x70B9;&#xFF1A;&#x5B83;&#x4EEC;&#x4E0D;&#x8981;&#x6C42;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5347;&#x7EA7;&#x6216;&#x5F3A;&#x5236;&#x975E;&#x5347;&#x7EA7;&#x8282;&#x70B9;&#x5FC5;&#x987B;&#x8131;&#x79BB;&#x5171;&#x8BC6;&#x3002;</p>
<h4 id="101351&#x8F6F;&#x5206;&#x53C9;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;nop&#x64CD;&#x4F5C;&#x7801;">10.13.5.1&#x8F6F;&#x5206;&#x53C9;&#x91CD;&#x65B0;&#x5B9A;&#x4E49;NOP&#x64CD;&#x4F5C;&#x7801;</h4>
<p>&#x57FA;&#x4E8E;NOP&#x64CD;&#x4F5C;&#x7801;&#x7684;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x4E9B;&#x8F6F;&#x5206;&#x53C9;&#x3002; Bitcoin&#x811A;&#x672C;&#x6709;10&#x4E2A;&#x64CD;&#x4F5C;&#x7801;&#x4FDD;&#x7559;&#x4F9B;&#x5C06;&#x6765;&#x4F7F;&#x7528;&#xFF0C;NOP1&#x5230;NOP10&#x3002; &#x6839;&#x636E;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#xFF0C;&#x8FD9;&#x4E9B;&#x64CD;&#x4F5C;&#x7801;&#x5728;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x5B58;&#x5728;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x65E0;&#x6548;&#x7684;&#x8FD0;&#x7B97;&#x7B26;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x6548;&#x679C;&#x3002; &#x5728;NOP&#x64CD;&#x4F5C;&#x7801;&#x4E4B;&#x540E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#xFF0C;&#x5C31;&#x597D;&#x50CF;&#x5B83;&#x4E0D;&#x5B58;&#x5728;&#x4E00;&#x6837;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8F6F;&#x53C9;&#x53EF;&#x4EE5;&#x4FEE;&#x6539;NOP&#x4EE3;&#x7801;&#x7684;&#x8BED;&#x4E49;&#x7ED9;&#x5B83;&#x65B0;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;BIP-65&#xFF08;CHECKLOCKTIMEVERIFY&#xFF09;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#x4E86;NOP2&#x64CD;&#x4F5C;&#x7801;&#x3002; &#x5B9E;&#x65BD;BIP-65&#x7684;&#x5BA2;&#x6237;&#x5C06;NOP2&#x89E3;&#x91CA;&#x4E3A;OP_CHECKLOCKTIMEVERIFY&#xFF0C;&#x5E76;&#x5728;&#x5176;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x4E2D;&#x5305;&#x542B;&#x8BE5;&#x64CD;&#x4F5C;&#x7801;&#x7684;UTXO&#x4E0A;&#xFF0C;&#x5F3A;&#x5236;&#x4E86;&#x7EDD;&#x5BF9;&#x9501;&#x5B9A;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x3002; &#x8FD9;&#x79CD;&#x53D8;&#x5316;&#x662F;&#x4E00;&#x4E2A;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x56E0;&#x4E3A;&#x5728;BIP-65&#x4E0B;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#x5728;&#x4EFB;&#x4F55;&#x6CA1;&#x6709;&#x5B9E;&#x73B0;&#xFF08;&#x4E0D;&#x4E86;&#x89E3;&#xFF09;BIP-65&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4E0A;&#x4E5F;&#x662F;&#x6709;&#x6548;&#x7684;&#x3002; &#x5BF9;&#x4E8E;&#x65E7;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x8BE5;&#x811A;&#x672C;&#x5305;&#x542B;&#x4E00;&#x4E2A;NOP&#x4EE3;&#x7801;&#xFF0C;&#x8FD9;&#x88AB;&#x5FFD;&#x7565;&#x3002;</p>
<h4 id="101352&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;">10.13.5.2&#x5176;&#x4ED6;&#x65B9;&#x5F0F;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;</h4>
<p>NOP&#x64CD;&#x4F5C;&#x7801;&#x7684;&#x91CD;&#x65B0;&#x89E3;&#x91CA;&#x65E2;&#x662F;&#x8BA1;&#x5212;&#x7684;&#xFF0C;&#x4E5F;&#x662F;&#x5171;&#x8BC6;&#x5347;&#x7EA7;&#x7684;&#x660E;&#x663E;&#x673A;&#x5236;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6700;&#x8FD1;&#xFF0C;&#x5F15;&#x5165;&#x4E86;&#x53E6;&#x4E00;&#x79CD;&#x8F6F;&#x5206;&#x53C9;&#x673A;&#x5236;&#xFF0C;&#x5176;&#x4E0D;&#x4F9D;&#x8D56;&#x4E8E;NOP&#x64CD;&#x4F5C;&#x7801;&#xFF0C;&#x7528;&#x4E8E;&#x975E;&#x5E38;&#x7279;&#x5B9A;&#x7C7B;&#x578B;&#x7684;&#x5171;&#x8BC6;&#x6539;&#x53D8;&#x3002;&#x8FD9;&#x5728;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x638C;&#x673A;[segwit]&#x4E2D;&#x6709;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x68C0;&#x67E5;&#x3002; Segwit&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x7ED3;&#x6784;&#x7684;&#x4F53;&#x7CFB;&#x7ED3;&#x6784;&#x53D8;&#x5316;&#xFF0C;&#x5B83;&#x5C06;&#x89E3;&#x9501;&#x811A;&#x672C;&#xFF08;&#x89C1;&#x8BC1;&#xFF09;&#x4ECE;&#x4EA4;&#x6613;&#x5185;&#x90E8;&#x79FB;&#x52A8;&#x5230;&#x5916;&#x90E8;&#x6570;&#x636E;&#x7ED3;&#x6784;&#xFF08;&#x5C06;&#x5176;&#x9694;&#x79BB;&#xFF09;&#x3002;</p>
<p>Segwit&#x6700;&#x521D;&#x88AB;&#x8BBE;&#x60F3;&#x4E3A;&#x786C;&#x5206;&#x53C9;&#x5347;&#x7EA7;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4FEE;&#x6539;&#x4E86;&#x4E00;&#x4E2A;&#x57FA;&#x672C;&#x7684;&#x7ED3;&#x6784;&#xFF08;&#x4EA4;&#x6613;&#xFF09;&#x3002;&#x5728;2015&#x5E74;11&#x6708;&#xFF0C;&#x4E00;&#x4F4D;&#x4ECE;&#x4E8B;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5DE5;&#x4F5C;&#x7684;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x63D0;&#x51FA;&#x4E86;&#x4E00;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#xFF0C;&#x53EF;&#x4EE5;&#x5C06;&#x8F6F;&#x4EF6;&#x5305;&#x5F15;&#x5165;segwit&#x3002;&#x7528;&#x4E8E;&#x6B64;&#x7684;&#x673A;&#x5236;&#x662F;&#x5728;segwit&#x89C4;&#x5219;&#x4E0B;&#x521B;&#x5EFA;&#x7684;UTXO&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x7684;&#x4FEE;&#x6539;&#xFF0C;&#x4F7F;&#x5F97;&#x672A;&#x4FEE;&#x6539;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x4EFB;&#x4F55;&#x89E3;&#x9501;&#x811A;&#x672C;&#x89C6;&#x4E3A;&#x53EF;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x3002;</p>
<p>&#x56E0;&#x6B64;&#xFF0C;&#x53EF;&#x4EE5;&#x5F15;&#x5165;segwit&#x5C31;&#x662F;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x5FC5;&#x987B;&#x4ECE;&#x94FE;&#x4E0A;&#x5347;&#x7EA7;&#x6216;&#x62C6;&#x5206;&#x7F51;&#x7EDC;&#x3002;&#x6709;&#x53EF;&#x80FD;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5C1A;&#x672A;&#x88AB;&#x53D1;&#x73B0;&#x7684;&#x673A;&#x5236;&#xFF0C;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x53EF;&#x4EE5;&#x4EE5;&#x5411;&#x524D;&#x517C;&#x5BB9;&#x7684;&#x65B9;&#x5F0F;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#xFF0C;&#x90FD;&#x4F5C;&#x4E3A;&#x8F6F;&#x5206;&#x53C9;&#x3002;</p>
<h3 id="10136&#x5BF9;&#x8F6F;&#x5206;&#x53C9;&#x7684;&#x6279;&#x8BC4;">10.13.6&#x5BF9;&#x8F6F;&#x5206;&#x53C9;&#x7684;&#x6279;&#x8BC4;</h3>
<p>&#x57FA;&#x4E8E;NOP&#x64CD;&#x4F5C;&#x7801;&#x7684;&#x8F6F;&#x5206;&#x53C9;&#x662F;&#x76F8;&#x5BF9;&#x65E0;&#x4E89;&#x8BAE;&#x7684;&#x3002; NOP&#x64CD;&#x4F5C;&#x7801;&#x88AB;&#x653E;&#x7F6E;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x660E;&#x786E;&#x7684;&#x76EE;&#x6807;&#x662F;&#x5141;&#x8BB8;&#x65E0;&#x4E2D;&#x65AD;&#x5347;&#x7EA7;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x8BB8;&#x591A;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x62C5;&#x5FC3;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;&#x7684;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x4F1A;&#x4EA7;&#x751F;&#x4E0D;&#x53EF;&#x63A5;&#x53D7;&#x7684;&#x6298;&#x8877;&#x3002;</p>
<p>&#x5BF9;&#x8F6F;&#x5206;&#x53C9;&#x66F4;&#x6539;&#x7684;&#x5E38;&#x89C1;&#x6279;&#x8BC4;&#x5305;&#x62EC;&#xFF1A;</p>
<ul>
<li>&#x6280;&#x672F;&#x6027;&#x503A;&#x52A1;</li>
</ul>
<p>&#x7531;&#x4E8E;&#x8F6F;&#x53C9;&#x5728;&#x6280;&#x672F;&#x4E0A;&#x6BD4;&#x786C;&#x53C9;&#x5347;&#x7EA7;&#x66F4;&#x590D;&#x6742;&#xFF0C;&#x6240;&#x4EE5;&#x5F15;&#x5165;&#x4E86;&#x6280;&#x672F;&#x6027;&#x503A;&#x52A1;&#xFF0C;&#x8FD9;&#x662F;&#x6307;&#x7531;&#x4E8E;&#x8FC7;&#x53BB;&#x7684;&#x8BBE;&#x8BA1;&#x6743;&#x8861;&#x800C;&#x589E;&#x52A0;&#x4EE3;&#x7801;&#x7EF4;&#x62A4;&#x7684;&#x672A;&#x6765;&#x6210;&#x672C;&#x3002;&#x4EE3;&#x7801;&#x590D;&#x6742;&#x6027;&#x53C8;&#x589E;&#x52A0;&#x4E86;&#x9519;&#x8BEF;&#x548C;&#x5B89;&#x5168;&#x6F0F;&#x6D1E;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x3002;</p>
<ul>
<li>&#x9A8C;&#x8BC1;&#x653E;&#x677E;</li>
</ul>
<p>&#x672A;&#x7ECF;&#x4FEE;&#x6539;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x5C06;&#x4EA4;&#x6613;&#x89C6;&#x4E3A;&#x6709;&#x6548;&#xFF0C;&#x800C;&#x4E0D;&#x8BC4;&#x4F30;&#x4FEE;&#x6539;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x672A;&#x7ECF;&#x4FEE;&#x6539;&#x7684;&#x5BA2;&#x6237;&#x7AEF;&#x4E0D;&#x4F1A;&#x4F7F;&#x7528;&#x5168;&#x9762;&#x7684;&#x534F;&#x5546;&#x4E00;&#x81F4;&#x7684;&#x89C4;&#x5219;&#x6765;&#x9A8C;&#x8BC1;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x5BF9;&#x65B0;&#x89C4;&#x5219;&#x65E0;&#x89C6;&#x3002;&#x8FD9;&#x9002;&#x7528;&#x4E8E;&#x57FA;&#x4E8E;NOP&#x7684;&#x5347;&#x7EA7;&#xFF0C;&#x4EE5;&#x53CA;&#x5176;&#x4ED6;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;&#x3002;</p>
<ul>
<li>&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x5347;&#x7EA7;</li>
</ul>
<p>&#x56E0;&#x4E3A;&#x8F6F;&#x5206;&#x53C9;&#x4EA7;&#x751F;&#x989D;&#x5916;&#x7684;&#x5171;&#x8BC6;&#x7EA6;&#x675F;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x6240;&#x4EE5;&#x5B83;&#x4EEC;&#x5728;&#x5B9E;&#x8DF5;&#x4E2D;&#x6210;&#x4E3A;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x7684;&#x5347;&#x7EA7;&#x3002;&#x5982;&#x679C;&#x8F6F;&#x5206;&#x53C9;&#x5347;&#x7EA7;&#x5728;&#x88AB;&#x6FC0;&#x6D3B;&#x540E;&#x88AB;&#x56DE;&#x9000;&#xFF0C;&#x6839;&#x636E;&#x65B0;&#x89C4;&#x5219;&#x521B;&#x5EFA;&#x7684;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x90FD;&#x53EF;&#x80FD;&#x5BFC;&#x81F4;&#x65E7;&#x89C4;&#x5219;&#x4E0B;&#x7684;&#x8D44;&#x91D1;&#x635F;&#x5931;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x6839;&#x636E;&#x65E7;&#x89C4;&#x5219;&#x5BF9;CLTV&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x8BC4;&#x4F30;&#xFF0C;&#x5219;&#x4E0D;&#x5B58;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x7EA6;&#x675F;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x82B1;&#x8D39;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BC4;&#x8BBA;&#x5BB6;&#x8BA4;&#x4E3A;&#xFF0C;&#x7531;&#x4E8E;&#x9519;&#x8BEF;&#x800C;&#x4E0D;&#x5F97;&#x4E0D;&#x88AB;&#x56DE;&#x9000;&#x7684;&#x5931;&#x8D25;&#x7684;&#x8F6F;&#x5206;&#x53C9;&#x51E0;&#x4E4E;&#x80AF;&#x5B9A;&#x4F1A;&#x5BFC;&#x81F4;&#x8D44;&#x91D1;&#x7684;&#x6D41;&#x5931;&#x3002;</p>
<h2 id="1014&#x4F7F;&#x7528;&#x533A;&#x5757;&#x7248;&#x672C;&#x53D1;&#x51FA;&#x8F6F;&#x5206;&#x53C9;&#x4FE1;&#x53F7;">10.14&#x4F7F;&#x7528;&#x533A;&#x5757;&#x7248;&#x672C;&#x53D1;&#x51FA;&#x8F6F;&#x5206;&#x53C9;&#x4FE1;&#x53F7;</h2>
<p>&#x7531;&#x4E8E;&#x8F6F;&#x5206;&#x53C9;&#x5141;&#x8BB8;&#x672A;&#x7ECF;&#x4FEE;&#x6539;&#x7684;&#x5BA2;&#x6237;&#x5728;&#x534F;&#x5546;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7EE7;&#x7EED;&#x8FD0;&#x4F5C;&#xFF0C;&#x201C;&#x6FC0;&#x6D3B;&#x201D;&#x8F6F;&#x5206;&#x53C9;&#x7684;&#x673A;&#x5236;&#x662F;&#x901A;&#x8FC7;&#x5411;&#x77FF;&#x5DE5;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x51C6;&#x5907;&#xFF1A;&#x5927;&#x591A;&#x6570;&#x77FF;&#x5DE5;&#x5FC5;&#x987B;&#x540C;&#x610F;&#x4ED6;&#x4EEC;&#x51C6;&#x5907;&#x5E76;&#x613F;&#x610F;&#x6267;&#x884C;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x3002; &#x4E3A;&#x4E86;&#x534F;&#x8C03;&#x4ED6;&#x4EEC;&#x7684;&#x884C;&#x52A8;&#xFF0C;&#x6709;&#x4E00;&#x4E2A;&#x4FE1;&#x53F7;&#x673A;&#x5236;&#xFF0C;&#x4F7F;&#x4ED6;&#x4EEC;&#x80FD;&#x591F;&#x8868;&#x8FBE;&#x4ED6;&#x4EEC;&#x5BF9;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x6539;&#x53D8;&#x7684;&#x652F;&#x6301;&#x3002; &#x8BE5;&#x673A;&#x5236;&#x662F;&#x5728;2013&#x5E74;3&#x6708;&#x6FC0;&#x6D3B;BIP-34&#x5E76;&#x5728;2016&#x5E74;7&#x6708;&#x88AB;BIP-9&#x6FC0;&#x6D3B;&#x6240;&#x53D6;&#x4EE3;&#x3002;</p>
<h3 id="10141-bip-34&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;">10.14.1 BIP-34&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;</h3>
<p>&#x5728;BIP-34&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B9E;&#x65BD;&#x4F7F;&#x7528;&#x5757;&#x7248;&#x672C;&#x5B57;&#x6BB5;&#x6765;&#x5141;&#x8BB8;&#x77FF;&#x5DE5;&#x8868;&#x793A;&#x51C6;&#x5907;&#x8FBE;&#x6210;&#x7279;&#x5B9A;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x66F4;&#x6539;&#x3002;&#x5728;BIP-34&#x4E4B;&#x524D;&#xFF0C;&#x6309;&#x7167;&#x60EF;&#x4F8B;&#x5C06;&#x5757;&#x7248;&#x672C;&#x8BBE;&#x5B9A;&#x4E3A;&#x201C;1&#x201D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x4EE5;&#x5171;&#x8BC6;&#x65B9;&#x5F0F;&#x6267;&#x884C;&#x3002;BIP-34&#x5B9A;&#x4E49;&#x4E86;&#x4E00;&#x4E2A;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x53D8;&#x66F4;&#xFF0C;&#x8981;&#x6C42;&#x5C06;Coinbase&#x4EA4;&#x6613;&#x7684;coinbade&#x5B57;&#x6BB5;&#xFF08;&#x8F93;&#x5165;&#xFF09;&#x5305;&#x542B;&#x5757;&#x9AD8;&#x5EA6;&#x3002;&#x5728;BIP-34&#x4E4B;&#x524D;&#xFF0C;Coinbase&#x53EF;&#x4EE5;&#x8BA9;&#x77FF;&#x5DE5;&#x9009;&#x62E9;&#x5305;&#x542B;&#x7684;&#x4EFB;&#x610F;&#x6570;&#x636E;&#x3002;&#x5728;BIP-34&#x6FC0;&#x6D3B;&#x4E4B;&#x540E;&#xFF0C;&#x6709;&#x6548;&#x5757;&#x5FC5;&#x987B;&#x5728;Coinbase&#x7684;&#x5F00;&#x59CB;&#x5904;&#x5305;&#x542B;&#x7279;&#x5B9A;&#x7684;&#x5757;&#x9AD8;&#x5EA6;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x7528;&#x5927;&#x4E8E;&#x6216;&#x7B49;&#x4E8E;&#x201C;2&#x201D;&#x7684;&#x7248;&#x672C;&#x53F7;&#x8FDB;&#x884C;&#x6807;&#x8BC6;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6807;&#x8BB0;BIP-34&#x7684;&#x66F4;&#x6539;&#x548C;&#x6FC0;&#x6D3B;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x5C06;&#x5757;&#x7248;&#x672C;&#x8BBE;&#x7F6E;&#x4E3A;&#x201C;2&#x201D;&#x800C;&#x4E0D;&#x662F;&#x201C;1&#x201D;&#x3002;&#x8FD9;&#x6CA1;&#x6709;&#x7ACB;&#x5373;&#x4F7F;&#x7248;&#x672C;&#x201C;1&#x201D;&#x5757;&#x65E0;&#x6548;&#x3002;&#x4E00;&#x65E6;&#x6FC0;&#x6D3B;&#xFF0C;&#x7248;&#x672C;&#x201C;1&#x201D;&#x5757;&#x5C06;&#x53D8;&#x5F97;&#x65E0;&#x6548;&#xFF0C;&#x5E76;&#x4E14;&#x5C06;&#x9700;&#x8981;&#x6240;&#x6709;&#x7248;&#x672C;&#x201C;2&#x201D;&#x5757;&#x4EE5;&#x5305;&#x542B;Coinbase&#x5E93;&#x4E2D;&#x7684;&#x5757;&#x9AD8;&#x5EA6;&#x624D;&#x80FD;&#x6709;&#x6548;&#x3002;</p>
<p>BIP-34&#x57FA;&#x4E8E;1000&#x4E2A;&#x5757;&#x7684;&#x6EDA;&#x52A8;&#x7A97;&#x53E3;&#x5B9A;&#x4E49;&#x4E86;&#x4E24;&#x6B65;&#x542F;&#x52A8;&#x673A;&#x5236;&#x3002;&#x77FF;&#x5DE5;&#x5C06;&#x4EE5;&#x201C;2&#x201D;&#x4F5C;&#x4E3A;&#x7248;&#x672C;&#x53F7;&#x6765;&#x6784;&#x5EFA;&#x5757;&#xFF0C;&#x4ECE;&#x800C;&#x5411;BIP-34&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x3002;&#x4E25;&#x683C;&#x6765;&#x8BF4;&#xFF0C;&#x7531;&#x4E8E;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5C1A;&#x672A;&#x88AB;&#x6FC0;&#x6D3B;&#xFF0C;&#x8FD9;&#x4E9B;&#x533A;&#x5757;&#x8FD8;&#x6CA1;&#x6709;&#x9075;&#x5B88;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5C06;&#x5757;&#x9AD8;&#x5EA6;&#x5305;&#x62EC;&#x5728;Coinbase&#x4EA4;&#x6613;&#x4E2D;&#x3002;</p>
<p>&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5206;&#x4E3A;&#x4E24;&#x4E2A;&#x6B65;&#x9AA4;&#x6FC0;&#x6D3B;&#xFF1A;</p>
<p>&#x5982;&#x679C;75&#xFF05;&#xFF08;&#x6700;&#x8FD1;1000&#x4E2A;&#x5757;&#x4E2D;&#x7684;750&#x4E2A;&#xFF09;&#x6807;&#x6709;&#x7248;&#x672C;&#x201C;2&#x201D;&#xFF0C;&#x5219;&#x7248;&#x672C;&#x201C;2&#x201D;&#x5757;&#x5FC5;&#x987B;&#x5305;&#x542B;coinbase&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x5757;&#x9AD8;&#x5EA6;&#xFF0C;&#x5426;&#x5219;&#x88AB;&#x62D2;&#x7EDD;&#x4E3A;&#x65E0;&#x6548;&#x3002; &#x7248;&#x672C;&#x201C;1&#x201D;&#x5757;&#x4ECD;&#x7136;&#x88AB;&#x7F51;&#x7EDC;&#x63A5;&#x53D7;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x5305;&#x542B;&#x5757;&#x9AD8;&#x5EA6;&#x3002; &#x8FD9;&#x4E2A;&#x65B0;&#x65F6;&#x671F;&#x7684;&#x65B0;&#x65E7;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x5171;&#x5B58;&#x3002;</p>
<p>&#x5F53;95&#xFF05;&#xFF08;&#x6700;&#x8FD1;1000&#x5757;&#x4E2D;&#x7684;950&#xFF09;&#x662F;&#x7248;&#x672C;&#x201C;2&#x201D;&#x65F6;&#xFF0C;&#x7248;&#x672C;&#x201C;1&#x201D;&#x5757;&#x4E0D;&#x518D;&#x88AB;&#x89C6;&#x4E3A;&#x6709;&#x6548;&#x3002; &#x7248;&#x672C;&#x201C;2&#x201D;&#x5757;&#x53EA;&#x6709;&#x5F53;&#x5B83;&#x4EEC;&#x5305;&#x542B;coinbase&#x4E2D;&#x7684;&#x5757;&#x9AD8;&#x5EA6;&#xFF08;&#x6839;&#x636E;&#x5148;&#x524D;&#x9608;&#x503C;&#xFF09;&#x65F6;&#x624D;&#x6709;&#x6548;&#x3002; &#x6B64;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x5757;&#x5FC5;&#x987B;&#x7B26;&#x5408;&#x65B0;&#x7684;&#x4E00;&#x81F4;&#x6027;&#x89C4;&#x5219;&#xFF0C;&#x6240;&#x6709;&#x6709;&#x6548;&#x5757;&#x5FC5;&#x987B;&#x5305;&#x542B;coinbase&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x5757;&#x9AD8;&#x5EA6;&#x3002;&#x6839;&#x636E;BIP-34&#x89C4;&#x5219;&#x6210;&#x529F;&#x53D1;&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;&#x540E;&#xFF0C;&#x8BE5;&#x673A;&#x5236;&#x518D;&#x6B21;&#x4F7F;&#x7528;&#x4E24;&#x6B21;&#x4EE5;&#x6FC0;&#x6D3B;&#x8F6F;&#x5206;&#x53C9;&#xFF1A;BIP-66&#x6807;&#x7B7E;&#x7684;&#x4E25;&#x683C;DER&#x7F16;&#x7801;&#x901A;&#x8FC7;BIP-34&#x4FE1;&#x53F7;&#x901A;&#x8FC7;&#x5757;&#x7248;&#x672C;&#x201C;3&#x201D;&#x6FC0;&#x6D3B;&#xFF0C;&#x65E0;&#x6548;&#x7248;&#x672C;&#x201C;2&#x201D;&#x5757;&#x3002;BIP-65 CHECKLOCKTIMEVERIFY&#x88AB;&#x5757;&#x7248;&#x672C;&#x201C;4&#x201D;&#x7684;BIP-34&#x4FE1;&#x53F7;&#x6FC0;&#x6D3B;&#xFF0C;&#x65E0;&#x6548;&#x7248;&#x672C;&#x201C;3&#x201D;&#x5757;&#x3002;</p>
<p>BIP-65&#x6FC0;&#x6D3B;&#x540E;&#xFF0C;BIP-34&#x7684;&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;&#x673A;&#x5236;&#x9000;&#x51FA;&#xFF0C;&#x5E76;&#x7528;&#x4E0B;&#x9762;&#x63CF;&#x8FF0;&#x7684;BIP-9&#x4FE1;&#x53F7;&#x4F20;&#x5BFC;&#x673A;&#x5236;&#x4EE3;&#x66FF;&#x3002;&#x8FD9;&#x4E2A;&#x6807;&#x51C6;&#x5728;<a href="https://github.com/bitcoin/bips/blob/master/bip-0034.mediawiki" target="_blank">BIP-34(Block v2, Height in Coinbase)</a>&#x4E2D;&#x5B9A;&#x4E49;&#x3002;</p>
<h3 id="10142-bip-9&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;">10.14.2 BIP-9&#x4FE1;&#x53F7;&#x548C;&#x6FC0;&#x6D3B;</h3>
<p>BIP-34&#xFF0C;BIP-66&#x548C;BIP-65&#x4F7F;&#x7528;&#x7684;&#x673A;&#x5236;&#x6210;&#x529F;&#x5730;&#x6FC0;&#x6D3B;&#x4E86;&#x4E09;&#x4E2A;&#x8F6F;&#x5206;&#x53C9;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5B83;&#x53C8;&#x88AB;&#x66FF;&#x6362;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x6709;&#x51E0;&#x4E2A;&#x9650;&#x5236;&#xFF1A;</p>
<p>&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x5757;&#x7248;&#x672C;&#x7684;&#x6574;&#x6570;&#x503C;&#xFF0C;&#x4E00;&#x6B21;&#x53EA;&#x80FD;&#x6FC0;&#x6D3B;&#x4E00;&#x4E2A;&#x8F6F;&#x5206;&#x53C9;&#xFF0C;&#x56E0;&#x6B64;&#x9700;&#x8981;&#x8F6F;&#x5206;&#x53C9;&#x63D0;&#x8BAE;&#x4E4B;&#x95F4;&#x7684;&#x534F;&#x8C03;&#x4EE5;&#x53CA;&#x5BF9;&#x5176;&#x4F18;&#x5148;&#x7EA7;&#x548C;&#x6392;&#x5E8F;&#x7684;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x7531;&#x4E8E;&#x5757;&#x7248;&#x672C;&#x589E;&#x52A0;&#xFF0C;&#x6240;&#x4EE5;&#x673A;&#x5236;&#x5E76;&#x6CA1;&#x6709;&#x63D0;&#x4F9B;&#x4E00;&#x79CD;&#x76F4;&#x63A5;&#x7684;&#x65B9;&#x5F0F;&#x6765;&#x62D2;&#x7EDD;&#x53D8;&#x66F4;&#xFF0C;&#x800C;&#x662F;&#x63D0;&#x51FA;&#x4E00;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x3002; &#x5982;&#x679C;&#x8001;&#x5BA2;&#x6237;&#x4ECD;&#x7136;&#x5728;&#x8FD0;&#x884C;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x80FD;&#x4F1A;&#x9519;&#x8BEF;&#x5730;&#x5C06;&#x4FE1;&#x53F7;&#x8F6C;&#x6362;&#x4E3A;&#x65B0;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x4F5C;&#x4E3A;&#x4EE5;&#x524D;&#x62D2;&#x7EDD;&#x7684;&#x66F4;&#x6539;&#x7684;&#x4FE1;&#x53F7;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x65B0;&#x7684;&#x66F4;&#x6539;&#x4E0D;&#x53EF;&#x9006;&#x8F6C;&#x5730;&#x51CF;&#x5C11;&#x53EF;&#x7528;&#x7684;&#x4F9B;&#x5C06;&#x6765;&#x66F4;&#x6539;&#x7684;&#x5757;&#x7248;&#x672C;&#x3002;</p>
<p>&#x63D0;&#x51FA;BIP-9&#x6765;&#x514B;&#x670D;&#x8FD9;&#x4E9B;&#x6311;&#x6218;&#xFF0C;&#x63D0;&#x9AD8;&#x5B9E;&#x65BD;&#x672A;&#x6765;&#x53D8;&#x5316;&#x7684;&#x901F;&#x5EA6;&#x548C;&#x4FBF;&#x5229;&#x6027;&#x3002;</p>
<p>BIP-9&#x5C06;&#x5757;&#x7248;&#x672C;&#x89E3;&#x91CA;&#x4E3A;bit&#x5B57;&#x6BB5;&#x800C;&#x4E0D;&#x662F;&#x6574;&#x5F62;&#xFF08;int&#xFF09;&#x5B57;&#x6BB5;&#x3002;&#x56E0;&#x4E3A;&#x5757;&#x7248;&#x672C;&#x6700;&#x521D;&#x4F5C;&#x4E3A;&#x6574;&#x5F62;&#xFF08;int32&#xFF09;&#x5B57;&#x6BB5;&#xFF0C;&#x56E0;&#x6B64;&#x7248;&#x672C;1&#x5230;4&#xFF0C;&#x53EA;&#x6709;29&#x4F4D;&#x53EF;&#x7528;&#x4F5C;bit&#x5B57;&#x6BB5;&#x3002;&#x8FD9;&#x7559;&#x4E0B;29&#x4F4D;&#xFF0C;&#x53EF;&#x4EE5;&#x72EC;&#x7ACB;&#x4F7F;&#x7528;&#xFF0C;&#x540C;&#x65F6;&#x5728;29&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x63D0;&#x6848;&#x4E0A;&#x8868;&#x793A;&#x51C6;&#x5907;&#x5C31;&#x7EEA;&#x3002;BIP-9&#x8FD8;&#x8BBE;&#x7F6E;&#x4E86;&#x4FE1;&#x4EE4;&#x548C;&#x6FC0;&#x6D3B;&#x7684;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x3002;&#x77FF;&#x5DE5;&#x4EEC;&#x4E0D;&#x9700;&#x8981;&#x6C38;&#x8FDC;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#x3002;&#x5982;&#x679C;&#x63D0;&#x6848;&#x5728;TIMEOUT&#x671F;&#x95F4;&#xFF08;&#x5728;&#x63D0;&#x6848;&#x4E2D;&#x5B9A;&#x4E49;&#xFF09;&#x672A;&#x6FC0;&#x6D3B;&#xFF0C;&#x5219;&#x8BE5;&#x63D0;&#x6848;&#x88AB;&#x89C6;&#x4E3A;&#x88AB;&#x62D2;&#x7EDD;&#x3002;&#x8BE5;&#x63D0;&#x8BAE;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x4F4D;&#x7684;&#x4FE1;&#x4EE4;&#x91CD;&#x65B0;&#x63D0;&#x4EA4;&#xFF0C;&#x66F4;&#x65B0;&#x6FC0;&#x6D3B;&#x5468;&#x671F;&#x3002;</p>
<p>&#x6B64;&#x5916;&#xFF0C;&#x5728;TIMEOUT&#x5DF2;&#x7ECF;&#x8FC7;&#x53BB;&#x5E76;&#x4E14;&#x7279;&#x5F81;&#x88AB;&#x6FC0;&#x6D3B;&#x6216;&#x88AB;&#x62D2;&#x7EDD;&#x4E4B;&#x540E;&#xFF0C;&#x4FE1;&#x4EE4;&#x4F4D;&#x53EF;&#x4EE5;&#x88AB;&#x518D;&#x6B21;&#x7528;&#x4E8E;&#x53E6;&#x4E00;&#x4E2A;&#x7279;&#x5F81;&#x800C;&#x4E0D;&#x4F1A;&#x6DF7;&#x6DC6;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x591A;&#x8FBE;29&#x6B21;&#x66F4;&#x6539;&#x53EF;&#x4EE5;&#x5E76;&#x884C;&#x53D1;&#x51FA;&#x4FE1;&#x53F7;&#xFF0C;TIMEOUT&#x540E;&#x53EF;&#x5C06;&#x8FD9;&#x4E9B;&#x4F4D;&#x201C;&#x518D;&#x5FAA;&#x73AF;&#x201D;&#x4EE5;&#x63D0;&#x51FA;&#x65B0;&#x7684;&#x66F4;&#x6539;&#x3002;</p>
<p><strong>&#x6CE8;&#x610F;</strong>&#x867D;&#x7136;&#x4FE1;&#x4EE4;&#x4F4D;&#x53EF;&#x4EE5;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x6216;&#x56DE;&#x6536;&#x5229;&#x7528;&#xFF0C;&#x4F46;&#x53EA;&#x8981;&#x6295;&#x7968;&#x671F;&#x95F4;&#x4E0D;&#x91CD;&#x53E0;&#xFF0C;BIP-9&#x7684;&#x4F5C;&#x8005;&#x5C31;&#x5EFA;&#x8BAE;&#x4EC5;&#x5728;&#x5FC5;&#x8981;&#x65F6;&#x91CD;&#x590D;&#x4F7F;&#x7528;&#x4F4D;; &#x4E3B;&#x8981;&#x662F;&#x7531;&#x4E8E;&#x65E7;&#x8F6F;&#x4EF6;&#x4E2D;&#x7684;bug&#xFF0C;&#x53EF;&#x80FD;&#x4F1A;&#x53D1;&#x751F;&#x610F;&#x5916;&#x7684;&#x884C;&#x4E3A;&#x3002; &#x603B;&#x4E4B;&#xFF0C;&#x6211;&#x4EEC;&#x4E0D;&#x5E94;&#x8BE5;&#x671F;&#x671B;&#x5728;&#x6240;&#x6709;29&#x4F4D;&#x90FD;&#x88AB;&#x4F7F;&#x7528;&#x4E00;&#x6B21;&#x4E4B;&#x524D;&#x770B;&#x5230;&#x91CD;&#x7528;&#x3002;</p>
<p>&#x5EFA;&#x8BAE;&#x7684;&#x66F4;&#x6539;&#x7531;&#x5305;&#x542B;&#x4EE5;&#x4E0B;&#x5B57;&#x6BB5;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x6807;&#x8BC6;&#xFF1A;&#x540D;&#x79F0;&#x7528;&#x4E8E;&#x533A;&#x5206;&#x63D0;&#x6848;&#x7684;&#x7B80;&#x77ED;&#x63CF;&#x8FF0;&#x3002; &#x901A;&#x5E38;&#xFF0C;BIP&#x5C06;&#x8BE5;&#x63D0;&#x6848;&#x63CF;&#x8FF0;&#x4E3A;&#x201C;bipN&#x201D;&#xFF0C;&#x5176;&#x4E2D;N&#x662F;BIP&#x7F16;&#x53F7;&#x3002;&#x4F4D;0&#x5230;28&#xFF0C;&#x77FF;&#x5DE5;&#x4F7F;&#x7528;&#x7684;&#x5757;&#x7248;&#x672C;&#x4E2D;&#x7684;&#x4F4D;&#x7528;&#x4E8E;&#x8868;&#x793A;&#x6B64;&#x63D0;&#x6848;&#x7684;&#x6279;&#x51C6;&#x3002;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x4FE1;&#x53F7;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x95F4;&#xFF08;&#x57FA;&#x4E8E;&#x4E2D;&#x503C;&#x65F6;&#x95F4;&#x8FC7;&#x53BB;&#x6216;MTP&#xFF09;&#xFF0C;&#x4E4B;&#x540E;&#x8BE5;&#x4F4D;&#x7684;&#x503C;&#x88AB;&#x89E3;&#x91CA;&#x4E3A;&#x63D0;&#x793A;&#x7684;&#x4FE1;&#x4EE4;&#x51C6;&#x5907;&#x3002;&#x65F6;&#x95F4;&#x7ED3;&#x675F;&#x8BE5;&#x65F6;&#x95F4;&#xFF08;&#x57FA;&#x4E8E;MTP&#xFF09;&#xFF0C;&#x5982;&#x679C;&#x5C1A;&#x672A;&#x8FBE;&#x5230;&#x6FC0;&#x6D3B;&#x9608;&#x503C;&#xFF0C;&#x5219;&#x8BA4;&#x4E3A;&#x8BE5;&#x66F4;&#x6539;&#x88AB;&#x62D2;&#x7EDD;&#x3002;</p>
<p>&#x4E0E;BIP-34&#x4E0D;&#x540C;&#xFF0C;BIP-9&#x6839;&#x636E;2016&#x5757;&#x7684;&#x96BE;&#x5EA6;&#x6539;&#x53D8;&#x76EE;&#x6807;&#xFF08;retarget&#xFF09;&#x5468;&#x671F;&#xFF0C;&#x5728;&#x6574;&#x4E2A;&#x95F4;&#x9694;&#x5468;&#x671F;&#x4E2D;&#x8BA1;&#x7B97;&#x6FC0;&#x6D3B;&#x4FE1;&#x53F7;&#x7684;&#x6570;&#x91CF;&#x3002; &#x5728;&#x6BCF;&#x4E2A;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x5468;&#x671F;&#x5185;&#xFF0C;&#x5982;&#x679C;&#x63D0;&#x6848;&#x7684;&#x6FC0;&#x6D3B;&#x4FE1;&#x53F7;&#x6570;&#x91CF;&#x603B;&#x548C;&#x8D85;&#x8FC7;95&#xFF05;&#xFF08;2016&#x4E2D;&#x7684;1916&#xFF09;&#xFF0C;&#x5219;&#x8BE5;&#x63D0;&#x6848;&#x5C06;&#x5728;&#x4E0B;&#x4E00;&#x4E2A;&#x96BE;&#x5EA6;&#x8C03;&#x6574;&#x5468;&#x671F;&#x5185;&#x6FC0;&#x6D3B;&#x3002;BIP-9&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x63D0;&#x6848;&#x72B6;&#x6001;&#x56FE;&#xFF0C;&#x4EE5;&#x8BF4;&#x660E;&#x4E00;&#x4E2A;&#x63D0;&#x6848;&#x7684;&#x5404;&#x4E2A;&#x9636;&#x6BB5;&#x548C;&#x8F6C;&#x6362;&#xFF0C;&#x5982;&#x56FE;10-10&#x6240;&#x793A;&#x3002;</p>
<p><img src="http://upload-images.jianshu.io/upload_images/1785959-4502b09278ed7c87.png?imageMogr2/auto-orient/strip%7CimageView2/2/w/1240" alt=""></p>
<p>&#x4E00;&#x65E6;&#x5B83;&#x4EEC;&#x7684;&#x53C2;&#x6570;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x8F6F;&#x4EF6;&#x4E2D;&#x88AB;&#x77E5;&#x9053;&#xFF08;&#x5B9A;&#x4E49;&#xFF09;&#xFF0C;&#x63D0;&#x6848;&#x5C06;&#x5728;DEFINED&#x72B6;&#x6001;&#x4E0B;&#x5F00;&#x59CB;&#x3002; &#x5BF9;&#x4E8E;&#x5177;&#x6709;MTP&#x7684;&#x5757;&#x5728;&#x5F00;&#x59CB;&#x65F6;&#x95F4;&#x4E4B;&#x540E;&#xFF0C;&#x63D0;&#x8BAE;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x5230;STARTED&#x3002; &#x5982;&#x679C;&#x5728;&#x6539;&#x53D8;&#x76EE;&#x6807;&#x671F;&#x95F4;&#x8D85;&#x8FC7;&#x4E86;&#x6295;&#x7968;&#x9608;&#x503C;&#xFF0C;&#x5E76;&#x4E14;&#x672A;&#x8D85;&#x8FC7;&#x8D85;&#x65F6;&#xFF0C;&#x5219;&#x63D0;&#x6848;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x4E3A;LOCKED_IN&#x3002; &#x4E00;&#x4E2A;&#x6539;&#x53D8;&#x76EE;&#x6807;&#x671F;&#x540E;&#xFF0C;&#x8BE5;&#x63D0;&#x6848;&#x53D8;&#x4E3A;&#x6D3B;&#x52A8;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8FBE;&#x5230;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#xFF0C;&#x63D0;&#x6848;&#x4ECD;&#x7136;&#x5904;&#x4E8E;&#x6D3B;&#x52A8;&#x72B6;&#x6001;&#x3002; &#x5982;&#x679C;&#x5728;&#x8FBE;&#x5230;&#x6295;&#x7968;&#x9608;&#x503C;&#x4E4B;&#x524D;&#x8D85;&#x65F6;&#x65F6;&#x95F4;&#xFF0C;&#x63D0;&#x6848;&#x72B6;&#x6001;&#x5C06;&#x66F4;&#x6539;&#x4E3A;&#x201C;&#x5DF2;&#x6545;&#x201D;&#xFF0C;&#x8868;&#x793A;&#x5DF2;&#x62D2;&#x7EDD;&#x7684;&#x63D0;&#x6848;&#x3002; REJECTED&#x7684;&#x5EFA;&#x8BAE;&#x6C38;&#x8FDC;&#x5728;&#x8FD9;&#x4E2A;&#x72B6;&#x6001;&#x3002;BIP-9&#x9996;&#x6B21;&#x5B9E;&#x65BD;&#x7528;&#x4E8E;&#x6FC0;&#x6D3B;CHECKSEQUENCEVERIFY&#x548C;&#x76F8;&#x5173;BIP&#xFF08;68,112,113&#xFF09;&#x3002; &#x540D;&#x4E3A;&#x201C;csv&#x201D;&#x7684;&#x5EFA;&#x8BAE;&#x5728;2016&#x5E74;7&#x6708;&#x6210;&#x529F;&#x542F;&#x52A8;&#x3002;&#x6807;&#x51C6;&#x5B9A;&#x4E49;&#x5728;<a href="https://github.com/bitcoin/bips/blob/master/bip-0009.mediawiki" target="_blank">BIP-9(Version bits with timeout and delay)</a>.</p>
<h2 id="1015&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;">10.15&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;</h2>
<p>&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E0D;&#x65AD;&#x53D1;&#x5C55;&#xFF0C;&#x5BF9;&#x4E8E;&#x6539;&#x53D8;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x5404;&#x79CD;&#x673A;&#x5236;&#x8FDB;&#x884C;&#x4E86;&#x5F88;&#x200B;&#x200B;&#x591A;&#x8BA8;&#x8BBA;&#x3002;&#x7531;&#x4E8E;&#x5176;&#x672C;&#x8D28;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5728;&#x534F;&#x8C03;&#x548C;&#x53D8;&#x5316;&#x5171;&#x8BC6;&#x65B9;&#x9762;&#x6811;&#x7ACB;&#x4E86;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x6807;&#x6746;&#x3002;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5236;&#x5EA6;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x5C06;&#x6743;&#x529B;&#x5F3A;&#x52A0;&#x4E8E;&#x7F51;&#x7EDC;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x201C;&#x6743;&#x5A01;&#x201D;&#x3002;&#x6743;&#x529B;&#x5206;&#x6563;&#x5728;&#x591A;&#x4E2A;&#x652F;&#x6301;&#x8005;&#xFF0C;&#x5982;&#x77FF;&#x5DE5;&#xFF0C;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x5546;&#xFF0C;&#x94B1;&#x5305;&#x5F00;&#x53D1;&#x5546;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#xFF0C;&#x5546;&#x5BB6;&#x548C;&#x6700;&#x7EC8;&#x7528;&#x6237;&#x4E4B;&#x95F4;&#x3002;&#x8FD9;&#x4E9B;&#x652F;&#x6301;&#x8005;&#x4E0D;&#x80FD;&#x5355;&#x65B9;&#x9762;&#x505A;&#x51FA;&#x51B3;&#x5B9A;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x77FF;&#x5DE5;&#x5728;&#x7406;&#x8BBA;&#x4E0A;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x591A;&#x6570;&#xFF08;51&#xFF05;&#xFF09;&#x6765;&#x6539;&#x53D8;&#x89C4;&#x5219;&#xFF0C;&#x4F46;&#x53D7;&#x5230;&#x5176;&#x4ED6;&#x652F;&#x6301;&#x8005;&#x7684;&#x540C;&#x610F;&#x7684;&#x9650;&#x5236;&#x3002;</p>
<p>&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5355;&#x65B9;&#x9762;&#x884C;&#x4E8B;&#xFF0C;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x8005;&#x53EF;&#x80FD;&#x4F1A;&#x62D2;&#x7EDD;&#x9075;&#x5B88;&#xFF0C;&#x5C06;&#x7ECF;&#x6D4E;&#x6D3B;&#x52A8;&#x4FDD;&#x6301;&#x5728;&#x5C11;&#x6570;&#x94FE;&#x6761;&#x4E0A;&#x3002;&#x6CA1;&#x6709;&#x7ECF;&#x6D4E;&#x6D3B;&#x52A8;&#xFF08;&#x4EA4;&#x6613;&#xFF0C;&#x5546;&#x4EBA;&#xFF0C;&#x94B1;&#x5305;&#xFF0C;&#x4EA4;&#x6613;&#x6240;&#xFF09;&#xFF0C;&#x77FF;&#x5DE5;&#x4EEC;&#x5C06;&#x7528;&#x7A7A;&#x7684;&#x5757;&#x5F00;&#x91C7;&#x4E00;&#x4E2A;&#x65E0;&#x4EF7;&#x503C;&#x7684;&#x8D27;&#x5E01;&#x3002;&#x8FD9;&#x79CD;&#x6743;&#x529B;&#x7684;&#x6269;&#x6563;&#x610F;&#x5473;&#x7740;&#x6240;&#x6709;&#x53C2;&#x4E0E;&#x8005;&#x5FC5;&#x987B;&#x534F;&#x8C03;&#xFF0C;&#x6216;&#x8005;&#x4E0D;&#x80FD;&#x505A;&#x51FA;&#x4EFB;&#x4F55;&#x6539;&#x53D8;&#x3002;&#x73B0;&#x72B6;&#x662F;&#x8FD9;&#x4E2A;&#x5236;&#x5EA6;&#x7684;&#x7A33;&#x5B9A;&#x72B6;&#x6001;&#xFF0C;&#x53EA;&#x6709;&#x5728;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x8FBE;&#x6210;&#x4E00;&#x81F4;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x624D;&#x80FD;&#x6709;&#x51E0;&#x4E2A;&#x53D8;&#x5316;&#x3002;&#x8F6F;&#x5206;&#x53C9;&#x7684;95&#xFF05;&#x95E8;&#x69DB;&#x53CD;&#x6620;&#x4E86;&#x8FD9;&#x4E00;&#x73B0;&#x5B9E;&#x3002;</p>
<p>&#x91CD;&#x8981;&#x7684;&#x662F;&#x8981;&#x8BA4;&#x8BC6;&#x5230;&#xFF0C;&#x5BF9;&#x4E8E;&#x5171;&#x8BC6;&#x53D1;&#x5C55;&#x6CA1;&#x6709;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x529E;&#x6CD5;&#x3002;&#x786C;&#x5206;&#x53C9;&#x548C;&#x8F6F;&#x5206;&#x53C9;&#x90FD;&#x6D89;&#x53CA;&#x6743;&#x8861;&#x3002;&#x5BF9;&#x4E8E;&#x67D0;&#x4E9B;&#x7C7B;&#x578B;&#x7684;&#x66F4;&#x6539;&#xFF0C;&#x8F6F;&#x5206;&#x53C9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;;&#x5BF9;&#x4E8E;&#x522B;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x786C;&#x5206;&#x53C9;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x66F4;&#x597D;&#x7684;&#x9009;&#x62E9;&#x3002;&#x6CA1;&#x6709;&#x5B8C;&#x7F8E;&#x7684;&#x9009;&#x62E9;&#xFF0C;&#x90FD;&#x5E26;&#x6709;&#x98CE;&#x9669;&#x3002;&#x5171;&#x8BC6;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x4E00;&#x4E2A;&#x4E0D;&#x53D8;&#x7279;&#x5F81;&#x662F;&#x53D8;&#x9769;&#x662F;&#x56F0;&#x96BE;&#x7684;&#xFF0C;&#x662F;&#x5171;&#x8BC6;&#x529B;&#x91CF;&#x7684;&#x59A5;&#x534F;&#x3002;&#x6709;&#x4E9B;&#x4EBA;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x5171;&#x8BC6;&#x5236;&#x5EA6;&#x7684;&#x5F31;&#x70B9;&#x3002;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x6211;&#x4E00;&#x6837;&#x770B;&#x5230;&#x5B83;&#xFF0C;&#x628A;&#x5B83;&#x5F53;&#x4F5C;&#x8FD9;&#x4E2A;&#x7CFB;&#x7EDF;&#x6700;&#x5927;&#x7684;&#x4F18;&#x52BF;&#x3002;</p>
<p>&#x4FDD;&#x5168;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x5F88;&#x6709;&#x6311;&#x6218;&#x6027;&#x7684;&#x4E8B;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x50CF;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x4F59;&#x989D;&#x90A3;&#x6837;&#x4F53;&#x73B0;&#x62BD;&#x8C61;&#x4EF7;&#x503C;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x5176;&#x5B9E;&#x66F4;&#x50CF;&#x6570;&#x5B57;&#x73B0;&#x91D1;&#x6216;&#x9EC4;&#x91D1;&#x3002; &#x4F60;&#x53EF;&#x80FD;&#x542C;&#x8FC7;&#x8FD9;&#x6837;&#x7684;&#x8BF4;&#x6CD5;&#xFF0C;&#x201C;&#x8C01;&#x6301;&#x6709;&#x51E0;&#x4E4E;&#x7B49;&#x540C;&#x6CD5;&#x5F8B;&#x62E5;&#x6709;&#x3002;&#x201D;&#x597D;&#x5427;&#xFF0C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E16;&#x754C;&#x91CC;&#xFF0C;&#x8C01;&#x6301;&#x6709;&#x8C01;&#x62E5;&#x6709;&#x3002;&#x6301;&#x6709;&#x62E5;&#x6709;&#x89E3;&#x9501;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5BC6;&#x94A5;&#x5C31;&#x76F8;&#x5F53;&#x4E8E;&#x6301;&#x6709;&#x73B0;&#x91D1;&#x6216;&#x4E00;&#x5757;&#x8D35;&#x91CD;&#x91D1;&#x5C5E;&#x3002;&#x4F60;&#x53EF;&#x80FD;&#x4F1A;&#x5C06;&#x5BC6;&#x94A5;&#x4E22;&#x5931;&#xFF0C;&#x4F1A;&#x653E;&#x9519;&#x5730;&#x65B9;&#xFF0C;&#x4F1A;&#x88AB;&#x76D7;&#x6216;&#x8005;&#x4E0D;&#x5C0F;&#x5FC3;&#x9519;&#x652F;&#x4E86;&#x6570;&#x989D;&#x3002;&#x65E0;&#x8BBA;&#x662F;&#x54EA;&#x79CD;&#x573A;&#x666F;&#xFF0C;&#x7528;&#x6237;&#x90FD;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x64A4;&#x56DE;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x5C31;&#x50CF;&#x662F;&#x5C06;&#x73B0;&#x91D1;&#x4E22;&#x5728;&#x4E86;&#x8F66;&#x6C34;&#x9A6C;&#x9F99;&#x7684;&#x5927;&#x8857;&#x4E0A;&#x3002;</p>
<p>&#x4E0D;&#x8FC7;&#xFF0C;&#x4E0E;&#x73B0;&#x91D1;&#x3001;&#x9EC4;&#x91D1;&#x6216;&#x8005;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x76F8;&#x6BD4;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6709;&#x7740;&#x4E00;&#x4E2A;&#x72EC;&#x4E00;&#x65E0;&#x4E8C;&#x7684;&#x4F18;&#x52BF;&#x3002;&#x4F60;&#x4E0D;&#x80FD;&#x201C;&#x5907;&#x4EFD;&#x201D;&#x4F60;&#x7684;&#x73B0;&#x91D1;&#x3001;&#x9EC4;&#x91D1;&#x6216;&#x8005;&#x94F6;&#x884C;&#x8D26; &#x6237;&#xFF0C;&#x4F46;&#x4F60;&#x53EF;&#x4EE5;&#x50CF;&#x5907;&#x4EFD;&#x5176;&#x4ED6;&#x6587;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x5907;&#x4EFD;&#x542B;&#x6709;&#x5BC6;&#x94A5;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x590D;&#x5236;&#x6210;&#x5F88;&#x591A;&#x4EFD;&#xFF0C;&#x653E;&#x5230;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x4FDD;&#x5B58;&#x8D77;&#x6765;&#xFF0C; &#x751A;&#x81F3;&#x80FD;&#x6253;&#x5370;&#x5230;&#x7EB8;&#x4E0A;&#x8FDB;&#x884C;&#x5B9E;&#x4F53;&#x5907;&#x4EFD;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x4E0E;&#x81F3;&#x4ECA;&#x4E3A;&#x6B62;&#x7684;&#x5176;&#x4ED6;&#x8D27;&#x5E01;&#x662F;&#x5982;&#x6B64;&#x4E0D;&#x540C;&#xFF0C;&#x4EE5;&#x81F4;&#x4E8E;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4EE5;&#x4E00;&#x79CD;&#x5168;&#x65B0;&#x7684;&#x601D;&#x7EF4;&#x65B9;&#x5F0F;&#x6765; &#x8861;&#x91CF;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch09.html" class="navigation navigation-prev " aria-label="Previous page: 第九章区块链">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch11.html" class="navigation navigation-next " aria-label="Next page: 第十一章比特币安全">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十章挖矿和共识","level":"1.16","depth":1,"next":{"title":"第十一章比特币安全","level":"1.17","depth":1,"path":"ch11.md","ref":"ch11.md","articles":[]},"previous":{"title":"第九章区块链","level":"1.15","depth":1,"path":"ch09.md","ref":"ch09.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch10.md","mtime":"2018-12-14T06:26:05.582Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

