
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十一章比特币安全 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch12.html" />
    
    
    <link rel="prev" href="ch10.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十一章比特币安全</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h2 id="111-&#x5B89;&#x5168;&#x51C6;&#x5219;">11.1 &#x5B89;&#x5168;&#x51C6;&#x5219;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6838;&#x5FC3;&#x51C6;&#x5219;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#xFF0C;&#x8FD9;&#x4E00;&#x70B9;&#x5BF9;&#x5B89;&#x5168;&#x6027;&#x5177;&#x6709;&#x91CD;&#x8981;&#x610F;&#x4E49;&#x3002;&#x5728;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6A21;&#x5F0F;&#x4E0B;&#xFF0C;&#x4F8B;&#x5982;&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x6216;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#xFF0C;&#x9700;&#x8981;&#x4F9D;&#x8D56;&#x4E8E;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#x548C;&#x5BA1;&#x67E5;&#x5236;&#x5EA6;&#x5C06;&#x4E0D;&#x826F;&#x884C;&#x4E3A;&#x8005;&#x62D2;&#x4E4B;&#x95E8;&#x5916;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x8FD9;&#x6837;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7CFB;&#x7EDF;&#x5219;&#x5C06;&#x8D23;&#x4EFB;&#x548C;&#x63A7;&#x5236;&#x6743;&#x90FD;&#x79FB;&#x4EA4;&#x7ED9;&#x4E86;&#x7528;&#x6237;&#x3002;&#x7531;&#x4E8E;&#x7F51;&#x7EDC;&#x7684;&#x5B89;&#x5168;&#x6027;&#x662F;&#x57FA;&#x4E8E;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x800C;&#x975E;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5BF9;&#x6240;&#x6709;&#x4EBA;&#x5F00;&#x653E;&#xFF0C;&#x4E5F;&#x65E0;&#x9700;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x4F20;&#x8F93;&#x8FDB;&#x884C;&#x52A0;&#x5BC6;&#x3002;</p>
<p>&#x5728;&#x4E00;&#x4E2A;&#x4F20;&#x7EDF;&#x7684;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x4E2D;&#xFF0C;&#x4F8B;&#x5982;&#x4FE1;&#x7528;&#x5361;&#x7CFB;&#x7EDF;&#xFF0C;&#x652F;&#x4ED8;&#x662F;&#x7EC8;&#x7AEF;&#x5F00;&#x653E;&#x5F0F;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x5305;&#x542B;&#x4E86;&#x7528;&#x6237;&#x7684;&#x4E2A;&#x4EBA;&#x6807;&#x8BC6;&#xFF08;&#x4FE1;&#x7528;&#x5361;&#x53F7;&#xFF09;&#x3002;&#x5728;&#x521D;&#x6B21;&#x652F;&#x4ED8;&#x540E;&#xFF0C;&#x4EFB;&#x4F55;&#x80FD;&#x83B7;&#x5F97;&#x8BE5;&#x6807;&#x8BC6;&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x4ECE;&#x6240;&#x6709;&#x8005;&#x90A3;&#x91CC;&#x53CD;&#x590D;&#x201C;&#x63D0;&#x53D6;&#x201D;&#x8D44;&#x91D1;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8BE5;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x5FC5;&#x987B;&#x91C7;&#x53D6;&#x7AEF;&#x5BF9;&#x7AEF;&#x52A0;&#x5BC6;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x7A83;&#x542C;&#x8005;&#x6216;&#x4E2D;&#x95F4;&#x4EBA;&#x53EF;&#x4EE5;&#x5728;&#x8D44;&#x91D1;&#x6D41;&#x901A;&#x6216;&#x5B58;&#x50A8;&#x8FC7;&#x7A0B;&#x4E2D;&#x5C06;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x622A;&#x83B7;&#x3002;&#x5982;&#x679C;&#x574F;&#x4EBA;&#x83B7;&#x5F97;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x63A7;&#x5236;&#x6743;&#xFF0C;&#x4ED6;&#x5C06;&#x80FD;&#x7834;&#x83B7;&#x5F53;&#x524D;&#x7684;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x652F;&#x4ED8;&#x4EE4;&#x724C;&#xFF0C;&#x4ED6;&#x8FD8;&#x53EF;&#x4EE5;&#x968F;&#x610F;&#x52A8;&#x7528;&#x8FD9;&#x7B14;&#x8D44;&#x91D1;&#x3002;&#x66F4;&#x7CDF;&#x7684;&#x662F;&#xFF0C;&#x5F53;&#x5BA2;&#x6237;&#x6570;&#x636E;&#x88AB;&#x6CC4;&#x9732;&#x65F6;&#xFF0C;&#x987E;&#x5BA2;&#x7684;&#x4E2A;&#x4EBA;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x5C06;&#x88AB;&#x76D7;&#x7A83;&#x8005;&#x4EEC;&#x4E00;&#x89C8;&#x65E0;&#x4F59;&#x3002;&#x5BA2;&#x6237;&#x8FD9;&#x65F6;&#x5FC5;&#x987B;&#x7ACB;&#x5373;&#x91C7;&#x53D6;&#x63AA;&#x65BD;&#xFF0C;&#x4EE5;&#x9632;&#x5931;&#x7A83;&#x5E10;&#x6237;&#x88AB;&#x76D7;&#x7A83;&#x8005;&#x7528;&#x4E8E;&#x6B3A;&#x8BC8;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x5219;&#x622A;&#x7136;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x7B14;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x53EA;&#x6388;&#x6743;&#x5411;&#x6307;&#x5B9A;&#x63A5;&#x6536;&#x65B9;&#x53D1;&#x9001;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x6570;&#x989D;&#xFF0C;&#x5E76;&#x4E14;&#x4E0D;&#x80FD;&#x88AB;&#x4FEE;&#x6539;&#x6216;&#x4F2A;&#x9020;&#x3002;&#x5B83;&#x4E0D;&#x4F1A;&#x900F;&#x9732;&#x4EFB;&#x4F55;&#x4E2A;&#x4EBA;&#x4FE1;&#x606F;&#xFF0C;&#x4F8B;&#x5982;&#x5F53;&#x4E8B;&#x4EBA;&#x7684;&#x8EAB;&#x4EFD;&#xFF0C;&#x4E5F;&#x4E0D;&#x80FD;&#x7528;&#x4E8E;&#x6743;&#x9650;&#x5916;&#x7684;&#x652F;&#x4ED8;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x652F;&#x4ED8;&#x7F51;&#x7EDC;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x52A0;&#x5BC6;&#x6216;&#x9632;&#x7A83;&#x542C;&#x4FDD;&#x62A4;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x516C;&#x5F00;&#x7684;&#x7F51;&#x7EDC;&#x4E0A;&#x5E7F;&#x64AD;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x4F8B;&#x5982;&#x5728;&#x4E0D;&#x5B89;&#x5168;&#x7684;WIFI&#x6216;&#x84DD;&#x7259;&#x7F51;&#x7EDC;&#x4E0A;&#x516C;&#x5F00;&#x4F20;&#x64AD;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8FD9;&#x5BF9;&#x5B89;&#x5168;&#x6027;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5F71;&#x54CD;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x5F88;&#x5927;&#x7A0B;&#x5EA6;&#x4E0A;&#x5C06;&#x6743;&#x529B;&#x79FB;&#x4EA4;&#x5230;&#x7528;&#x6237;&#x624B;&#x4E0A;&#xFF0C;&#x968F;&#x4E4B;&#x800C;&#x6765;&#x7684;&#x662F;&#x7528;&#x6237;&#x4EEC;&#x4FDD;&#x7BA1;&#x597D;&#x5BC6;&#x94A5;&#x7684;&#x8D23;&#x4EFB;&#x3002;&#x8FD9;&#x5BF9;&#x4E8E;&#x5927;&#x591A;&#x6570; &#x7528;&#x6237;&#x6765;&#x8BF4;&#x5E76;&#x975E;&#x4E00;&#x4EF6;&#x6613;&#x4E8B;&#xFF0C;&#x7279;&#x522B;&#x662F;&#x5728;&#x50CF;&#x667A;&#x80FD;&#x624B;&#x673A;&#x6216;&#x7B14;&#x8BB0;&#x672C;&#x7535;&#x8111;&#x8FD9;&#x79CD;&#x80FD;&#x80FD;&#x65F6;&#x523B;&#x8054;&#x7F51;&#x7684;&#x901A;&#x7528;&#x8BBE;&#x5907;&#x4E0A;&#x3002;&#x867D;&#x7136;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x6A21; &#x578B;&#x907F;&#x514D;&#x4E86;&#x5E38;&#x89C1;&#x7684;&#x4FE1;&#x7528;&#x5361;&#x76D7;&#x7528;&#x7B49;&#x60C5;&#x51B5;&#xFF0C;&#x4F46;&#x5F88;&#x591A;&#x7528;&#x6237;&#x7531;&#x4E8E;&#x65E0;&#x6CD5;&#x4FDD;&#x7BA1;&#x597D;&#x5BC6;&#x94A5;&#x4ECE;&#x800C;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x3002;</p>
<h3 id="1111-&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x5F00;&#x53D1;">11.1.1 &#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x5B89;&#x5168;&#x5F00;&#x53D1;</h3>
<p>&#x5BF9;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x53D1;&#x8005;&#x800C;&#x8A00;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x539F;&#x5219;&#x3002;&#x5927;&#x591A;&#x6570;&#x5F00;&#x53D1;&#x8005;&#x5BF9;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x5F88;&#x719F;&#x6089;&#xFF0C;&#x5E76;&#x53EF;&#x80FD;&#x8BD5;&#x56FE;&#x5C06;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6A21;&#x578B;&#x8FD0;&#x7528;&#x5230;&#x501F;&#x9274;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5E94;&#x7528;&#x4E2D;&#x53BB;&#xFF0C;&#x8FD9;&#x5C06;&#x7ED9;&#x6BD4;&#x7279;&#x5E01;&#x5E26;&#x6765;&#x706D;&#x9876;&#x4E4B;&#x707E;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x6027;&#x4F9D;&#x8D56;&#x4E8E;&#x5BC6;&#x94A5;&#x7684;&#x5206;&#x6563;&#x6027;&#x63A7;&#x5236;&#xFF0C;&#x5E76;&#x4E14;&#x9700;&#x8981;&#x77FF;&#x5DE5;&#x4EEC;&#x5404;&#x81EA;&#x72EC;&#x7ACB;&#x5730;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x9A8C;&#x8BC1;&#x3002;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5229;&#x7528;&#x597D;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x786E;&#x4FDD;&#x81EA;&#x5DF1;&#x5904;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x91CC;&#x3002;&#x7B80;&#x800C;&#x8A00;&#x4E4B;&#xFF0C;&#x4E0D;&#x8981;&#x5C06;&#x7528;&#x6237;&#x7684;&#x5BC6;&#x94A5;&#x63A7;&#x5236;&#x6743;&#x62FF;&#x8D70;&#xFF0C;&#x4E0D;&#x8981;&#x63A5;&#x53D7;&#x975E;&#x533A;&#x5757;&#x94FE;&#x4EA4;&#x6613;&#x4FE1;&#x606F;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x8BB8;&#x591A;&#x65E9;&#x671F;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x5C06;&#x6240;&#x6709;&#x7528;&#x6237;&#x7684;&#x8D44;&#x91D1;&#x96C6;&#x4E2D;&#x5728;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x7740;&#x79C1;&#x94A5;&#x7684;&#x201C;&#x70ED;&#x94B1;&#x5305;&#x201D;&#x91CC;&#xFF0C;&#x5E76;&#x5B58;&#x653E;&#x5728;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x593A;&#x53D6;&#x4E86;&#x7528;&#x6237;&#x7684;&#x638C;&#x63A7;&#x6743;&#xFF0C;&#x5E76;&#x5C06;&#x5BC6;&#x94A5;&#x96C6;&#x4E2D;&#x5230;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x91CC;&#x3002;&#x5F88;&#x591A;&#x8FD9;&#x6837;&#x7684;&#x7CFB;&#x7EDF;&#x90FD;&#x88AB;&#x9ED1;&#x5BA2;&#x653B;&#x7834;&#x4E86;&#xFF0C;&#x5E76;&#x7ED9;&#x5BA2;&#x6237;&#x5E26;&#x6765;&#x707E;&#x96BE;&#x6027;&#x540E;&#x679C;&#x3002; &#x53E6;&#x4E00;&#x4E2A;&#x5E38;&#x89C1;&#x7684;&#x9519;&#x8BEF;&#x662F;&#x63A5;&#x53D7;&#x533A;&#x5757;&#x94FE;&#x79BB;&#x7EBF;&#x4EA4;&#x6613;&#xFF0C;&#x5984;&#x56FE;&#x51CF;&#x5C11;&#x4EA4;&#x6613;&#x8D39;&#x6216;&#x52A0;&#x901F;&#x4EA4;&#x6613;&#x5904;&#x7406;&#x901F;&#x5EA6;&#x3002;&#x4E00;&#x4E2A;&#x201C;&#x533A;&#x5757;&#x94FE;&#x79BB;&#x7EBF;&#x4EA4;&#x6613;&#x201D;&#x7CFB;&#x7EDF;&#x5C06;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x8BB0;&#x5F55;&#x5728;&#x4E00;&#x4E2A;&#x5185;&#x90E8;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x8D26;&#x672C;&#x4E0A;&#xFF0C;&#x7136;&#x540E;&#x5076;&#x5C14;&#x5C06;&#x5B83;&#x4EEC;&#x540C;&#x6B65;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#xFF0C;&#x518D;&#x4E00;&#x6B21;&#xFF0C;&#x7528;&#x4E13;&#x5236;&#x548C;&#x96C6;&#x4E2D;&#x7684;&#x65B9;&#x5F0F;&#x53D6; &#x4EE3;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x6A21;&#x578B;&#x3002;&#x5F53;&#x6570;&#x636E;&#x5904;&#x4E8E;&#x79BB;&#x7EBF;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x4FDD;&#x62A4;&#x4E0D;&#x5F53;&#x7684;&#x4E2D;&#x5FC3;&#x5316;&#x8D26;&#x672C;&#x91CC;&#x7684;&#x8D44;&#x91D1;&#x53EF;&#x80FD;&#x4F1A;&#x4E0D;&#x77E5;&#x4E0D;&#x89C9;&#x88AB; &#x4F2A;&#x9020;&#x3001;&#x88AB;&#x632A;&#x7528;&#x3001;&#x88AB;&#x6D88;&#x8017;&#x3002;</p>
<p>&#x9664;&#x975E;&#x4F60;&#x662F;&#x51C6;&#x5907;&#x5927;&#x529B;&#x6295;&#x8D44;&#x8FD0;&#x8425;&#x5B89;&#x5168;&#xFF0C;&#x53E0;&#x52A0;&#x591A;&#x5C42;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x6216;&#xFF08;&#x50CF;&#x4F20;&#x7EDF;&#x7684;&#x94F6;&#x884C;&#x90A3;&#x6837;&#xFF09;&#x52A0;&#x5F3A;&#x5BA1;&#x8BA1;&#xFF0C;&#x5426;&#x5219;&#x5728;&#x5C06;&#x8D44;&#x91D1;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x573A;&#x666F;&#x4E2D;&#x62BD;&#x79BB;&#x51FA;&#x6765;&#x4E4B;&#x524D;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x614E;&#x91CD;&#x8003;&#x8651;&#x4E00;&#x756A;&#x3002;&#x5373;&#x4F7F;&#x4F60;&#x6709;&#x8DB3;&#x591F;&#x7684;&#x8D44;&#x91D1;&#x548C;&#x7EAA;&#x5F8B;&#x53BB;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x5B89;&#x5168;&#x6A21;&#x578B;&#xFF0C;&#x8FD9;&#x6837;&#x7684;&#x8BBE;&#x8BA1;&#x4E5F;&#x4EC5;&#x4EC5;&#x662F;&#x590D;&#x5236;&#x4E86;&#x4E00;&#x4E2A;&#x8106;&#x5F31;&#x4E0D;&#x582A;&#xFF0C;&#x6DF1;&#x53D7;&#x8D26;&#x6237;&#x76D7;&#x7A83;&#x5A01;&#x80C1;&#x3001;&#x8D2A;&#x6C61;&#x548C;&#x632A;&#x7528;&#x516C;&#x6B3E;&#x56F0;&#x6270;&#x7684;&#x4F20;&#x7EDF;&#x91D1;&#x878D;&#x7F51;&#x7EDC;&#x800C;&#x5DF2;&#x3002;&#x8981;&#x60F3;&#x5145;&#x5206;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7279;&#x6709;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B89;&#x5168;&#x6A21;&#x578B;&#xFF0C;&#x4F60;&#x5FC5;&#x987B;&#x907F;&#x514D;&#x4E2D;&#x5FC3;&#x5316;&#x67B6;&#x6784;&#x7684;&#x5E38;&#x89C1;&#x8BF1;&#x60D1;&#xFF0C;&#x56E0;&#x5B83;&#x6700;&#x7EC8;&#x5C06;&#x6467;&#x6BC1;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;</p>
<h3 id="1112-&#x4FE1;&#x4EFB;&#x6839;">11.1.2 &#x4FE1;&#x4EFB;&#x6839;</h3>
<p>&#x4F20;&#x7EDF;&#x7684;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x57FA;&#x4E8E;&#x4E00;&#x4E2A;&#x79F0;&#x4E3A;&#x4FE1;&#x4EFB;&#x6839;&#xFF08;ROOT OF TRUST&#xFF09;&#x7684;&#x6982;&#x5FF5;&#xFF0C;&#x5B83;&#x6307;&#x7684;&#x603B;&#x4F53;&#x7CFB;&#x7EDF;&#x6216;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x4E00;&#x4E2A;&#x53EF;&#x4FE1;&#x8D56;&#x7684;&#x5B89;&#x5168;&#x6838;&#x5FC3;&#x3002;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x50CF;&#x4E00;&#x5708;&#x540C;&#x5FC3;&#x5706;&#x4E00;&#x6837;&#x56F4;&#x7ED5;&#x7740;&#x4FE1;&#x4EFB;&#x6839;&#x6E90;&#x6765;&#x8FDB;&#x884C;&#x5F00;&#x53D1;&#xFF0C;&#x50CF;&#x5C42;&#x5C42;&#x5305;&#x88F9;&#x7684;&#x6D0B;&#x8471;&#x4E00;&#x6837;&#xFF0C;&#x4FE1;&#x4EFB;&#x4ECE;&#x5185;&#x81F3;&#x5916;&#x4F9D;&#x6B21;&#x5EF6;&#x4F38;&#x3002;&#x6BCF;&#x4E00;&#x5C42;&#x90FD;&#x6784;&#x5EFA;&#x4E8E;&#x66F4;&#x53EF;&#x4FE1;&#x7684;&#x5185;&#x5C42;&#x4E4B;&#x4E0A;&#xFF0C;&#x901A;&#x8FC7;&#x8BBF;&#x95EE;&#x63A7;&#x5236;&#xFF0C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#xFF0C;&#x52A0;&#x5BC6;&#x548C;&#x5176;&#x4ED6;&#x5B89;&#x5168;&#x65B9;&#x5F0F;&#x786E;&#x4FDD;&#x53EF;&#x4FE1;&#x3002;&#x968F;&#x7740;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5B83;&#x4EEC;&#x66F4;&#x53EF;&#x80FD;&#x51FA;&#x73B0;&#x95EE;&#x9898;&#xFF0C;&#x5B89;&#x5168;&#x66F4;&#x5BB9;&#x6613;&#x53D7;&#x5230;&#x5A01;&#x80C1;&#x3002;&#x5176;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x53D8;&#x5F97;&#x8D8A;&#x590D;&#x6742;&#xFF0C;&#x5C31;&#x8D8A;&#x96BE;&#x7EF4;&#x62A4;&#x5B89;&#x5168;&#x6027;&#x3002;&#x4FE1;&#x4EFB;&#x6839;&#x7684;&#x6982;&#x5FF5;&#x786E;&#x4FDD;&#x7EDD;&#x5927;&#x591A;&#x6570;&#x7684;&#x4FE1;&#x4EFB;&#x88AB;&#x7F6E;&#x4E8E;&#x4E00;&#x4E2A;&#x4E0D;&#x662F;&#x8FC7;&#x4E8E;&#x590D;&#x6742;&#x7CFB;&#x7EDF;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x6B64;&#x8BE5;&#x7CFB;&#x7EDF;&#x7684;&#x8FD9;&#x90E8;&#x5206;&#x4E5F;&#x76F8;&#x5BF9;&#x575A;&#x56FA;&#xFF0C;&#x800C;&#x66F4;&#x590D;&#x6742;&#x7684;&#x8F6F;&#x4EF6;&#x5219;&#x5728;&#x5B83;&#x4E4B;&#x4E0A;&#x6784;&#x5EFA;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x968F;&#x7740;&#x89C4;&#x6A21;&#x6269;&#x5927;&#x800C;&#x4E0D;&#x65AD;&#x91CD;&#x590D;&#x51FA;&#x73B0;&#xFF0C;&#x9996;&#x5148;&#x4FE1;&#x4EFB;&#x6839;&#x5EFA;&#x7ACB;&#x4E8E;&#x5355;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;&#x786C;&#x4EF6;&#x5185;&#xFF0C;&#x7136;&#x540E;&#x5C06;&#x8BE5;&#x4FE1;&#x4EFB;&#x6839;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x6269;&#x5C55;&#x5230;&#x66F4;&#x9AD8;&#x7EA7;&#x522B;&#x7684;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#xFF0C;&#x6700;&#x540E;&#x9010;&#x6B21;&#x6269;&#x6563;&#x5230;&#x5708;&#x5185;&#x591A;&#x53F0;&#x670D;&#x52A1;&#x5668;&#x4E0A;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x4E0E;&#x8FD9;&#x4E0D;&#x540C;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x91CC;&#xFF0C;&#x5171;&#x8BC6;&#x7CFB;&#x7EDF;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x53EF;&#x4FE1;&#x7684;&#x5B8C;&#x5168;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x516C;&#x5F00;&#x8D26;&#x672C;&#xFF0C;&#x4E00;&#x4E2A;&#x6B63;&#x786E;&#x9A8C;&#x8BC1;&#x8FC7;&#x7684;&#x533A;&#x5757;&#x4F7F;&#x7528;&#x521B;&#x4E16;&#x533A;&#x5757; &#x4F5C;&#x4E3A;&#x4FE1;&#x4EFB;&#x6839;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x6761;&#x81F3;&#x5F53;&#x524D;&#x533A;&#x5757;&#x7684;&#x53EF;&#x4FE1;&#x4EFB;&#x94FE;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x533A;&#x5757;&#x94FE;&#x4F5C;&#x4E3A;&#x5B83;&#x4EEC;&#x7684;&#x4FE1;&#x4EFB;&#x6839;&#x3002;&#x5728;&#x8BBE;&#x8BA1;&#x4E00;&#x4E2A;&#x591A;&#x7CFB;&#x7EDF;&#x670D;&#x52A1;&#x673A;&#x5236;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5E94;&#x7528;&#x65F6;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x4ED4;&#x7EC6;&#x786E;&#x8BA4;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x5BF9;&#x5B83;&#x7684;&#x4FE1;&#x4EFB;&#x80FD;&#x6709;&#x636E;&#x53EF;&#x4F9D;&#x3002;&#x6700;&#x7EC8;&#xFF0C; &#x552F;&#x4E00;&#x53EF;&#x786E;&#x4FE1;&#x65E0;&#x7591;&#x7684;&#x662F;&#x4E00;&#x6761;&#x5B8C;&#x5168;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x94FE;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6216;&#x660E;&#x6216;&#x6697;&#x5730;&#x4FE1;&#x8D56;&#x4E8E;&#x533A;&#x5757;&#x94FE;&#x4EE5;&#x5916;&#x7684;&#x4E1C;&#x897F;&#xFF0C;&#x5C31;&#x8BE5;&#x5F15;&#x8D77;&#x91CD;&#x89C6;&#xFF0C; &#x56E0;&#x4E3A;&#x5B83;&#x53EF;&#x80FD;&#x4F1A;&#x5F15;&#x5165;&#x6F0F;&#x6D1E;&#x3002;&#x4E00;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x65B9;&#x6CD5;&#x8BC4;&#x4F30;&#x4F60;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#xFF1A;&#x5355;&#x72EC;&#x8003;&#x91CF;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x8BBE;&#x60F3;&#x8BE5;&#x7EC4;&#x4EF6;&#x88AB;&#x5B8C;&#x5168;&#x653B;&#x7834;&#x5E76;&#x88AB;&#x574F;&#x4EBA;&#x638C;&#x63A7;&#x7684;&#x573A;&#x666F;&#x3002;&#x4F9D;&#x6B21;&#x53D6;&#x51FA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6BCF;&#x4E2A;&#x7EC4;&#x4EF6;&#xFF0C;&#x5E76;&#x8BC4;&#x4F30;&#x5B83;&#x88AB;&#x653B;&#x7834;&#x65F6;&#x5BF9;&#x6574;&#x4F53;&#x5B89;&#x5168;&#x7684;&#x5F71;&#x54CD;&#x3002;&#x5982;&#x679C;&#x4F60;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x5B89;&#x5168;&#x6027;&#x5728;&#x8BE5;&#x7EC4;&#x4EF6;&#x6CA6;&#x9677;&#x540E;&#x5927;&#x6253;&#x6298;&#x6263;&#xFF0C;&#x90A3;&#x5C31;&#x8BF4;&#x660E;&#x4F60;&#x5DF2;&#x7ECF;&#x5BF9;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x8FC7;&#x5EA6;&#x4FE1;&#x4EFB;&#x4E86;&#x3002;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x6F0F;&#x6D1E;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5E94;&#x8BE5;&#x53EA;&#x53D7;&#x9650;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5171;&#x8BC6;&#x673A;&#x5236;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5176;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x7684;&#x4FE1;&#x4EFB;&#x6E90;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x6700;&#x5E95;&#x5C42;&#x7684;&#x90E8;&#x5206;&#x3002; </p>
<p>&#x65E0;&#x6570;&#x4E2A;&#x9ED1;&#x5BA2;&#x653B;&#x51FB;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x7684;&#x4F8B;&#x5B50;&#x90FD;&#x662F;&#x56E0;&#x4E3A;&#x8F7B;&#x89C6;&#x4E86;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4ED6;&#x4EEC;&#x7684;&#x5B89;&#x5168;&#x4F53;&#x7CFB;&#x548C;&#x8BBE;&#x8BA1;&#x751A;&#x81F3;&#x65E0;&#x6CD5;&#x901A;&#x8FC7;&#x57FA;&#x672C;&#x7684;&#x5BA1;&#x67E5;&#x3002;&#x8FD9;&#x79CD;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x5C06;&#x4FE1;&#x4EFB;&#x7F6E;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E4B;&#x5916;&#x7684;&#x8BF8;&#x591A;&#x7EC4;&#x4EF6;&#x4E4B;&#x4E0A;&#xFF0C;&#x4F8B;&#x5982;&#x70ED;&#x94B1;&#x5305;&#xFF0C;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8D26;&#x672C;&#x6570;&#x636E;&#x5E93;&#xFF0C;&#x7B80;&#x6613;&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4EE5;&#x53CA;&#x8BB8;&#x591A;&#x7C7B;&#x4F3C;&#x7684;&#x65B9;&#x6848;&#x3002;</p>
<h2 id="112-&#x7528;&#x6237;&#x6700;&#x4F73;&#x5B89;&#x5168;&#x5B9E;&#x8DF5;">11.2 &#x7528;&#x6237;&#x6700;&#x4F73;&#x5B89;&#x5168;&#x5B9E;&#x8DF5;</h2>
<p>&#x4EBA;&#x7C7B;&#x4F7F;&#x7528;&#x7269;&#x7406;&#x7684;&#x5B89;&#x5168;&#x63A7;&#x5236;&#x5DF2;&#x7ECF;&#x6709;&#x6570;&#x5343;&#x5E74;&#x4E4B;&#x4E45;&#x3002;&#x76F8;&#x6BD4;&#x4E4B;&#x4E0B;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x6570;&#x5B57;&#x5316;&#x5B89;&#x5168;&#x7ECF;&#x9A8C;&#x7684;&#x5E74;&#x7EAA;&#x8FD8;&#x4E0D;&#x6EE1;50&#x5C81;&#x3002;&#x73B0;&#x4EE3;&#x901A;&#x7528;&#x7684;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x5E76;&#x4E0D;&#x662F;&#x5341;&#x5206;&#x5B89;&#x5168;&#xFF0C;&#x4EA6;&#x4E0D;&#x7279;&#x522B;&#x9002;&#x5408;&#x7528;&#x6765;&#x5B58;&#x50A8;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x3002;&#x6211;&#x4EEC;&#x7684;&#x7535;&#x8111;&#x901A;&#x8FC7;&#x4E00;&#x76F4;&#x8FDE;&#x63A5;&#x7684;&#x4E92;&#x8054;&#x7F51;&#x957F;&#x65F6;&#x95F4;&#x66B4;&#x9732;&#x5728;&#x5916;&#xFF0C;&#x5B83;&#x4EEC;&#x8FD0;&#x884C;&#x7740;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7B2C;&#x4E09;&#x65B9;&#x8F6F;&#x4EF6;&#x7EC4;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F6F;&#x4EF6;&#x5F80;&#x5F80;&#x53EF;&#x4EE5;&#x4E0D;&#x53D7;&#x7EA6;&#x675F;&#x5730;&#x8BBF;&#x95EE;&#x7528;&#x6237;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x4F60;&#x7535;&#x8111;&#x4E0A;&#x5B89;&#x88C5;&#x7684;&#x4F17;&#x591A;&#x8F6F;&#x4EF6;&#x53EA;&#x8981;&#x6709;&#x4E00;&#x4E2A;&#x6076;&#x610F;&#x8F6F;&#x4EF6;&#xFF0C;&#x5C31;&#x4F1A;&#x5A01;&#x80C1;&#x5230;&#x4F60;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x53EF;&#x7A83;&#x53D6;&#x4F60;&#x94B1;&#x5305;&#x91CC;&#x7684;&#x6240;&#x6709;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x60F3;&#x8981;&#x675C;&#x7EDD;&#x75C5;&#x6BD2;&#x548C;&#x6728;&#x9A6C;&#x5BF9;&#x7535;&#x8111;&#x7684;&#x5A01;&#x80C1;&#xFF0C;&#x7528;&#x6237;&#x8981;&#x8FBE;&#x5230;&#x4E00;&#x5B9A;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7EF4;&#x62A4;&#x6C34;&#x5E73;&#xFF0C;&#x53EA;&#x6709;&#x5C0F;&#x90E8;&#x5206;&#x4EBA;&#x80FD;&#x505A;&#x5230;&#x3002;</p>
<p>&#x5C3D;&#x7BA1;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x7ECF;&#x8FC7;&#x4E86;&#x6570;&#x5341;&#x5E74;&#x7684;&#x7814;&#x7A76;&#x548C;&#x53D1;&#x5C55;&#xFF0C;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x5728;&#x7EF5;&#x5EF6;&#x4E0D;&#x7EDD;&#x7684;&#x653B;&#x52BF;&#x4E0B;&#x8FD8;&#x662F;&#x5341;&#x5206;&#x8106;&#x5F31;&#x3002;&#x7EB5;&#x4F7F;&#x662F;&#x50CF;&#x91D1;&#x878D;&#x670D;&#x52A1;&#x516C;&#x53F8;&#xFF0C;&#x60C5;&#x62A5;&#x673A;&#x6784;&#x6216;&#x56FD;&#x9632;&#x627F;&#x5305;&#x5546;&#x8FD9;&#x6837;&#x62E5;&#x6709;&#x9AD8;&#x5EA6;&#x9632;&#x62A4;&#x548C;&#x9650;&#x5236;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E5F;&#x7ECF;&#x5E38;&#x4F1A;&#x88AB;&#x653B;&#x7834;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x521B;&#x9020;&#x4E86;&#x5177;&#x6709;&#x5185;&#x5728;&#x4EF7;&#x503C;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x7A83;&#x53D6;&#xFF0C;&#x5E76;&#x7ACB;&#x5373;&#x8F6C;&#x79FB;&#x7ED9;&#x4ED6;&#x4EBA;&#x800C;&#x65E0;&#x6CD5;&#x64A4;&#x56DE;&#x3002;&#x8FD9;&#x8BA9;&#x9ED1;&#x5BA2;&#x6709;&#x4E86;&#x5F3A;&#x70C8;&#x7684;&#x4F5C;&#x6848;&#x52A8;&#x673A;&#x3002;&#x81F3;&#x4ECA;&#x4E3A;&#x6B62;&#xFF0C;&#x9ED1;&#x5BA2;&#x90FD;&#x4E0D;&#x5F97;&#x4E0D;&#x5728;&#x5957;&#x73B0;&#x540E;&#x66F4;&#x6362;&#x8EAB;&#x4EFD;&#x4FE1; &#x606F;&#x6216;&#x5E10;&#x6237;&#x53E3;&#x4EE4;&#xFF0C;&#x4F8B;&#x5982;&#x4FE1;&#x7528;&#x5361;&#x6216;&#x94F6;&#x884C;&#x8D26;&#x6237;&#x3002;&#x5C3D;&#x7BA1;&#x63A9;&#x9970;&#x548C;&#x6D17;&#x767D;&#x8FD9;&#x90E8;&#x5206;&#x8D22;&#x52A1;&#x4FE1;&#x606F;&#x7684;&#x96BE;&#x5EA6;&#x4E0D;&#x5C0F;&#xFF0C;&#x4F46;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x7684;&#x7A83;&#x8D3C;&#x4ECE;&#x4E8E;&#x6B64;&#x9053;&#x3002;&#x800C; &#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#x52A0;&#x5267;&#x4E86;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4E0D;&#x9700;&#x8981;&#x63A9;&#x9970;&#x6216;&#x6D17;&#x767D;&#xFF0C;&#x5B83;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x5177;&#x6709;&#x5185;&#x5728;&#x4EF7;&#x503C;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x3002;</p>
<p>&#x5E78;&#x8FD0;&#x7684;&#x662F;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x4E5F;&#x6709;&#x7740;&#x6FC0;&#x52B1;&#x673A;&#x5236;&#xFF0C;&#x4EE5;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5B89;&#x5168;&#x6027;&#x3002;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x8BA1;&#x7B97;&#x673A;&#x53D7;&#x5A01;&#x80C1;&#x7684;&#x98CE;&#x9669;&#x662F;&#x6A21;&#x7CCA;&#x7684;&#xFF0C;&#x95F4;&#x63A5;&#x7684;&#xFF0C;&#x800C;&#x6BD4;&#x7279;&#x5E01;&#x8BA9;&#x8FD9;&#x4E9B;&#x98CE;&#x9669;&#x53D8;&#x5F97;&#x660E;&#x786E;&#x6E05;&#x6670;&#x3002;&#x5728;&#x7535;&#x8111;&#x4E0A;&#x4FDD;&#x5B58;&#x6BD4;&#x7279;&#x5E01;&#x8BA9;&#x7528;&#x6237;&#x65F6;&#x523B;&#x6CE8;&#x610F;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x63D0;&#x9AD8;&#x8BA1;&#x7B97;&#x673A;&#x7684;&#x5B89;&#x5168;&#x6027;&#xFF0C;&#x7ED3;&#x679C;&#x4FBF;&#x662F;&#x8FD9;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x548C;&#x5176;&#x5B83;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x5F97;&#x4EE5;&#x4F20;&#x64AD;&#x548C;&#x6269;&#x6563;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x5728;&#x9ED1;&#x5BA2;&#x6280;&#x672F;&#x548C;&#x5B89;&#x5168;&#x89E3;&#x51B3;&#x65B9;&#x6848;&#x53CC;&#x65B9;&#x7684;&#x63D0;&#x5347;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x9ED1;&#x5BA2;&#x73B0;&#x5728;&#x6709;&#x7740;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x8BF1;&#x4EBA;&#x7684;&#x76EE;&#x6807;&#xFF0C;&#x800C;&#x7528;&#x6237;&#x4E5F;&#x6709;&#x660E;&#x786E;&#x7684;&#x6FC0;&#x52B1;&#x6027;&#x53BB;&#x4FDD;&#x536B;&#x81EA;&#x5DF1;&#x3002;</p>
<p>&#x5728;&#x8FC7;&#x53BB;&#x7684;&#x4E09;&#x5E74;&#x91CC;&#xFF0C;&#x968F;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x65AD;&#x88AB;&#x63A5;&#x7EB3;&#xFF0C;&#x4E00;&#x4E2A;&#x76F4;&#x63A5;&#x7684;&#x7ED3;&#x679C;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x770B;&#x5230;&#x4FE1;&#x606F;&#x5B89;&#x5168;&#x9886;&#x57DF;&#x53D6;&#x5F97;&#x4E86;&#x5DE8;&#x5927;&#x521B;&#x65B0;&#xFF0C;&#x4F8B;&#x5982;&#x786C;&#x4EF6;&#x52A0;&#x5BC6;&#xFF0C;&#x5BC6;&#x94A5;&#x5B58;&#x50A8;&#x548C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#xFF0C;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x6280;&#x672F;&#x548C;&#x6570;&#x5B57;&#x6258;&#x7BA1;&#x3002;&#x5728;&#x4E0B;&#x9762;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x5404;&#x79CD;&#x5B9E;&#x9645;&#x7528;&#x6237;&#x5B89;&#x5168;&#x4E2D;&#x7684;&#x5B9E;&#x8DF5;&#x7ECF;&#x9A8C;&#x3002;</p>
<h3 id="1121-&#x6BD4;&#x7279;&#x5E01;&#x7269;&#x7406;&#x5B58;&#x50A8;">11.2.1 &#x6BD4;&#x7279;&#x5E01;&#x7269;&#x7406;&#x5B58;&#x50A8;</h3>
<p>&#x76F8;&#x6BD4;&#x6570;&#x5B57;&#x4FE1;&#x606F;&#x7684;&#x5B89;&#x5168;&#xFF0C;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x5BF9;&#x7269;&#x7406;&#x5B89;&#x5168;&#x66F4;&#x52A0;&#x719F;&#x6089;&#xFF0C;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x6709;&#x6548;&#x4FDD;&#x62A4;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#xFF0C;&#x5C06;&#x5B83;&#x4EEC;&#x8F6C;&#x6362;&#x4E3A;&#x7269;&#x7406;&#x5F62;&#x5F0F;&#x3002; &#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#x4E0D;&#x8FC7;&#x662F;&#x4E32;&#x957F;&#x6570;&#x5B57;&#x800C;&#x5DF2;&#x3002;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x4EE5;&#x7269;&#x7406;&#x5F62;&#x5F0F;&#x5B58;&#x50A8;&#x8D77;&#x6765;&#xFF0C;&#x5982;&#x5370;&#x5728;&#x7EB8;&#x4E0A;&#x6216;&#x8680;&#x523B;&#x6210;&#x91D1;&#x5C5E;&#x786C;&#x5E01;&#x4E0A;&#x3002;&#x8FD9;&#x6837;&#x4FDD;&#x62A4;&#x5BC6;&#x94A5;&#x5C31;&#x53D8;&#x6210;&#x4E86;&#x7B80;&#x5355;&#x5730;&#x4FDD;&#x62A4;&#x5370;&#x7740;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#x7684;&#x7269;&#x7406;&#x5B9E;&#x4F53;&#x3002;&#x4E00;&#x7EC4;&#x6253;&#x5370;&#x5728;&#x7EB8;&#x4E0A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5BC6;&#x94A5;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x7EB8;&#x94B1;&#x5305;&#x201D;&#xFF0C;&#x6709;&#x8BB8;&#x591A;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x5B83;&#x4EEC;&#x7684;&#x514D;&#x8D39;&#x5DE5;&#x5177;&#x3002;&#x6211;&#x4E2A;&#x4EBA;&#x5C06;&#x5927;&#x90E8;&#x5206;&#xFF08;99&#xFF05;&#x4EE5;&#x4E0A;&#xFF09;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5B58;&#x50A8;&#x5728;&#x7EB8;&#x94B1;&#x5305;&#x4E0A;&#xFF0C;&#x5E76;&#x7528;BIP0038&#x52A0;&#x5BC6;&#xFF0C;&#x590D;&#x5236;&#x4E86;&#x591A;&#x4EFD;&#x5E76;&#x9501;&#x5728;&#x4FDD;&#x9669;&#x7BB1;&#x91CC;&#x3002;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x79BB;&#x7EBF;&#x4FDD;&#x5B58;&#x7684;&#x65B9;&#x6CD5;&#x88AB;&#x79F0;&#x4E3A;&#x51B7;&#x5B58;&#x50A8;&#xFF0C;&#x5B83;&#x662F;&#x6700;&#x6709;&#x6548;&#x7684;&#x5B89;&#x5168;&#x6280;&#x672F;&#x4E4B;&#x4E00;&#x3002;&#x51B7;&#x5B58;&#x50A8;&#x7CFB;&#x7EDF;&#x662F;&#x5728;&#x4E00;&#x4E2A;&#x79BB;&#x7EBF;&#x7CFB;&#x7EDF;&#xFF08;&#x4E00;&#x4E2A;&#x4ECE;&#x6765;&#x6CA1;&#x6709;&#x8FDE;&#x63A5;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x7684;&#x7CFB;&#x7EDF;&#xFF09;&#x4E0A;&#x751F;&#x6210;&#x5BC6;&#x94A5;&#xFF0C;&#x5E76;&#x79BB;&#x7EBF;&#x5B58;&#x50A8;&#x5230;&#x7EB8;&#x4E0A;&#x6216;&#x8005;U&#x76D8;&#x7B49;&#x7535;&#x5B50;&#x5A92;&#x4ECB;&#x4E0A;&#x3002;</p>
<h3 id="1122-&#x786C;&#x4EF6;&#x94B1;&#x5305;">11.2.2 &#x786C;&#x4EF6;&#x94B1;&#x5305;</h3>
<p>&#x4ECE;&#x957F;&#x8FDC;&#x6765;&#x770B;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x5B89;&#x5168;&#x5C06;&#x8D8A;&#x6765;&#x8D8A;&#x591A;&#x5730;&#x4EE5;&#x786C;&#x4EF6;&#x9632;&#x7BE1;&#x6539;&#x94B1;&#x5305;&#x7684;&#x5F62;&#x5F0F;&#x51FA;&#x73B0;&#x3002;&#x4E0E;&#x667A;&#x80FD;&#x624B;&#x673A;&#x6216;&#x53F0;&#x5F0F;&#x7535;&#x8111;&#x4E0D;&#x540C;&#xFF0C;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x53EA;&#x6709;&#x4E00;&#x4E2A;&#x76EE;&#x7684;&#xFF0C;&#x5B89;&#x5168;&#x5730;&#x5B58;&#x50A8;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E0D;&#x50CF;&#x5BB9;&#x6613;&#x53D7;&#x5BB3;&#x7684;&#x5E38;&#x7528;&#x8F6F;&#x4EF6;&#x90A3;&#x6837;&#xFF0C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x53EA;&#x63D0;&#x4F9B;&#x4E86;&#x6709;&#x9650;&#x7684;&#x63A5;&#x53E3;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x7ED9;&#x975E;&#x4E13;&#x4E1A;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x8FD1;&#x4E4E;&#x4E07;&#x65E0;&#x4E00;&#x5931;&#x7684;&#x5B89;&#x5168;&#x7B49;&#x7EA7;&#x3002;&#x6211;&#x9884;&#x671F;&#x5C06;&#x770B;&#x5230;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x6210;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x50A8;&#x5B58;&#x7684;&#x4E3B;&#x8981;&#x65B9;&#x5F0F;&#x3002;&#x8981;&#x60F3;&#x770B;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x7684;&#x5B9E;&#x4F8B;&#xFF0C;&#x8BF7;&#x67E5;&#x9605;<a href="HTTPS://TREZOR.IO/" target="_blank">TREZOR</a>&#x3002;</p>
<h3 id="1123-&#x5E73;&#x8861;&#x98CE;&#x9669;">11.2.3 &#x5E73;&#x8861;&#x98CE;&#x9669;</h3>
<p>&#x867D;&#x7136;&#x5927;&#x591A;&#x6570;&#x7528;&#x6237;&#x90FD;&#x975E;&#x5E38;&#x5173;&#x6CE8;&#x6BD4;&#x7279;&#x5E01;&#x9632;&#x76D7;&#xFF0C;&#x5176;&#x5B9E;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x7684;&#x98CE;&#x9669;&#x5B58;&#x5728;&#x3002;&#x6570;&#x636E;&#x6587;&#x4EF6;&#x4E22;&#x5931;&#x7684;&#x60C5;&#x51B5;&#x65F6;&#x6709;&#x53D1;&#x751F;&#x3002;&#x5982;&#x679C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6570;&#x636E;&#x4E5F;&#x5728;&#x5176;&#x4E2D;&#xFF0C;&#x635F;&#x5931;&#x5C06;&#x4F1A;&#x8BA9;&#x4EBA;&#x75DB;&#x82E6;&#x4E0D;&#x582A;&#x3002;&#x4E3A;&#x4E86;&#x4FDD;&#x62A4;&#x597D;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF0C;&#x7528;&#x6237;&#x5FC5;&#x987B;&#x975E;&#x5E38;&#x6CE8;&#x610F;&#x4E0D;&#x8981;&#x5251;&#x8D70;&#x504F;&#x950B;&#xFF0C;&#x8FD9;&#x6837;&#x4E0D;&#x81F3;&#x4E8E;&#x4F1A;&#x641E;&#x4E22;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5728;2011&#x5E74;7&#x6708;&#xFF0C;&#x4E00;&#x4E2A;&#x8457;&#x540D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8BA4;&#x77E5;&#x6559;&#x80B2;&#x9879;&#x76EE;&#x635F;&#x5931;&#x4E86;&#x8FD1;7,000&#x679A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x88AB;&#x76D7;&#x7A83;&#xFF0C;&#x5176;&#x4E3B;&#x4EBA;&#x66FE;&#x4E4B;&#x524D;&#x91C7;&#x53D6;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x590D;&#x6742;&#x7684;&#x64CD;&#x4F5C;&#x53BB;&#x52A0;&#x5BC6;&#x5907;&#x4EFD;&#x3002;&#x7ED3;&#x679C;&#x4ED6;&#x4EEC;&#x4E0D;&#x614E;&#x4E22;&#x5931;&#x4E86;&#x52A0;&#x5BC6;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x4F7F;&#x5F97;&#x5907;&#x4EFD;&#x53D8;&#x5F97;&#x6BEB;&#x65E0;&#x4EF7;&#x503C;&#xFF0C;&#x767D;&#x767D;&#x5931;&#x53BB;&#x4E86;&#x4E00;&#x5927;&#x7B14;&#x8D22;&#x5BCC;&#x3002;&#x5982;&#x679C;&#x4F60;&#x4FDD;&#x62A4;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x5F0F;&#x592A;&#x8FC7;&#x4E86;&#xFF0C;&#x8FD9;&#x597D;&#x6BD4;&#x4E8E;&#x628A;&#x94B1;&#x85CF;&#x5728;&#x6C99;&#x6F20;&#x91CC;&#xFF0C;&#x4F60;&#x53EF;&#x80FD;&#x4E0D;&#x80FD;&#x518D;&#x628A;&#x5B83;&#x627E;&#x56DE;&#x6765;&#x4E86;&#x3002;</p>
<h3 id="1124-&#x5206;&#x6563;&#x98CE;&#x9669;">11.2.4 &#x5206;&#x6563;&#x98CE;&#x9669;</h3>
<p>&#x4F60;&#x4F1A;&#x5C06;&#x4F60;&#x7684;&#x5168;&#x90E8;&#x5BB6;&#x5F53;&#x6362;&#x6210;&#x73B0;&#x91D1;&#x653E;&#x5728;&#x94B1;&#x5305;&#x91CC;&#x968F;&#x8EAB;&#x643A;&#x5E26;&#x4E48;&#xFF1F;&#x5927;&#x591A;&#x6570;&#x4EBA;&#x4F1A;&#x8BA4;&#x4E3A;&#x8FD9;&#x975E;&#x5E38;&#x4E0D;&#x660E;&#x667A;&#xFF0C;&#x4F46;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x7ECF;&#x5E38;&#x4F1A;&#x5C06;&#x6240;&#x6709;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x653E;&#x5728;&#x4E00;&#x4E2A;&#x94B1;&#x5305;&#x91CC;&#x3002;&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x5C06;&#x98CE;&#x9669;&#x5206;&#x6563;&#x5230;&#x4E0D;&#x540C;&#x7C7B;&#x578B;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x3002;&#x5BA1;&#x614E;&#x7684;&#x7528;&#x6237;&#x5E94;&#x8BE5;&#x53EA;&#x7559;&#x4E00;&#x5C0F;&#x90E8;&#x5206;&#xFF08;&#x6216;&#x8BB8;&#x4F4E;&#x4E8E;5%&#xFF09; &#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5728;&#x4E00;&#x4E2A;&#x5728;&#x7EBF;&#x7684;&#x6216;&#x624B;&#x673A;&#x94B1;&#x5305;&#xFF0C;&#x5C31;&#x50CF;&#x96F6;&#x7528;&#x94B1;&#x4E00;&#x6837;&#xFF0C;&#x5176;&#x4F59;&#x7684;&#x90E8;&#x5206;&#x5E94;&#x8BE5;&#x91C7;&#x7528;&#x4E0D;&#x540C;&#x5B58;&#x50A8;&#x673A;&#x5236;&#x5206;&#x6563;&#x5F00;&#x6765;&#xFF0C;&#x8BF8;&#x5982;&#x7535;&#x8111;&#x94B1;&#x5305;&#x548C;&#x79BB;&#x7EBF;&#xFF08;&#x51B7;&#x5B58;&#x50A8;&#xFF09;&#x94B1;&#x5305;&#x3002;</p>
<h3 id="1125-&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7BA1;&#x7406;">11.2.5 &#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7BA1;&#x7406;</h3>
<p>&#x5F53;&#x4E00;&#x4E2A;&#x516C;&#x53F8;&#x6216;&#x4E2A;&#x4EBA;&#x6301;&#x6709;&#x5927;&#x91CF;&#x6BD4;&#x7279;&#x5E01;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x91C7;&#x7528;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3002;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x9700;&#x8981;&#x591A;&#x4E2A;&#x7B7E;&#x540D;&#x624D;&#x80FD;&#x652F;&#x4ED8;&#xFF0C;&#x4ECE;&#x800C;&#x4FDD;&#x8BC1;&#x8D44;&#x91D1;&#x7684;&#x5B89;&#x5168;&#x3002;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x5BC6;&#x94A5;&#x5E94;&#x5B58;&#x50A8;&#x5728;&#x591A;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x5E76;&#x7531;&#x4E0D;&#x540C;&#x7684;&#x4EBA;&#x638C;&#x63A7;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x5728;&#x4F01;&#x4E1A;&#x73AF;&#x5883;&#x4E2D;&#xFF0C;&#x5BC6;&#x94A5;&#x5E94;&#x8BE5;&#x5206;&#x522B;&#x751F;&#x6210;&#x5E76;&#x7531;&#x82E5;&#x5E72;&#x516C;&#x53F8;&#x7BA1;&#x7406;&#x4EBA;&#x5458;&#x6301;&#x6709;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x4EBA;&#x53EF;&#x4EE5;&#x72EC;&#x81EA;&#x5360;&#x6709;&#x8D44;&#x91D1;&#x3002;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x5730;&#x5740;&#x4E5F;&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x5197;&#x4F59;&#xFF0C;&#x4F8B;&#x5982;&#x4E00;&#x4E2A;&#x4EBA;&#x6301;&#x6709;&#x591A;&#x4E2A;&#x5BC6;&#x94A5;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x4EEC;&#x5206;&#x522B;&#x5B58;&#x50A8;&#x5728;&#x4E0D;&#x540C;&#x7684;&#x5730;&#x65B9;&#x3002;</p>
<h3 id="1126-&#x5B58;&#x6D3B;&#x80FD;&#x529B;">11.2.6 &#x5B58;&#x6D3B;&#x80FD;&#x529B;</h3>
<p>&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x5374;&#x53C8;&#x5E38;&#x5E38;&#x88AB;&#x5FFD;&#x89C6;&#x7684;&#x5B89;&#x5168;&#x6027;&#x8003;&#x8651;&#x662F;&#x53EF;&#x7528;&#x6027;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5728;&#x5BC6;&#x94A5;&#x6301;&#x6709;&#x8005;&#x4E27;&#x5931;&#x5DE5;&#x4F5C;&#x80FD;&#x529B;&#x6216;&#x6B7B;&#x4EA1;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x7528;&#x6237;&#x88AB;&#x544A;&#x77E5;&#x5E94;&#x8BE5;&#x4F7F;&#x7528;&#x590D;&#x6742;&#x7684;&#x5BC6;&#x7801;&#xFF0C;&#x5E76;&#x4FDD;&#x8BC1;&#x4ED6;&#x4EEC;&#x7684;&#x5BC6;&#x94A5;&#x5B89;&#x5168;&#x4E14;&#x4E0D;&#x4E3A;&#x4ED6;&#x4EBA;&#x6240;&#x77E5;&#x3002;&#x4E0D;&#x5E78;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x79CD;&#x505A;&#x6CD5;&#x4F7F;&#x5F97;&#x5728;&#x7528;&#x6237;&#x65E0;&#x6CD5;&#x89E3;&#x9501;&#x65F6;&#xFF0C; &#x7528;&#x6237;&#x7684;&#x5BB6;&#x4EBA;&#x51E0;&#x4E4E;&#x65E0;&#x6CD5;&#x5C06;&#x8BE5;&#x8D22;&#x4EA7;&#x6062;&#x590D;&#x3002;&#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x7684;&#x5BB6;&#x4EBA;&#x53EF;&#x80FD;&#x5B8C;&#x5168;&#x4E0D;&#x77E5;&#x9053;&#x8FD9;&#x7B14;&#x6BD4;&#x7279;&#x5E01;&#x8D44;&#x91D1;&#x7684;&#x5B58;&#x5728;&#x3002; &#x5982;&#x679C;&#x4F60;&#x6709;&#x5F88;&#x591A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4F60;&#x5E94;&#x8BE5;&#x8003;&#x8651;&#x4E0E;&#x4E00;&#x4E2A;&#x503C;&#x5F97;&#x4FE1;&#x8D56;&#x7684;&#x4EB2;&#x5C5E;&#x6216;&#x5F8B;&#x5E08;&#x5206;&#x4EAB;&#x89E3;&#x5BC6;&#x7684;&#x7EC6;&#x8282;&#x3002;&#x53EF;&#x4EE5;&#x641E;&#x4E00;&#x4E2A;&#x66F4;&#x590D;&#x6742;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6062;&#x590D;&#x8BA1;&#x5212;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x8BBE;&#x7F6E;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#xFF0C;&#x505A;&#x597D;&#x9057;&#x4EA7;&#x89C4;&#x5212;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x4E13;&#x95E8;&#x7684;&#x201C;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x6267;&#x884C;&#x8005;&#x201D;&#x5F8B;&#x5E08;&#x5904;&#x7406;&#x540E;&#x4E8B;&#x3002;</p>
<h2 id="113-&#x603B;&#x7ED3;">11.3 &#x603B;&#x7ED3;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x4E00;&#x9879;&#x5168;&#x65B0;&#x7684;&#xFF0C;&#x524D;&#x6240;&#x672A;&#x6709;&#x7684;&#xFF0C;&#x590D;&#x6742;&#x7684;&#x6280;&#x672F;&#x3002;&#x968F;&#x7740;&#x65F6;&#x95F4;&#x7684;&#x63A8;&#x79FB;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5F00;&#x53D1;&#x51FA;&#x66F4;&#x597D;&#x7684;&#x5B89;&#x5168;&#x5DE5;&#x5177;&#xFF0C;&#x800C;&#x4E14;&#x66F4;&#x5BB9;&#x6613;&#x88AB;&#x975E;&#x4E13;&#x4E1A;&#x4EBA;&#x58EB;&#x4F7F;&#x7528;&#x3002;&#x800C;&#x73B0;&#x5728;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6237;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8BB8;&#x591A;&#x8FD9;&#x91CC;&#x6240;&#x8BA8;&#x8BBA;&#x7684;&#x6280;&#x5DE7;&#xFF0C;&#x4EAB;&#x53D7;&#x5B89;&#x5168;&#x800C;&#x65E0;&#x56F0;&#x6270;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x751F;&#x6D3B;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch10.html" class="navigation navigation-prev " aria-label="Previous page: 第十章挖矿和共识">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch12.html" class="navigation navigation-next " aria-label="Next page: 第十二章比特币应用">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十一章比特币安全","level":"1.17","depth":1,"next":{"title":"第十二章比特币应用","level":"1.18","depth":1,"path":"ch12.md","ref":"ch12.md","articles":[]},"previous":{"title":"第十章挖矿和共识","level":"1.16","depth":1,"path":"ch10.md","ref":"ch10.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch11.md","mtime":"2018-12-14T06:26:05.583Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

