
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>第十二章比特币应用 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="appdx-bips.html" />
    
    
    <link rel="prev" href="ch11.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >第十二章比特币应用</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x73B0;&#x5728;&#xFF0C;&#x8BA9;&#x6211;&#x4EEC;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x4F5C;&#x4E3A;&#x4E00;&#x4E2A;&#x5E94;&#x7528;&#x5E73;&#x53F0;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FDB;&#x4E00;&#x6B65;&#x52A0;&#x5F3A;&#x7406;&#x89E3;&#x3002; &#x73B0;&#x5728;&#x5F88;&#x591A;&#x4EBA;&#x4F7F;&#x7528;&#x201C;blockchain&#x201D;(&#x533A;&#x5757;&#x94FE;)&#x8FD9;&#x4E2A;&#x8BCD;&#x6765;&#x8868;&#x793A;&#x4EFB;&#x4F55;&#x5171;&#x4EAB;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x8BBE;&#x8BA1;&#x539F;&#x5219;&#x7684;&#x5E94;&#x7528;&#x5E73;&#x53F0;&#x3002; &#x8BE5;&#x672F;&#x8BED;&#x7ECF;&#x5E38;&#x88AB;&#x6EE5;&#x7528;&#xFF0C;&#x5E76;&#x88AB;&#x5E94;&#x7528;&#x4E8E;&#x8BB8;&#x591A;&#x4E0D;&#x80FD;&#x63D0;&#x4F9B;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E3B;&#x8981;&#x529F;&#x80FD;&#x7684;&#x4E8B;&#x60C5;&#x3002;</p>
<p>&#x5728;&#x672C;&#x7AE0;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4F5C;&#x4E3A;&#x5E94;&#x7528;&#x5E73;&#x53F0;&#x6240;&#x63D0;&#x4F9B;&#x7684;&#x529F;&#x80FD;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x8003;&#x8651;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6784;&#x5EFA;&#x539F;&#x8BED;&#xFF0C;&#x5373;&#x6784;&#x6210;&#x4EFB;&#x4F55;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x6784;&#x5EFA;&#x5757;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x7814;&#x7A76;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x539F;&#x8BED;&#x7684;&#x51E0;&#x4E2A;&#x91CD;&#x8981;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#xFF0C;&#x4F8B;&#x5982;&#x5F69;&#x8272;&#x5E01;&#xFF0C;&#x4ED8;&#x6B3E;&#xFF08;&#x72B6;&#x6001;&#xFF09;&#x6E20;&#x9053;&#x548C;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x6E20;&#x9053;&#xFF08;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#xFF09;&#x3002;</p>
<h2 id="121&#x4ECB;&#x7ECD;">12.1&#x4ECB;&#x7ECD;</h2>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x88AB;&#x8BBE;&#x8BA1;&#x4E3A;&#x4E00;&#x4E2A;&#x5206;&#x5E03;&#x5F0F;&#x7684;&#x8D27;&#x5E01;&#x53CA;&#x652F;&#x4ED8;&#x7CFB;&#x7EDF;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5B83;&#x7684;&#x5927;&#x90E8;&#x5206;&#x529F;&#x80FD;&#x6E90;&#x4E8E;&#x53EF;&#x7528;&#x4E8E;&#x66F4;&#x5E7F;&#x6CDB;&#x5E94;&#x7528;&#x4E2D;&#x7684;&#x8F83;&#x4F4E;&#x7EA7;&#x522B;&#x7684;&#x7ED3;&#x6784;&#x3002; &#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x662F;&#x7531;&#x5E10;&#x6237;&#xFF0C;&#x7528;&#x6237;&#xFF0C;&#x4F59;&#x989D;&#x548C;&#x4ED8;&#x6B3E;&#x7B49;&#x7EC4;&#x4EF6;&#x6784;&#x5EFA;&#x7684;&#x3002; &#x76F8;&#x53CD;&#x7684;&#xFF0C;&#x6211;&#x4EEC;&#x5728;[&#x4EA4;&#x6613;]&#x7AE0;&#x8282;&#x4E2D;&#x770B;&#x5230;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x7684;&#x662F;&#x5177;&#x6709;&#x4F4E;&#x7EA7;&#x52A0;&#x5BC6;&#x529F;&#x80FD;&#x7684;&#x4EA4;&#x6613;&#x811A;&#x672C;&#x8BED;&#x8A00;&#x3002; &#x5C31;&#x50CF;&#x8D26;&#x6237;&#xFF0C;&#x4F59;&#x989D;&#x548C;&#x4ED8;&#x6B3E;&#x7684;&#x66F4;&#x9AD8;&#x5C42;&#x6B21;&#x7684;&#x6982;&#x5FF5;&#x53EF;&#x4EE5;&#x4ECE;&#x57FA;&#x672C;&#x539F;&#x8BED;&#x4E2D;&#x884D;&#x751F;&#x51FA;&#x6765;&#x4E00;&#x6837;&#xFF0C;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x590D;&#x6742;&#x7684;&#x5E94;&#x7528;&#x4E5F;&#x662F;&#x5982;&#x6B64;&#x3002; &#x56E0;&#x6B64;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x53EF;&#x4EE5;&#x6210;&#x4E3A;&#x4E00;&#x4E2A;&#x5411;&#x8BF8;&#x5982;&#x667A;&#x80FD;&#x5408;&#x540C;&#x7B49;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x63D0;&#x4F9B;&#x4FE1;&#x4EFB;&#x670D;&#x52A1;&#x7684;&#x5E94;&#x7528;&#x5E73;&#x53F0;&#xFF0C;&#x8FDC;&#x8FDC;&#x8D85;&#x51FA;&#x4E86;&#x4F5C;&#x4E3A;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x548C;&#x652F;&#x4ED8;&#x7684;&#x539F;&#x59CB;&#x76EE;&#x7684;&#x3002;</p>
<h2 id="122&#x6784;&#x5EFA;&#x533A;&#x5757;&#xFF08;&#x539F;&#x8BED;&#xFF09;">12.2&#x6784;&#x5EFA;&#x533A;&#x5757;&#xFF08;&#x539F;&#x8BED;&#xFF09;</h2>
<p>&#x5F53;&#x8FD0;&#x884C;&#x6B63;&#x5E38;&#x4E14;&#x957F;&#x671F;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x4FDD;&#x8BC1;&#xFF0C;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x6765;&#x521B;&#x5EFA;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; &#x8FD9;&#x4E9B;&#x5305;&#x62EC;&#xFF1A;</p>
<p><strong>&#x675C;&#x7EDD;&#x53CC;&#x91CD;&#x652F;&#x51FA;</strong> &#x6BD4;&#x7279;&#x5E01;&#x5206;&#x5E03;&#x5F0F;&#x5171;&#x8BC6;&#x7B97;&#x6CD5;&#x7684;&#x6700;&#x6839;&#x672C;&#x4FDD;&#x8BC1;&#x662F;&#x786E;&#x4FDD;UTXO&#x4E0D;&#x4F1A;&#x82B1;&#x8D39;&#x4E24;&#x6B21;&#x3002;</p>
<p><strong>&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x6027;</strong> &#x4E00;&#x65E6;&#x4EA4;&#x6613;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x540E;&#x7684;&#x533A;&#x5757;&#x4E2D;&#x6DFB;&#x52A0;&#x4E86;&#x8DB3;&#x591F;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x5C31;&#x53D8;&#x5F97;&#x4E0D;&#x53EF;&#x7BE1;&#x6539;&#x3002; &#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x6027;&#x662F;&#x7531;&#x80FD;&#x6E90;&#x8FDB;&#x884C;&#x627F;&#x4FDD;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x91CD;&#x5199;&#x533A;&#x5757;&#x94FE;&#x9700;&#x8981;&#x6D88;&#x8017;&#x80FD;&#x6E90;&#x624D;&#x80FD;&#x4EA7;&#x751F;&#x5DE5;&#x4F5C;&#x8BC1;&#x660E;&#x3002; &#x6240;&#x9700;&#x7684;&#x80FD;&#x6E90;&#x4EE5;&#x53CA;&#x7531;&#x6B64;&#x5E26;&#x6765;&#x7684;&#x4E0D;&#x53EF;&#x53D8;&#x6027;&#x7684;&#x7A0B;&#x5EA6;&#x968F;&#x7740;&#x5728;&#x5305;&#x542B;&#x4EA4;&#x6613;&#x7684;&#x533A;&#x5757;&#x4E4B;&#x540E;&#x88AB;&#x63D0;&#x4EA4;&#x7684;&#x5DE5;&#x4F5C;&#x91CF;&#x800C;&#x589E;&#x52A0;&#x3002;</p>
<p><strong>&#x4E2D;&#x7ACB;</strong> &#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4F20;&#x64AD;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x4E0D;&#x7BA1;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x7684;&#x6765;&#x6E90;&#x6216;&#x5185;&#x5BB9;&#x5982;&#x4F55;&#x3002; &#x8FD9;&#x610F;&#x5473;&#x7740;&#x4EFB;&#x4F55;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x652F;&#x4ED8;&#x8DB3;&#x591F;&#x7684;&#x8D39;&#x7528;&#x6765;&#x521B;&#x5EFA;&#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x76F8;&#x4FE1;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x968F;&#x65F6;&#x4F20;&#x8F93;&#x8BE5;&#x4EA4;&#x6613;&#x5E76;&#x4F7F;&#x5176;&#x5305;&#x542B;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;</p>
<p><strong>&#x5B89;&#x5168;&#x65F6;&#x95F4;&#x6233;</strong> </p>
<p>&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x62D2;&#x7EDD;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x6233;&#x8DDD;&#x79BB;&#x73B0;&#x5728;&#x592A;&#x8FDC;&#xFF08;&#x8FC7;&#x53BB;&#x548C;&#x5C06;&#x6765;&#xFF09;&#x7684;&#x5757;&#x3002; &#x8FD9;&#x53EF;&#x4EE5;&#x786E;&#x4FDD;&#x5757;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x53EF;&#x4EE5;&#x88AB;&#x4FE1;&#x4EFB;&#x3002; &#x5757;&#x4E0A;&#x7684;&#x65F6;&#x95F4;&#x6233;&#x610F;&#x5473;&#x7740;&#x5BF9;&#x6240;&#x6709;&#x5176;&#x5305;&#x542B;&#x7684;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x4E4B;&#x524D;&#x4ECE;&#x672A;&#x88AB;&#x82B1;&#x8FC7;&#x7684;&#x4FDD;&#x8BC1;&#x3002;</p>
<p><strong>&#x6388;&#x6743;</strong> &#x88AB;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7F51;&#x7EDC;&#x4E2D;&#x9A8C;&#x8BC1;&#x8FC7;&#x7684;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x53EF;&#x63D0;&#x4F9B;&#x6388;&#x6743;&#x4FDD;&#x8BC1;&#x3002;&#x6CA1;&#x6709;&#x811A;&#x672C;&#x4E2D;&#x6307;&#x5B9A;&#x7684;&#x79C1;&#x94A5;&#x7684;&#x6301;&#x6709;&#x4EBA;&#x7684;&#x6388;&#x6743;&#xFF0C;&#x5305;&#x542B;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x8981;&#x6C42;&#x7684;&#x811A;&#x672C;&#x5C31;&#x4E0D;&#x80FD;&#x88AB;&#x6267;&#x884C;&#x3002;</p>
<p><strong>&#x5BA1;&#x8BA1;&#x80FD;&#x529B;</strong> &#x6240;&#x6709;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x516C;&#x5F00;&#x7684;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x5BA1;&#x8BA1;&#x3002; &#x6240;&#x6709;&#x7684;&#x4EA4;&#x6613;&#x548C;&#x4EA4;&#x6613;&#x6240;&#x5C5E;&#x7684;&#x533A;&#x5757;&#x90FD;&#x53EF;&#x4EE5;&#x4EE5;&#x4E00;&#x4E2A;&#x4E0D;&#x95F4;&#x65AD;&#x7684;&#x533A;&#x5757;&#x94FE;&#x94FE;&#x63A5;&#x8D77;&#x6765;&#x5E76;&#x6700;&#x7EC8;&#x94FE;&#x63A5;&#x5230;&#x521B;&#x59CB;&#x533A;&#x5757;&#x3002;</p>
<p><strong>&#x4F1A;&#x8BA1;</strong> &#x5728;&#x4EFB;&#x4F55;&#x4EA4;&#x6613;&#x4E2D;&#xFF08;coinbase&#x4EA4;&#x6613;&#x9664;&#x5916;&#xFF09;&#xFF0C;&#x8F93;&#x5165;&#x7684;&#x91D1;&#x989D;&#x7B49;&#x4E8E;&#x8F93;&#x51FA;&#x7684;&#x91D1;&#x989D;&#x52A0;&#x4E0A;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002; &#x5728;&#x4EA4;&#x6613;&#x4E2D;&#x4E0D;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x6216;&#x9500;&#x6BC1;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x503C;&#x6570;&#x503C;&#x3002; &#x8F93;&#x51FA;&#x4E0D;&#x80FD;&#x8D85;&#x8FC7;&#x8F93;&#x5165;&#x3002;</p>
<p><strong>&#x6C38;&#x4E0D;&#x8FC7;&#x671F;</strong> &#x6709;&#x6548;&#x7684;&#x4EA4;&#x6613;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x8FC7;&#x671F;&#x3002; &#x5982;&#x679C;&#x4ECA;&#x5929;&#x6709;&#x6548;&#xFF0C;&#x5B83;&#x5C06;&#x5728;&#x4E0D;&#x4E45;&#x7684;&#x5C06;&#x6765;&#x4ECD;&#x7136;&#x6709;&#x6548;&#xFF0C;&#x53EA;&#x8981;&#x8F93;&#x5165;&#x4ECD;&#x7136;&#x6CA1;&#x6709;&#x88AB;&#x82B1;&#x8D39;&#xFF0C;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x6CA1;&#x6709;&#x6539;&#x53D8;&#x3002;</p>
<p><strong>&#x516C;&#x6B63;&#x6027;</strong> &#x4F7F;&#x7528;SIGHASH_ALL&#x7B7E;&#x540D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6216;&#x7531;&#x53E6;&#x4E00;&#x4E2A;&#x90E8;&#x5206;&#x7531;SIGHASH&#x7C7B;&#x578B;&#x7B7E;&#x7F72;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x4E0D;&#x80FD;&#x5728;&#x7B7E;&#x540D;&#x8FD8;&#x6709;&#x6548;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x4FEE;&#x6539;&#xFF0C;&#x4ECE;&#x800C;&#x5BFC;&#x81F4;&#x4EA4;&#x6613;&#x672C;&#x8EAB;&#x65E0;&#x6548;&#x3002;</p>
<p><strong>&#x4EA4;&#x6613;&#x539F;&#x5B50;&#x6027;</strong> &#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x662F;&#x539F;&#x5B50;&#x7684;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x539F;&#x5B50;&#x6027;&#x662F;&#x6307;&#x4EA4;&#x6613;&#x8981;&#x4E48;&#x5168;&#x90E8;&#x6267;&#x884C;&#xFF0C;&#x8981;&#x4E48;&#x5B8C;&#x5168;&#x4E0D;&#x6267;&#x884C;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#xFF09;&#x3002; &#x5B83;&#x4EEC;&#x8981;&#x4E48;&#x662F;&#x6709;&#x6548;&#x7684;&#x5E76;&#x4E14;&#x7ECF;&#x8FC7;&#x786E;&#x8BA4;&#x7684;&#xFF08;&#x6316;&#x77FF;&#xFF09;&#xFF0C;&#x8981;&#x4E48;&#x4E0D;&#x662F;&#x3002; &#x4E0D;&#x5B58;&#x5728;&#x6316;&#x77FF;&#x51FA;&#x4EA4;&#x6613;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4EA4;&#x6613;&#x4E5F;&#x4E0D;&#x5B58;&#x5728;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3002; &#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x70B9;&#xFF0C;&#x4EA4;&#x6613;&#x8981;&#x4E48;&#x88AB;&#x6316;&#x51FA;&#xFF0C;&#x8981;&#x4E48;&#x6CA1;&#x6709;&#x88AB;&#x6316;&#xFF0C;&#x4E0D;&#x5B58;&#x5728;&#x4E2D;&#x95F4;&#x72B6;&#x6001;&#x3002;</p>
<p><strong>&#x79BB;&#x6563;&#xFF08;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#xFF09;&#x4EF7;&#x503C;&#x5355;&#x4F4D;</strong> &#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x662F;&#x79BB;&#x6563;&#x548C;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#x4EF7;&#x503C;&#x5355;&#x4F4D;&#x3002; &#x4ED6;&#x4EEC;&#x8981;&#x4E48;&#x6574;&#x4F53;&#x88AB;&#x82B1;&#x8D39;&#x8981;&#x4E48;&#x6574;&#x4F53;&#x6CA1;&#x6709;&#x82B1;&#x8D39;&#x3002; &#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x88AB;&#x5206;&#x5272;&#x6216;&#x8005;&#x90E8;&#x5206;&#x88AB;&#x82B1;&#x8D39;&#x3002;</p>
<p><strong>&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF08;&#x6CE8;&#xFF1A;&#x8BA9;&#x4EFB;&#x4F55;&#x9884;&#x5B9A;&#x4E8B;&#x7269;&#x6709;&#x6548;&#x7684;&#x6700;&#x4F4E;&#x53C2;&#x4E0E;&#x4EBA;&#x6570;&#xFF09;</strong> &#x811A;&#x672C;&#x4E2D;&#x7684;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x9650;&#x5236;&#x89C4;&#x5B9A;&#x4E86;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x65B9;&#x6848;&#x4E2D;&#x7684;&#x9884;&#x5B9A;&#x4E49;&#x7684;&#x6CD5;&#x5B9A;&#x6743;&#x9650;&#x3002; M-of-N&#x8981;&#x6C42;&#x7531;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x6267;&#x884C;&#x3002;</p>
<p><strong>&#x65F6;&#x95F4;&#x9501;/&#x8001;&#x5316;</strong> &#x5305;&#x542B;&#x76F8;&#x5BF9;&#x6216;&#x7EDD;&#x5BF9;&#x65F6;&#x95F4;&#x9501;&#x7684;&#x4EFB;&#x4F55;&#x811A;&#x672C;&#x8BED;&#x53E5;&#x53EA;&#x80FD;&#x5728;&#x5176;&#x65F6;&#x95F4;&#x8D85;&#x8FC7;&#x6307;&#x5B9A;&#x65F6;&#x95F4;&#x540E;&#x6267;&#x884C;&#x3002;</p>
<p><strong>&#x590D;&#x5236;</strong> &#x533A;&#x5757;&#x94FE;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x5B58;&#x50A8;&#x786E;&#x4FDD;&#x4E86;&#x5728;&#x4EA4;&#x6613;&#x5728;&#x88AB;&#x5F00;&#x91C7;&#x4E4B;&#x540E;&#xFF0C;&#x7ECF;&#x8FC7;&#x5145;&#x5206;&#x7684;&#x786E;&#x8BA4;&#xFF0C;&#x5B83;&#x88AB;&#x590D;&#x5236;&#x5230;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4E0A;&#xFF0C;&#x5E76;&#x4E14;&#x53D8;&#x5F97;&#x53EF;&#x4EE5;&#x8010;&#x53D7;&#x5F97;&#x8D77;&#x7535;&#x529B;&#x635F;&#x5931;&#xFF0C;&#x6570;&#x636E;&#x4E22;&#x5931;&#x7B49;&#x7684;&#x5F71;&#x54CD;&#x3002;</p>
<p><strong>&#x4F2A;&#x9020;&#x4FDD;&#x62A4;</strong> &#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x53EA;&#x80FD;&#x82B1;&#x8D39;&#x73B0;&#x6709;&#x7684;&#x7ECF;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x4E0D;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x6216;&#x4F2A;&#x9020;&#x4EF7;&#x503C;&#x3002;</p>
<p><strong>&#x4E00;&#x81F4;&#x6027;</strong> &#x5728;&#x6CA1;&#x6709;&#x77FF;&#x5DE5;&#x5206;&#x533A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x6839;&#x636E;&#x8BB0;&#x5F55;&#x7684;&#x6DF1;&#x5EA6;&#xFF0C;&#x8BB0;&#x5F55;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x5757;&#x53EF;&#x80FD;&#x4F1A;&#x88AB;&#x4ECE;&#x65B0;&#x7EC4;&#x7EC7;&#x6216;&#x8005;&#x88AB;&#x4E0D;&#x8BA4;&#x53EF;&#x7684;&#x53EF;&#x80FD;&#x6027;&#x5C06;&#x5448;&#x6307;&#x6570;&#x7EA7;&#x4E0B;&#x964D;&#x3002;&#x4E00;&#x65E6;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x6DF1;&#x5C42;&#xFF0C;&#x6539;&#x53D8;&#x6240;&#x9700;&#x7684;&#x8BA1;&#x7B97;&#x548C;&#x80FD;&#x91CF;&#x5C06;&#x5927;&#x5230;&#x4E0D;&#x53EF;&#x884C;&#x7684;&#x7A0B;&#x5EA6;&#x3002;</p>
<p><strong>&#x8BB0;&#x5F55;&#x5916;&#x90E8;&#x72B6;&#x6001;</strong> &#x6BCF;&#x4E2A;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;OP_RETURN&#x63D0;&#x4EA4;&#x4E00;&#x4E2A;&#x503C;&#xFF0C;&#x8868;&#x793A;&#x5916;&#x90E8;&#x72B6;&#x6001;&#x673A;&#x4E2D;&#x7684;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#x3002;</p>
<p><strong>&#x53EF;&#x9884;&#x6D4B;&#x53D1;&#x884C;&#x91CF;</strong> &#x603B;&#x8BA1;&#x4E0D;&#x5230;2100&#x4E07;&#x6BD4;&#x7279;&#x5E01;&#x5C06;&#x4F1A;&#x4EE5;&#x53EF;&#x4EE5;&#x9884;&#x6D4B;&#x7684;&#x901F;&#x5EA6;&#x53D1;&#x884C;&#x3002;</p>
<p>&#x4E0A;&#x8FF0;&#x6784;&#x5EFA;&#x5757;&#x533A;&#x7684;&#x5217;&#x8868;&#x5E76;&#x4E0D;&#x5B8C;&#x6574;&#xFF0C;&#x8FD8;&#x4F1A;&#x6709;&#x65B0;&#x529F;&#x80FD;&#x90FD;&#x88AB;&#x4ECB;&#x7ECD;&#x6DFB;&#x52A0;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x3002;</p>
<h2 id="123&#x6E90;&#x4E8E;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x7684;&#x5E94;&#x7528;">12.3&#x6E90;&#x4E8E;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x7684;&#x5E94;&#x7528;</h2>
<p>&#x7531;&#x6BD4;&#x7279;&#x5E01;&#x63D0;&#x4F9B;&#x7684;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x662F;&#x53EF;&#x4FE1;&#x5E73;&#x53F0;&#x7684;&#x7EC4;&#x6210;&#x90E8;&#x5206;&#xFF0C;&#x53EF;&#x7528;&#x4E8E;&#x6784;&#x6210;&#x5404;&#x79CD;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002; &#x4EE5;&#x4E0B;&#x662F;&#x4ECA;&#x5929;&#x5728;&#x7528;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x53CA;&#x5176;&#x4F7F;&#x7528;&#x7684;&#x6784;&#x5EFA;&#x533A;&#x5757;&#x7684;&#x4E00;&#x4E9B;&#x793A;&#x4F8B;&#xFF1A;</p>
<p><strong>Proof-of-Existence&#xFF08;Digital Notary&#xFF09;&#x6570;&#x5B57;&#x516C;&#x8BC1;</strong> </p>
<p>&#x4E0D;&#x53EF;&#x7BE1;&#x6539;&#x6027;+&#x65F6;&#x95F4;&#x6233;+&#x6C38;&#x4E45;&#x6027;&#x3002;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x63D0;&#x4EA4;&#x7ED9;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x4EE5;&#x8BC1;&#x660E;&#x6587;&#x4EF6;&#x5728;&#x6B64;&#x5B58;&#x6863;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x662F;&#x5B58;&#x5728;&#x7684;&#xFF08;Timestamp&#x5B89;&#x5168;&#x65F6;&#x95F4;&#x6233;&#xFF09;&#x3002;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x4E0D;&#x80FD;&#x5728;&#x4E8B;&#x540E;&#x4FEE;&#x6539;&#xFF08;Immutability&#x4E0D;&#x53EF;&#x6539;&#x53D8;&#x6027;&#xFF09;&#xFF0C;&#x8BC1;&#x636E;&#x5C06;&#x88AB;&#x6C38;&#x4E45;&#x5B58;&#x50A8;&#xFF08;Durability&#x8010;&#x4E45;&#x6027;&#xFF09;&#x3002;</p>
<p><strong>Kickstarter&#xFF08;Lighthouse&#xFF09;</strong> </p>
<p>&#x4E00;&#x81F4;&#x6027;+&#x539F;&#x5B50;&#x6027;+&#x53EF;&#x4FE1;&#x3002;&#x5982;&#x679C;&#x60A8;&#x53D1;&#x8D77;&#x4F17;&#x7B79;&#x6D3B;&#x52A8;&#x7684;&#x4E00;&#x4E2A;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#xFF08;Integrity&#x516C;&#x6B63;&#x6027;&#xFF09;&#xFF0C;&#x522B;&#x4EBA;&#x53EF;&#x4EE5;&#x53C2;&#x4E0E;&#x4F17;&#x7B79;&#xFF0C;&#x4F46;&#x5728;&#x76EE;&#x6807;&#xFF08;output value&#x8F93;&#x51FA;&#x503C;&#xFF09;&#x5B8C;&#x6210;&#x4E4B;&#x524D;&#xFF08;Consistency&#x4E00;&#x81F4;&#x6027;&#xFF09;&#xFF0C;&#x8FD9;&#x7B14;&#x94B1;&#x4E0D;&#x80FD;&#x88AB;&#x82B1;&#x8D39;&#x51FA;&#x53BB;&#xFF08;Atomicity&#x4EA4;&#x6613;&#x539F;&#x5B50;&#x6027; &#xFF09;&#x3002;</p>
<p><strong>Payment Channels</strong> </p>
<p>&#x63A7;&#x5236;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;+&#x65F6;&#x95F4;&#x9501;+&#x675C;&#x7EDD;&#x53CC;&#x91CD;&#x652F;&#x4ED8;+&#x6C38;&#x4E0D;&#x8FC7;&#x671F;+&#x8010;&#x5BA1;&#x67E5;+&#x6388;&#x6743;&#x3002;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x65F6;&#x95F4;&#x9501;&#xFF08;Timelock&#x65F6;&#x95F4;&#x9501;&#xFF09;&#x7684;&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#x4E3A;2-2&#x7684;&#xFF08;Quorum&#x6CD5;&#x5B9A;&#x4EBA;&#x6570;&#xFF09;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x88AB;&#x4F5C;&#x4E3A;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x201C;&#x7ED3;&#x7B97;&#x201D;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x53EF;&#x4EE5;&#x88AB;&#x6301;&#x6709;&#xFF08;Nonexpiration&#x6C38;&#x4E0D;&#x8FC7;&#x671F;&#xFF09;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x95F4;&#x7531;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x6388;&#x6743;&#xFF08;Authorization&#x6388;&#x6743;&#xFF09;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF08;Censorship Resistance&#x8010;&#x5BA1;&#x67E5;&#xFF09;&#x8FDB;&#x884C;&#x82B1;&#x8D39;&#x3002;&#x7136;&#x540E;&#x53CC;&#x65B9;&#x53EF;&#x4EE5;&#x5728;&#x66F4;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x9501;&#xFF08;Timelock&#xFF09;&#x521B;&#x5EFA;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#xFF08;No Double-Spend&#xFF09;&#x7ED3;&#x7B97;&#x7684;&#x786E;&#x8BA4;&#x4EA4;&#x6613;&#x3002;</p>
<blockquote>
<p>&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x672C;&#x6BB5;&#x539F;&#x6587;&#x5982;&#x4E0B;&#xFF1A;Quorum of Control + Timelock + No Double Spend + Nonexpiration + Censorship Resistance + Authorization. A multisig 2-of-2 (Quorum) with a timelock (Timelock) used as the &quot;settlement&quot; transaction of a payment channel can be held (Nonexpiration) and spent whenever (Censorship Resistance) by either party (Authorization). The two parties can then create commitment transactions that double-spend (No Double-Spend) the settlement on a shorter timelock (Timelock).&#xFF09;</p>
</blockquote>
<h2 id="124&#x67D3;&#x8272;&#x5E01;&#xFF08;colored-coins&#xFF09;">12.4&#x67D3;&#x8272;&#x5E01;&#xFF08;Colored Coins&#xFF09;</h2>
<p>&#x6211;&#x4EEC;&#x5C06;&#x8BA8;&#x8BBA;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x5E94;&#x7528;&#x662F;&#x67D3;&#x8272;&#x5E01;&#x3002;</p>
<p>&#x67D3;&#x8272;&#x5E01;&#x662F;&#x6307;&#x5229;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6765;&#x8BB0;&#x5F55;&#x9664;&#x6BD4;&#x7279;&#x5E01;&#x4E4B;&#x5916;&#x7684;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x7684;&#x521B;&#x5EFA;&#xFF0C;&#x6240;&#x6709;&#x6743;&#x548C;&#x8F6C;&#x8BA9;&#x7684;&#x8FD9;&#x7C7B;&#x6280;&#x672F;&#x3002; &#x6240;&#x8C13;&#x201C;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x201D;&#x6211;&#x4EEC;&#x662F;&#x6307;&#x8FD9;&#x4E9B;&#x8D44;&#x4EA7;&#x4E0D;&#x76F4;&#x63A5;&#x5B58;&#x50A8;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x4E0A;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x6307;&#x6BD4;&#x7279;&#x5E01;&#x672C;&#x8EAB;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x672C;&#x8EAB;&#x5C31;&#x662F;&#x8FD9;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x56FA;&#x6709;&#x8D44;&#x4EA7;&#x3002;</p>
<p>&#x67D3;&#x8272;&#x5E01;&#x7528;&#x4E8E;&#x8DDF;&#x8E2A;&#x7B2C;&#x4E09;&#x65B9;&#x6301;&#x6709;&#x7684;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x548C;&#x5B9E;&#x7269;&#x8D44;&#x4EA7;&#xFF0C;&#x5E76;&#x901A;&#x8FC7;&#x67D3;&#x8272;&#x5E01;&#x6240;&#x6709;&#x6743;&#x8BC1;&#x4E66;&#x6765;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002; &#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x67D3;&#x8272;&#x5E01;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x65E0;&#x5F62;&#x8D44;&#x4EA7;&#xFF0C;&#x5982;&#x80A1;&#x7968;&#x8BC1;&#x4E66;&#xFF0C;&#x8BB8;&#x53EF;&#x8BC1;&#xFF0C;&#x865A;&#x62DF;&#x8D22;&#x4EA7;&#xFF08;&#x6E38;&#x620F;&#x88C5;&#x5907;&#xFF09;&#x6216;&#x5927;&#x591A;&#x6570;&#x4EFB;&#x4F55;&#x5F62;&#x5F0F;&#x7684;&#x8BB8;&#x53EF;&#x77E5;&#x8BC6;&#x4EA7;&#x6743;&#xFF08;&#x5546;&#x6807;&#xFF0C;&#x7248;&#x6743;&#x7B49;&#xFF09;&#x3002; &#x6709;&#x5F62;&#x8D44;&#x4EA7;&#x67D3;&#x8272;&#x5E01;&#x53EF;&#x4EE5;&#x4EE3;&#x8868;&#x5546;&#x54C1;&#xFF08;&#x9EC4;&#x91D1;&#xFF0C;&#x767D;&#x94F6;&#xFF0C;&#x77F3;&#x6CB9;&#xFF09;&#xFF0C;&#x571F;&#x5730;&#x6240;&#x6709;&#x6743;&#xFF0C;&#x6C7D;&#x8F66;&#xFF0C;&#x8239;&#x53EA;&#xFF0C;&#x98DE;&#x673A;&#x7B49;&#x6240;&#x6709;&#x6743;&#x3002;</p>
<p>&#x8BE5;&#x672F;&#x8BED;&#x6E90;&#x4E8E;&#x201C;&#x7740;&#x8272;&#x201D;&#x6216;&#x6807;&#x8BB0;&#x67D0;&#x540D;&#x4E49;&#x91D1;&#x989D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x60F3;&#x6CD5;&#xFF0C;&#x4F8B;&#x5982;&#xFF0C;1&#x806A;&#xFF0C;&#x7528;&#x6765;&#x8868;&#x793A;&#x6BD4;&#x7279;&#x5E01;&#x4EF7;&#x503C;&#x672C;&#x8EAB;&#x4EE5;&#x5916;&#x7684;&#x4E1C;&#x897F;&#x3002;&#x6253;&#x4E2A;&#x6BD4;&#x65B9;&#xFF0C;&#x6211;&#x4EEC;&#x7ED9;&#x4E00;&#x7F8E;&#x5143;&#x7684;&#x949E;&#x7968;&#x6807;&#x4E0A;&#x4E00;&#x884C;&#x4FE1;&#x606F;&#x8BF4;&#xFF1A;&#x201C;&#x8FD9;&#x662F;ACME&#x7684;&#x80A1;&#x7968;&#x8BC1;&#x4E66;&#x201D;&#xFF0C;&#x6216;&#x8005;&#x201C;&#x8FD9;&#x5F20;&#x949E;&#x7968;&#x53EF;&#x4EE5;&#x5151;&#x6362;1&#x76CE;&#x53F8;&#x7684;&#x94F6;&#x201D;&#xFF0C;&#x7136;&#x540E;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;1&#x7F8E;&#x5143;&#x949E;&#x7968;&#x4E0E;&#x4F5C;&#x4E3A;&#x5176;&#x4ED6;&#x8D44;&#x4EA7;&#x6743;&#x76CA;&#x8BC1;&#x660E;&#x6765;&#x8FDB;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x67D3;&#x8272;&#x5E01;&#x7684;&#x7B2C;&#x4E00;&#x6B21;&#x5B9E;&#x65BD;&#xFF0C;&#x540D;&#x4E3A;&#x201C;&#x57FA;&#x4E8E;&#x589E;&#x5F3A;&#x586B;&#x5145;&#x8BA2;&#x5355;&#x7684;&#x7740;&#x8272;&#x201D;&#x6216;&#x201C;EPOBC&#x201D;&#xFF0C;&#x5C06;&#x5916;&#x90E8;&#x8D44;&#x4EA7;&#x6807;&#x8BB0;&#x4E8E;1&#x806A;&#x8F93;&#x51FA;&#x4E0A;&#x3002;&#x8FD9;&#x6837;&#xFF0C;&#x56E0;&#x4E3A;&#x6BCF;&#x4E2A;&#x8D44;&#x4EA7;&#x4F5C;&#x4E3A;1&#x806A;&#x7684;&#x5C5E;&#x6027;&#xFF08;&#x989C;&#x8272;&#xFF09;&#x88AB;&#x6DFB;&#x52A0;&#x4E86;&#xFF0C;&#x5B83;&#x5C31;&#x6210;&#x4E86;&#x4E00;&#x4E2A;&#x771F;&#x6B63;&#x7684;&#x201C;&#x67D3;&#x8272;&#x5E01;&#x201D;&#x3002;</p>
<p>&#x67D3;&#x8272;&#x5E01;&#x7684;&#x6700;&#x65B0;&#x5B9E;&#x65BD;&#x4F7F;&#x7528;OP_RETURN&#x811A;&#x672C;&#x64CD;&#x4F5C;&#x7801;&#x5C06;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x5143;&#x6570;&#x636E;&#x4E0E;&#x5C06;&#x5143;&#x6570;&#x636E;&#x4E0E;&#x7279;&#x5B9A;&#x8D44;&#x4EA7;&#x76F8;&#x5173;&#x8054;&#x7684;&#x5916;&#x90E8;&#x6570;&#x636E;&#x5B58;&#x50A8;&#x7ED3;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x3002;</p>
<p>&#x4ECA;&#x5929;&#x67D3;&#x8272;&#x5E01;&#x7684;&#x4E24;&#x4E2A;&#x6700;&#x7A81;&#x51FA;&#x7684;&#x5B9E;&#x73B0;&#x662F; Open Assets&#x548C;Colu&#x7684;&#x67D3;&#x8272;&#x5E01;&#x3002;&#x8FD9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x6765;&#x67D3;&#x8272;&#xFF0C;&#x5E76;&#x4E0D;&#x517C;&#x5BB9;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x521B;&#x5EFA;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x5728;&#x5176;&#x4ED6;&#x7CFB;&#x7EDF;&#x4E2D;&#x65E0;&#x6CD5;&#x770B;&#x5230;&#x6216;&#x88AB;&#x4F7F;&#x7528;&#x3002;</p>
<h3 id="1241&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;">12.4.1&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;</h3>
<p>&#x67D3;&#x8272;&#x5E01;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x8F6C;&#x79FB;&#xFF0C;&#x5E76;&#x4E14;&#x901A;&#x5E38;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x53EF;&#x4EE5;&#x7406;&#x89E3;&#x542B;&#x6709;&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x5143;&#x6570;&#x636E;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x94B1;&#x5305;&#x6765;&#x67E5;&#x770B;&#x3002; &#x5FC5;&#x987B;&#x7279;&#x522B;&#x6CE8;&#x610F;&#x907F;&#x514D;&#x5728;&#x5E38;&#x89C4;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x4E2D;&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;&#x76F8;&#x5173;&#x7684;&#x5BC6;&#x94A5;&#xFF0C;&#x56E0;&#x4E3A;&#x5E38;&#x89C4;&#x94B1;&#x5305;&#x53EF;&#x80FD;&#x4F1A;&#x7834;&#x574F;&#x5143;&#x6570;&#x636E;&#x3002; &#x540C;&#x6837;&#x5730;&#xFF0C;&#x67D3;&#x8272;&#x5E01;&#x4E5F;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x53D1;&#x9001;&#x5230;&#x7531;&#x5E38;&#x89C4;&#x94B1;&#x5305;&#x7BA1;&#x7406;&#x7684;&#x5730;&#x5740;&#xFF0C;&#x800C;&#x53EA;&#x80FD;&#x53D1;&#x9001;&#x5230;&#x7531;&#x67D3;&#x8272;&#x5E01;&#x80FD;&#x591F;&#x8BC6;&#x522B;&#x7684;&#x94B1;&#x5305;&#x7BA1;&#x7406;&#x7684;&#x5730;&#x5740;&#x3002;Colu&#x548C;Open Assets&#x8FD9;&#x4E24;&#x4E2A;&#x7CFB;&#x7EDF;&#x90FD;&#x4F7F;&#x7528;&#x7279;&#x6B8A;&#x7684;&#x67D3;&#x8272;&#x5E01;&#x5730;&#x5740;&#x6765;&#x51CF;&#x8F7B;&#x8FD9;&#x79CD;&#x98CE;&#x9669;&#xFF0C;&#x5E76;&#x786E;&#x4FDD;&#x67D3;&#x8272;&#x5E01;&#x4E0D;&#x4F1A;&#x53D1;&#x9001;&#x5230;&#x4E0D;&#x80FD;&#x8BC6;&#x522B;&#x7684;&#x94B1;&#x5305;&#x3002;</p>
<p>&#x67D3;&#x8272;&#x5E01;&#x5BF9;&#x5927;&#x591A;&#x6570;&#x901A;&#x7528;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x4E5F;&#x662F;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002; &#x76F8;&#x53CD;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;&#x6D4F;&#x89C8;&#x5668;&#x6765;&#x9610;&#x91CA;&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x5143;&#x6570;&#x636E;&#x3002;</p>
<p>Open Assets&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x53EF;&#x4EE5;&#x5728;<a href="https://www.coinprism.info/" target="_blank">coinprism</a>&#x67E5;&#x627E;&#x3002;</p>
<p>Colu&#x67D3;&#x8272;&#x5E01;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x533A;&#x5757;&#x94FE;&#x63A2;&#x7D22;&#x5668;&#x53EF;&#x4EE5;&#x5728;<a href="http://coloredcoins.org/explorer/" target="_blank">Blockchain Explorer</a>&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<p>Copay&#x94B1;&#x5305;&#x63D2;&#x4EF6;&#x53EF;&#x4EE5;&#x5728;<a href="http://coloredcoins.org/colored-coins-copay-addon/" target="_blank">Colored Coins Copay Addon</a>&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<h3 id="1242&#x53D1;&#x884C;&#x67D3;&#x8272;&#x5E01;">12.4.2&#x53D1;&#x884C;&#x67D3;&#x8272;&#x5E01;</h3>
<p>&#x6BCF;&#x4E2A;&#x67D3;&#x8272;&#x5E01;&#x7684;&#x5B9E;&#x73B0;&#x90FD;&#x901A;&#x8FC7;&#x4E0D;&#x540C;&#x7684;&#x65B9;&#x6CD5;&#x521B;&#x9020;&#x67D3;&#x8272;&#x5E01;&#xFF0C;&#x4F46;&#x5B83;&#x4EEC;&#x90FD;&#x63D0;&#x4F9B;&#x7C7B;&#x4F3C;&#x7684;&#x529F;&#x80FD;&#x3002;&#x521B;&#x9020;&#x67D3;&#x8272;&#x5E01;&#x8D44;&#x4EA7;&#x7684;&#x8FC7;&#x7A0B;&#x79F0;&#x4E3A;<em>&#x53D1;&#x884C;</em>&#x3002;&#x4F5C;&#x4E3A;&#x521D;&#x59CB;&#x4EA4;&#x6613;&#xFF0C;&#x53D1;&#x884C;&#x4EA4;&#x6613;&#x5C06;&#x8D44;&#x4EA7;&#x767B;&#x8BB0;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x7528;&#x4E8E;&#x5F15;&#x7528;&#x8D44;&#x4EA7;&#x7684;&#x8D44;&#x4EA7;ID&#x3002;&#x4E00;&#x65E6;&#x53D1;&#x884C;&#xFF0C;&#x8D44;&#x4EA7;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x8F6C;&#x8D26;&#x4EA4;&#x6613;&#x5728;&#x5730;&#x5740;&#x4E4B;&#x95F4;&#x4F20;&#x9012;&#x3002;</p>
<p>&#x4F5C;&#x4E3A;&#x67D3;&#x8272;&#x5E01;&#x53D1;&#x884C;&#x7684;&#x8D44;&#x4EA7;&#x53EF;&#x4EE5;&#x6709;&#x591A;&#x79CD;&#x5C5E;&#x6027;&#x3002;&#x5B83;&#x4EEC;&#x53EF;&#x4EE5;&#x662F;&#x53EF;&#x5206;&#x5272;&#x7684;&#x6216;&#x4E0D;&#x53EF;&#x5206;&#x5272;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x8F6C;&#x8D26;&#x4E2D;&#x7684;&#x8D44;&#x4EA7;&#x91CF;&#x53EF;&#x4EE5;&#x662F;&#x6574;&#x6570;&#xFF08;&#x6BD4;&#x5982;5&#xFF09;&#x6216;&#x5177;&#x6709;&#x5341;&#x8FDB;&#x5236;&#x7EC6;&#x5206;&#xFF08;&#x6BD4;&#x5982;4.321&#xFF09;&#x3002;&#x8D44;&#x4EA7;&#x4E5F;&#x53EF;&#x4EE5;<em>&#x56FA;&#x5B9A;&#x53D1;&#x884C;</em>&#xFF0C;&#x610F;&#x601D;&#x662F;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8D44;&#x4EA7;&#x53EA;&#x53EF;&#x4EE5;&#x53D1;&#x884C;&#x4E00;&#x6B21;&#xFF0C;&#x6216;&#x8005;&#x53EF;&#x4EE5;&#x88AB;&#x518D;&#x6B21;&#x53D1;&#x884C;&#xFF0C;&#x540E;&#x8005;&#x610F;&#x5473;&#x7740;&#x539F;&#x59CB;&#x53D1;&#x884C;&#x4EBA;&#x5728;&#x521D;&#x59CB;&#x53D1;&#x884C;&#x540E;&#x53EF;&#x4EE5;&#x53D1;&#x884C;&#x65B0;&#x8D44;&#x4EA7;&#x5355;&#x4F4D;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x4E00;&#x4E9B;&#x67D3;&#x8272;&#x5E01;&#x542F;&#x7528;&#x5206;&#x7EA2;&#xFF0C;&#x5373;&#x5141;&#x8BB8;&#x6309;&#x7167;&#x62E5;&#x6709;&#x6743;&#x6210;&#x6BD4;&#x4F8B;&#x5206;&#x914D;&#x6BD4;&#x7279;&#x5E01;&#x4ED8;&#x6B3E;&#x7ED9;&#x67D3;&#x8272;&#x5E01;&#x8D44;&#x4EA7;&#x7684;&#x6240;&#x6709;&#x8005;&#x3002;</p>
<h3 id="1243&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;">12.4.3&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;</h3>
<p>&#x7ED9;&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x610F;&#x4E49;&#x7684;&#x5143;&#x6570;&#x636E;&#x901A;&#x5E38;&#x4F7F;&#x7528;OP_RETURN&#x64CD;&#x4F5C;&#x7801;&#x5B58;&#x50A8;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x4E2D;&#x3002;&#x4E0D;&#x540C;&#x989C;&#x8272;&#x7684;&#x786C;&#x5E01;&#x534F;&#x8BAE;&#x5BF9;OP_RETURN&#x6570;&#x636E;&#x7684;&#x5185;&#x5BB9;&#x4F7F;&#x7528;&#x4E0D;&#x540C;&#x7684;&#x7F16;&#x7801;&#x3002;&#x5305;&#x542B;OP_RETURN&#x7684;&#x8F93;&#x51FA;&#x79F0;&#x4E3A;<em>&#x6807;&#x8BB0;&#x8F93;&#x51FA;</em>&#x3002;</p>
<p>&#x8F93;&#x51FA;&#x7684;&#x987A;&#x5E8F;&#x548C;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x7684;&#x4F4D;&#x7F6E;&#x5728;&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x4E2D;&#x53EF;&#x80FD;&#x5177;&#x6709;&#x7279;&#x6B8A;&#x542B;&#x4E49;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5728;Open Assets&#x4E2D;&#xFF0C;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x4E4B;&#x524D;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#x90FD;&#x4EE3;&#x8868;&#x8D44;&#x4EA7;&#x53D1;&#x884C;&#x3002;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x540E;&#x7684;&#x4EFB;&#x4F55;&#x8F93;&#x51FA;&#x8868;&#x793A;&#x8D44;&#x4EA7;&#x8F6C;&#x8D26;&#x3002;&#x901A;&#x8FC7;&#x53C2;&#x8003;&#x5404;&#x4E2A;&#x8F93;&#x51FA;&#x5728;&#x8F6C;&#x8D26;&#x4E2D;&#x7684;&#x987A;&#x5E8F;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x5C06;&#x7279;&#x5B9A;&#x503C;&#x548C;&#x989C;&#x8272;&#x5206;&#x914D;&#x7ED9;&#x5176;&#x4ED6;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5728;Colored Coins (Colu)&#x4E2D;&#xFF0C;&#x901A;&#x8FC7;&#x6BD4;&#x8F83;&#xFF0C;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x7F16;&#x7801;&#x4E00;&#x4E2A;&#x5B9A;&#x4E49;&#x5143;&#x6570;&#x636E;&#x8BE5;&#x5982;&#x4F55;&#x88AB;&#x7406;&#x89E3;&#x7684;&#x64CD;&#x4F5C;&#x7801;&#x3002;&#x64CD;&#x4F5C;&#x7801;0x01&#x81F3;0x0F&#x8868;&#x793A;&#x53D1;&#x884C;&#x4EA4;&#x6613;&#x3002;&#x53D1;&#x884C;&#x64CD;&#x4F5C;&#x7801;&#x901A;&#x5E38;&#x540E;&#x9762;&#x662F;&#x8D44;&#x4EA7;ID&#x6216;&#x53EF;&#x7528;&#x4E8E;&#x4ECE;&#x5916;&#x90E8;&#x6765;&#x6E90;&#xFF08;&#x4F8B;&#x5982;bittorrent&#xFF09;&#x53D6;&#x5F97;&#x8D44;&#x4EA7;&#x4FE1;&#x606F;&#x7684;&#x5176;&#x4ED6;&#x6807;&#x8BC6;&#x7B26;&#x3002;&#x64CD;&#x4F5C;&#x7801;0x10&#x5230;0x1F&#x8868;&#x793A;&#x8F6C;&#x8D26;&#x4EA4;&#x6613;&#x3002;&#x8F6C;&#x8D26;&#x4EA4;&#x6613;&#x5143;&#x6570;&#x636E;&#x5305;&#x542B;&#x7B80;&#x5355;&#x7684;&#x811A;&#x672C;&#xFF0C;&#x901A;&#x8FC7;&#x53C2;&#x8003;&#x8F93;&#x5165;&#x8F93;&#x51FA;&#x7684;&#x7D22;&#x5F15;&#xFF08;&#x987A;&#x5E8F;&#xFF09;&#xFF0C;&#x5C06;&#x7279;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x8D44;&#x4EA7;&#x4ECE;&#x8F93;&#x5165;&#x8F6C;&#x8D26;&#x5230;&#x8F93;&#x51FA;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x8F93;&#x5165;&#x548C;&#x8F93;&#x51FA;&#x7684;&#x6392;&#x5E8F;&#x5BF9;&#x811A;&#x672C;&#x7684;&#x89E3;&#x91CA;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5982;&#x679C;&#x5143;&#x6570;&#x636E;&#x592A;&#x957F;&#x800C;&#x4E0D;&#x80FD;&#x653E;&#x5165;OP_RETURN&#xFF0C;&#x5219;&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x53EF;&#x80FD;&#x4F1A;&#x4F7F;&#x7528;&#x5176;&#x4ED6;&#x201C;&#x6280;&#x5DE7;&#x201D;&#x5728;&#x4EA4;&#x6613;&#x4E2D;&#x5B58;&#x50A8;&#x5143;&#x6570;&#x636E;&#x3002;&#x793A;&#x4F8B;&#x5305;&#x62EC;&#x5C06;&#x5143;&#x6570;&#x636E;&#x653E;&#x5728;&#x5151;&#x6362;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x7D27;&#x63A5;&#x7740;OP_DROP&#x64CD;&#x4F5C;&#x7801;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x811A;&#x672C;&#x5FFD;&#x7565;&#x5143;&#x6570;&#x636E;&#x3002;&#x53E6;&#x4E00;&#x79CD;&#x88AB;&#x4F7F;&#x7528;&#x7684;&#x673A;&#x5236;&#x662F;1-N &#x591A;&#x91CD;&#x7B7E;&#x540D;&#x811A;&#x672C;&#xFF0C;&#x5176;&#x4E2D;&#x53EA;&#x6709;&#x7B2C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x662F;&#x53EF;&#x4EE5;&#x82B1;&#x8D39;&#x8F93;&#x51FA;&#x7684;&#x771F;&#x5B9E;&#x516C;&#x94A5;&#xFF0C;&#x968F;&#x540E;&#x7684;&#x201C;&#x5BC6;&#x94A5;&#x201D;&#x5219;&#x7528;&#x88AB;&#x7F16;&#x7801;&#x7684;&#x5143;&#x6570;&#x636E;&#x66FF;&#x4EE3;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x6B63;&#x786E;&#x89E3;&#x91CA;&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x5143;&#x6570;&#x636E;&#xFF0C;&#x60A8;&#x5FC5;&#x987B;&#x4F7F;&#x7528;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x6216;&#x5757;&#x8D44;&#x6E90;&#x6D4F;&#x89C8;&#x5668;&#x3002;&#x5426;&#x5219;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x4F1A;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x4E00;&#x4E2A;&#x5177;&#x6709;OP_RETURN&#x8F93;&#x51FA;&#x7684;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;&#x521B;&#x5EFA;&#x5E76;&#x53D1;&#x884C;&#x4E86;MasterBTC&#x8D44;&#x4EA7;&#x3002; &#x201C;MasterBTC&#x201D;&#x4EE3;&#x8868;&#x4E86;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x672C;&#x4E66;&#x514D;&#x8D39;&#x62F7;&#x8D1D;&#x7684;&#x5151;&#x6362;&#x5238;&#x3002;&#x8FD9;&#x4E9B;&#x5151;&#x6362;&#x5238;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x67D3;&#x8272;&#x5E01;&#x517C;&#x5BB9;&#x7684;&#x94B1;&#x5305;&#x8FDB;&#x884C;&#x8F6C;&#x8BA9;&#xFF0C;&#x4EA4;&#x6613;&#x548C;&#x5151;&#x6362;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x7279;&#x5B9A;&#x7684;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4F7F;&#x7528;&#x4E86;<a href="https://coinprism.info/" target="_blank">https://coinprism.info</a>&#x7684;&#x94B1;&#x5305;&#x548C;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x5B83;&#x4F7F;&#x7528;&#x4E86;Open Assets&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x3002;</p>
<p>&#x4E0B;&#x56FE;12-1<a href="https://github.com/bitcoinbook/bitcoinbook/blob/second_edition/ch12.asciidoc#the_issuance_transaction_as_viewed_on_coinprismio" target="_blank">&#x5728;coinprism.info&#x4E0A;&#x67E5;&#x770B;&#x7684;&#x53D1;&#x884C;&#x4EA4;&#x6613;</a> &#x663E;&#x793A;&#x4F7F;&#x7528;Coinprism&#x5757;&#x6D4F;&#x89C8;&#x5668;&#x7684;&#x53D1;&#x884C;&#x4EA4;&#x6613;&#xFF1A;[(<a href="https://www.coinprism.info/tx/10d7c4e022f35288779be6713471151ede967caaa39eecd35296aa36d9c109ec" target="_blank">https://www.coinprism.info/tx/10d7c4e022f35288779be6713471151ede967caaa39eecd35296aa36d9c109ec</a>)</p>
<p><a href="https://camo.githubusercontent.com/cc017b7221e56cee73004872939642275a481f2d/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d356531343361613431616165343239642e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/cc017b7221e56cee73004872939642275a481f2d/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d356531343361613431616165343239642e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-1. &#x5728;coinprism.info&#x4E0A;&#x67E5;&#x770B;&#x7684;&#x53D1;&#x884C;&#x4EA4;&#x6613;"></a>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#x90A3;&#x6837;&#xFF0C;coinprism&#x663E;&#x793A;&#x4E86;&#x53D1;&#x884C;&#x7684;20&#x4E2A;&#x201C;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x514D;&#x8D39;&#x62F7;&#x8D1D;&#x201D;&#xFF0C;&#x7B80;&#x79F0;&#x4E3A;MasterBTC&#x7684;&#x8D44;&#x4EA7;&#xFF0C;&#x53D1;&#x7ED9;&#x4E86;&#x4E00;&#x4E2A;&#x7279;&#x6B8A;&#x7684;&#x5F69;&#x8272;&#x5E01;&#x5730;&#x5740;&#xFF1A;</p>
<blockquote>
<p>akTnsDt5uzpioRST76VFRQM8q8sBFnQiwcx</p>
</blockquote>
<p><strong>&#x8B66;&#x544A;</strong>  &#x53D1;&#x9001;&#x5230;&#x8BE5;&#x5730;&#x5740;&#x7684;&#x4EFB;&#x4F55;&#x8D44;&#x91D1;&#x6216;&#x67D3;&#x8272;&#x5E01;&#x5C06;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#x3002; &#x4E0D;&#x8981;&#x53D1;&#x9001;&#x5230;&#x8FD9;&#x4E2A;&#x793A;&#x4F8B;&#x5730;&#x5740;&#xFF01;</p>
<p>&#x53D1;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x4EA4;&#x6613;ID&#x662F;&#x201C;&#x6B63;&#x5E38;&#x201D;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;ID&#x3002;&#x4E0B;&#x56FE;12-2<strong><a href="https://github.com/bitcoinbook/bitcoinbook/blob/second_edition/ch12.asciidoc#the_issuance_transaction_on_a_block" target="_blank">&#x4E0D;&#x5BF9;&#x67D3;&#x8272;&#x5E01;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x53D1;&#x884C;&#x4EA4;&#x6613;</a></strong> &#x663E;&#x793A;&#x540C;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#xFF08;&#x548C;12.1&#x540C;&#x4E00;&#x7B14;&#xFF09;&#x5728;&#x4E0D;&#x4F1A;&#x5BF9;&#x533A;&#x5757;&#x94FE;&#x89E3;&#x7801;&#x7684;&#x533A;&#x5757;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x6837;&#x5B50;&#x3002; &#x6211;&#x4EEC;&#x5C06;&#x4F7F;&#x7528;blockchain.info&#xFF1A;<a href="https://blockchain.info/tx/10d7c4e022f35288779be6713471151ede967caaa39eecd35296aa36d9c109ec" target="_blank">https://blockchain.info/tx/10d7c4e022f35288779be6713471151ede967caaa39eecd35296aa36d9c109ec</a></p>
<p><a href="https://camo.githubusercontent.com/b6a382a9268ff42d277fbfb3115aa2c360eed6d8/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d626262343238393438303633643232332e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/b6a382a9268ff42d277fbfb3115aa2c360eed6d8/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d626262343238393438303633643232332e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-2. &#x4E0D;&#x5BF9;&#x67D3;&#x8272;&#x5E01;&#x8FDB;&#x884C;&#x89E3;&#x7801;&#x7684;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x770B;&#x5230;&#x7684;&#x53D1;&#x884C;&#x4EA4;&#x6613;"></a>&#x6B63;&#x5982;&#x4F60;&#x6240;&#x770B;&#x5230;&#x7684;&#xFF0C;blockchain.info&#x4E0D;&#x8BA4;&#x4E3A;&#x8FD9;&#x662F;&#x4E00;&#x4E2A;&#x67D3;&#x8272;&#x5E01;&#x4EA4;&#x6613;&#x3002; &#x4E8B;&#x5B9E;&#x4E0A;&#xFF0C;&#x5B83;&#x4EE5;&#x7EA2;&#x8272;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x201C;&#x65E0;&#x6CD5;&#x89E3;&#x7801;&#x8F93;&#x51FA;&#x5730;&#x5740;&#x201D;&#x3002;</p>
<p>&#x5982;&#x679C;&#x60A8;&#x5728;&#x8BE5;&#x5C4F;&#x5E55;&#x4E0A;&#x9009;&#x62E9;&#x201C;&#x663E;&#x793A;&#x811A;&#x672C;&#x548C;coinbase&#x201D;&#xFF0C;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x6709;&#x5173;&#x4EA4;&#x6613;&#x7684;&#x66F4;&#x591A;&#x8BE6;&#x7EC6;&#x4FE1;&#x606F;(&#x4E0B;&#x56FE;12-3 <a href="https://github.com/bitcoinbook/bitcoinbook/blob/second_edition/ch12.asciidoc#the_scripts_in_the_issuance_transaction" target="_blank">&#x53D1;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x811A;&#x672C;</a>).</p>
<p><a href="https://camo.githubusercontent.com/e5062914700116046992086abfce4a4293499a2c/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d343063306334336639646338663964652e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/e5062914700116046992086abfce4a4293499a2c/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d343063306334336639646338663964652e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-3. &#x53D1;&#x884C;&#x4EA4;&#x6613;&#x7684;&#x811A;&#x672C;"></a>&#x518D;&#x6B21;&#xFF0C;blockchain.info&#x5E76;&#x4E0D;&#x80FD;&#x7406;&#x89E3;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x3002; &#x5B83;&#x4EE5;&#x7EA2;&#x8272;&#x5B57;&#x6BCD;&#x8868;&#x793A;&#x201C;&#x5947;&#x602A;&#x201D;&#x3002; &#x4F46;&#x662F;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x6807;&#x8BB0;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x4E00;&#x4E9B;&#x5143;&#x6570;&#x636E;&#x662F;&#x53EF;&#x8BFB;&#x7684;&#xFF1A;</p>
<pre><code>OP\_RETURN 4f41010001141b753d68747470733a2f2f6370722e736d2f466f796b777248365559\(decoded\) &quot;OAu=[https://cpr.sm/FoykwrH6UY](https://cpr.sm/FoykwrH6UY)
</code></pre><p>&#x8BA9;&#x6211;&#x4EEC;&#x4F7F;&#x7528;bitcoin-cli&#x68C0;&#x7D22;&#x4EA4;&#x6613;&#xFF1A;</p>
<pre><code>$ bitcoin-cli decoderawtransaction`bitcoin-cli getrawtransaction 10d7c4e022f35288779be6713471151ede967caaa39eecd35296aa36d9c109ec
</code></pre><p>&#x5265;&#x79BB;&#x5176;&#x4F59;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>{
    &quot;value&quot;: 0.00000000,
    &quot;n&quot;: 1,
    &quot;scriptPubKey&quot;: &quot;OP\_RETURN 4f41010001141b753d68747470733a2f2f6370722e736d2f466f796b777248365559&quot;
}
</code></pre><p>&#x524D;&#x7F00;4F41&#x8868;&#x793A;&#x5B57;&#x6BCD;&#x201C;OA&#x201D;&#xFF0C;&#x4EE3;&#x8868;&#x201C;Open Assets&#x201D;&#xFF0C;&#x5E76;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x786E;&#x5B9A;&#x4EE5;&#x4E0B;&#x5143;&#x6570;&#x636E;&#x662F;&#x7531;Open Assets&#x534F;&#x8BAE;&#x5B9A;&#x4E49;&#x7684;&#x7D27;&#x63A5;&#x7740;&#x7684;ASCII&#x7F16;&#x7801;&#x7684;&#x5B57;&#x7B26;&#x4E32;&#x662F;&#x6307;&#x5411;&#x8D44;&#x4EA7;&#x5B9A;&#x4E49;&#x7684;&#x94FE;&#x63A5;&#xFF1A;</p>
<pre><code>u=[https://cpr.sm/FoykwrH6UY](https://cpr.sm/FoykwrH6UY)
</code></pre><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x68C0;&#x7D22;&#x6B64;URL&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x83B7;&#x5F97;JSON&#x7F16;&#x7801;&#x7684;&#x8D44;&#x4EA7;&#x5B9A;&#x4E49;&#xFF0C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>{
    &quot;asset\_ids&quot;: \[
    &quot;AcuRVsoa81hoLHmVTNXrRD8KpTqUXeqwgH&quot;
    \],
    &quot;contract\_url&quot;: null,
    &quot;name\_short&quot;: &quot;MasterBTC&quot;,
    &quot;name&quot;: &quot;Free copy of \&quot;Mastering Bitcoin\&quot;&quot;,
    &quot;issuer&quot;: &quot;Andreas M. Antonopoulos&quot;,
    &quot;description&quot;: &quot;This token is redeemable for a free copy of the book \&quot;Mastering Bitcoin\&quot;&quot;,
    &quot;description\_mime&quot;: &quot;text/x-markdown; charset=UTF-8&quot;,
    &quot;type&quot;: &quot;Other&quot;,
    &quot;divisibility&quot;: 0,
    &quot;link\_to\_website&quot;: false,
    &quot;icon\_url&quot;: null,
    &quot;image\_url&quot;: null,
    &quot;version&quot;: &quot;1.0&quot;
}
</code></pre><h2 id="125&#x5408;&#x7EA6;&#x5E01;&#xFF08;counterparty&#xFF09;">12.5&#x5408;&#x7EA6;&#x5E01;&#xFF08;Counterparty&#xFF09;</h2>
<p>&#x5408;&#x7EA6;&#x5E01;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E4B;&#x4E0A;&#x5EFA;&#x7ACB;&#x7684;&#x534F;&#x8BAE;&#x5C42;&#x3002;&#x4E0E;&#x201C;&#x67D3;&#x8272;&#x5E01;&#x201D;&#x7C7B;&#x4F3C;&#x7684;&#x201C;&#x5408;&#x7EA6;&#x5E01;&#x534F;&#x8BAE;&#x201D;&#x63D0;&#x4F9B;&#x4E86;&#x521B;&#x5EFA;&#x548C;&#x4EA4;&#x6613;&#x865A;&#x62DF;&#x8D44;&#x4EA7;&#x548C;&#x4EE3;&#x5E01;&#x7684;&#x80FD;&#x529B;&#x3002;&#x6B64;&#x5916;&#xFF0C;&#x5408;&#x7EA6;&#x5E01;&#x63D0;&#x4F9B;&#x4E86;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x8D44;&#x4EA7;&#x4EA4;&#x6362;&#x3002;&#x5408;&#x7EA6;&#x5E01;&#x8FD8;&#x5728;&#x5B9E;&#x65BD;&#x57FA;&#x4E8E;Ethereum&#x865A;&#x62DF;&#x673A;&#xFF08;EVM&#xFF09;&#x7684;&#x667A;&#x80FD;&#x5408;&#x540C;&#x3002;</p>
<p>&#x50CF;&#x67D3;&#x8272;&#x5E01;&#x534F;&#x8BAE;&#x4E00;&#x6837;&#xFF0C;&#x5408;&#x7EA6;&#x5E01;&#x4F7F;&#x7528;OP_RETURN&#x64CD;&#x4F5C;&#x7801;&#x6216;1-N&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x7684;&#x516C;&#x94A5;&#x5730;&#x5740;&#x5C06;&#x5143;&#x6570;&#x636E;&#x5D4C;&#x5165;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#xFF0C;&#x8BE5;&#x5730;&#x5740;&#x7528;&#x4E8E;&#x4EE3;&#x66FF;&#x516C;&#x5171;&#x5BC6;&#x94A5;&#x8FDB;&#x884C;&#x5143;&#x6570;&#x636E;&#x7F16;&#x7801;&#x3002;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x673A;&#x5236;&#xFF0C;&#x5408;&#x7EA6;&#x5E01;&#x5B9E;&#x73B0;&#x4E86;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x7F16;&#x7801;&#x7684;&#x534F;&#x8BAE;&#x5C42;&#x3002;&#x989D;&#x5916;&#x7684;&#x534F;&#x8BAE;&#x5C42;&#x53EF;&#x4EE5;&#x7531;&#x80FD;&#x7406;&#x89E3;&#x5408;&#x7EA6;&#x5E01;&#x7684;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x6765;&#x89E3;&#x8BFB;&#xFF0C;&#x5982;&#x94B1;&#x5305;&#x548C;&#x533A;&#x5757;&#x94FE;&#x6D4F;&#x89C8;&#x5668;&#xFF0C;&#x6216;&#x4F7F;&#x7528;&#x5408;&#x7EA6;&#x5E01;&#x5E93;&#xFF08;library&#xFF09;&#x6784;&#x5EFA;&#x7684;&#x4EFB;&#x4F55;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;</p>
<p>&#x53CD;&#x8FC7;&#x6765;&#x5408;&#x7EA6;&#x5E01;&#x53EF;&#x4EE5;&#x7528;&#x4F5C;&#x7ED9;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x548C;&#x670D;&#x52A1;&#x7684;&#x5E73;&#x53F0;&#x3002;&#x4F8B;&#x5982;&#xFF0C;Tokenly&#x662F;&#x4E00;&#x4E2A;&#x5EFA;&#x7ACB;&#x5728;&#x5408;&#x7EA6;&#x5E01;&#x4E4B;&#x4E0A;&#x7684;&#x5E73;&#x53F0;&#xFF0C;&#x5141;&#x8BB8;&#x5185;&#x5BB9;&#x521B;&#x4F5C;&#x8005;&#xFF0C;&#x827A;&#x672F;&#x5BB6;&#x548C;&#x516C;&#x53F8;&#x53D1;&#x884C;&#x8868;&#x8FBE;&#x6570;&#x5B57;&#x6240;&#x6709;&#x6743;&#x7684;&#x4EE3;&#x5E01;&#xFF0C;&#x5E76;&#x53EF;&#x7528;&#x4E8E;&#x79DF;&#x8D41;&#xFF0C;&#x8BBF;&#x95EE;&#xFF0C;&#x4EA4;&#x6613;&#x6216;&#x8D2D;&#x4E70;&#x5185;&#x5BB9;&#xFF0C;&#x4EA7;&#x54C1;&#x548C;&#x670D;&#x52A1;&#x3002;&#x5229;&#x7528;&#x4EA4;&#x6613;&#x5408;&#x7EA6;&#x5E01;&#x7684;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x5305;&#x62EC;&#x6E38;&#x620F;&#xFF08;Spells of Genesis&#xFF09;&#x548C;&#x7F51;&#x683C;&#x8BA1;&#x7B97;&#x9879;&#x76EE;&#xFF08;(Folding Coin&#xFF09;&#x3002;</p>
<p>&#x66F4;&#x591A;&#x5173;&#x4E8E;&#x5408;&#x7EA6;&#x5E01;&#x7684;&#x5185;&#x5BB9;&#x53C2;&#x89C1;<a href="https://counterparty.io/" target="_blank">https://counterparty.io</a>&#x3002;&#x5F00;&#x6E90;&#x9879;&#x76EE;&#x53EF;&#x4EE5;&#x5728;<a href="https://github.com/CounterpartyXCP" target="_blank">https://github.com/CounterpartyXCP</a>&#x4E2D;&#x627E;&#x5230;&#x3002;</p>
<h2 id="126&#x652F;&#x4ED8;&#x901A;&#x9053;&#x548C;&#x72B6;&#x6001;&#x901A;&#x9053;">12.6&#x652F;&#x4ED8;&#x901A;&#x9053;&#x548C;&#x72B6;&#x6001;&#x901A;&#x9053;</h2>
<p>&#x652F;&#x4ED8;&#x901A;&#x9053;&#x662F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E4B;&#x5916;&#x53CC;&#x65B9;&#x4E4B;&#x95F4;&#x4EA4;&#x6362;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x7684;&#x65E0;&#x4FE1;&#x4EFB;&#x673A;&#x5236;&#x3002;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7ED3;&#x7B97;&#xFF0C;&#x5219;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x7136;&#x800C;&#x4ED6;&#x4EEC;&#x5374;&#x662F;&#x5728;&#x94FE;&#x5916;&#x88AB;&#x6301;&#x6709;&#x7684;&#xFF0C;&#x4EE5;&#x671F;&#x7968;&#x7684;&#x5F62;&#x5F0F;&#x7B49;&#x5F85;&#x6700;&#x7EC8;&#x6279;&#x91CF;&#x7ED3;&#x7B97;&#x3002;&#x7531;&#x4E8E;&#x4EA4;&#x6613;&#x5C1A;&#x672A;&#x7ED3;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x6CA1;&#x6709;&#x901A;&#x5E38;&#x7684;&#x7ED3;&#x7B97;&#x5EF6;&#x8FDF;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x8FDB;&#x884C;&#x4EA4;&#x6362;&#xFF0C;&#x4ECE;&#x800C;&#x53EF;&#x4EE5;&#x6EE1;&#x8DB3;&#x6781;&#x9AD8;&#x7684;&#x4EA4;&#x6613;&#x541E;&#x5410;&#x91CF;&#xFF0C;&#x4F4E;&#xFF08;&#x4E9A;&#x6BEB;&#x79D2;&#xFF09;&#x5EF6;&#x8FDF;&#x548C;&#x7CBE;&#x7EC6;&#xFF08;satoshi&#x7EA7;&#xFF09;&#x7C92;&#x5EA6;&#x3002;</p>
<p>&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;<em>&#x901A;&#x9053;</em> &#x4E00;&#x8BCD;&#x662F;&#x4E00;&#x4E2A;&#x6BD4;&#x55BB;&#x3002;&#x72B6;&#x6001;&#x901A;&#x9053;&#x662F;&#x533A;&#x5757;&#x94FE;&#x5916;&#xFF0C;&#x7531;&#x53CC;&#x65B9;&#x4E4B;&#x95F4;&#x7684;&#x4EA4;&#x6362;&#x72B6;&#x6001;&#x4EE3;&#x8868;&#x7684;&#x865A;&#x62DF;&#x7ED3;&#x6784;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x6CA1;&#x6709;&#x201C;&#x6E20;&#x9053;&#x201D;&#xFF0C;&#x5E95;&#x5C42;&#x6570;&#x636E;&#x4F20;&#x8F93;&#x673A;&#x5236;&#x5E76;&#x4E0D;&#x662F;&#x6E20;&#x9053;&#x3002;&#x6211;&#x4EEC;&#x4F7F;&#x7528;&#x901A;&#x9053;&#x8FD9;&#x4E2A;&#x672F;&#x8BED;&#x6765;&#x8868;&#x793A;&#x94FE;&#x5916;&#x53CC;&#x65B9;&#x4E4B;&#x95F4;&#x7684;&#x5173;&#x7CFB;&#x548C;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8FDB;&#x4E00;&#x6B65;&#x89E3;&#x91CA;&#x8FD9;&#x4E2A;&#x6982;&#x5FF5;&#xFF0C;&#x60F3;&#x4E00;&#x60F3;TCP&#x6D41;&#x3002;&#x4ECE;&#x9AD8;&#x5C42;&#x534F;&#x8BAE;&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x4E2A;&#x6A2A;&#x8DE8;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#x4E24;&#x4E2A;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x7684;&#x201C;socket&#x201D;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x60A8;&#x67E5;&#x770B;&#x7F51;&#x7EDC;&#x6D41;&#x91CF;&#xFF0C;TCP&#x6D41;&#x53EA;&#x662F;IP&#x6570;&#x636E;&#x5305;&#x4E4B;&#x4E0A;&#x7684;&#x865A;&#x62DF;&#x901A;&#x9053;&#x3002; TCP&#x6D41;&#x7684;&#x6BCF;&#x4E2A;&#x7AEF;&#x70B9;&#x901A;&#x8FC7;&#x6392;&#x5E8F;&#x5E76;&#x7EC4;&#x88C5;IP&#x6570;&#x636E;&#x5305;&#x4EE5;&#x4EA7;&#x751F;&#x5B57;&#x8282;&#x6D41;&#x7684;&#x9519;&#x89C9;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x5728;&#x80CC;&#x540E;&#xFF0C;&#x6240;&#x6709;&#x7684;&#x6570;&#x636E;&#x5305;&#x90FD;&#x662F;&#x65AD;&#x5F00;&#x5206;&#x6563;&#x7684;&#x3002;&#x540C;&#x7406;&#xFF0C;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x53EA;&#x662F;&#x4E00;&#x7CFB;&#x5217;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x59A5;&#x5584;&#x6392;&#x5E8F;&#x548C;&#x8FDE;&#x63A5;&#xFF0C;&#x5373;&#x4F7F;&#x60A8;&#x4E0D;&#x4FE1;&#x4EFB;&#x901A;&#x9053;&#x7684;&#x53E6;&#x4E00;&#x65B9;&#xFF0C;&#xFF08;&#x7ECF;&#x8FC7;&#x6392;&#x5E8F;&#x8FDE;&#x63A5;&#x540E;&#x7684;&#x4EA4;&#x6613;&#xFF09;&#x4E5F;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x53EF;&#x4EE5;&#x4FE1;&#x4EFB;&#x7684;&#x53EF;&#x5151;&#x6362;&#x7684;&#x503A;&#x52A1;&#x3002;</p>
<p>&#x5728;&#x672C;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4ECB;&#x7ECD;&#x5404;&#x79CD;&#x5F62;&#x5F0F;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002;&#x9996;&#x5148;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x68C0;&#x89C6;&#x7528;&#x4E8E;&#x6784;&#x5EFA;&#x8BA1;&#x91CF;&#x5C0F;&#x989D;&#x652F;&#x4ED8;&#x670D;&#x52A1;&#xFF08;&#x5982;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#xFF09;&#x7684;&#x5355;&#x884C;&#xFF08;&#x5355;&#x5411;&#xFF09;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x673A;&#x5236;&#x3002;&#x7136;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x6269;&#x5927;&#x8FD9;&#x4E00;&#x673A;&#x5236;&#xFF0C;&#x5F15;&#x5165;&#x53CC;&#x5411;&#x4ED8;&#x8D39;&#x6E20;&#x9053;&#x3002;&#x6700;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x770B;&#x9996;&#x5148;&#x5728; <em>&#x95EA;&#x7535;&#x7F51;&#x7EDC;</em> &#x4E2D;&#x63D0;&#x51FA;&#x7684;&#xFF0C;&#x5982;&#x4F55;&#x5C06;&#x8DEF;&#x7531;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x53CC;&#x5411;&#x901A;&#x9053;&#x7AEF;&#x5230;&#x7AEF;&#x94FE;&#x63A5;&#x4ECE;&#x800C;&#x5F62;&#x6210;&#x591A;&#x8DF3;&#x901A;&#x9053;&#x3002;</p>
<p>&#x652F;&#x4ED8;&#x901A;&#x9053;&#x662F; &#x72B6;&#x6001;&#x901A;&#x9053;&#x7684;&#x5F15;&#x7533;&#x6982;&#x5FF5;&#x4E4B;&#x4E00;&#xFF0C;&#x4EE3;&#x8868;&#x4E86;&#x94FE;&#x5916;&#x72B6;&#x6001;&#x7684;&#x53D8;&#x5316;&#xFF0C;&#x901A;&#x8FC7;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x6700;&#x7EC8;&#x7684;&#x7ED3;&#x7B97;&#x5F97;&#x5230;&#x4FDD;&#x969C;&#x3002;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x662F;&#x4E00;&#x79CD;&#x72B6;&#x6001;&#x901A;&#x9053;&#xFF0C;&#x5176;&#x4E2D;&#x88AB;&#x6539;&#x53D8;&#x7684;&#x72B6;&#x6001;&#x662F;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#x4F59;&#x989D;&#x3002;</p>
<h3 id="1261&#x72B6;&#x6001;&#x901A;&#x9053;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;">12.6.1&#x72B6;&#x6001;&#x901A;&#x9053;&#x57FA;&#x672C;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;</h3>
<p>&#x901A;&#x8FC7;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x5728;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x6240;&#x9501;&#x5B9A;&#x7684;&#x5171;&#x4EAB;&#x72B6;&#x6001;&#xFF0C;&#x5728;&#x4EA4;&#x6613;&#x4E24;&#x65B9;&#x4E4B;&#x95F4;&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x901A;&#x9053;&#x3002;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x6216;&#x951A;&#x70B9;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x4F20;&#x9001;&#x5230;&#x7F51;&#x7EDC;&#x5E76;&#x5F00;&#x59CB;&#x6316;&#x77FF;&#x88AB;&#x6316;&#x77FF;&#x786E;&#x8BA4;&#x4EE5;&#x5EFA;&#x7ACB;&#x901A;&#x9053;&#x3002;&#x5728;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x793A;&#x4F8B;&#x4E2D;&#xFF0C;&#x9501;&#x5B9A;&#x7684;&#x72B6;&#x6001;&#x5373;&#x4E3A;&#x901A;&#x9053;&#x7684;&#x521D;&#x59CB;&#x4F59;&#x989D;&#xFF08;&#x4EE5;&#x8D27;&#x5E01;&#x8BA1;&#xFF09;&#x3002;</p>
<p>&#x968F;&#x540E;&#x53CC;&#x65B9;&#x4EA4;&#x6362;&#x5DF2;&#x7B7E;&#x540D;&#x7684;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x201D;&#x3002;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4F1A;&#x6539;&#x53D8;&#x521D;&#x59CB;&#x72B6;&#x6001;&#x3002;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x63D0;&#x4EA4;&#x7ED3;&#x7B97;&#x7684;&#x8BF7;&#x6C42;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x7B49;&#x5230;&#x901A;&#x9053;&#x5173;&#x95ED;&#x518D;&#x505A;&#x7ED3;&#x7B97;&#x3002;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x7ED9;&#x5BF9;&#x65B9;&#x521B;&#x5EFA;&#x3001;&#x7B7E;&#x540D;&#x548C;&#x53D1;&#x9001;&#x4EA4;&#x6613;&#x65F6;&#x5C31;&#x4F1A;&#x66F4;&#x65B0;&#x72B6;&#x6001;&#x3002;&#x5B9E;&#x8DF5;&#x4E2D;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x6BCF;&#x79D2;&#x53EF;&#x8FDB;&#x884C;&#x6570;&#x5343;&#x7B14;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x5F53;&#x4EA4;&#x6362;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x53CC;&#x65B9;&#x540C;&#x65F6;&#x5E9F;&#x6B62;&#x4E4B;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x5982;&#x6B64;&#x4E00;&#x6765;&#x6700;&#x65B0;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x603B;&#x662F;&#x552F;&#x4E00;&#x53EF;&#x4EE5;&#x8D4E;&#x56DE;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x8FD9;&#x6837;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x5728;&#x901A;&#x9053;&#x4E2D;&#x67D0;&#x4E2A;&#x5148;&#x524D;&#x72B6;&#x6001;&#x6BD4;&#x6700;&#x65B0;&#x72B6;&#x6001;&#x66F4;&#x6709;&#x5229;&#x4E8E;&#x5DF1;&#x65B9;&#x7684;&#x65F6;&#x5019;&#x901A;&#x8FC7;&#x5355;&#x65B9;&#x9762;&#x5173;&#x95ED;&#x901A;&#x9053;&#x6765;&#x8FDB;&#x884C;&#x6B3A;&#x9A97;&#x3002;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x672C;&#x7AE0;&#x7684;&#x5176;&#x4F59;&#x90E8;&#x5206;&#x4E2D;&#x68C0;&#x89C6;&#x53EF;&#x7528;&#x4E8E;&#x5E9F;&#x6B62;&#x5148;&#x524D;&#x72B6;&#x6001;&#x7684;&#x5404;&#x79CD;&#x673A;&#x5236;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x901A;&#x9053;&#x53EF;&#x4EE5;&#x5408;&#x4F5C;&#x5173;&#x95ED;&#xFF0C;&#x5373;&#x5411;&#x533A;&#x5757;&#x94FE;&#x63D0;&#x4EA4;&#x6700;&#x540E;&#x7684;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#xFF0C;&#x6216;&#x8005;&#x5355;&#x65B9;&#x9762;&#x7531;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x63D0;&#x4EA4;&#x6700;&#x540E;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5230;&#x94FE;&#x4E0A;&#x3002;&#x5355;&#x65B9;&#x9762;&#x5173;&#x95ED;&#x7684;&#x9009;&#x9879;&#x662F;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x4EE5;&#x9632;&#x4E07;&#x4E00;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x4E00;&#x65B9;&#x610F;&#x5916;&#x65AD;&#x5F00;&#x8FDE;&#x63A5;&#x3002;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x4EE3;&#x8868;&#x901A;&#x9053;&#x7684;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#xFF0C;&#x5E76;&#x5728;&#x94FE;&#x4E0A;&#x8FDB;&#x884C;&#x7ED3;&#x7B97;&#x3002;</p>
<p>&#x5728;&#x901A;&#x9053;&#x7684;&#x6574;&#x4E2A;&#x751F;&#x547D;&#x5468;&#x671F;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x9700;&#x8981;&#x63D0;&#x4EA4;&#x7ED9;&#x94FE;&#x4E0A;&#x8FDB;&#x884C;&#x6316;&#x77FF;&#xFF1A;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x548C;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x8FD9;&#x4E24;&#x4E2A;&#x72B6;&#x6001;&#x4E4B;&#x95F4;&#xFF0C;&#x53CC;&#x65B9;&#x53EF;&#x4EE5;&#x4EA4;&#x6362;&#x4EFB;&#x4F55;&#x6570;&#x91CF;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4EBA;&#x6C38;&#x8FDC;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#xFF0C;&#x4E5F;&#x4E0D;&#x4F1A;&#x63D0;&#x4EA4;&#x5230;&#x94FE;&#x4E0A;&#x3002;</p>
<p>&#x4E0B;&#x56FE;12-4&#x8BF4;&#x660E;&#x4E86;Bob&#x548C;Alice&#x4E4B;&#x95F4;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF0C;&#x663E;&#x793A;&#x4E86;&#x8D44;&#x91D1;&#xFF0C;&#x627F;&#x8BFA;&#x548C;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x3002;</p>
<p><a href="https://camo.githubusercontent.com/58b5342dee25c341ccf11efa48326ad6d9f1431e/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d313833643130393262656266383861302e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/58b5342dee25c341ccf11efa48326ad6d9f1431e/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d313833643130393262656266383861302e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-4. Bob&#x548C;Alice&#x4E4B;&#x95F4;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF0C;&#x663E;&#x793A;&#x4E86;&#x8D44;&#x91D1;&#xFF0C;&#x627F;&#x8BFA;&#x548C;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;"></a></p>
<h3 id="1262&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x793A;&#x4F8B;">12.6.2&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x793A;&#x4F8B;</h3>
<p>&#x8981;&#x8BF4;&#x660E;&#x72B6;&#x6001;&#x901A;&#x9053;&#xFF0C;&#x6211;&#x4EEC;&#x5FC5;&#x987B;&#x4ECE;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#x4F8B;&#x5B50;&#x5F00;&#x59CB;&#x3002; &#x6211;&#x4EEC;&#x5C55;&#x793A;&#x4E00;&#x4E2A;&#x5355;&#x5411;&#x901A;&#x9053;&#xFF0C;&#x610F;&#x5473;&#x7740;&#x4EF7;&#x503C;&#x53EA;&#x5411;&#x7740;&#x4E00;&#x4E2A;&#x65B9;&#x5411;&#x6D41;&#x52A8;&#x3002; &#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x89E3;&#x91CA;&#xFF0C;&#x6211;&#x4EEC;&#x4EE5;&#x4E00;&#x4E2A;&#x5929;&#x771F;&#x7684;&#x5047;&#x8BBE;&#x5F00;&#x59CB;&#xFF0C;&#x5047;&#x8BBE;&#x6CA1;&#x6709;&#x4EBA;&#x8981;&#x8BD5;&#x56FE;&#x6B3A;&#x9A97;&#x4ED6;&#x4EBA;&#x3002; &#x4E00;&#x65E6;&#x6211;&#x4EEC;&#x89E3;&#x91CA;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x901A;&#x9053;&#x6982;&#x5FF5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x4F1A;&#x63A5;&#x7740;&#x770B;&#x770B;&#x662F;&#x4EC0;&#x4E48;&#x4F7F;&#x5F97;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x53EF;&#x4EE5;&#x65E0;&#x4FE1;&#x4EFB;&#x5316;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x4EA4;&#x6613;&#x53CC;&#x65B9;&#x54EA;&#x6015;&#x53BB;&#x5C1D;&#x8BD5;&#x8FDB;&#x884C;&#x6B3A;&#x9A97;&#x90FD;&#x65E0;&#x6CD5;&#x6210;&#x529F;&#x3002;</p>
<p>&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x4E24;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#xFF1A;Emma&#x548C;Fabian&#x3002; Fabian&#x63D0;&#x4F9B;&#x7531;&#x5FAE;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x652F;&#x6301;&#x4EE5;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#x65F6;&#x957F;&#x8BA1;&#x8D39;&#x7684;&#x89C6;&#x9891;&#x6D41;&#x670D;&#x52A1;&#x3002;Fabian&#x6BCF;&#x79D2;&#x89C6;&#x9891;&#x6536;&#x8D39;0.01&#x6BEB;&#x6BD4;&#xFF08;millibits&#xFF09;&#xFF08;0.00001 BTC&#xFF09;&#xFF0C;&#x76F8;&#x5F53;&#x4E8E;&#x6BCF;&#x5C0F;&#x65F6;36&#x6BEB;&#x6BD4;&#xFF08;0.036 BTC&#xFF09;&#x7684;&#x89C6;&#x9891;&#x3002; Emma&#x662F;&#x4ECE;Fabian&#x90A3;&#x91CC;&#x4F7F;&#x7528;&#x4EE5;&#x79D2;&#x8BA1;&#x8D39;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x6765;&#x8D2D;&#x4E70;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#x670D;&#x52A1;&#x7684;&#x7528;&#x6237;&#x3002;&#x4E0B;&#x56FE;12-5&#x663E;&#x793A;Emma&#x4F7F;&#x7528;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4ECE;Fabian&#x8D2D;&#x4E70;&#x89C6;&#x9891;&#x6D41;&#x670D;&#x52A1;&#x3002;</p>
<p><a href="https://camo.githubusercontent.com/885c851a60310739b1ce367bc8017ea069b71e3e/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d366437393639323266333333333463312e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/885c851a60310739b1ce367bc8017ea069b71e3e/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d366437393639323266333333333463312e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-5.Emma&#x4F7F;&#x7528;&#x4EE5;&#x79D2;&#x8BA1;&#x8D39;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4ECE;Fabian&#x8D2D;&#x4E70;&#x89C6;&#x9891;&#x6D41;&#x670D;&#x52A1;"></a></p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Fabian&#x548C;Emma&#x6B63;&#x5728;&#x4F7F;&#x7528;&#x4E13;&#x95E8;&#x7684;&#x5904;&#x7406;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x548C;&#x89C6;&#x9891;&#x6D41;&#x7684;&#x8F6F;&#x4EF6;&#x3002; Emma&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x8FD0;&#x884C;&#x8BE5;&#x8F6F;&#x4EF6;&#xFF0C;Fabian&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#x8FD0;&#x884C;&#x8BE5;&#x8F6F;&#x4EF6;&#x3002;&#x8BE5;&#x8F6F;&#x4EF6;&#x5305;&#x62EC;&#x57FA;&#x672C;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#x529F;&#x80FD;&#xFF0C;&#x53EF;&#x4EE5;&#x521B;&#x5EFA;&#x548C;&#x7B7E;&#x7F72;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x3002;&#x201C;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x201D;&#x7684;&#x6982;&#x5FF5;&#x548C;&#x672F;&#x8BED;&#x5BF9;&#x4E8E;&#x7528;&#x6237;&#x90FD;&#x662F;&#x5B8C;&#x5168;&#x4E0D;&#x53EF;&#x89C1;&#x7684;&#x3002;&#x4ED6;&#x4EEC;&#x770B;&#x5230;&#x7684;&#x662F;&#x4EE5;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#x652F;&#x4ED8;&#x4E86;&#x7684;&#x89C6;&#x9891;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x8BBE;&#x7F6E;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF0C;Emma&#x548C;Fabian&#x5EFA;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;2-2&#x7684;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x5730;&#x5740;&#xFF0C;&#x53CC;&#x65B9;&#x5404;&#x6301;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x3002;&#x4ECE;Emma&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5979;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x4E2D;&#x7684;&#x8F6F;&#x4EF6;&#x63D0;&#x4F9B;&#x4E86;&#x4E00;&#x4E2A;&#x5E26;&#x6709;P2SH&#x5730;&#x5740;&#x7684;&#x4E8C;&#x7EF4;&#x7801;&#xFF08;&#x4EE5;&#x201C;3&#x201D;&#x5F00;&#x5934;&#xFF09;&#xFF0C;&#x5E76;&#x8981;&#x6C42;&#x5979;&#x63D0;&#x4EA4;&#x6700;&#x591A;1&#x5C0F;&#x65F6;&#x89C6;&#x9891;&#x7684;&#x201C;&#x62BC;&#x91D1;&#x201D;&#x3002;&#x8BE5;&#x5730;&#x5740;&#x56E0;&#x800C;&#x5F97;&#x5230;&#x4E86;Emma&#x7684;&#x6CE8;&#x8D44;&#x3002;&#x652F;&#x4ED8;&#x7ED9;&#x8BE5;&#x591A;&#x91CD;&#x5730;&#x5740;&#x7684;Emma&#x4EA4;&#x6613;&#xFF0C;&#x5C31;&#x662F;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x6216;&#x951A;&#x70B9;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x5C31;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x800C;&#x8A00;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;Emma&#x652F;&#x4ED8;&#x4E86;36&#x4E2A;&#x6BEB;&#x6BD4;&#xFF08;0.036 BTC&#xFF09;&#x5230;&#x901A;&#x9053;&#x4E2D;&#x3002;&#x8FD9;&#x5C06;&#x5141;&#x8BB8;Emma&#x6D88;&#x8D39;&#x957F;&#x8FBE;1&#x5C0F;&#x65F6;&#x7684;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#x3002;&#x8FD9;&#x7B14;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x8BBE;&#x5B9A;&#x4E86;&#x53EF;&#x4EE5;&#x5728;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x4E0A;&#x53D1;&#x9001;&#x7684;&#x6700;&#x5927;&#x6570;&#x91CF;&#xFF08;&#x6570;&#x636E;&#x91CF;&#xFF09;&#xFF0C;&#x5373;&#x8BBE;&#x7F6E;&#x4E86;&#x901A;&#x9053;&#x5BB9;&#x91CF;&#x3002;</p>
<p>&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x4ECE;Emma&#x7684;&#x94B1;&#x5305;&#x4E2D;&#x6D88;&#x8017;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x4EE5;&#x96C6;&#x6210;&#x8D44;&#x91D1;&#x3002;&#x5B83;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x4EF7;&#x503C;&#x4E3A;36&#x6BEB;&#x6BD4;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x652F;&#x4ED8;&#x7ED9;Emma&#x548C;Fabian&#x4E4B;&#x95F4;&#x5171;&#x540C;&#x63A7;&#x5236;&#x7684;&#x591A;&#x91CD;&#x7B7E;&#x540D;2-2&#x5730;&#x5740;&#x3002;&#x5B83;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x4F5C;&#x4E3A;&#x627E;&#x96F6;&#x94B1;&#x5230;Emma&#x7684;&#x94B1;&#x5305;&#x7684;&#x989D;&#x5916;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x4E00;&#x65E6;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x5F97;&#x5230;&#x786E;&#x8BA4;&#xFF0C;Emma&#x53EF;&#x4EE5;&#x5F00;&#x59CB;&#x89C2;&#x770B;&#x89C6;&#x9891;&#x3002;Emma&#x7684;&#x8F6F;&#x4EF6;&#x521B;&#x5EFA;&#x5E76;&#x7B7E;&#x7F72;&#x4E00;&#x7B14;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x6539;&#x53D8;&#x901A;&#x9053;&#x4F59;&#x989D;&#xFF0C;&#x5C06;0.01&#x6BEB;&#x6BD4;&#x5F52;&#x5165;Fabian&#x7684;&#x5730;&#x5740;&#xFF0C;&#x5E76;&#x9000;&#x56DE;&#x7ED9;Emma&#x7684;35.99&#x6BEB;&#x6BD4;&#x3002;Emma&#x7B7E;&#x7F72;&#x7684;&#x4EA4;&#x6613;&#x6D88;&#x8017;&#x4E86;&#x7531;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x521B;&#x9020;&#x7684;36&#x6BEB;&#x6BD4;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#xFF1A;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x627E;&#x94B1;&#xFF0C;&#x53E6;&#x4E00;&#x4E2A;&#x7528;&#x4E8E;Fabian&#x7684;&#x4ED8;&#x6B3E;&#x3002;&#x4EA4;&#x6613;&#x53EA;&#x662F;&#x90E8;&#x5206;&#x88AB;&#x7B7E;&#x7F72;&#x4E86; - &#x5B83;&#x9700;&#x8981;&#x4E24;&#x4E2A;&#x7B7E;&#x540D;&#xFF08;2 - 2&#xFF09;&#xFF0C;&#x4F46;&#x53EA;&#x6709;Emma&#x7684;&#x7B7E;&#x540D;&#x3002;&#x5F53;Fabian&#x7684;&#x670D;&#x52A1;&#x5668;&#x63A5;&#x6536;&#x5230;&#x6B64;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x5B83;&#x4F1A;&#x6DFB;&#x52A0;&#x7B2C;&#x4E8C;&#x4E2A;&#x7B7E;&#x540D;&#xFF08;&#x7528;&#x4E8E;2-2&#x8F93;&#x5165;&#xFF09;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8FD4;&#x56DE;&#x7ED9;Emma&#x5E76;&#x9644;&#x5E26;&#x65F6;&#x957F;1&#x79D2;&#x7684;&#x89C6;&#x9891;&#x3002;&#x73B0;&#x5728;&#x53CC;&#x65B9;&#x90FD;&#x6709;&#x8C01;&#x90FD;&#x53EF;&#x4EE5;&#x5151;&#x6362;&#x7684;&#x5B8C;&#x5168;&#x7B7E;&#x7F72;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x8FD9;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4EE3;&#x8868;&#x7740;&#x901A;&#x9053;&#x4E2D;&#x7684;&#x6700;&#x65B0;&#x6B63;&#x786E;&#x4F59;&#x989D;&#x3002;&#x53CC;&#x65B9;&#x90FD;&#x4E0D;&#x4F1A;&#x5C06;&#x6B64;&#x4EA4;&#x6613;&#x5E7F;&#x64AD;&#x5230;&#x7F51;&#x7EDC;&#x4E2D;&#x3002;</p>
<p>&#x5728;&#x4E0B;&#x4E00;&#x8F6E;&#xFF0C;Emma&#x7684;&#x8F6F;&#x4EF6;&#x521B;&#x5EFA;&#x5E76;&#x7B7E;&#x7F72;&#x53E6;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF08;&#x627F;&#x8BFA;2&#x53F7;&#xFF09;&#xFF0C;&#x8BE5;&#x4EA4;&#x6613;&#x4ECE;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x4E2D;&#x6D88;&#x8017;&#x76F8;&#x540C;&#x7684;2-2&#x8F93;&#x51FA;&#x3002;&#x4E8C;&#x53F7;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5206;&#x914D;&#x4E00;&#x4E2A;0.2&#x6BEB;&#x6BD4;&#x7684;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5230;Fabian&#x7684;&#x5730;&#x5740;&#xFF0C;&#x8FD8;&#x6709;&#x4E00;&#x4E2A;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x4E3A;35.98&#x6BEB;&#x6BD4;&#xFF0C;&#x4F5C;&#x4E3A;&#x627E;&#x96F6;&#x8FD4;&#x56DE;&#x7ED9;Emma&#x7684;&#x5730;&#x5740;&#x3002;&#x8FD9;&#x4E2A;&#x65B0;&#x4EA4;&#x6613;&#x652F;&#x4ED8;&#x7684;&#x662F;&#x8FDE;&#x7EED;&#x4E24;&#x79D2;&#x7684;&#x89C6;&#x9891;&#x5185;&#x5BB9;&#x3002; Fabian&#x7684;&#x8F6F;&#x4EF6;&#x7B7E;&#x7F72;&#x5E76;&#x8FD4;&#x56DE;&#x7B2C;&#x4E8C;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x518D;&#x52A0;&#x4E0A;&#x89C6;&#x9891;&#x7684;&#x53E6;&#x4E00;&#x79D2;&#x5185;&#x5BB9;&#x3002;</p>
<p>&#x5229;&#x7528;&#x4E0A;&#x8FF0;&#x7684;&#x65B9;&#x6CD5;&#xFF0C;Emma&#x7684;&#x8F6F;&#x4EF6;&#x7EE7;&#x7EED;&#x5411;Fabian&#x7684;&#x670D;&#x52A1;&#x5668;&#x53D1;&#x9001;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x6362;&#x53D6;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#x3002;&#x56E0;&#x4E3A;Emma&#x89C2;&#x770B;&#x4E86;&#x66F4;&#x591A;&#x79D2;&#x6570;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x901A;&#x9053;&#x4E2D;&#x5C5E;&#x4E8E;Fabian&#x7684;&#x94B1;&#x9010;&#x6E10;&#x7D2F;&#x79EF;&#x53D8;&#x591A;&#x3002;&#x5047;&#x8BBE;Emma&#x89C2;&#x770B;600&#x79D2;&#xFF08;10&#x5206;&#x949F;&#xFF09;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x521B;&#x5EFA;&#x548C;&#x7B7E;&#x7F72;600&#x7B14;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x6700;&#x540E;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF08;&#xFF03;600&#xFF09;&#x5C06;&#x6709;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#xFF0C;&#x5C06;&#x901A;&#x9053;&#x7684;&#x4F59;&#x989D;&#x5206;&#x6210;&#x4E24;&#x534A;&#xFF0C;&#x5206;&#x522B;&#x4E3A;6&#x6BEB;&#x6BD4;&#x5C5E;&#x4E8E;Fabian&#x548C;30&#x6BEB;&#x6BD4;&#x5C5E;&#x4E8E;Emma&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;Emma&#x70B9;&#x51FB;&#x201C;&#x505C;&#x6B62;&#x201D;&#x505C;&#x6B62;&#x6D41;&#x5A92;&#x4F53;&#x89C6;&#x9891;&#x3002; Fabian&#x6216;Emma&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x6700;&#x7EC8;&#x72B6;&#x6001;&#x4EA4;&#x6613;&#x4EE5;&#x8FDB;&#x884C;&#x7ED3;&#x7B97;&#x3002;&#x6700;&#x540E;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x5373;&#x4E3A;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#xFF0C;&#x5411;Fabian&#x652F;&#x4ED8;&#x6240;&#x6709;Emma&#x6D88;&#x8D39;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x5E76;&#x5411;Emma&#x9000;&#x8FD8;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x4E2D;&#x5269;&#x4F59;&#x7684;&#x8D44;&#x91D1;&#x3002;</p>
<p>&#x56FE;12-6&#x663E;&#x793A;&#x4E86;Emma&#x548C;Fabian&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4EE5;&#x53CA;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x4F59;&#x989D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x8BB0;&#x5F55;&#x5728;&#x5757;&#x4E0A;&#xFF1A;&#x5EFA;&#x7ACB;&#x901A;&#x9053;&#x7684;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x548C;&#x5728;&#x4E24;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x4E4B;&#x95F4;&#x6B63;&#x786E;&#x5206;&#x914D;&#x6700;&#x7EC8;&#x4F59;&#x989D;&#x7684;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x3002;</p>
<p><a href="https://camo.githubusercontent.com/e30ea2c45783d671e8049e962be307ac5b2c7df5/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d343961623438383339383634643430642e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/e30ea2c45783d671e8049e962be307ac5b2c7df5/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d343961623438383339383634643430642e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-6 Emma&#x548C;Fabian&#x4E4B;&#x95F4;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF0C;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4E0D;&#x65AD;&#x7684;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x4F59;&#x989D;"></a></p>
<h3 id="1263&#x5236;&#x9020;&#x65E0;&#x9700;&#x4FE1;&#x4EFB;&#x7684;&#x901A;&#x9053;">12.6.3&#x5236;&#x9020;&#x65E0;&#x9700;&#x4FE1;&#x4EFB;&#x7684;&#x901A;&#x9053;</h3>
<p>&#x6211;&#x4EEC;&#x521A;&#x521A;&#x63CF;&#x8FF0;&#x7684;&#x901A;&#x9053;&#x53EA;&#x6709;&#x5728;&#x53CC;&#x65B9;&#x5408;&#x4F5C;&#xFF0C;&#x6CA1;&#x6709;&#x4EFB;&#x4F55;&#x5931;&#x8D25;&#x6216;&#x4F01;&#x56FE;&#x6B3A;&#x9A97;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x5DE5;&#x4F5C;&#x3002;&#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x7834;&#x574F;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x4E00;&#x4E9B;&#x573A;&#x666F;&#xFF0C;&#x5E76;&#x4E14;&#x770B;&#x770B;&#x9700;&#x8981;&#x4EC0;&#x4E48;&#x6765;&#x4FEE;&#x590D;&#x8FD9;&#x7C7B;&#x573A;&#x666F;&#xFF1A;</p>
<ul>
<li>&#x4E00;&#x65E6;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#xFF0C;Emma&#x9700;&#x8981;Fabian&#x7684;&#x7B7E;&#x540D;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x7ED9;&#x81EA;&#x5DF1;&#x7684;&#x627E;&#x96F6;&#x3002;&#x5982;&#x679C;Fabian&#x6D88;&#x5931;&#xFF0C;Emma&#x7684;&#x8D44;&#x91D1;&#x5C06;&#x88AB;&#x9501;&#x5B9A;&#x5728;2-2&#x4E2D;&#xFF0C;&#x5E76;&#x5F7B;&#x5E95;&#x635F;&#x5931;&#x3002;&#x8FD9;&#x4E2A;&#x901A;&#x9053;&#x4E00;&#x65E6;&#x5EFA;&#x7ACB;&#xFF0C;&#x5982;&#x679C;&#x5728;&#x53CC;&#x65B9;&#x5171;&#x540C;&#x7B7E;&#x7F72;&#x81F3;&#x5C11;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#xFF0C;&#x6709;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x65AD;&#x5F00;&#xFF0C;&#x5C31;&#x4F1A;&#x5BFC;&#x81F4;&#x8D44;&#x91D1;&#x7684;&#x6D41;&#x5931;&#x3002;</li>
<li>&#x5F53;&#x901A;&#x9053;&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x65F6;&#xFF0C;Emma&#x53EF;&#x4EE5;&#x91C7;&#x53D6;Fabian&#x5DF2;&#x7ECF;&#x7B7E;&#x7F72;&#x7684;&#x4EFB;&#x4F55;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x5C06;&#x5B83;&#x53D1;&#x56DE;&#x94FE;&#x4E0A;&#x3002;&#x5982;&#x679C;&#x5979;&#x53EF;&#x4EE5;&#x53D1;&#x9001;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF03;1&#xFF0C;&#x53EA;&#x652F;&#x4ED8;1&#x79D2;&#x7684;&#x89C6;&#x9891;&#xFF0C;&#x4E3A;&#x4EC0;&#x4E48;&#x8981;&#x652F;&#x4ED8;600&#x79D2;&#x7684;&#x89C6;&#x9891;&#xFF1F;&#x901A;&#x9053;&#x5931;&#x8D25;&#x662F;&#x56E0;&#x4E3A;Emma&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5E7F;&#x64AD;&#x5BF9;&#x5979;&#x6BD4;&#x8F83;&#x6709;&#x5229;&#x7684;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x6765;&#x6B3A;&#x9A97;&#x3002;</li>
</ul>
<p>&#x8FD9;&#x4E24;&#x4E2A;&#x95EE;&#x9898;&#x90FD;&#x53EF;&#x4EE5;&#x7528;&#x65F6;&#x95F4;&#x9501;(timelocks)&#x6765;&#x89E3;&#x51B3; - &#x6211;&#x4EEC;&#x6765;&#x770B;&#x770B;&#x6211;&#x4EEC;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x4EA4;&#x6613;&#x7EA7;&#x65F6;&#x95F4;&#x9501;&#xFF08;nLocktime&#xFF09;&#x3002;</p>
<p>&#x9664;&#x975E;&#x5979;&#x6709;&#x4FDD;&#x8BC1;&#x7684;&#x627E;&#x96F6;&#x9000;&#x6B3E;&#xFF0C;&#x5426;&#x5219;Emma&#x4E0D;&#x80FD;&#x5192;&#x98CE;&#x9669;&#x8FDB;&#x884C;2-of-2 &#x7B7E;&#x540D;&#x3002;&#x4E3A;&#x4E86;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;Emma&#x540C;&#x65F6;&#x5EFA;&#x7ACB;&#x4E86;&#x8D44;&#x91D1;&#x548C;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#x3002;&#x5979;&#x7B7E;&#x7F72;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#x4E0D;&#x4F20;&#x9001;&#x7ED9;&#x4EFB;&#x4F55;&#x4EBA;&#x3002;Emma&#x53EA;&#x5C06;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#x4F20;&#x9001;&#x7ED9;Fabian&#xFF0C;&#x5E76;&#x83B7;&#x5F97;&#x4ED6;&#x7684;&#x7B7E;&#x540D;&#x3002;</p>
<p>&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#x4F5C;&#x4E3A;&#x7B2C;&#x4E00;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x65F6;&#x95F4;&#x9501;&#x786E;&#x7ACB;&#x4E86;&#x901A;&#x9053;&#x751F;&#x547D;&#x7684;&#x4E0A;&#x9650;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Emma&#x53EF;&#x4EE5;&#x5C06;nLocktime&#x8BBE;&#x7F6E;&#x4E3A;30&#x5929;&#x6216;&#x5C06;&#x6765;&#x7684;&#x7B2C;4320&#x4E2A;&#x533A;&#x5757;&#x3002;&#x6240;&#x6709;&#x540E;&#x7EED;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x4EE5;&#x4FBF;&#x5728;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x80FD;&#x628A;&#x5B83;&#x4EEC;&#x8D4E;&#x56DE;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;Emma&#x5DF2;&#x7ECF;&#x6709;&#x4E00;&#x4E2A;&#x5B8C;&#x5168;&#x7B7E;&#x7F72;&#x7684;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x81EA;&#x4FE1;&#x5730;&#x53D1;&#x9001;&#x7B7E;&#x7F72;&#x8FC7;&#x7684;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x5979;&#x77E5;&#x9053;&#x5979;&#x6700;&#x7EC8;&#x53EF;&#x4EE5;&#x5728;&#x65F6;&#x95F4;&#x5230;&#x671F;&#x540E;&#x6700;&#x7EC8;&#x8D4E;&#x56DE;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#xFF0C;&#x5373;&#x4F7F;Fabian&#x6D88;&#x5931;&#x4E5F;&#x4E0D;&#x4F1A;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
<p>&#x5728;&#x901A;&#x9053;&#x751F;&#x547D;&#x4E2D;&#x53CC;&#x65B9;&#x4EA4;&#x6362;&#x7684;&#x6BCF;&#x4E00;&#x9879;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x90FD;&#x4F1A;&#x88AB;&#x65F6;&#x95F4;&#x9501;&#x9501;&#x8FDB;&#x672A;&#x6765;&#x65F6;&#x95F4;&#x70B9;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5BF9;&#x4E8E;&#x6BCF;&#x4E2A;&#x627F;&#x8BFA;&#xFF0C;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x4F1A;&#x7A0D;&#x77ED;&#x4E00;&#x70B9;&#xFF0C;&#x6240;&#x4EE5;&#x6700;&#x65B0;&#x7684;&#x627F;&#x8BFA;&#x53EF;&#x4EE5;&#x5728;&#x88AB;&#x5B83;&#x5E9F;&#x6B62;&#x7684;&#x524D;&#x4E00;&#x627F;&#x8BFA;&#x4E4B;&#x524D;&#x88AB;&#x8D4E;&#x56DE;&#xFF08;&#x8BD1;&#x8005;&#x6CE8;&#xFF1A;&#x4E0A;&#x6587;&#x63D0;&#x5230;&#x5982;&#x679C;&#x6709;&#x4E2A;&#x6700;&#x65B0;&#x627F;&#x8BFA;&#xFF0C;&#x524D;&#x9762;&#x7684;&#x627F;&#x8BFA;&#x5C31;&#x5DF2;&#x7ECF;&#x4F5C;&#x5E9F;&#xFF09;&#x3002;&#x7531;&#x4E8E;nLocktime&#xFF0C;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x90FD;&#x53EA;&#x6709;&#x5176;&#x65F6;&#x95F4;&#x5230;&#x671F;&#x540E;&#x624D;&#x80FD;&#x6210;&#x529F;&#x4F20;&#x64AD;&#x4EFB;&#x4F55;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x5982;&#x679C;&#x4E00;&#x5207;&#x987A;&#x5229;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x5408;&#x4F5C;&#x5E76;&#x901A;&#x8FC7;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x5408;&#x7406;&#x5730;&#x5173;&#x95ED;&#x901A;&#x9053;&#xFF0C;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#x53D1;&#x9001;&#x4E2D;&#x95F4;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5C31;&#x4E0D;&#x5FC5;&#x8981;&#x4E86;&#x3002;&#x5B9E;&#x8D28;&#x4E0A;&#x8BF4;&#xFF0C;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x53EA;&#x5728;&#x4E00;&#x65B9;&#x65AD;&#x7EBF;&#x800C;&#x53E6;&#x4E00;&#x65B9;&#x4E0D;&#x5F97;&#x4E0D;&#x5355;&#x65B9;&#x9762;&#x5173;&#x95ED;&#x901A;&#x9053;&#x65F6;&#x624D;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5C06;&#x6765;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF03;1&#x88AB;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5230;&#x5C06;&#x6765;&#x7684;&#x7B2C;4320&#x4E2A;&#x5757;&#xFF0C;&#x5219;&#x5C06;&#x6765;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF03;2&#x88AB;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5230;&#x5C06;&#x6765;&#x7684;4319&#x4E2A;&#x5757;&#x3002;&#xFF08;&#x540C;&#x7406;&#x53EF;&#x77E5;&#xFF09;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF03;600&#x5219;&#x53EF;&#x4EE5;&#x5728;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF03;1&#x53D8;&#x4E3A;&#x6709;&#x6548;&#x4E4B;&#x524D;600&#x4E2A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x88AB;&#x6D88;&#x8D39;&#x3002;</p>
<p>&#x56FE;12-7&#x663E;&#x793A;&#x6BCF;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x8BBE;&#x7F6E;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x5B83;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x53D8;&#x4E3A;&#x6709;&#x6548;&#x524D;&#x88AB;&#x82B1;&#x8D39;</p>
<p><a href="https://camo.githubusercontent.com/31efbdf647e92af331af447ef95f00ca604f4a31/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d616662386639396532646232633530612e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/31efbdf647e92af331af447ef95f00ca604f4a31/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d616662386639396532646232633530612e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-7. &#x6BCF;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x8BBE;&#x7F6E;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x5B83;&#x5728;&#x4E4B;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x53D8;&#x4E3A;&#x6709;&#x6548;&#x524D;&#x88AB;&#x82B1;&#x8D39; "></a></p>
<p>&#x6BCF;&#x4E2A;&#x540E;&#x7EED;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x5177;&#x6709;&#x8F83;&#x77ED;&#x7684;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x4EE5;&#x4FBF;&#x53EF;&#x4EE5;&#x5728;&#x5176;&#x524D;&#x4EFB;&#x4E4B;&#x524D;&#x548C;&#x9000;&#x6B3E;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#x3002;&#x80FD;&#x591F;&#x5C3D;&#x65E9;&#x5E7F;&#x64AD;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x80FD;&#x529B;&#x786E;&#x4FDD;&#x4E86;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x80FD;&#x591F;&#x82B1;&#x8D39;&#x8D44;&#x91D1;&#x8F93;&#x51FA;&#xFF0C;&#x5E76;&#x6392;&#x9664;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x901A;&#x8FC7;&#x82B1;&#x8D39;&#x8D44;&#x91D1;&#x8F93;&#x51FA;&#x6765;&#x8D4E;&#x56DE;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x63D0;&#x4F9B;&#x7684;&#x62C5;&#x4FDD;&#xFF0C;&#x5373;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x548C;&#x6267;&#x884C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#xFF0C;&#x6709;&#x6548;&#x5730;&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5E9F;&#x6B62;&#x5176;&#x524D;&#x4EFB;&#x6709;&#x6548;&#x6027;&#x3002;</p>
<p>&#x72B6;&#x6001;&#x901A;&#x9053;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x9501;&#x6765;&#x5728;&#x65F6;&#x95F4;&#x7EF4;&#x5EA6;&#x4E2D;&#x6267;&#x884C;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x770B;&#x5230;&#x65F6;&#x95F4;&#x7EF4;&#x5EA6;&#x5982;&#x4F55;&#x4FDD;&#x8BC1;&#x6700;&#x8FD1;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5728;&#x4EFB;&#x4F55;&#x65E9;&#x5148;&#x7684;&#x627F;&#x8BFA;&#x4E4B;&#x524D;&#x53D8;&#x5F97;&#x6709;&#x6548;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x6700;&#x8FD1;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x4F20;&#x8F93;&#xFF0C;&#x6D88;&#x8D39;&#x8F93;&#x5165;&#x548C;&#x4F7F;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x65E0;&#x6548;&#x3002;&#x7EDD;&#x5BF9;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x7684;&#x667A;&#x80FD;&#x5408;&#x540C;&#x7684;&#x6267;&#x884C;&#x53EF;&#x4EE5;&#x9632;&#x6B62;&#x5176;&#x4E2D;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#x7684;&#x6B3A;&#x9A97;&#x3002;&#x6B64;&#x5B9E;&#x73B0;&#x53EA;&#x9700;&#x8981;&#x7EDD;&#x5BF9;&#x7684;&#x4EA4;&#x6613;&#x7EA7;&#x65F6;&#x95F4;&#x9501;&#xFF08;nLocktime&#xFF09;&#x3002;&#x63A5;&#x4E0B;&#x6765;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x811A;&#x672C;&#x7EA7;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#xFF0C;CHECKLOCKTIMEVERIFY&#x548C;CHECKSEQUENCEVERIFY&#x6765;&#x6784;&#x5EFA;&#x66F4;&#x7075;&#x6D3B;&#xFF0C;&#x6709;&#x7528;&#x548C;&#x590D;&#x6742;&#x7684;&#x72B6;&#x6001;&#x901A;&#x9053;&#x3002;</p>
<p>&#x7B2C;&#x4E00;&#x6B21;&#x51FA;&#x73B0;&#x7684;&#x5355;&#x5411;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x5728;2015&#x5E74;&#x7531;&#x963F;&#x6839;&#x5EF7;&#x5F00;&#x53D1;&#x5546;&#x56E2;&#x961F;&#x6F14;&#x793A;&#x4E3A;&#x89C6;&#x9891;&#x6D41;&#x5E94;&#x7528;&#x6837;&#x677F;&#x3002;&#x4F60;&#x4ECD;&#x7136;&#x53EF;&#x4EE5;&#x5728;streamsium.io&#x770B;&#x5230;&#x5B83;&#x3002;</p>
<p>&#x65F6;&#x95F4;&#x9501;&#x5E76;&#x4E0D;&#x662F;&#x4F7F;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x65E0;&#x6548;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x3002;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;&#x7AE0;&#x8282;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x770B;&#x5230;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x6765;&#x5B9E;&#x73B0;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x65F6;&#x95F4;&#x9501;&#x662F;&#x6709;&#x6548;&#x7684;&#xFF0C;&#x4F46;&#x5176;&#x6709;&#x4E24;&#x4E2A;&#x660E;&#x663E;&#x7684;&#x7F3A;&#x70B9;&#x3002;&#x5728;&#x901A;&#x9053;&#x9996;&#x6B21;&#x6253;&#x5F00;&#x65F6;&#x5EFA;&#x7ACB;&#x6700;&#x5927;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x9650;&#x5236;&#x4E86;&#x901A;&#x9053;&#x7684;&#x4F7F;&#x7528;&#x5BFF;&#x547D;&#x3002;&#x66F4;&#x7CDF;&#x7CD5;&#x7684;&#x662F;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FEB;&#x4F7F;&#x901A;&#x9053;&#x5B9E;&#x73B0;&#x4EE5;&#x5728;&#x5141;&#x8BB8;&#x957F;&#x671F;&#x901A;&#x9053;&#xFF0C;&#x548C;&#x8FEB;&#x4F7F;&#x5176;&#x4E2D;&#x4E00;&#x4F4D;&#x53C2;&#x4E0E;&#x8005;&#x5728;&#x63D0;&#x524D;&#x5173;&#x95ED;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x7B49;&#x5F85;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#x7684;&#x9000;&#x6B3E;&#x4E4B;&#x95F4;&#x53D6;&#x5F97;&#x5E73;&#x8861;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x5982;&#x679C;&#x5141;&#x8BB8;&#x9891;&#x9053;&#x4FDD;&#x6301;&#x5F00;&#x653E;30&#x5929;&#xFF0C;&#x901A;&#x8FC7;&#x5C06;&#x9000;&#x6B3E;&#x65F6;&#x95F4;&#x8BBE;&#x7F6E;&#x4E3A;30&#x5929;&#xFF0C;&#x5982;&#x679C;&#x5176;&#x4E2D;&#x4E00;&#x65B9;&#x7ACB;&#x5373;&#x6D88;&#x5931;&#xFF0C;&#x5219;&#x53E6;&#x4E00;&#x65B9;&#x5FC5;&#x987B;&#x7B49;&#x5F85;30&#x5929;&#x624D;&#x80FD;&#x9000;&#x6B3E;&#x3002;&#x7EC8;&#x70B9;&#x8BBE;&#x7F6E;&#x8D8A;&#x8FDC;&#xFF0C;&#x9000;&#x6B3E;&#x65F6;&#x95F4;&#x8D8A;&#x8FDC;&#x3002;</p>
<p>&#x7B2C;&#x4E8C;&#x4E2A;&#x95EE;&#x9898;&#x662F;&#xFF0C;&#x7531;&#x4E8E;&#x6BCF;&#x4E2A;&#x540E;&#x7EED;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x51CF;&#x77ED;&#x65F6;&#x95F4;&#x9501;&#xFF0C;&#x6240;&#x4EE5;&#x5728;&#x53CC;&#x65B9;&#x4E4B;&#x95F4;&#x53EF;&#x4EE5;&#x4EA4;&#x6362;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x6570;&#x91CF;&#x6709;&#x660E;&#x786E;&#x7684;&#x9650;&#x5236;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4E00;&#x4E2A;30&#x5929;&#x7684;&#x901A;&#x9053;&#xFF0C;&#x8BBE;&#x7F6E;&#x4E86;&#x4F4D;&#x4E8E;&#x672A;&#x6765;&#x7B2C;4320&#x4E2A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x9501;<strong>&#xFF0C;</strong>&#x5728;&#x5FC5;&#x987B;&#x88AB;&#x5173;&#x95ED;&#x524D;&#x53EA;&#x80FD;&#x5BB9;&#x7EB3;4320&#x4E2A;&#x4E2D;&#x95F4;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x5C06;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x95F4;&#x9694;&#x8BBE;&#x7F6E;&#x4E3A;1&#x4E2A;&#x533A;&#x5757;&#x5B58;&#x5728;&#x5371;&#x9669;&#x3002;&#x901A;&#x8FC7;&#x5C06;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4E4B;&#x95F4;&#x7684;&#x65F6;&#x95F4;&#x9501;&#x8BBE;&#x7F6E;&#x4E3A;1&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5F00;&#x53D1;&#x8005;&#x7ED9;&#x901A;&#x9053;&#x53C2;&#x4E0E;&#x8005;&#x5E26;&#x6765;&#x4E86;&#x975E;&#x5E38;&#x9AD8;&#x7684;&#x8D1F;&#x62C5;&#xFF0C;&#x53C2;&#x4E0E;&#x8005;&#x5FC5;&#x987B;&#x4FDD;&#x6301;&#x8B66;&#x60D5;&#xFF0C;&#x4FDD;&#x6301;&#x5728;&#x7EBF;&#x5E76;&#x76D1;&#x89C6;&#xFF0C;&#x5E76;&#x968F;&#x65F6;&#x51C6;&#x5907;&#x4F20;&#x9001;&#x6B63;&#x786E;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4E86;&#x89E3;&#x5982;&#x4F55;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x9501;&#x6765;&#x4F7F;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x65E0;&#x6548;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5408;&#x4F5C;&#x5173;&#x95ED;&#x901A;&#x9053;&#x548C;&#x901A;&#x8FC7;&#x5E7F;&#x64AD;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5355;&#x65B9;&#x9762;&#x5173;&#x95ED;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x7684;&#x533A;&#x522B;&#x3002;&#x6240;&#x6709;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x90FD;&#x662F;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x7684;&#xFF0C;&#x56E0;&#x5E7F;&#x64AD;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x603B;&#x662F;&#x8981;&#x7B49;&#x5F85;&#x65F6;&#x95F4;&#x5230;&#x671F;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x53CC;&#x65B9;&#x540C;&#x610F;&#x6700;&#x540E;&#x7684;&#x4F59;&#x989D;&#x662F;&#x591A;&#x5C11;&#xFF0C;&#x5E76;&#x4E14;&#x77E5;&#x9053;&#x4ED6;&#x4EEC;&#x90FD;&#x627F;&#x62C5;&#x6700;&#x7EC8;&#x5B9E;&#x73B0;&#x4F59;&#x989D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x90A3;&#x4E48;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x6CA1;&#x6709;&#x65F6;&#x95F4;&#x9501;&#x4EE3;&#x8868;&#x76F8;&#x540C;&#x4F59;&#x989D;&#x7684;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x5408;&#x4F5C;&#x5173;&#x95ED;&#x4E2D;&#xFF0C;&#x4EFB;&#x4E00;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x63D0;&#x53D6;&#x6700;&#x8FD1;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x5404;&#x65B9;&#x9762;&#x5B8C;&#x5168;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#xFF0C;&#x552F;&#x4E00;&#x5DEE;&#x522B;&#x5C31;&#x662F;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#x7701;&#x7565;&#x4E86;&#x65F6;&#x95F4;&#x9501;&#x3002;&#x53CC;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x7B7E;&#x7F72;&#x8FD9;&#x7B14;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x77E5;&#x9053;&#x65E0;&#x6CD5;&#x4F5C;&#x5F0A;&#x4EE5;&#x5F97;&#x5230;&#x66F4;&#x591A;&#x7684;&#x4F59;&#x989D;&#x3002;&#x901A;&#x8FC7;&#x5408;&#x4F5C;&#x7B7E;&#x7F72;&#x548C;&#x53D1;&#x9001;&#x7ED3;&#x7B97;&#x4EA4;&#x6613;&#xFF0C;&#x53EF;&#x4EE5;&#x7ACB;&#x5373;&#x5173;&#x95ED;&#x901A;&#x9053;&#x5E76;&#x5151;&#x6362;&#x4F59;&#x989D;&#x3002;&#x6700;&#x5DEE;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5F53;&#x4E8B;&#x4EBA;&#x4E4B;&#x4E00;&#x53EF;&#x4EE5;&#x662F;&#x5351;&#x9119;&#x5C0F;&#x4EBA;&#xFF0C;&#x62D2;&#x7EDD;&#x5408;&#x4F5C;&#xFF0C;&#x5F3A;&#x8FEB;&#x53E6;&#x4E00;&#x65B9;&#x5355;&#x65B9;&#x9762;&#x5173;&#x95ED;&#x6700;&#x8FD1;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x4F46;&#x662F;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x8FD9;&#x6837;&#x505A;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E5F;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x4ED6;&#x4EEC;&#x7684;&#x8D44;&#x91D1;&#x3002;</p>
<h3 id="1264&#x4E0D;&#x5BF9;&#x79F0;&#x53EF;&#x64A4;&#x9500;&#x627F;&#x8BFA;">12.6.4&#x4E0D;&#x5BF9;&#x79F0;&#x53EF;&#x64A4;&#x9500;&#x627F;&#x8BFA;</h3>
<p>&#x5904;&#x7406;&#x5148;&#x524D;&#x627F;&#x8BFA;&#x72B6;&#x6001;&#x7684;&#x66F4;&#x597D;&#x65B9;&#x6CD5;&#x662F;&#x660E;&#x786E;&#x64A4;&#x9500;&#x5B83;&#x4EEC;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x8FD9;&#x4E0D;&#x5BB9;&#x6613;&#x5B9E;&#x73B0;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x4E00;&#x4E2A;&#x5173;&#x952E;&#x7279;&#x5F81;&#x662F;&#xFF0C;&#x4E00;&#x65E6;&#x4EA4;&#x6613;&#x6709;&#x6548;&#xFF0C;&#x5B83;&#x4E00;&#x76F4;&#x6709;&#x6548;&#xFF0C;&#x4E0D;&#x4F1A;&#x8FC7;&#x671F;&#x3002;&#x53D6;&#x6D88;&#x4EA4;&#x6613;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x662F;&#x5728;&#x4EA4;&#x6613;&#x88AB;&#x6316;&#x77FF;&#x524D;&#x7528;&#x53E6;&#x4E00;&#x7B14;&#x4EA4;&#x6613;&#x53CC;&#x91CD;&#x652F;&#x51FA;&#x5B83;&#x7684;&#x8F93;&#x5165;&#x3002;&#x8FD9;&#x5C31;&#x662F;&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x5728;&#x4E0A;&#x8FF0;&#x7B80;&#x5355;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x793A;&#x4F8B;&#x4E2D;&#x4F7F;&#x7528;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x6700;&#x65B0;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x53EF;&#x4EE5;&#x5728;&#x65E7;&#x627F;&#x8BFA;&#x751F;&#x6548;&#x4E4B;&#x524D;&#x88AB;&#x82B1;&#x8D39;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x628A;&#x627F;&#x8BFA;&#x5728;&#x65F6;&#x95F4;&#x4E0A;&#x6392;&#x5E8F;&#x9020;&#x6210;&#x4E86;&#x8BB8;&#x591A;&#x9650;&#x5236;&#xFF0C;&#x4F7F;&#x5F97;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x96BE;&#x4EE5;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x867D;&#x8BF4;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x65E0;&#x6CD5;&#x53D6;&#x6D88;&#xFF0C;&#x4F46;&#x662F;&#x5B83;&#x53EF;&#x4EE5;&#x88AB;&#x6784;&#x9020;&#x6210;&#x65E0;&#x6CD5;&#x518D;&#x4F7F;&#x7528;&#x7684;&#x6837;&#x5B50;&#x3002;&#x6211;&#x4EEC;&#x8FD9;&#x6837;&#x505A;&#x6211;&#x4EEC;&#x5B9E;&#x73B0;&#x5B83;&#x7684;&#x65B9;&#x6CD5;&#x662F;&#x901A;&#x8FC7;&#x7ED9;&#x4E88;&#x6BCF;&#x4E00;&#x65B9;&#x4E00;&#x4E2A; &#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;&#x5982;&#x679C;&#x5BF9;&#x65B9;&#x8BD5;&#x56FE;&#x6B3A;&#x9A97;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x6765;&#x8FDB;&#x884C;&#x60E9;&#x7F5A;&#x3002;&#x64A4;&#x9500;&#x5148;&#x524D;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x8FD9;&#x79CD;&#x673A;&#x5236;&#x9996;&#x5148;&#x88AB;&#x4F5C;&#x4E3A;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x90E8;&#x5206;&#x63D0;&#x51FA;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x89E3;&#x91CA;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;&#x6211;&#x4EEC;&#x5C06;&#x5728;&#x7531;Hitesh&#x548C;Irene&#x7ECF;&#x8425;&#x7684;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x6240;&#x4E4B;&#x95F4;&#x6784;&#x5EFA;&#x4E00;&#x4E2A;&#x66F4;&#x52A0;&#x590D;&#x6742;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002; Hitesh&#x548C;Irene&#x5206;&#x522B;&#x5728;&#x5370;&#x5EA6;&#x548C;&#x7F8E;&#x56FD;&#x8FD0;&#x8425;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x6240;&#x3002; Hitesh&#x7684;&#x5370;&#x5EA6;&#x4EA4;&#x6613;&#x6240;&#x7684;&#x5BA2;&#x6237;&#x7ECF;&#x5E38;&#x5411;Irene&#x7684;&#x7F8E;&#x56FD;&#x4EA4;&#x6613;&#x6240;&#x7684;&#x5BA2;&#x6237;&#x53D1;&#x9001;&#x4ED8;&#x6B3E;&#xFF0C;&#x53CD;&#x4E4B;&#x4EA6;&#x7136;&#x3002;&#x76EE;&#x524D;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x53D1;&#x751F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x94FE;&#x4E0A;&#xFF0C;&#x4F46;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x652F;&#x4ED8;&#x624B;&#x7EED;&#x8D39;&#x7528;&#x5E76;&#x7B49;&#x5F85;&#x51E0;&#x4E2A;&#x5757;&#x8FDB;&#x884C;&#x786E;&#x8BA4;&#x3002;&#x5728;&#x4EA4;&#x6613;&#x6240;&#x4E4B;&#x95F4;&#x8BBE;&#x7F6E;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x5C06;&#x5927;&#x5927;&#x964D;&#x4F4E;&#x6210;&#x672C;&#x5E76;&#x52A0;&#x5FEB;&#x4EA4;&#x6613;&#x6D41;&#x7A0B;&#x3002;</p>
<p>Hitesh&#x548C;Irene&#x901A;&#x8FC7;&#x5408;&#x4F5C;&#x5EFA;&#x7ACB;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x6765;&#x542F;&#x52A8;&#x901A;&#x9053;&#xFF0C;&#x6BCF;&#x4EBA;&#x5411;&#x901A;&#x9053;&#x6CE8;&#x8D44;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x521D;&#x59CB;&#x4F59;&#x989D;&#x4E3A;Hitesh&#x6709;5&#x6BD4;&#x7279;&#x5E01;&#x4E14;Irene&#x6709;5&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x5C06;&#x901A;&#x9053;&#x72B6;&#x6001;&#x9501;&#x5B9A;&#x5728;2-2&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x4E2D;&#xFF0C;&#x5C31;&#x50CF;&#x5728;&#x7B80;&#x5355;&#x901A;&#x9053;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#x4E00;&#x6837;&#x3002;</p>
<p>&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x6765;&#x81EA;Hitesh&#x7684;&#x8F93;&#x5165;&#xFF08;&#x52A0;&#x8D77;&#x6765;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x6216;&#x66F4;&#x591A;&#xFF09;&#xFF0C;&#x4EE5;&#x53CA;Irene&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#xFF08;&#x52A0;&#x8D77;&#x6765;5&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x6216;&#x66F4;&#x591A;&#xFF09;&#x3002;&#x6295;&#x5165;&#x5FC5;&#x987B;&#x7565;&#x5FAE;&#x8D85;&#x8FC7;&#x901A;&#x9053;&#x5BB9;&#x91CF;&#x624D;&#x591F;&#x652F;&#x4ED8;&#x4EA4;&#x6613;&#x8D39;&#x7528;&#x3002;&#x8BE5;&#x4EA4;&#x6613;&#x6709;&#x4E00;&#x4E2A;&#x5C06;&#x603B;&#x5171;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x9501;&#x5B9A;&#x5230;&#x7531;Hitesh&#x548C;Irene&#x63A7;&#x5236;&#x7684;2-of-2&#x591A;&#x91CD;&#x5730;&#x5740;&#x7684;&#x8F93;&#x51FA;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x7684;&#x8F93;&#x5165;&#x8D85;&#x8FC7;&#x4ED6;&#x4EEC;&#x9700;&#x8981;&#x8D21;&#x732E;&#x7684;&#x6570;&#x503C;&#xFF0C;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#x4E5F;&#x53EF;&#x80FD;&#x6709;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x51FA;&#x5C06;&#x627E;&#x96F6;&#x8FD4;&#x56DE;&#x7ED9;Hitesh&#x548C;Irene&#x3002;&#x8FD9;&#x662F;&#x7531;&#x53CC;&#x65B9;&#x63D0;&#x4F9B;&#x548C;&#x7B7E;&#x7F72;&#x7684;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x5F62;&#x6210;&#x7684;&#x5355;&#x4E00;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x53D1;&#x9001;&#x4E4B;&#x524D;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x88AB;&#x5408;&#x4F5C;&#x6784;&#x5EFA;&#x8D77;&#x6765;&#x5E76;&#x4E14;&#x7531;&#x5404;&#x65B9;&#x7B7E;&#x7F72;&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4EE3;&#x66FF;&#x53CC;&#x65B9;&#x7B7E;&#x7F72;&#x5355;&#x4E00;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x662F;&#xFF0C; Hitesh&#x548C;Irene&#x521B;&#x9020;&#x4E86;&#x4E24;&#x4E2A;&#x4E0D;&#x5BF9;&#x79F0; &#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;</p>
<p>Hitesh&#x6709;&#x4E00;&#x4E2A;&#x5E26;&#x6709;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x7B2C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x7ACB;&#x5373;&#x652F;&#x4ED8;Irene&#x6B20;&#x5979;&#x7684;5&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x652F;&#x4ED8;Hitesh&#x6B20;&#x4ED6;&#x81EA;&#x5DF1;&#x7684;5&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4F46;&#x6761;&#x4EF6;&#x662F;&#x53EA;&#x6709;&#x5728;1000&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x9501;&#x4E4B;&#x540E;&#x3002;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>Input: 2-of-2 funding output, signed by Irene 

Output 0 &lt;5 bitcoin&gt;:
    &lt;Irene&apos;s Public Key&gt; CHECKSIG

Output 1:
    &lt;1000 blocks&gt;
    CHECKSEQUENCEVERIFY
    DROP
    &lt;Hitesh&apos;s Public Key&gt; CHECKSIG
</code></pre><p>Irene&#x6709;&#x5E26;&#x6709;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x7684;&#x4E0D;&#x540C;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002; &#x7B2C;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x652F;&#x4ED8;Hitesh&#x6B20;&#x4ED6;&#x7684;5&#x6BD4;&#x7279;&#x5E01;&#x3002; &#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x652F;&#x4ED8;Irene&#xFF0C;&#x6B20;&#x5979;&#x81EA;&#x5DF1;&#x7684;5&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4F46;&#x540C;&#x6837;&#x53EA;&#x6709;&#x7ECF;&#x8FC7;1000&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x9501;&#x3002; Irene&#x6301;&#x6709;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF08;&#x7531;Hitesh&#x7B7E;&#x7F72;&#xFF09;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x8FD9;&#x6837;&#xFF1A;</p>
<pre><code>Input: 2-of-2 funding output, signed by Hitesh

Output 0&lt;5 bitcoin&gt;:
    &lt;Hitesh&apos;s Public Key&gt; CHECKSIG

Output 1:
    &lt;1000 blocks&gt;
    CHECKSEQUENCEVERIFY
    DROP
    &lt;Irene&apos;s Public Key&gt; CHECKSIG
</code></pre><p>&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;&#x53CC;&#x65B9;&#x5404;&#x6709;&#x4E00;&#x7B14;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x4EE5;&#x82B1;&#x8D39;2 -2&#x7684;&#x8D44;&#x91D1;&#x8F93;&#x51FA;&#x3002; &#x8BE5;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x662F;&#x7531;&#x5BF9;&#x65B9;&#x7B7E;&#x7F72;&#x7684;&#x3002; &#x5728;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#xFF0C;&#x6301;&#x6709;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x4E00;&#x65B9;&#x90FD;&#x53EF;&#x4EE5;&#x7B7E;&#x5B57;&#xFF08;&#x5B8C;&#x6210;2-2&#x7B7E;&#x540D;&#xFF09;&#x5E76;&#x8FDB;&#x884C;&#x5E7F;&#x64AD;&#x3002; &#x7136;&#x800C;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x4EEC;&#x5E7F;&#x64AD;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4F1A;&#x7ACB;&#x5373;&#x652F;&#x4ED8;&#x5BF9;&#x65B9;&#xFF0C;&#x800C;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x5FC5;&#x987B;&#x7B49;&#x5F85;&#x77ED;&#x65F6;&#x95F4;&#x9501;&#x5230;&#x671F;&#x3002;&#x901A;&#x8FC7;&#x5728;&#x5176;&#x4E2D;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x5F3A;&#x5236;&#x6267;&#x884C;&#x8D4E;&#x56DE;&#x62D6;&#x5EF6;,&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x505A;&#x5230;&#x8BA9;&#x5404;&#x65B9;&#x5728;&#x9009;&#x62E9;&#x5355;&#x65B9;&#x9762;&#x5E7F;&#x64AD;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x65F6;&#x5904;&#x4E8E;&#x8F7B;&#x5FAE;&#x7684;&#x4E0D;&#x5229;&#x5730;&#x4F4D;&#x3002; &#x4F46;&#x662F;&#x5355;&#x9760;&#x65F6;&#x95F4;&#x5EF6;&#x8FDF;&#x8FD8;&#x4E0D;&#x8DB3;&#x4EE5;&#x9F13;&#x52B1;&#x516C;&#x5E73;&#x7684;&#x884C;&#x4E3A;&#x3002;</p>
<p>&#x4E0B;&#x56FE;12-8&#x663E;&#x793A;&#x4E24;&#x4E2A;&#x4E0D;&#x5BF9;&#x79F0;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x4E2D;&#x627F;&#x8BFA;&#x6301;&#x6709;&#x4EBA;&#x7684;&#x6709;&#x5EF6;&#x8FDF;&#x652F;&#x4ED8; <img src="https://camo.githubusercontent.com/4fb604873e4f374f40207b990c4fcb203ce59326/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d346161373331663063666666336164642e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-8&#x663E;&#x793A;&#x4E24;&#x4E2A;&#x4E0D;&#x5BF9;&#x79F0;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF0C;&#x5176;&#x4E2D;&#x627F;&#x8BFA;&#x6301;&#x6709;&#x4EBA;&#x7684;&#x6709;&#x5EF6;&#x8FDF;&#x652F;&#x4ED8;"></p>
<p>&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x4ECB;&#x7ECD;&#x8FD9;&#x4E2A;&#x65B9;&#x6848;&#x7684;&#x6700;&#x540E;&#x4E00;&#x4E2A;&#x8981;&#x7D20;&#xFF1A;&#x4E00;&#x4E2A;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;&#x5141;&#x8BB8;&#x88AB;&#x6B3A;&#x8BC8;&#x7684;&#x4E00;&#x65B9;&#x901A;&#x8FC7;&#x5360;&#x6709;&#x901A;&#x9053;&#x7684;&#x6240;&#x6709;&#x4F59;&#x989D;&#x6765;&#x60E9;&#x7F5A;&#x9A97;&#x5B50;&#x3002;</p>
<p>&#x6BCF;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x201C;&#x5EF6;&#x8FDF;&#x201D;&#x7684;&#x8F93;&#x51FA;&#x3002; &#x8BE5;&#x8F93;&#x51FA;&#x7684;&#x5151;&#x6362;&#x811A;&#x672C;&#x5141;&#x8BB8;&#x4E00;&#x65B9;&#x5728;1000&#x4E2A;&#x533A;&#x5757;&#x540E;&#x5151;&#x6362;&#x5B83;&#xFF0C;&#x6216;&#x8005;&#x53E6;&#x4E00;&#x65B9;&#x5982;&#x679C;&#x62E5;&#x6709;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x4E5F;&#x53EF;&#x5151;&#x6362;&#x5B83;&#x3002; &#x6240;&#x4EE5;&#x5F53;Hitesh&#x4E3A;Irene&#x7B7E;&#x7F72;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x65F6;&#xFF0C;&#x4ED6;&#x5C06;&#x628A;&#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x5B9A;&#x4E49;&#x4E3A;&#x5728;1000&#x5757;&#x4E4B;&#x540E;&#x53EF;&#x8F93;&#x51FA;&#x652F;&#x4ED8;&#x7ED9;&#x81EA;&#x5DF1;&#xFF0C;&#x6216;&#x8005;&#x662F;&#x4EFB;&#x4F55;&#x53EF;&#x4EE5;&#x51FA;&#x793A;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x7684;&#x4EBA;&#x3002; Hitesh&#x6784;&#x5EFA;&#x4E86;&#x8FD9;&#x4E2A;&#x4EA4;&#x6613;&#xFF0C;&#x5E76;&#x521B;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;&#x7531;&#x4ED6;&#x79D8;&#x5BC6;&#x4FDD;&#x7BA1;&#x7684;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x3002;&#x5F53;&#x4ED6;&#x51C6;&#x5907;&#x8F6C;&#x79FB;&#x5230;&#x65B0;&#x7684;&#x901A;&#x9053;&#x72B6;&#x6001;&#x5E76;&#x5E0C;&#x671B;&#x64A4;&#x9500;&#x8FD9;&#x4E00;&#x627F;&#x8BFA;&#x65F6;&#xFF0C; &#x4ED6;&#x624D;&#x4F1A;&#x628A;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x900F;&#x9732;&#x7ED9;Irene &#x7B2C;&#x4E8C;&#x4E2A;&#x8F93;&#x51FA;&#x811A;&#x672C;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>Output 0&lt;5 bitcoin&gt;:
    &lt;Irene&apos;s Public Key&gt; CHECKSIG

Output 1&lt;5 bitcoin&gt;:
IF # Revocation penalty output
    &lt;Revocation Public Key&gt;
ELSE
    &lt;1000 blocks&gt;
    CHECKSEQUENCEVERIFY
    DROP
    &lt;Hitesh&apos;s Public Key&gt;
ENDIF
CHECKSIG
</code></pre><p>Irene&#x53EF;&#x4EE5;&#x81EA;&#x4FE1;&#x5730;&#x7B7E;&#x7F72;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#xFF0C;&#x56E0;&#x4E3A;&#x4E00;&#x65E6;&#x88AB;&#x53D1;&#x9001;&#x5B83;&#x5C06;&#x7ACB;&#x5373;&#x652F;&#x4ED8;&#x5979;&#x88AB;&#x6B20;&#x7684;&#x6B20;&#x6B3E;&#x3002; Hitesh&#x6301;&#x6709;&#x4EA4;&#x6613;&#xFF0C;&#x4F46;&#x77E5;&#x9053;&#x5982;&#x679C;&#x4ED6;&#x5728;&#x5355;&#x65B9;&#x901A;&#x9053;&#x5173;&#x95ED;&#x65F6;&#x53D1;&#x9001;&#xFF0C;&#x4ED6;&#x5C06;&#x4E0D;&#x5F97;&#x4E0D;&#x7B49;&#x5F85;1000&#x4E2A;&#x5757;&#x624D;&#x80FD;&#x83B7;&#x5F97;&#x652F;&#x4ED8;&#x3002;</p>
<p>&#x5F53;&#x901A;&#x9053;&#x8FDB;&#x5165;&#x4E0B;&#x4E00;&#x4E2A;&#x72B6;&#x6001;&#x65F6;&#xFF0C;Hitesh&#x5FC5;&#x987B;&#x5728;Irene&#x540C;&#x610F;&#x7B7E;&#x7F72;&#x4E0B;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#x64A4;&#x9500;&#x6B64;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x8981;&#x505A;&#x5230;&#x8FD9;&#x4E00;&#x70B9;&#xFF0C;&#x4ED6;&#x6240;&#x8981;&#x505A;&#x7684;&#x5C31;&#x662F;&#x5C06;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x53D1;&#x9001;&#x7ED9;Irene&#x3002;&#x4E00;&#x65E6;Irene&#x62E5;&#x6709;&#x8FD9;&#x4E00;&#x627F;&#x8BFA;&#x7684;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;&#x5979;&#x5C31;&#x53EF;&#x4EE5;&#x81EA;&#x4FE1;&#x5730;&#x7B7E;&#x7F72;&#x4E0B;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#x3002;&#x5979;&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;Hitesh&#x8BD5;&#x56FE;&#x901A;&#x8FC7;&#x53D1;&#x5E03;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x6765;&#x4F5C;&#x5F0A;&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x6765;&#x5151;&#x6362;Hitesh&#x7684;&#x5EF6;&#x8FDF;&#x8F93;&#x51FA;&#x3002;&#x5982;&#x679C;Hitesh&#x4F5C;&#x5F0A;&#xFF0C;Irene&#x4F1A;&#x5F97;&#x5230;BOTH&#xFF08;&#x4E24;&#x65B9;&#xFF09;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x64A4;&#x9500;&#x534F;&#x8BAE;&#x662F;&#x53CC;&#x8FB9;&#x7684;&#xFF0C;&#x8FD9;&#x610F;&#x5473;&#x7740;&#x5728;&#x6BCF;&#x4E00;&#x8F6E;&#x4E2D;&#xFF0C;&#x968F;&#x7740;&#x901A;&#x9053;&#x72B6;&#x6001;&#x7684;&#x8FDB;&#x4E00;&#x6B65;&#x53D1;&#x5C55;&#xFF0C;&#x53CC;&#x65B9;&#x4EA4;&#x6362;&#x65B0;&#x7684;&#x627F;&#x8BFA;&#xFF0C;&#x4EA4;&#x6362;&#x7528;&#x4E8E;&#x4E4B;&#x524D;&#x627F;&#x8BFA;&#x7684;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;&#x5E76;&#x7B7E;&#x7F72;&#x5F7C;&#x6B64;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x5F53;&#x4ED6;&#x4EEC;&#x63A5;&#x53D7;&#x65B0;&#x7684;&#x72B6;&#x6001;&#x65F6;&#xFF0C;&#x4ED6;&#x4EEC;&#x901A;&#x8FC7;&#x7ED9;&#x4E88;&#x5BF9;&#x65B9;&#x5FC5;&#x8981;&#x7684;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x6765;&#x60E9;&#x7F5A;&#x4EFB;&#x4F55;&#x4F5C;&#x5F0A;&#x884C;&#x4E3A;&#xFF0C;&#x4F7F;&#x5148;&#x524D;&#x7684;&#x72B6;&#x6001;&#x4E0D;&#x53EF;&#x80FD;&#x518D;&#x88AB;&#x4F7F;&#x7528;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x6765;&#x770B;&#x4E00;&#x4E2A;&#x5B83;&#x7684;&#x5DE5;&#x4F5C;&#x4F8B;&#x5B50;&#x3002; Irene&#x7684;&#x5BA2;&#x6237;&#x4E4B;&#x4E00;&#x5E0C;&#x671B;&#x5411;Hitesh&#x7684;&#x5BA2;&#x6237;&#x53D1;&#x9001;2&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x8981;&#x901A;&#x8FC7;&#x901A;&#x9053;&#x4F20;&#x8F93;2&#x6BD4;&#x7279;&#x5E01;&#xFF0C;Hitesh&#x548C;Irene&#x5FC5;&#x987B;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x72B6;&#x6001;&#x4EE5;&#x53CD;&#x6620;&#x65B0;&#x7684;&#x4F59;&#x989D;&#x3002;&#x4ED6;&#x4EEC;&#x5C06;&#x627F;&#x8BFA;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x72B6;&#x6001;&#xFF08;&#x72B6;&#x6001;&#x53F7;2&#xFF09;&#xFF0C;&#x901A;&#x9053;&#x7684;10&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5206;&#x88C2;&#xFF0C;7&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5C5E;&#x4E8E;Hitesh&#x548C;3&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x5C5E;&#x4E8E;Irene&#x3002;&#x4E3A;&#x4E86;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x7684;&#x72B6;&#x6001;&#xFF0C;&#x4ED6;&#x4EEC;&#x5C06;&#x5404;&#x81EA;&#x521B;&#x5EFA;&#x53CD;&#x6620;&#x65B0;&#x901A;&#x9053;&#x4F59;&#x989D;&#x7684;&#x65B0;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;</p>
<p>&#x5982;&#x4E0A;&#x8FF0;&#x5185;&#x5BB9;&#x6240;&#x8BF4;&#xFF0C;&#x8FD9;&#x4E9B;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x662F;&#x4E0D;&#x5BF9;&#x79F0;&#x7684;&#xFF0C;&#x6240;&#x4EE5;&#x6BCF;&#x4E00;&#x65B9;&#x6240;&#x6301;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x90FD;&#x8FEB;&#x4F7F;&#x4ED6;&#x4EEC;&#x7B49;&#x5F85;&#x5151;&#x6362;&#x3002;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x5728;&#x7B7E;&#x7F72;&#x65B0;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x4E4B;&#x524D;&#xFF0C;&#x4ED6;&#x4EEC;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x4EA4;&#x6362;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x4EE5;&#x4F7F;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x65E0;&#x6548;&#x3002;&#x5728;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Hitesh&#x7684;&#x5229;&#x76CA;&#x4E0E;&#x901A;&#x9053;&#x7684;&#x771F;&#x5B9E;&#x72B6;&#x6001;&#x662F;&#x4E00;&#x81F4;&#x7684;&#xFF0C;&#x56E0;&#x6B64;&#x4ED6;&#x6CA1;&#x6709;&#x7406;&#x7531;&#x5E7F;&#x64AD;&#x5148;&#x524D;&#x7684;&#x72B6;&#x6001;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5BF9;&#x4E8E;Irene&#x6765;&#x8BF4;&#xFF0C;&#x72B6;&#x6001;&#x53F7;1&#x4E2D;&#x7559;&#x7ED9;&#x5979;&#x7684;&#x4F59;&#x989D;&#x6BD4;&#x72B6;&#x6001;2&#x4E2D;&#x7684;&#x66F4;&#x9AD8;&#x3002;&#x5F53;Irene&#x7ED9;&#x4E88;Hitesh&#x5979;&#x4EE5;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#xFF08;&#x72B6;&#x6001;&#x53F7;1&#xFF09;&#x7684;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x65F6;&#xFF0C;&#x5979;&#x5B9E;&#x9645;&#x4E0A;&#x5E9F;&#x9664;&#x4E86;&#x81EA;&#x5DF1;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x901A;&#x9053;&#x72B6;&#x6001;&#x5230;&#x524D;&#x4E00;&#x72B6;&#x6001;&#x800C;&#x4ECE;&#x4E2D;&#x83B7;&#x76CA;&#x7684;&#x80FD;&#x529B;&#x3002;&#x56E0;&#x4E3A;&#x6709;&#x4E86;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#xFF0C;Hitesh&#x53EF;&#x4EE5;&#x6BEB;&#x4E0D;&#x62D6;&#x5EF6;&#x5730;&#x5151;&#x6362;&#x5148;&#x524D;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x7684;&#x4E24;&#x4E2A;&#x8F93;&#x51FA;&#x3002;&#x4E5F;&#x5C31;&#x662F;&#x8BF4;&#x4E00;&#x65E6;Irene&#x5E7F;&#x64AD;&#x5148;&#x524D;&#x7684;&#x72B6;&#x6001;&#xFF0C;Hitesh&#x53EF;&#x4EE5;&#x884C;&#x4F7F;&#x5176;&#x5360;&#x6709;&#x6240;&#x6709;&#x8F93;&#x51FA;&#x7684;&#x6743;&#x5229;&#x3002;</p>
<p>&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x64A4;&#x9500;&#x4E0D;&#x4F1A;&#x81EA;&#x52A8;&#x53D1;&#x751F;&#x3002;&#x867D;&#x7136;Hitesh&#x6709;&#x80FD;&#x529B;&#x60E9;&#x7F5A;Irene&#x7684;&#x4F5C;&#x5F0A;&#x884C;&#x4E3A;&#xFF0C;&#x4F46;&#x4ED6;&#x5FC5;&#x987B;&#x52E4;&#x52C9;&#x5730;&#x89C2;&#x5BDF;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x4F5C;&#x5F0A;&#x7684;&#x8FF9;&#x8C61;&#x3002;&#x5982;&#x679C;&#x4ED6;&#x770B;&#x5230;&#x5148;&#x524D;&#x7684;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x5E7F;&#x64AD;&#xFF0C;&#x4ED6;&#x6709;1000&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#x91C7;&#x53D6;&#x884C;&#x52A8;&#xFF0C;&#x5E76;&#x4F7F;&#x7528;&#x64A4;&#x9500;&#x5BC6;&#x94A5;&#x6765;&#x963B;&#x6B62;Irene&#x7684;&#x6B3A;&#x9A97;&#x884C;&#x4E3A;&#x5E76;&#x5360;&#x6709;&#x6240;&#x6709;&#x4F59;&#x989D;&#x4E5F;&#x5C31;&#x662F;&#x5168;&#x90E8;10&#x6BD4;&#x7279;&#x5E01;&#x6765;&#x60E9;&#x7F5A;&#x5979;&#x3002;</p>
<p>&#x5E26;&#x6709;&#x76F8;&#x5BF9;&#x65F6;&#x95F4;&#x9501;&#xFF08;CSV&#xFF09;&#x7684;&#x4E0D;&#x5BF9;&#x79F0;&#x53EF;&#x64A4;&#x9500;&#x627F;&#x8BFA;&#x662F;&#x5B9E;&#x73B0;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x66F4;&#x597D;&#x65B9;&#x6CD5;&#xFF0C;&#x4E5F;&#x662F;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x975E;&#x5E38;&#x91CD;&#x8981;&#x7684;&#x521B;&#x65B0;&#x3002;&#x901A;&#x8FC7;&#x8FD9;&#x79CD;&#x7ED3;&#x6784;&#xFF0C;&#x901A;&#x9053;&#x53EF;&#x4EE5;&#x65E0;&#x9650;&#x671F;&#x5730;&#x4FDD;&#x6301;&#x5F00;&#x653E;&#xFF0C;&#x5E76;&#x4E14;&#x53EF;&#x4EE5;&#x62E5;&#x6709;&#x6570;&#x5341;&#x4EBF;&#x7684;&#x4E2D;&#x95F4;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x3002;&#x5728;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;&#x539F;&#x578B;&#x5B9E;&#x73B0;&#x4E2D;&#xFF0C;&#x627F;&#x8BFA;&#x72B6;&#x6001;&#x7531;48&#x4F4D;&#x7D22;&#x5F15;&#x8BC6;&#x522B;&#xFF0C;&#x5141;&#x8BB8;&#x5728;&#x4EFB;&#x4F55;&#x5355;&#x4E2A;&#x901A;&#x9053;&#x4E2D;&#x6709;&#x8D85;&#x8FC7;281&#x5146;&#xFF08;2.8&#xD7;10^14&#xFF09;&#x4E2A;&#x72B6;&#x6001;&#x8F6C;&#x6362;&#xFF01;</p>
<h3 id="1265&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5408;&#x7EA6;&#xFF08;hash-time-lock-contracts&#xFF0C;htlc&#xFF09;">12.6.5&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5408;&#x7EA6;&#xFF08;Hash Time Lock Contracts&#xFF0C;HTLC&#xFF09;</h3>
<p>&#x652F;&#x4ED8;&#x901A;&#x9053;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7279;&#x6B8A;&#x7C7B;&#x578B;&#x7684;&#x667A;&#x80FD;&#x5408;&#x540C;&#x8FDB;&#x4E00;&#x6B65;&#x6269;&#x5C55;&#xFF0C;&#x4EE5;&#x5141;&#x8BB8;&#x53C2;&#x4E0E;&#x8005;&#x5C06;&#x8D44;&#x91D1;&#x7528;&#x4E8E;&#x53EF;&#x8D4E;&#x56DE;&#x7684;&#x5177;&#x6709;&#x5230;&#x671F;&#x65F6;&#x95F4;&#x7684;&#x79D8;&#x5BC6;&#xFF08;secret&#xFF09;&#x3002; &#x6B64;&#x529F;&#x80FD;&#x79F0;&#x4E3A;&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5408;&#x7EA6;&#x6216;HTLC&#xFF0C;&#x5E76;&#x7528;&#x4E8E;&#x53CC;&#x5411;&#x548C;&#x8DEF;&#x7531;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002;</p>
<p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x6765;&#x89E3;&#x91CA;HTLC&#x7684;&#x201C;&#x54C8;&#x5E0C;&#x201D;&#x90E8;&#x5206;&#x3002; &#x8981;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;HTLC&#xFF0C;&#x9884;&#x671F;&#x7684;&#x6536;&#x6B3E;&#x4EBA;&#x5C06;&#x9996;&#x5148;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x79D8;&#x5BC6;&#xFF08;secret&#xFF09;R&#x3002;&#x4ED6;&#x4EEC;&#x7136;&#x540E;&#x8BA1;&#x7B97;&#x8FD9;&#x4E2A;R&#x7684;&#x54C8;&#x5E0C;H&#xFF1A;</p>
<pre><code>H = Hash\(R\)
</code></pre><p>&#x8FD9;&#x6B65;&#x4EA7;&#x751F;&#x53EF;&#x4EE5;&#x5305;&#x542B;&#x5728;&#x8F93;&#x51FA;&#x7684;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x4E2D;&#x7684;&#x54C8;&#x5E0C;H&#x3002; &#x77E5;&#x9053;&#x79D8;&#x5BC6;&#x7684;&#x4EFB;&#x4F55;&#x4EBA;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x5151;&#x6362;&#x8F93;&#x51FA;&#x3002; &#x79D8;&#x5BC6;R&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x7684;<em>&#x524D;&#x56FE;&#x50CF;</em>&#x3002; &#x524D;&#x56FE;&#x50CF;&#x5C31;&#x662F;&#x7528;&#x4F5C;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x8F93;&#x5165;&#x7684;&#x6570;&#x636E;&#x3002;</p>
<p>HTLC&#x7684;&#x7B2C;&#x4E8C;&#x90E8;&#x5206;&#x662F;&#x201C;&#x65F6;&#x95F4;&#x9501;&#x201D;&#x7EC4;&#x4EF6;&#x3002; &#x5982;&#x679C;&#x79D8;&#x5BC6;&#x6CA1;&#x6709;&#x88AB;&#x900F;&#x9732;&#xFF0C;HTLC&#x7684;&#x4ED8;&#x6B3E;&#x4EBA;&#x53EF;&#x4EE5;&#x5728;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x540E;&#x5F97;&#x5230;&#x201C;&#x9000;&#x6B3E;&#x201D;&#x3002; &#x8FD9;&#x662F;&#x901A;&#x8FC7;&#x4F7F;&#x7528;&#x7EDD;&#x5BF9;&#x65F6;&#x95F4;&#x9501;CHECKLOCKTIMEVERIFY&#x6765;&#x5B9E;&#x73B0;&#x7684;&#x3002;&#x5B9E;&#x73B0;HTLC&#x7684;&#x811A;&#x672C;&#x53EF;&#x80FD;&#x5982;&#x4E0B;&#x6240;&#x793A;&#xFF1A;</p>
<pre><code>IF
   # Payment if you have the secret R
   HASH160 &lt;H&gt; EQUALVERIFY
ELSE
  # Refund after timeout.
  &lt;locktime&gt;
  CHECKLOCKTIMEVERIFY DROP
  &lt;Payee Pubic Key&gt; CHECKSIG
ENDIF
</code></pre><p>&#x4EFB;&#x4F55;&#x77E5;&#x9053;&#x53EF;&#x4EE5;&#x8BA9;&#x54C8;&#x5E0C;&#x7B49;&#x4E8E;H&#x7684;&#x5BF9;&#x5E94;&#x79D8;&#x5BC6;R&#x7684;&#x4EBA;&#xFF0C;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x884C;&#x4F7F;IF&#x8BED;&#x53E5;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x53E5;&#x6765;&#x5151;&#x6362;&#x8BE5;&#x8F93;&#x51FA;&#x3002;</p>
<p>&#x5982;&#x679C;&#x79D8;&#x5BC6;&#x6CA1;&#x6709;&#x88AB;&#x900F;&#x9732;&#xFF0C;HTLC&#x4E2D;&#x5199;&#x660E;&#x4E86;&#xFF0C;&#x5728;&#x4E00;&#x5B9A;&#x6570;&#x91CF;&#x7684;&#x5757;&#x4E4B;&#x540E;&#xFF0C;&#x6536;&#x6B3E;&#x4EBA;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;IF&#x8BED;&#x53E5;&#x4E2D;&#x7684;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B50;&#x53E5;&#x7533;&#x8BF7;&#x9000;&#x6B3E;&#x3002;</p>
<p>&#x8FD9;&#x662F;HTLC&#x7684;&#x57FA;&#x672C;&#x5B9E;&#x73B0;&#x3002; &#x4EFB;&#x4F55; &#x62E5;&#x6709;&#x79D8;&#x5BC6;R&#x7684;&#x4EBA;&#x90FD;&#x53EF;&#x4EE5;&#x5151;&#x6362;&#x8FD9;&#x79CD;&#x7C7B;&#x578B;&#x7684;HTLC&#x3002;&#x901A;&#x8FC7;&#x5BF9;&#x811A;&#x672C;&#x8FDB;&#x884C;&#x5FAE;&#x8C03;&#xFF0C;HTLC&#x53EF;&#x4EE5;&#x91C7;&#x7528;&#x8BB8;&#x591A;&#x4E0D;&#x540C;&#x7684;&#x5F62;&#x5F0F;&#x3002; &#x4F8B;&#x5982;&#xFF0C;&#x5728;&#x7B2C;&#x4E00;&#x4E2A;&#x5B50;&#x53E5;&#x4E2D;&#x6DFB;&#x52A0;&#x4E00;&#x4E2A;CHECKSIG&#x8FD0;&#x7B97;&#x7B26;&#x548C;&#x4E00;&#x4E2A;&#x516C;&#x94A5;&#x6765;&#x9650;&#x5236;&#x5C06;&#x54C8;&#x5E0C;&#x503C;&#x5151;&#x6362;&#x6210;&#x4E00;&#x4E2A;&#x6307;&#x5B9A;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#xFF0C;&#x8FD9;&#x4E2A;&#x4EBA;&#x5FC5;&#x987B;&#x77E5;&#x9053;&#x79D8;&#x5BC6;R.</p>
<h2 id="127&#x53EF;&#x8DEF;&#x7531;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF08;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#xFF09;">12.7&#x53EF;&#x8DEF;&#x7531;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF08;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#xFF09;</h2>
<p>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x79CD;&#x7AEF;&#x5230;&#x7AEF;&#x8FDE;&#x63A5;&#x7684;&#x53CC;&#x5411;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x53EF;&#x8DEF;&#x7531;&#x7F51;&#x7EDC;&#x3002;&#x8FD9;&#x6837;&#x7684;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5141;&#x8BB8;&#x4EFB;&#x4F55;&#x53C2;&#x4E0E;&#x8005;&#x7A7F;&#x8FC7;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x8DEF;&#x7531;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x901A;&#x9053;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4FE1;&#x4EFB;&#x4EFB;&#x4F55;&#x4E2D;&#x95F4;&#x4EBA;&#x3002;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7531;Joseph Poon&#x548C;Thadeus Dryja&#x4E8E;2015&#x5E74;2&#x6708;&#x9996;&#x6B21;&#x63CF;&#x8FF0;&#xFF0C;&#x5176;&#x57FA;&#x7840;&#x662F;&#x8BB8;&#x591A;&#x5176;&#x4ED6;&#x4EBA;&#x63D0;&#x51FA;&#x548C;&#x9610;&#x8FF0;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x6982;&#x5FF5;&#x3002;</p>
<p>&#x201C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x201D;&#x662F;&#x6307;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7F51;&#x7EDC;&#x7684;&#x5177;&#x4F53;&#x8BBE;&#x8BA1;&#xFF0C;&#x73B0;&#x5DF2;&#x7531;&#x81F3;&#x5C11;&#x4E94;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x5F00;&#x6E90;&#x56E2;&#x961F;&#x5B9E;&#x65BD;&#x3002;&#x8FD9;&#x4E9B;&#x7684;&#x72EC;&#x7ACB;&#x5B9E;&#x65BD;&#x662F;&#x7531;&#x201C;&#x95EA;&#x7535;&#x6280;&#x672F;&#x57FA;&#x7840;&#x201D;&#xFF08;BOLT&#xFF09;&#x8BBA;&#x6587;&#x4E2D;&#x63CF;&#x8FF0;&#x7684;&#x4E00;&#x7EC4;&#x4E92;&#x901A;&#x6027;&#x6807;&#x51C6;&#x8FDB;&#x884C;&#x534F;&#x4F5C;&#x3002;</p>
<p>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;&#x539F;&#x578B;&#x5B9E;&#x65BD;&#x5DF2;&#x7ECF;&#x7531;&#x51E0;&#x4E2A;&#x56E2;&#x961F;&#x53D1;&#x5E03;&#x3002;&#x73B0;&#x5728;&#xFF0C;&#x8FD9;&#x4E9B;&#x5B9E;&#x73B0;&#x53EA;&#x80FD;&#x5728;testnet&#x4E0A;&#x8FD0;&#x884C;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4F7F;&#x7528;segwit&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x4E3B;&#x94FE;&#xFF08;mainnet&#xFF09;&#x4E0A;&#x6FC0;&#x6D3B;&#x3002;</p>
<p>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x662F;&#x5B9E;&#x73B0;&#x53EF;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x4E00;&#x79CD;&#x53EF;&#x80FD;&#x65B9;&#x5F0F;&#x3002;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x51E0;&#x79CD;&#x65E8;&#x5728;&#x5B9E;&#x73B0;&#x7C7B;&#x4F3C;&#x76EE;&#x6807;&#x7684;&#x8BBE;&#x8BA1;&#xFF0C;&#x5982;Teechan&#x548C;Tumblebit&#x3002;</p>
<h3 id="1271&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;">12.7.1&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x793A;&#x4F8B;</h3>
<p>&#x8BA9;&#x6211;&#x4EEC;&#x770B;&#x770B;&#x5B83;&#x662F;&#x5982;&#x4F55;&#x5DE5;&#x4F5C;&#x7684;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E2A;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6211;&#x4EEC;&#x6709;&#x4E94;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#xFF1A;Alice, Bob, Carol, Diana, and Eric&#x3002;&#x8FD9;&#x4E94;&#x540D;&#x53C2;&#x4E0E;&#x8005;&#x5DF2;&#x7ECF;&#x5F7C;&#x6B64;&#x4E4B;&#x95F4;&#x5F00;&#x8BBE;&#x4E86;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002;Alice&#x548C;Bob&#x6709;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002;Bob&#x8FDE;&#x63A5;Carol&#xFF0C;Carol&#x8FDE;&#x63A5;&#x5230;Diana&#xFF0C;Diana&#x8FDE;&#x63A5;Eric&#x3002;&#x4E3A;&#x4E86;&#x7B80;&#x5355;&#x8D77;&#x89C1;&#xFF0C;&#x6211;&#x4EEC;&#x5047;&#x8BBE;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x90FD;&#x6CE8;&#x8D44;2&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x8D44;&#x91D1;&#xFF0C;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x7684;&#x603B;&#x5BB9;&#x91CF;&#x4E3A;4&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x4E0B;&#x56FE;12-9&#x663E;&#x793A;&#x4E00;&#x7CFB;&#x5217;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x652F;&#x4ED8;&#x7684;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4EE5;&#x652F;&#x6301;&#x4E00;&#x7B14;&#x4ECE;Alice&#x5230;Eric&#x7684;&#x4ED8;&#x6B3E; &#x5C55;&#x793A;&#x4E86;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4E2D;&#x4E94;&#x540D;&#x53C2;&#x4E0E;&#x8005;&#xFF0C;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#xFF0C;&#x53EF;&#x4ECE;Alice&#x4ED8;&#x6B3E;&#x5230;Eric&#xFF08;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x901A;&#x9053;&#xFF08;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#xFF09;&#xFF09;&#x3002;</p>
<p><a href="https://camo.githubusercontent.com/1f2a5c1dbf6f8c03097444f78075ff7321f7dc7c/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d656466393061356365666635613336652e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/1f2a5c1dbf6f8c03097444f78075ff7321f7dc7c/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d656466393061356365666635613336652e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-9&#x663E;&#x793A;&#x4E00;&#x7CFB;&#x5217;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x652F;&#x4ED8;&#x7684;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#x5728;&#x4E00;&#x8D77;&#x5F62;&#x6210;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4EE5;&#x652F;&#x6301;&#x4E00;&#x7B14;&#x4ECE;Alice&#x5230;Eric&#x7684;&#x4ED8;&#x6B3E;"></a></p>
<p>Alice&#x60F3;&#x8981;&#x652F;&#x4ED8;&#x7ED9;Eric1&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x3002; &#x4E0D;&#x8FC7;&#xFF0C;Alice&#x5E76;&#x672A;&#x901A;&#x8FC7;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x8FDE;&#x63A5;&#x5230;Eric&#x3002; &#x521B;&#x5EFA;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x9700;&#x8981;&#x8D44;&#x91D1;&#x4EA4;&#x6613;&#xFF0C;&#x800C;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x63D0;&#x4EA4;&#x7ED9;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x3002; Alice&#x4E0D;&#x60F3;&#x6253;&#x5F00;&#x4E00;&#x4E2A;&#x65B0;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x5E76;&#x652F;&#x51FA;&#x66F4;&#x591A;&#x7684;&#x624B;&#x7EED;&#x8D39;&#x3002; &#x6709;&#x6CA1;&#x6709;&#x529E;&#x6CD5;&#x95F4;&#x63A5;&#x652F;&#x4ED8;Eric&#xFF1F;</p>
<p>&#x4E0B;&#x56FE;12-10 &#x663E;&#x793A;&#x4E86;&#x901A;&#x8FC7;&#x5728;&#x8FDE;&#x63A5;&#x5404;&#x65B9;&#x53C2;&#x4E0E;&#x8005;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4E0A;&#x901A;&#x8FC7;&#x4E00;&#x7CFB;&#x5217;HTLC&#x627F;&#x8BFA;&#x5C06;&#x4ED8;&#x6B3E;&#x4ECE;Alice&#x8DEF;&#x7531;&#x5230;Eric&#x7684;&#x9010;&#x6B65;&#x8FC7;&#x7A0B;&#x3002;</p>
<p><a href="https://camo.githubusercontent.com/6c36ebad622e0fcbabea4123ce1339bb0b1a3eb0/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d346137363030663431656538343939612e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" target="_blank"><img src="https://camo.githubusercontent.com/6c36ebad622e0fcbabea4123ce1339bb0b1a3eb0/687474703a2f2f75706c6f61642d696d616765732e6a69616e7368752e696f2f75706c6f61645f696d616765732f313738353935392d346137363030663431656538343939612e706e673f696d6167654d6f6772322f6175746f2d6f7269656e742f7374726970253743696d61676556696577322f322f772f31323430" alt="&#x56FE;12-10 "></a></p>
<p>Alice&#x6B63;&#x5728;&#x8FD0;&#x884C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#xFF08;LN&#xFF09;&#x8282;&#x70B9;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x6B63;&#x5728;&#x8DDF;&#x8E2A;&#x5176;&#x5411;Bob&#x7684;&#x4ED8;&#x8D39;&#x901A;&#x9053;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x591F;&#x53D1;&#x73B0;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4E4B;&#x95F4;&#x7684;&#x8DEF;&#x7531;&#x3002;Alice&#x7684;LN&#x8282;&#x70B9;&#x8FD8;&#x5177;&#x6709;&#x901A;&#x8FC7;&#x4E92;&#x8054;&#x7F51;&#x8FDE;&#x63A5;&#x5230;Eric&#x7684;LN&#x8282;&#x70B9;&#x7684;&#x80FD;&#x529B;&#x3002; Eric&#x7684;LN&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x968F;&#x673A;&#x6570;&#x751F;&#x6210;&#x5668;&#x521B;&#x5EFA;&#x4E00;&#x4E2A;&#x79D8;&#x5BC6;R&#x3002;Eric&#x7684;&#x8282;&#x70B9;&#x6CA1;&#x6709;&#x5411;&#x4EFB;&#x4F55;&#x4EBA;&#x6CC4;&#x6F0F;&#x8FD9;&#x4E2A;&#x79D8;&#x5BC6;&#x3002;&#x76F8;&#x53CD;&#xFF0C;Eric&#x7684;&#x8282;&#x70B9;&#x8BA1;&#x7B97;&#x79D8;&#x5BC6;R&#x5BF9;&#x5E94;&#x7684;&#x54C8;&#x5E0C;H&#xFF0C;&#x5E76;&#x5C06;&#x6B64;&#x54C8;&#x5E0C;&#x53D1;&#x9001;&#x5230;Alice&#x7684;&#x8282;&#x70B9;&#xFF08;&#x8BF7;&#x53C2;&#x9605;&#x56FE;12-10&#x6B65;&#x9AA4;1&#xFF09;&#x3002;</p>
<p>&#x73B0;&#x5728;Alice&#x7684;LN&#x8282;&#x70B9;&#x6784;&#x5EFA;&#x4E86;Alice&#x7684;LN&#x8282;&#x70B9;&#x548C;Eric&#x7684;LN&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x8DEF;&#x7531;&#x3002;&#x6240;&#x4F7F;&#x7528;&#x7684;&#x8DEF;&#x7531;&#x7B97;&#x6CD5;&#x5C06;&#x5728;&#x540E;&#x9762;&#x8FDB;&#x884C;&#x66F4;&#x8BE6;&#x7EC6;&#x7684;&#x89E3;&#x91CA;&#xFF0C;&#x4F46;&#x73B0;&#x5728;&#x6211;&#x4EEC;&#x5047;&#x8BBE;Alice&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x7684;&#x8DEF;&#x7531;&#x3002;</p>
<p>&#x7136;&#x540E;&#xFF0C;Alice&#x7684;&#x8282;&#x70B9;&#x6784;&#x9020;&#x4E00;&#x4E2A;HTLC&#xFF0C;&#x652F;&#x4ED8;&#x5230;&#x54C8;&#x5E0C;H&#xFF0C;&#x5177;&#x6709;10&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#x7684;&#x9000;&#x6B3E;&#x8D85;&#x65F6;&#xFF08;&#x5F53;&#x524D;&#x5757;+10&#xFF09;&#xFF0C;&#x6570;&#x91CF;&#x4E3A;1.003&#x6BD4;&#x7279;&#x5E01;&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x7684;&#x6B65;&#x9AA4;2&#xFF09;&#x3002;&#x989D;&#x5916;&#x7684;0.003&#x5C06;&#x7528;&#x4E8E;&#x8865;&#x507F;&#x53C2;&#x4E0E;&#x6B64;&#x652F;&#x4ED8;&#x8DEF;&#x7531;&#x7684;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x3002;Alice&#x5C06;&#x6B64;HTLC&#x63D0;&#x4F9B;&#x7ED9;Bob&#xFF0C;&#x4ECE;&#x548C;Bob&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x4E2D;&#x6263;&#x9664;1.003&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x63D0;&#x4EA4;&#x7ED9;HTLC&#x3002; &#x8BE5;HTLC&#x5177;&#x6709;&#x4EE5;&#x4E0B;&#x542B;&#x4E49;&#xFF1A;&#x201C;&#x5982;&#x679C;Bob&#x77E5;&#x9053;&#x79D8;&#x5BC6;&#xFF0C;Alice&#x5C06;&#x5176;&#x901A;&#x9053;&#x4F59;&#x989D;&#x7684;1.003&#x652F;&#x4ED8;&#x7ED9;Bob&#xFF0C;&#x6216;&#x8005;&#x5982;&#x679C;&#x8D85;&#x8FC7;10&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#x540E;&#xFF0C;&#x5219;&#x9000;&#x8FD8;&#x5165;Alice&#x7684;&#x4F59;&#x989D;&#x201D;&#x3002; Alice&#x548C;Bob&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x73B0;&#x5728;&#x7531;&#x627F;&#x8BFA;&#x4EA4;&#x6613;&#x8868;&#x793A;&#xFF0C;&#x5176;&#x4E2D;&#x6709;&#x4E09;&#x4E2A;&#x8F93;&#x51FA;&#xFF1A;Bob&#x7684;2&#x6BD4;&#x7279;&#x5E01;&#x4F59;&#x989D;&#xFF0C;Alice&#x7684;0.997&#x6BD4;&#x7279;&#x5E01;&#x4F59;&#x989D;&#xFF0C;Alice&#x7684;HTLC&#x4E2D;&#x627F;&#x8BFA;&#x7684;1.003&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x627F;&#x8BFA;&#x5728;HTLC&#x4E2D;&#x7684;&#x91D1;&#x989D;&#x4ECE;Alice&#x7684;&#x4F59;&#x989D;&#x4E2D;&#x88AB;&#x51CF;&#x53BB;&#x3002;</p>
<p>Bob&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#xFF0C;&#x5982;&#x679C;&#x4ED6;&#x80FD;&#x591F;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;10&#x4E2A;&#x533A;&#x5757;&#x751F;&#x4EA7;&#x65F6;&#x95F4;&#x5185;&#x83B7;&#x5F97;&#x79D8;&#x5BC6;R&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;Alice&#x9501;&#x5B9A;&#x7684;1.003&#x3002;&#x624B;&#x4E0A;&#x6709;&#x4E86;&#x8FD9;&#x4E00;&#x627F;&#x8BFA;&#xFF0C;Bob&#x7684;&#x8282;&#x70B9;&#x5728;&#x548C;Carol&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4E0A;&#x6784;&#x5EFA;&#x4E86;&#x4E00;&#x4E2A;HTLC&#x3002;Bob&#x7684;HTLC&#x63D0;&#x4EA4;1.002&#x6BD4;&#x7279;&#x5E01;&#x5230;&#x54C8;&#x5E0C;H&#x5171;9&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#xFF0C;&#x8FD9;&#x4E2A;HTLC&#x4E2D;&#x5982;&#x679C;Carol&#x6709;&#x79D8;&#x5BC6;R&#x5979;&#x53EF;&#x4EE5;&#x5151;&#x6362;&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x6B65;&#x9AA4;3&#xFF09;&#x3002;Bob&#x77E5;&#x9053;&#xFF0C;&#x5982;&#x679C;Carol&#x8981;&#x83B7;&#x53D6;&#x4ED6;&#x7684;HTLC&#xFF0C;&#x5979;&#x5FC5;&#x987B;&#x51FA;&#x793A;&#x79D8;&#x5BC6;R&#x3002;&#x5982;&#x679C;Bob&#x5728;9&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#x5185;&#x6709;R&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x83B7;&#x53D6;Alice&#x7684;HTLC&#x7ED9;&#x81EA;&#x5DF1;&#x3002;&#x901A;&#x8FC7;&#x627F;&#x8BFA;&#x81EA;&#x5DF1;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;9&#x4E2A;&#x533A;&#x5757;&#x7684;&#x65F6;&#x95F4;&#xFF0C;&#x4ED6;&#x4E5F;&#x8D5A;&#x4E86;0.001&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5982;&#x679C;Carol&#x65E0;&#x6CD5;&#x83B7;&#x53D6;&#x4ED6;&#x7684;HTLC&#xFF0C;&#x5E76;&#x4E14;&#x4ED6;&#x4E5F;&#x65E0;&#x6CD5;&#x83B7;&#x53D6;Alice&#x7684;HTLC&#xFF0C;&#x90A3;&#x4E48;&#x4E00;&#x5207;&#x90FD;&#x5C06;&#x6062;&#x590D;&#x5230;&#x4EE5;&#x524D;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#xFF0C;&#x6CA1;&#x6709;&#x4EBA;&#x4F1A;&#x4E8F;&#x635F;&#x3002; Bob&#x548C;Carol&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x73B0;&#x5728;&#x662F;&#xFF1A;2&#x6BD4;&#x7279;&#x5E01;&#x7ED9;Carol&#xFF0C;0.998&#x7ED9;Bob&#xFF0C;1.002&#x7531;Bob&#x627F;&#x8BFA;&#x7ED9;HTLC&#x3002;</p>
<p>Carol&#x73B0;&#x5728;&#x6709;&#x4E00;&#x4E2A;&#x627F;&#x8BFA;&#xFF0C;&#x5982;&#x679C;&#x5979;&#x5728;&#x63A5;&#x4E0B;&#x6765;&#x7684;9&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#x5185;&#x83B7;&#x5F97;R&#xFF0C;&#x5979;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;Bob&#x7684;&#x9501;&#x5B9A;1.002&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x73B0;&#x5728;&#x5979;&#x53EF;&#x4EE5;&#x5728;&#x5979;&#x4E0E;Diana&#x7684;&#x901A;&#x9053;&#x4E0A;&#x6784;&#x5EFA;HTLC&#x627F;&#x8BFA;&#x3002;&#x5979;&#x63D0;&#x4EA4;&#x4E86;&#x4E00;&#x4E2A;1.001&#x6BD4;&#x7279;&#x5E01;&#x7684;HTLC&#x5230;&#x54C8;&#x5E0C;H&#xFF0C;&#x5171;&#x8BA1;8&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#xFF0C;&#x5982;&#x679C;Diana&#x6709;&#x79D8;&#x5BC6;R &#xFF0C;&#x5979;&#x5C31;&#x53EF;&#x4EE5;&#x5151;&#x6362;&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x6B65;&#x9AA4;4&#xFF09;&#x3002;&#x4ECE;Carol&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x591F;&#x5B9E;&#x73B0;&#xFF0C;&#x5979;&#x5C31;&#x53EF;&#x4EE5;&#x83B7;&#x5F97;&#x7684;0.001&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5426;&#x5219;&#x4E5F;&#x6CA1;&#x6709;&#x5931;&#x53BB;&#x4EFB;&#x4F55;&#x4E1C;&#x897F;&#x3002;&#x5979;&#x63D0;&#x4EA4;&#x7ED9;Diana&#x7684;HTLC&#xFF0C;&#x53EA;&#x6709;&#x5728;R&#x88AB;&#x6CC4;&#x6F0F;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x53EF;&#x884C;&#xFF0C;&#x5230;&#x90A3;&#x65F6;&#x5019;&#x5979;&#x53EF;&#x4EE5;&#x4ECE;Bob&#x90A3;&#x91CC;&#x7D22;&#x53D6;HTLC&#x3002;Carol&#x548C;Diana&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x73B0;&#x5728;&#x662F;&#xFF1A;2&#x7ED9;Diana&#xFF0C;0.999&#x7ED9;Carol&#xFF0C;1.001&#x7531;Carol&#x627F;&#x8BFA;&#x7ED9;HTLC&#x3002;</p>
<p>&#x6700;&#x540E;&#xFF0C;Diana&#x53EF;&#x4EE5;&#x63D0;&#x4F9B;&#x7ED9;Eric&#x4E00;&#x4E2A;HTLC&#xFF0C;&#x627F;&#x8BFA;1&#x6BD4;&#x7279;&#x5E01;&#xFF0C;7&#x4E2A;&#x533A;&#x5757;&#x65F6;&#x95F4;&#xFF0C;&#x5230;&#x54C8;&#x5E0C;H&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x7684;&#x6B65;&#x9AA4;5&#xFF09;&#x3002;Diana&#x4E0E;Eric&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x73B0;&#x5728;&#x662F;&#xFF1A;2&#x7ED9;Eric&#xFF0C;1&#x7ED9;Diana&#xFF0C;1&#x7531;Diana&#x627F;&#x8BFA;&#x7ED9;HTLC&#x3002;</p>
<p>&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8FD9;&#x6761;&#x8DEF;&#x4E0A;&#xFF0C;Eric&#x62E5;&#x6709;&#x79D8;&#x5BC6;R&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;Diana&#x63D0;&#x4F9B;&#x7684;HTLC&#x3002;&#x4ED6;&#x5C06;R&#x53D1;&#x9001;&#x7ED9;Diana&#xFF0C;&#x5E76;&#x83B7;&#x53D6;1&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x6DFB;&#x52A0;&#x5230;&#x4ED6;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x4E2D;&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x7684;&#x6B65;&#x9AA4;6&#xFF09;&#x3002;&#x901A;&#x9053;&#x5E73;&#x8861;&#x73B0;&#x5728;&#x662F;&#xFF1A;1&#x7ED9;Diana&#xFF0C;3&#x7ED9;Eric&#x3002;</p>
<p>&#x73B0;&#x5728;&#xFF0C;Diana&#x6709;&#x79D8;&#x5BC6;R&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x5979;&#x73B0;&#x5728;&#x53EF;&#x4EE5;&#x83B7;&#x53D6;&#x6765;&#x81EA;Carol&#x7684;HTLC&#x3002;Diana&#x5C06;R&#x53D1;&#x9001;&#x7ED9;Carol&#xFF0C;&#x5E76;&#x5C06;1.001&#x6BD4;&#x7279;&#x5E01;&#x6DFB;&#x52A0;&#x5230;&#x5176;&#x901A;&#x9053;&#x4F59;&#x989D;&#x4E2D;&#xFF08;&#x53C2;&#x89C1;&#x56FE;12-10&#x7684;&#x6B65;&#x9AA4;7&#x3002;&#x73B0;&#x5728;Carol&#x4E0E;Diana&#x4E4B;&#x95F4;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x662F;&#xFF1A;0.999&#x7ED9;Carol&#xFF0C;3.001&#x7ED9;Diana&#x3002;Diana&#x5DF2;&#x7ECF;&#x201C;&#x8D5A;&#x4E86;&#x201D;&#x53C2;&#x4E0E;&#x8FD9;&#x4E2A;&#x4ED8;&#x6B3E;&#x8DEF;&#x7EBF;0.001&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p>&#x901A;&#x8FC7;&#x8DEF;&#x7531;&#x56DE;&#x4F20;&#xFF0C;&#x79D8;&#x5BC6;R&#x5141;&#x8BB8;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x83B7;&#x53D6;&#x672A;&#x5B8C;&#x6210;&#x7684;HTLC&#x3002;Carol&#x4ECE;Bob&#x90A3;&#x91CC;&#x83B7;&#x53D6;1.002&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5C06;&#x4ED6;&#x4EEC;&#x901A;&#x9053;&#x4F59;&#x989D;&#x8BBE;&#x4E3A;&#xFF1A;0.998&#x7ED9;Bob&#xFF0C;3.002&#x7ED9;Carol&#xFF08;&#x53C2;&#x89C1;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x6B65;&#x9AA4;8&#xFF09;&#x3002;&#x6700;&#x540E;&#xFF0C;Bob&#x83B7;&#x53D6;&#x6765;&#x81EA;Alice&#x7684;HTLC&#xFF08;&#x53C2;&#x89C1;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x6B65;&#x9AA4;9&#xFF09;&#x3002;&#x4ED6;&#x4EEC;&#x7684;&#x901A;&#x9053;&#x4F59;&#x989D;&#x66F4;&#x65B0;&#x4E3A;&#xFF1A;0.997&#x7ED9;Alice&#xFF0C;3.003&#x7ED9;Bob&#x3002;</p>
<p>&#x5728;&#x6CA1;&#x6709;&#x5411;Eric&#x6253;&#x5F00;&#x901A;&#x9053;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;Alice&#x5DF2;&#x7ECF;&#x652F;&#x4ED8;&#x4E86;Eric 1&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x4ED8;&#x6B3E;&#x8DEF;&#x7EBF;&#x4E2D;&#x7684;&#x4E2D;&#x95F4;&#x65B9;&#x4E0D;&#x5FC5;&#x8981;&#x4E92;&#x76F8;&#x4FE1;&#x4EFB;&#x3002;&#x5728;&#x4ED6;&#x4EEC;&#x7684;&#x901A;&#x9053;&#x5185;&#x505A;&#x4E00;&#x4E2A;&#x77ED;&#x65F6;&#x95F4;&#x7684;&#x8D44;&#x91D1;&#x627F;&#x8BFA;&#xFF0C;&#x4ED6;&#x4EEC;&#x53EF;&#x4EE5;&#x8D5A;&#x53D6;&#x4E00;&#x5C0F;&#x7B14;&#x8D39;&#x7528;&#xFF0C;&#x552F;&#x4E00;&#x7684;&#x98CE;&#x9669;&#x662F;&#xFF0C;&#x5982;&#x679C;&#x901A;&#x9053;&#x5173;&#x95ED;&#x6216;&#x8DEF;&#x7531;&#x4ED8;&#x6B3E;&#x5931;&#x8D25;&#xFF0C;&#x9000;&#x6B3E;&#x6709;&#x6BB5;&#x77ED;&#x77ED;&#x7684;&#x5EF6;&#x8FDF;&#x65F6;&#x95F4;&#x3002;</p>
<h3 id="1272&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x548C;&#x8DEF;&#x7531;">12.7.2&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#x548C;&#x8DEF;&#x7531;</h3>
<p>LN&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x7684;&#x6240;&#x6709;&#x901A;&#x4FE1;&#x90FD;&#x662F;&#x70B9;&#x5BF9;&#x70B9;&#x52A0;&#x5BC6;&#x7684;&#x3002; &#x53E6;&#x5916;&#xFF0C;&#x8282;&#x70B9;&#x6709;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x516C;&#x94A5;&#xFF0C;<a href="http://bit.ly/2r5TACm" target="_blank">&#x5B83;&#x4EEC;&#x7528;&#x4F5C;&#x6807;&#x8BC6;&#x7B26;&#x5E76;&#x4E14;&#x5F7C;&#x6B64;&#x8BA4;&#x8BC1;&#x5BF9;&#x65B9;</a>&#x3002;</p>
<p>&#x6BCF;&#x5F53;&#x8282;&#x70B9;&#x5E0C;&#x671B;&#x5411;&#x53E6;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x53D1;&#x9001;&#x652F;&#x4ED8;&#x65F6;&#xFF0C;&#x5B83;&#x5FC5;&#x987B;&#x9996;&#x5148;&#x901A;&#x8FC7;&#x8FDE;&#x63A5;&#x5177;&#x6709;&#x8DB3;&#x591F;&#x5BB9;&#x91CF;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x6765;&#x6784;&#x5EFA;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x7684;&#x8DEF;&#x5F84;&#x3002;&#x8282;&#x70B9;&#x5BA3;&#x4F20;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#xFF0C;&#x5305;&#x62EC;&#x4ED6;&#x4EEC;&#x5DF2;&#x7ECF;&#x6253;&#x5F00;&#x4E86;&#x4EC0;&#x4E48;&#x901A;&#x9053;&#xFF0C;&#x6BCF;&#x4E2A;&#x901A;&#x9053;&#x62E5;&#x6709;&#x591A;&#x5C11;&#x5BB9;&#x91CF;&#xFF0C;&#x4EE5;&#x53CA;&#x4ED6;&#x4EEC;&#x6536;&#x53D6;&#x591A;&#x5C11;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x8D39;&#x7528;&#x3002;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x4EE5;&#x5404;&#x79CD;&#x65B9;&#x5F0F;&#x5171;&#x4EAB;&#xFF0C;&#x5E76;&#x4E14;&#x968F;&#x7740;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x6280;&#x672F;&#x7684;&#x8FDB;&#x6B65;&#xFF0C;&#x4E0D;&#x540C;&#x7684;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#x53EF;&#x80FD;&#x4F1A;&#x51FA;&#x73B0;&#x3002;&#x4E00;&#x4E9B;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5B9E;&#x65BD;&#x4F7F;&#x7528;IRC&#x534F;&#x8BAE;&#x4F5C;&#x4E3A;&#x8282;&#x70B9;&#x5BA3;&#x5E03;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x7684;&#x4E00;&#x79CD;&#x65B9;&#x4FBF;&#x7684;&#x673A;&#x5236;&#x3002;&#x8DEF;&#x7531;&#x53D1;&#x73B0;&#x7684;&#x53E6;&#x4E00;&#x79CD;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x662F;&#x4F7F;&#x7528;P2P&#x6A21;&#x578B;&#xFF0C;&#x5176;&#x4E2D;&#x8282;&#x70B9;&#x5C06;&#x901A;&#x9053;&#x5BA3;&#x4F20;&#x4F20;&#x64AD;&#x7ED9;&#x4ED6;&#x4EEC;&#x7684;&#x5BF9;&#x7B49;&#x4F53;&#xFF0C;&#x5728;&#x201C;&#x6D2A;&#x6C34;&#x6CDB;&#x6EE5;&#x201D;&#x6A21;&#x578B;&#x4E2D;&#xFF0C;&#x8FD9;&#x7C7B;&#x4F3C;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x4F20;&#x64AD;&#x4EA4;&#x6613;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x672A;&#x6765;&#x7684;&#x8BA1;&#x5212;&#x5305;&#x62EC;&#x4E00;&#x4E2A;&#x540D;&#x4E3A;<a href="http://bit.ly/2r5TACm" target="_blank">Flare</a>&#x7684;&#x5EFA;&#x8BAE;&#xFF0C;&#x5B83;&#x662F;&#x4E00;&#x79CD;&#x5177;&#x6709;&#x672C;&#x5730;&#x8282;&#x70B9;&#x201C;&#x90BB;&#x5C45;&#x201D;&#x548C;&#x8F83;&#x957F;&#x8DDD;&#x79BB;&#x7684;&#x4FE1;&#x6807;&#x8282;&#x70B9;&#x7684;&#x6DF7;&#x5408;&#x8DEF;&#x7531;&#x6A21;&#x578B;&#x3002;</p>
<p>&#x5728;&#x6211;&#x4EEC;&#x524D;&#x9762;&#x7684;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;Alice&#x7684;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x8FD9;&#x4E9B;&#x8DEF;&#x7531;&#x53D1;&#x73B0;&#x673A;&#x5236;&#x4E4B;&#x4E00;&#x6765;&#x67E5;&#x627E;&#x5C06;&#x5979;&#x7684;&#x8282;&#x70B9;&#x8FDE;&#x63A5;&#x5230;Eric&#x7684;&#x8282;&#x70B9;&#x7684;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8DEF;&#x5F84;&#x3002;&#x4E00;&#x65E6;Alice&#x7684;&#x8282;&#x70B9;&#x6784;&#x5EFA;&#x4E86;&#x8DEF;&#x5F84;&#xFF0C;&#x5979;&#x5C06;&#x901A;&#x8FC7;&#x7F51;&#x7EDC;&#x521D;&#x59CB;&#x5316;&#x8BE5;&#x8DEF;&#x5F84;&#xFF0C;&#x4F20;&#x64AD;&#x4E00;&#x7CFB;&#x5217;&#x52A0;&#x5BC6;&#x548C;&#x5D4C;&#x5957;&#x7684;&#x6307;&#x4EE4;&#x6765;&#x8FDE;&#x63A5;&#x6BCF;&#x4E2A;&#x76F8;&#x90BB;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x3002;</p>
<p>&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x4E2A;&#x8DEF;&#x5F84;&#x53EA;&#x6709;Alice&#x7684;&#x8282;&#x70B9;&#x624D;&#x77E5;&#x9053;&#x3002;&#x4ED8;&#x6B3E;&#x8DEF;&#x7EBF;&#x4E0A;&#x7684;&#x6240;&#x6709;&#x5176;&#x4ED6;&#x53C2;&#x4E0E;&#x8005;&#x53EA;&#x80FD;&#x770B;&#x5230;&#x76F8;&#x90BB;&#x7684;&#x8282;&#x70B9;&#x3002;&#x4ECE;Carol&#x7684;&#x89D2;&#x5EA6;&#x6765;&#x770B;&#xFF0C;&#x8FD9;&#x770B;&#x8D77;&#x6765;&#x50CF;&#x662F;&#x4ECE;Bob&#x5230;Diana&#x7684;&#x4ED8;&#x6B3E;&#x3002; Carol&#x4E0D;&#x77E5;&#x9053;Bob&#x5B9E;&#x9645;&#x4E0A;&#x662F;&#x4E2D;&#x7EE7;&#x8F6C;&#x53D1;Alice&#x7684;&#x6C47;&#x6B3E;&#x3002;&#x5979;&#x4E5F;&#x4E0D;&#x77E5;&#x9053;Diana&#x5C06;&#x4F1A;&#x5411;Eric&#x4E2D;&#x7EE7;&#x8F6C;&#x53D1;&#x4ED8;&#x6B3E;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;&#x4E00;&#x4E2A;&#x91CD;&#x8981;&#x7279;&#x5F81;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x786E;&#x4FDD;&#x4E86;&#x4ED8;&#x6B3E;&#x7684;&#x9690;&#x79C1;&#xFF0C;&#x5E76;&#x4E14;&#x4F7F;&#x5F97;&#x5F88;&#x96BE;&#x5E94;&#x7528;&#x76D1;&#x89C6;&#xFF0C;&#x5BA1;&#x67E5;&#x6216;&#x9ED1;&#x540D;&#x5355;&#x3002;&#x4F46;&#x662F;&#xFF0C;Alice&#x5982;&#x4F55;&#x5EFA;&#x7ACB;&#x8FD9;&#x79CD;&#x4ED8;&#x6B3E;&#x9014;&#x5F84;&#xFF0C;&#x800C;&#x4E0D;&#x5411;&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x900F;&#x9732;&#x4EFB;&#x4F55;&#x5185;&#x5BB9;&#xFF1F;</p>
<p>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5B9E;&#x73B0;&#x4E86;&#x4E00;&#x79CD;&#x57FA;&#x4E8E;&#x79F0;&#x4E3A;Sphinx&#x7684;&#x65B9;&#x6848;&#x7684;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#x3002;&#x8BE5;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#x786E;&#x4FDD;&#x652F;&#x4ED8;&#x53D1;&#x9001;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x6784;&#x5EFA;&#x548C;&#x901A;&#x4FE1;&#x8DEF;&#x5F84;&#xFF0C;&#x4F7F;&#x5F97;&#xFF1A;</p>
<ul>
<li>&#x4E2D;&#x95F4;&#x8282;&#x70B9;&#x53EF;&#x4EE5;&#x9A8C;&#x8BC1;&#x548C;&#x89E3;&#x5BC6;&#x5176;&#x90E8;&#x5206;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#xFF0C;&#x5E76;&#x627E;&#x5230;&#x4E0B;&#x4E00;&#x8DF3;&#x3002;</li>
<li>&#x9664;&#x4E86;&#x4E0A;&#x4E00;&#x8DF3;&#x548C;&#x4E0B;&#x4E00;&#x8DF3;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x80FD;&#x4E86;&#x89E3;&#x4F5C;&#x4E3A;&#x8DEF;&#x5F84;&#x4E00;&#x90E8;&#x5206;&#x7684;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x3002;</li>
<li>&#x4ED6;&#x4EEC;&#x65E0;&#x6CD5;&#x8BC6;&#x522B;&#x652F;&#x4ED8;&#x8DEF;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#xFF0C;&#x6216;&#x8005;&#x4ED6;&#x4EEC;&#x81EA;&#x5DF1;&#x5728;&#x8BE5;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;</li>
<li>&#x8DEF;&#x5F84;&#x7684;&#x6BCF;&#x4E2A;&#x90E8;&#x5206;&#x88AB;&#x52A0;&#x5BC6;&#xFF0C;&#x4F7F;&#x5F97;&#x7F51;&#x7EDC;&#x7EA7;&#x653B;&#x51FB;&#x8005;&#x4E0D;&#x80FD;&#x5C06;&#x6765;&#x81EA;&#x8DEF;&#x5F84;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x7684;&#x6570;&#x636E;&#x5305;&#x5F7C;&#x6B64;&#x5173;&#x8054;&#x3002;</li>
<li>&#x4E0D;&#x540C;&#x4E8E;Tor&#xFF08;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x7684;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x533F;&#x540D;&#x534F;&#x8BAE;&#xFF09;&#xFF0C;&#x6CA1;&#x6709;&#x53EF;&#x4EE5;&#x88AB;&#x76D1;&#x89C6;&#x7684;&#x201C;&#x9000;&#x51FA;&#x8282;&#x70B9;&#x201D;&#x3002;&#x4ED8;&#x6B3E;&#x4E0D;&#x9700;&#x8981;&#x4F20;&#x8F93;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x8282;&#x70B9;&#x53EA;&#x662F;&#x66F4;&#x65B0;&#x901A;&#x9053;&#x4F59;&#x989D;&#x3002;</li>
</ul>
<p>&#x4F7F;&#x7528;&#x8FD9;&#x79CD;&#x6D0B;&#x8471;&#x8DEF;&#x7531;&#x534F;&#x8BAE;&#xFF0C;Alice&#x5C06;&#x8DEF;&#x5F84;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5305;&#x88F9;&#x5728;&#x4E00;&#x5C42;&#x52A0;&#x5BC6;&#x4E2D;&#xFF0C;&#x4ECE;&#x5C3E;&#x7AEF;&#x5F00;&#x59CB;&#x5012;&#x8FC7;&#x6765;&#x8FD0;&#x7B97;&#x3002;&#x5979;&#x7528;Eric&#x7684;&#x516C;&#x94A5;&#x52A0;&#x5BC6;&#x4E86;Eric&#x7684;&#x6D88;&#x606F;&#x3002;&#x8BE5;&#x6D88;&#x606F;&#x5305;&#x88F9;&#x5728;&#x52A0;&#x5BC6;&#x5230;Diana&#x7684;&#x6D88;&#x606F;&#x4E2D;&#xFF0C;&#x5C06;Eric&#x6807;&#x8BC6;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x6536;&#x4EF6;&#x4EBA;&#x3002;&#x7ED9;Diana&#x7684;&#x6D88;&#x606F;&#x5305;&#x88F9;&#x5728;&#x52A0;&#x5BC6;&#x5230;Carol&#x7684;&#x516C;&#x94A5;&#x7684;&#x6D88;&#x606F;&#x4E2D;&#xFF0C;&#x5E76;&#x5C06;Diana&#x8BC6;&#x522B;&#x4E3A;&#x4E0B;&#x4E00;&#x4E2A;&#x6536;&#x4EF6;&#x4EBA;&#x3002;&#x5BF9;Carol&#x7684;&#x6D88;&#x606F;&#x88AB;Bob&#x7684;&#x5BC6;&#x94A5;&#x52A0;&#x5BC6;&#x3002;&#x8FD9;&#x6837;&#x4E00;&#x6765;&#xFF0C;Alice&#x5DF2;&#x7ECF;&#x6784;&#x5EFA;&#x4E86;&#x8FD9;&#x4E2A;&#x52A0;&#x5BC6;&#x7684;&#x591A;&#x5C42;&#x201C;&#x6D0B;&#x8471;&#x201D;&#x7684;&#x6D88;&#x606F;&#x3002;&#x5979;&#x53D1;&#x9001;&#x7ED9;Bob&#xFF0C;&#x4ED6;&#x53EA;&#x80FD;&#x89E3;&#x5BC6;&#x548C;&#x89E3;&#x5F00;&#x5916;&#x5C42;&#x3002;&#x5728;&#x91CC;&#x9762;&#xFF0C;Bob&#x53D1;&#x73B0;&#x4E00;&#x5C01;&#x7ED9;Carol&#x7684;&#x6D88;&#x606F;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x8F6C;&#x53D1;&#x7ED9;Carol&#xFF0C;&#x4F46;&#x4E0D;&#x80FD;&#x81EA;&#x5DF1;&#x7834;&#x8BD1;&#x3002;&#x6309;&#x7167;&#x8DEF;&#x5F84;&#xFF0C;&#x6D88;&#x606F;&#x88AB;&#x8F6C;&#x53D1;&#xFF0C;&#x89E3;&#x5BC6;&#xFF0C;&#x8F6C;&#x53D1;&#x7B49;&#xFF0C;&#x4E00;&#x8DEF;&#x5230;Eric&#x90A3;&#x91CC;&#x3002;&#x6BCF;&#x4E2A;&#x53C2;&#x4E0E;&#x8005;&#x53EA;&#x77E5;&#x9053;&#x5404;&#x81EA;&#x8FD9;&#x4E00;&#x8DF3;&#x7684;&#x524D;&#x4E00;&#x4E2A;&#x548C;&#x4E0B;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x3002;</p>
<p>&#x8DEF;&#x5F84;&#x7684;&#x6BCF;&#x4E2A;&#x5143;&#x7D20;&#x5305;&#x542B;&#x627F;&#x8F7D;&#x4E8E;HTLC&#x7684;&#x5FC5;&#x987B;&#x6269;&#x5C55;&#x5230;&#x4E0B;&#x4E00;&#x8DF3;&#x7684;&#x4FE1;&#x606F;&#xFF0C;HTLC&#x4E2D;&#x7684;&#x8981;&#x53D1;&#x9001;&#x7684;&#x6570;&#x91CF;&#xFF0C;&#x8981;&#x5305;&#x62EC;&#x7684;&#x8D39;&#x7528;&#x4EE5;&#x53CA;CLTV&#x9501;&#x5B9A;&#x5230;&#x671F;&#x65F6;&#x95F4;&#xFF08;&#x4EE5;&#x5757;&#x4E3A;&#x5355;&#x4F4D;&#xFF09;&#x3002;&#x968F;&#x7740;&#x8DEF;&#x7531;&#x4FE1;&#x606F;&#x7684;&#x4F20;&#x64AD;&#xFF0C;&#x8282;&#x70B9;&#x5C06;HTLC&#x627F;&#x8BFA;&#x8F6C;&#x53D1;&#x5230;&#x4E0B;&#x4E00;&#x8DF3;&#x3002;</p>
<p>&#x5728;&#x8FD9;&#x4E00;&#x70B9;&#x4E0A;&#xFF0C;&#x60A8;&#x53EF;&#x80FD;&#x4F1A;&#x60F3;&#x77E5;&#x9053;&#x8282;&#x70B9;&#x600E;&#x4E48;&#x77E5;&#x9053;&#x8DEF;&#x5F84;&#x7684;&#x957F;&#x5EA6;&#x53CA;&#x5176;&#x5728;&#x8BE5;&#x8DEF;&#x5F84;&#x4E2D;&#x7684;&#x4F4D;&#x7F6E;&#x3002;&#x6BD5;&#x7ADF;&#xFF0C;&#x4ED6;&#x4EEC;&#x6536;&#x5230;&#x4E00;&#x4E2A;&#x6D88;&#x606F;&#xFF0C;&#x5E76;&#x5C06;&#x5176;&#x8F6C;&#x53D1;&#x5230;&#x4E0B;&#x4E00;&#x8DF3;&#x3002;&#x96BE;&#x9053;&#x5B83;&#x4E0D;&#x4F1A;&#x5C06;&#x8DEF;&#x5F84;&#x7F29;&#x77ED;&#xFF0C;&#x6216;&#x8005;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x63A8;&#x65AD;&#x51FA;&#x8DEF;&#x5F84;&#x5927;&#x5C0F;&#x548C;&#x4F4D;&#x7F6E;&#xFF1F;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#xFF0C;&#x8DEF;&#x5F84;&#x603B;&#x662F;&#x56FA;&#x5B9A;&#x5728;20&#x8DF3;&#xFF0C;&#x5E76;&#x7528;&#x968F;&#x673A;&#x6570;&#x636E;&#x586B;&#x5145;&#x3002;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x4F1A;&#x770B;&#x5230;&#x4E0B;&#x4E00;&#x8DF3;&#x548C;&#x4E00;&#x4E2A;&#x8981;&#x8F6C;&#x53D1;&#x7684;&#x56FA;&#x5B9A;&#x957F;&#x5EA6;&#x7684;&#x52A0;&#x5BC6;&#x6D88;&#x606F;&#x3002;&#x53EA;&#x6709;&#x6700;&#x7EC8;&#x7684;&#x6536;&#x4EF6;&#x4EBA;&#x770B;&#x5F97;&#x5230;&#x6CA1;&#x6709;&#x4E0B;&#x4E00;&#x8DF3;&#x3002;&#x5BF9;&#x4E8E;&#x5176;&#x4ED6;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x4F3C;&#x4E4E;&#x603B;&#x662F;&#x6709;20&#x591A;&#x8DF3;&#x8981;&#x8D70;&#x3002;</p>
<h3 id="1273&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4F18;&#x52BF;">12.7.3&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4F18;&#x52BF;</h3>
<p>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x662F;&#x7B2C;&#x4E8C;&#x5C42;&#x8DEF;&#x7531;&#x6280;&#x672F;&#x3002;&#x5B83;&#x53EF;&#x4EE5;&#x5E94;&#x7528;&#x4E8E;&#x652F;&#x6301;&#x4E00;&#x4E9B;&#x57FA;&#x672C;&#x529F;&#x80FD;&#x7684;&#x4EFB;&#x4F55;&#x533A;&#x5757;&#x94FE;&#xFF0C;&#x5982;&#x591A;&#x91CD;&#x7B7E;&#x540D;&#x4EA4;&#x6613;&#xFF0C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x548C;&#x57FA;&#x672C;&#x7684;&#x667A;&#x80FD;&#x5408;&#x7EA6;&#x3002;</p>
<p>&#x5982;&#x679C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x642D;&#x5EFA;&#x5728;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4E4B;&#x4E0A;&#xFF0C;&#x5219;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x5927;&#x5927;&#x63D0;&#x9AD8;&#x5BB9;&#x91CF;&#xFF0C;&#x9690;&#x79C1;&#x6027;&#xFF0C;&#x7C92;&#x5EA6;&#x548C;&#x901F;&#x5EA6;&#xFF0C;&#x800C;&#x4E0D;&#x4F1A;&#x727A;&#x7272;&#x65E0;&#x4E2D;&#x4ECB;&#x673A;&#x6784;&#x7684;&#x65E0;&#x4FE1;&#x4EFB;&#x64CD;&#x4F5C;&#x539F;&#x5219;&#xFF1A;</p>
<p><strong>&#x9690;&#x79C1;</strong> &#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4ED8;&#x6B3E;&#x6BD4;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4ED8;&#x6B3E;&#x66F4;&#x79C1;&#x5BC6;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EEC;&#x4E0D;&#x662F;&#x516C;&#x5F00;&#x7684;&#x3002;&#x867D;&#x7136;&#x8DEF;&#x7531;&#x4E2D;&#x7684;&#x53C2;&#x4E0E;&#x8005;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x5728;&#x5176;&#x901A;&#x9053;&#x4E0A;&#x4F20;&#x64AD;&#x7684;&#x4ED8;&#x6B3E;&#xFF0C;&#x4F46;&#x4ED6;&#x4EEC;&#x5E76;&#x4E0D;&#x77E5;&#x9053;&#x53D1;&#x4EF6;&#x4EBA;&#x6216;&#x6536;&#x4EF6;&#x4EBA;&#x3002;</p>
<p><strong>&#x6D41;&#x52A8;&#x6027;</strong> &#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4F7F;&#x5F97;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E0A;&#x5E94;&#x7528;&#x76D1;&#x89C6;&#x548C;&#x9ED1;&#x540D;&#x5355;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x56F0;&#x96BE;&#xFF0C;&#x4ECE;&#x800C;&#x589E;&#x52A0;&#x4E86;&#x8D27;&#x5E01;&#x7684;&#x6D41;&#x52A8;&#x6027;&#x3002;</p>
<p><strong>&#x901F;&#x5EA6;</strong> &#x4F7F;&#x7528;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x5C06;&#x4EE5;&#x6BEB;&#x79D2;&#x4E3A;&#x5355;&#x4F4D;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x5206;&#x949F;&#xFF0C;&#x56E0;&#x4E3A;HTLC&#x5728;&#x4E0D;&#x7528;&#x63D0;&#x4EA4;&#x4EA4;&#x6613;&#x5230;&#x533A;&#x5757;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x88AB;&#x7ED3;&#x7B97;&#x3002;</p>
<p><strong>&#x7C92;&#x5EA6;</strong> &#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x53EF;&#x4EE5;&#x4F7F;&#x652F;&#x4ED8;&#x81F3;&#x5C11;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x201C;&#x7070;&#x5C18;&#x201D;&#x9650;&#x5236;&#x4E00;&#x6837;&#x5C0F;&#xFF0C;&#x751A;&#x81F3;&#x66F4;&#x5C0F;&#x3002;&#x4E00;&#x4E9B;&#x5EFA;&#x8BAE;&#x5141;&#x8BB8;&#x5B50;&#x806A;&#x7EA7;&#x589E;&#x91CF;&#xFF08;subsatoshi increments&#xFF09;&#x3002;</p>
<p><strong>&#x5BB9;&#x91CF;</strong> &#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x5BB9;&#x91CF;&#x63D0;&#x9AD8;&#x4E86;&#x51E0;&#x4E2A;&#x6570;&#x91CF;&#x7EA7;&#x3002;&#x6BCF;&#x79D2;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x8DEF;&#x7531;&#x7684;&#x4ED8;&#x8D39;&#x6570;&#x91CF;&#x6CA1;&#x6709;&#x5177;&#x4F53;&#x4E0A;&#x9650;&#xFF0C;&#x56E0;&#x4E3A;&#x5B83;&#x4EC5;&#x53D6;&#x51B3;&#x4E8E;&#x6BCF;&#x4E2A;&#x8282;&#x70B9;&#x7684;&#x5BB9;&#x91CF;&#x548C;&#x901F;&#x5EA6;&#x3002;</p>
<p><strong>&#x65E0;&#x4FE1;&#x4EFB;&#x64CD;&#x4F5C;</strong>&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5728;&#x4E0D;&#x9700;&#x8981;&#x4E92;&#x76F8;&#x4FE1;&#x4EFB;&#x5C31;&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x5BF9;&#x7B49;&#x4F53;&#x4F7F;&#x7528;&#x7684;&#x8282;&#x70B9;&#x4E4B;&#x95F4;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x3002;&#x56E0;&#x6B64;&#xFF0C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x4FDD;&#x7559;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x7684;&#x539F;&#x7406;&#xFF0C;&#x540C;&#x65F6;&#x663E;&#x8457;&#x6269;&#x5927;&#x4E86;&#x5176;&#x64CD;&#x4F5C;&#x53C2;&#x6570;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x5982;&#x524D;&#x6240;&#x8FF0;&#xFF0C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x534F;&#x8BAE;&#x4E0D;&#x662F;&#x5B9E;&#x73B0;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x552F;&#x4E00;&#x65B9;&#x6CD5;&#x3002;&#x5176;&#x4ED6;&#x88AB;&#x63D0;&#x51FA;&#x7684;&#x7CFB;&#x7EDF;&#x5305;&#x62EC;Tumblebit&#x548C;Teechan&#x3002;&#x7136;&#x800C;&#xFF0C;&#x5728;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#xFF0C;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5DF2;&#x7ECF;&#x90E8;&#x7F72;&#x5728;testnet&#x4E0A;&#x4E86;&#x3002;&#x51E0;&#x4E2A;&#x4E0D;&#x540C;&#x7684;&#x56E2;&#x961F;&#x5DF2;&#x7ECF;&#x5F00;&#x53D1;&#x4E86;&#x6B63;&#x5728;&#x7ADE;&#x4E89;&#x7684;LN&#x5B9E;&#x73B0;&#xFF0C;&#x5E76;&#x4E14;&#x6B63;&#x5728;&#x52AA;&#x529B;&#x5B9E;&#x73B0;&#x4E00;&#x4E2A;&#x901A;&#x7528;&#x7684;&#x4E92;&#x64CD;&#x4F5C;&#x6027;&#x6807;&#x51C6;&#xFF08;&#x79F0;&#x4E3A;BOLT&#xFF09;&#x3002;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x5F88;&#x53EF;&#x80FD;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x90E8;&#x7F72;&#x5728;&#x751F;&#x4EA7;&#x5B9E;&#x9645;&#x4E2D;&#x7684;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7F51;&#x7EDC;&#x3002;</p>
<h2 id="128&#x7ED3;&#x8BBA;">12.8&#x7ED3;&#x8BBA;</h2>
<p>&#x6211;&#x4EEC;&#x4EC5;&#x7814;&#x7A76;&#x4E86;&#x51E0;&#x4E2A;&#x53EF;&#x4EE5;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4F5C;&#x4E3A;&#x4FE1;&#x4EFB;&#x5E73;&#x53F0;&#x6784;&#x5EFA;&#x7684;&#x65B0;&#x5174;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x8FD9;&#x4E9B;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8303;&#x56F4;&#x6269;&#x5927;&#x5230;&#x8D85;&#x51FA;&#x4ED8;&#x6B3E;&#x548C;&#x8D85;&#x8D8A;&#x91D1;&#x878D;&#x5DE5;&#x5177;&#x7684;&#x8303;&#x56F4;&#xFF0C;&#x4EE5;&#x6DB5;&#x76D6;&#x8BB8;&#x591A;&#x4FE1;&#x4EFB;&#x81F3;&#x5173;&#x91CD;&#x8981;&#x7684;&#x5176;&#x4ED6;&#x5E94;&#x7528;&#x7A0B;&#x5E8F;&#x3002;&#x901A;&#x8FC7;&#x53BB;&#x4E2D;&#x6027;&#x5316;&#x7684;&#x4FE1;&#x4EFB;&#x57FA;&#x7840;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x662F;&#x4E00;&#x4E2A;&#x4F1A;&#x91CA;&#x653E;&#x5C06;&#x5728;&#x5404;&#x79CD;&#x884C;&#x4E1A;&#x4E2D;&#x4EA7;&#x751F;&#x8BB8;&#x591A;&#x9769;&#x547D;&#x6027;&#x5E94;&#x7528;&#x7684;&#x5E73;&#x53F0;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="ch11.html" class="navigation navigation-prev " aria-label="Previous page: 第十一章比特币安全">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="appdx-bips.html" class="navigation navigation-next " aria-label="Next page: 附录1：比特币改进提案（BIP）">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"第十二章比特币应用","level":"1.18","depth":1,"next":{"title":"附录1：比特币改进提案（BIP）","level":"1.19","depth":1,"path":"appdx-bips.md","ref":"appdx-bips.md","articles":[]},"previous":{"title":"第十一章比特币安全","level":"1.17","depth":1,"path":"ch11.md","ref":"ch11.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"ch12.md","mtime":"2018-12-14T06:26:05.584Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

