
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>中文版序言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="trans-preface.html" />
    
    
    <link rel="prev" href="./" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >中文版序言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x4E2D;&#x6587;&#x7248;&#x5E8F;&#x8A00;">&#x4E2D;&#x6587;&#x7248;&#x5E8F;&#x8A00;</h1>
<h3 id="&#x9001;&#x4F60;&#x4E00;&#x628A;&#x6253;&#x5F00;&#x533A;&#x5757;&#x94FE;&#x4E16;&#x754C;&#x5927;&#x95E8;&#x7684;&#x94A5;&#x5319;&#x2014;&#x2014;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x7B2C;&#x4E8C;&#x7248;&#x300B;&#x5E8F;&#x8A00;">&#x9001;&#x4F60;&#x4E00;&#x628A;&#x6253;&#x5F00;&#x533A;&#x5757;&#x94FE;&#x4E16;&#x754C;&#x5927;&#x95E8;&#x7684;&#x94A5;&#x5319;&#x2014;&#x2014;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x7B2C;&#x4E8C;&#x7248;&#x300B;&#x5E8F;&#x8A00;</h3>
<p>2008&#x5E74;&#x6BD4;&#x7279;&#x5E01;&#x8BDE;&#x751F;&#xFF0C;&#x539F;&#x672C;&#x53EA;&#x662F;&#x4E00;&#x4E2A;&#x5BC6;&#x7801;&#x5B66;&#x6781;&#x5BA2;&#x4E4B;&#x95F4;&#x7684;&#x73A9;&#x7269;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x72B9;&#x5982;&#x6253;&#x5F00;&#x7684;&#x6F58;&#x591A;&#x62C9;&#x76D2;&#x5B50;&#xFF0C;&#x6162;&#x6162;&#x5E2D;&#x5377;&#x5168;&#x7403;&#x3002;&#x5728;08&#x5E74;&#x4EE5;&#x524D;&#x8FD8;&#x6CA1;&#x6709;&#x4EBA;&#x80FD;&#x6210;&#x529F;&#x5730;&#x7814;&#x53D1;&#x51FA;&#x4E00;&#x4E2A;&#x8FD0;&#x884C;&#x826F;&#x597D;&#x7684;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x51FA;&#x6765;&#xFF0C;&#x76F4;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x95EE;&#x4E16;&#xFF1B;&#x53E6;&#x5916;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x4F5C;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5E95;&#x5C42;&#x6280;&#x672F;&#xFF0C;&#x5728;&#x6B64;&#x4E4B;&#x524D;&#x4E5F;&#x662F;&#x95FB;&#x6240;&#x672A;&#x95FB;&#x3002;&#x90A3;&#x4E48;&#x533A;&#x5757;&#x94FE;&#x5230;&#x5E95;&#x6709;&#x4EC0;&#x4E48;&#x9B54;&#x529B;&#xFF0C;&#x8BA9;&#x6574;&#x4E2A;&#x4E16;&#x754C;&#x4E3A;&#x4E4B;&#x75AF;&#x72C2;&#x5462;&#xFF1F;</p>
<p>&#x76F8;&#x4FE1;&#x5F88;&#x591A;&#x521D;&#x5B66;&#x8005;&#x90FD;&#x6709;&#x8FD9;&#x6837;&#x7684;&#x7591;&#x95EE;&#x3002;&#x6211;&#x4E5F;&#x66FE;&#x5E26;&#x7740;&#x8FD9;&#x6837;&#x7684;&#x56F0;&#x60D1;&#x7FFB;&#x9605;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x4E66;&#x7C4D;&#xFF0C;&#x7136;&#x540E;&#x624D;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x6BD4;&#x8F83;&#x5168;&#x9762;&#x7684;&#x8BA4;&#x8BC6;&#x3002;2010&#x5E74;&#x4ECE;&#x4E2D;&#x79D1;&#x9662;&#x6BD5;&#x4E1A;&#x4EE5;&#x6765;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x519C;&#x884C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x4E2D;&#x5FC3;&#x5DE5;&#x4F5C;&#xFF0C;&#x5E73;&#x65F6;&#x505A;&#x7684;&#x4E3B;&#x8981;&#x662F;&#x4E00;&#x4E9B;&#x4F20;&#x7EDF;&#x94F6;&#x884C;&#x6838;&#x5FC3;&#x7CFB;&#x7EDF;&#x7684;&#x7814;&#x53D1;&#xFF0C;&#x6709;&#x65F6;&#x5019;&#x4F1A;&#x89C9;&#x5F97;&#x67AF;&#x71E5;&#x3002;&#x7279;&#x522B;&#x662F;&#xFF0C;13&#x5E74;&#x4E92;&#x8054;&#x7F51;&#x91D1;&#x878D;&#x7206;&#x53D1;&#xFF0C;&#x76F4;&#x63A5;&#x51B2;&#x51FB;&#x5230;&#x94F6;&#x884C;&#x7684;&#x4F20;&#x7EDF;&#x4E1A;&#x52A1;&#xFF0C;&#x4E5F;&#x51B2;&#x51FB;&#x7740;&#x6211;&#x4EEC;&#x8FD9;&#x4E9B;&#x5904;&#x4E8E;&#x4F53;&#x5236;&#x5185;&#x4E00;&#x4EFD;&#x5B50;&#x7684;&#x5FC3;&#x7075;&#x3002;&#x6211;&#x5E76;&#x975E;&#x89C9;&#x5F97;&#x538B;&#x529B;&#x5927;&#xFF0C;&#x800C;&#x662F;&#x770B;&#x5230;&#x4E86;&#x673A;&#x4F1A;&#xFF0C;&#x56E0;&#x4E3A;&#x4EE5;&#x524D;&#x5728;&#x6211;&#x8111;&#x6D77;&#x6DF1;&#x5904;&#x6211;&#x4E00;&#x76F4;&#x89C9;&#x5F97;&#x8FDB;&#x5165;&#x4F53;&#x5236;&#x5185;&#x4E4B;&#x540E;&#x4FBF;&#x5F88;&#x96BE;&#x518D;&#x6709;&#x673A;&#x4F1A;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x65B0;&#x9886;&#x57DF;&#x4E86;&#xFF0C;&#x6CA1;&#x60F3;&#x5230;&#x6211;&#x5F53;&#x65F6;&#x6240;&#x4ECE;&#x4E8B;&#x7684;&#x91D1;&#x878D;&#x884C;&#x4E1A;&#x7ADF;&#x7136;&#x662F;&#x5F53;&#x4E0B;&#x7684;&#x9999;&#x997D;&#x997D;&#xFF0C;&#x6240;&#x4EE5;&#x6709;&#x65F6;&#x5019;&#x6211;&#x4E5F;&#x4F1A;&#x5173;&#x6CE8;&#x4E00;&#x4E0B;&#x5916;&#x9762;&#x7684;&#x673A;&#x4F1A;&#x3002;</p>
<p>&#x90A3;&#x4E2A;&#x65F6;&#x5019;&#x94F6;&#x884C;&#x4E1A;&#x6B63;&#x5904;&#x4E8E;&#x53D8;&#x9769;&#x7684;&#x5173;&#x53E3;&#xFF0C;&#x5927;&#x91CF;&#x7684;&#x5458;&#x5DE5;&#x548C;&#x6211;&#x4E00;&#x6837;&#x770B;&#x5230;&#x4E86;&#x8FD9;&#x6837;&#x7684;&#x673A;&#x4F1A;&#xFF0C;&#x9009;&#x62E9;&#x51FA;&#x8D70;&#x5BFB;&#x6C42;&#x66F4;&#x597D;&#x7684;&#x5F85;&#x9047;&#xFF0C;&#x5E74;&#x85AA;&#x767E;&#x4E07;&#x4E5F;&#x662F;&#x6709;&#x7684;&#x3002;&#x5F53;&#x6211;&#x72B9;&#x8C6B;&#x4E0D;&#x51B3;&#x662F;&#x5426;&#x8981;&#x50CF;&#x4ED6;&#x4EEC;&#x4E00;&#x6837;&#x9009;&#x62E9;&#x79BB;&#x5F00;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x5173;&#x6CE8;&#x5230;&#x5355;&#x4F4D;&#x5185;&#x90E8;&#x7684;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#x91CC;&#x63D0;&#x5230;&#x4E86;&#x5173;&#x4E8E;&#x7814;&#x7A76;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x65B9;&#x9762;&#x7684;&#x6587;&#x5B57;&#x3002;&#x52A0;&#x4E4B;&#x6211;&#x81EA;&#x8EAB;&#x5BF9;&#x65B0;&#x6280;&#x672F;&#x7684;&#x72C2;&#x70ED;&#xFF0C;&#x7ECF;&#x8FC7;&#x4E00;&#x756A;&#x601D;&#x91CF;&#xFF0C;&#x5728;2016&#x5E74;6&#x6708;&#x4EFD;&#x7684;&#x65F6;&#x5019;&#x6211;&#x7ED9;&#x603B;&#x7ECF;&#x7406;&#x53BB;&#x4E86;&#x4E00;&#x5C01;&#x90AE;&#x4EF6;&#xFF0C;&#x6B63;&#x5F0F;&#x51B3;&#x5B9A;&#x4ECE;&#x5F53;&#x524D;&#x67AF;&#x71E5;&#x7684;&#x5DE5;&#x4F5C;&#x5C97;&#x4F4D;&#x4E0A;&#x201C;&#x51FA;&#x8D70;&#x201D;&#xFF0C;&#x9009;&#x62E9;&#x8FDB;&#x5165;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x9886;&#x57DF;&#xFF0C;&#x867D;&#x7136;&#x6211;&#x4ECD;&#x5728;&#x4F53;&#x5236;&#x5185;&#xFF0C;&#x4F46;&#x6211;&#x89C9;&#x5F97;&#x5728;&#x4E00;&#x4E2A;&#x5927;&#x7684;&#x5E73;&#x53F0;&#x4E0A;&#xFF0C;&#x6216;&#x8BB8;&#x6709;&#x66F4;&#x597D;&#x66F4;&#x591A;&#x7684;&#x8D44;&#x6E90;&#x8BA9;&#x6211;&#x5B66;&#x4E60;&#x8FD9;&#x4E9B;&#x65B0;&#x4E1C;&#x897F;&#x3002;</p>
<p>&#x8FD9;&#x662F;&#x6545;&#x4E8B;&#x7684;&#x5F00;&#x59CB;&#xFF0C;&#x4E5F;&#x662F;&#x533A;&#x5757;&#x94FE;&#x7814;&#x7A76;&#x793E;&#xFF08;&#x5EFA;&#x7ACB;&#x4E4B;&#x521D;&#x53EB;&#x505A;&#x201C;&#x533A;&#x5757;&#x94FE;&#x7814;&#x4E60;&#x793E;&#x201D;&#xFF09;&#x6210;&#x7ACB;&#x7684;&#x53D1;&#x7AEF;&#x3002;&#x56E0;&#x4E3A;&#x6B63;&#x662F;&#x5F97;&#x76CA;&#x4E8E;&#x8FD9;&#x6837;&#x7684;&#x4E00;&#x4E2A;&#x673A;&#x4F1A;&#xFF0C;&#x6211;&#x5F53;&#x65F6;&#x6709;&#x5E78;&#x53C2;&#x52A0;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4F1A;&#x8BAE;&#xFF0C;&#x5E76;&#x63A5;&#x89E6;&#x5230;&#x4E1A;&#x5185;&#x9876;&#x5C16;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E13;&#x5BB6;&#xFF0C;&#x4ECE;&#x800C;&#x8033;&#x6FE1;&#x76EE;&#x67D3;&#x5730;&#x6162;&#x6162;&#x6DF1;&#x5165;&#x5230;&#x8FD9;&#x4E2A;&#x884C;&#x4E1A;&#x91CC;&#x3002;&#x6211;&#x5F53;&#x65F6;&#x610F;&#x8BC6;&#x5230;&#x8FD9;&#x4E2A;&#x7FA4;&#x4F53;&#x8FD8;&#x5F88;&#x5C0F;&#xFF0C;&#x6574;&#x4E2A;&#x793E;&#x4F1A;&#x5BF9;&#x533A;&#x5757;&#x94FE;&#x7684;&#x4E86;&#x89E3;&#x8FD8;&#x8FDC;&#x8FDC;&#x4E0D;&#x591F;&#xFF0C;&#x867D;&#x7136;&#x4EE5;&#x524D;&#x6709;&#x5F88;&#x591A;&#x5E03;&#x9053;&#x8005;&#x4E5F;&#x66FE;&#x5C1D;&#x8BD5;&#x63A8;&#x52A8;&#x533A;&#x5757;&#x94FE;&#x6280;&#x672F;&#x5728;&#x56FD;&#x5185;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4F46;&#x662F;&#x6211;&#x51B3;&#x5B9A;&#x505A;&#x4E00;&#x4E2A;&#x4E0D;&#x592A;&#x4E00;&#x6837;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5B66;&#x4E60;&#x793E;&#x7FA4;&#xFF0C;&#x8BA9;&#x6240;&#x6709;&#x7684;&#x7231;&#x597D;&#x8005;&#x4EEC;&#x80FD;&#x591F;&#x5728;&#x8FD9;&#x91CC;&#x83B7;&#x5F97;&#x6700;&#x8D34;&#x5FC3;&#x7684;&#x533A;&#x5757;&#x94FE;&#x77E5;&#x8BC6;&#x670D;&#x52A1;&#xFF0C;&#x5E76;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x5F3A;&#x6709;&#x529B;&#x7684;&#x7FA4;&#x4F53;&#xFF0C;&#x521B;&#x9020;&#x66F4;&#x5927;&#x7684;&#x4EF7;&#x503C;&#x548C;&#x5F71;&#x54CD;&#x529B;&#x3002;&#x56E0;&#x6B64;&#xFF0C;2017&#x5E74;1&#x6708;&#x4EFD;&#xFF0C;&#x533A;&#x5757;&#x94FE;&#x7814;&#x4E60;&#x793E;&#x6210;&#x7ACB;&#xFF0C;&#x8FD9;&#x662F;&#x56FD;&#x5185;&#x6700;&#x65E9;&#x7684;&#x533A;&#x5757;&#x94FE;&#x5B66;&#x4E60;&#x793E;&#x7FA4;&#xFF0C;&#x76EE;&#x524D;&#x6574;&#x4E2A;&#x7FA4;&#x4F53;&#x4EBA;&#x6570;&#x8FD1;3000&#xFF0C;&#x76F8;&#x4FE1;&#x4E5F;&#x662F;&#x56FD;&#x5185;&#x6700;&#x5927;&#x5E76;&#x4E14;&#x770B;&#x8D77;&#x6765;&#x8D28;&#x91CF;&#x6700;&#x9AD8;&#x7684;&#x793E;&#x7FA4;&#x4E86;&#x3002;&#x5BF9;&#x4E8E;&#x8FD9;&#x4E2A;&#x793E;&#x7FA4;&#xFF0C;&#x6211;&#x628A;&#x5B83;&#x5F53;&#x6210;&#x4E00;&#x4EFD;&#x4E8B;&#x4E1A;&#x6765;&#x505A;&#xFF0C;&#x81F3;&#x5C11;&#x505A;20&#x5E74;&#x3002;</p>
<p>&#x5728;&#x5E26;&#x7740;&#x5927;&#x5BB6;&#x5B66;&#x4E60;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x5F88;&#x591A;&#x4EBA;&#x90FD;&#x95EE;&#x5230;&#x6211;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x201C;&#x4ECE;&#x4F55;&#x5165;&#x624B;&#xFF1F;&#x201D;&#xFF0C;&#x6211;&#x6DF1;&#x77E5;&#x7406;&#x8BBA;&#x7684;&#x5B66;&#x4E60;&#x603B;&#x662F;&#x975E;&#x5E38;&#x5FC5;&#x8981;&#x7684;&#xFF0C;&#x6B66;&#x88C5;&#x4E86;&#x5927;&#x8111;&#x4E4B;&#x540E;&#x624D;&#x80FD;&#x66F4;&#x597D;&#x5730;&#x8DF5;&#x884C;&#xFF0C;&#x4E8E;&#x662F;&#x6211;&#x63A8;&#x8350;&#x5927;&#x5BB6;&#x53BB;&#x770B;&#x4E66;&#xFF0C;&#x53BB;&#x5B66;&#x4E60;&#x3002;&#x800C;&#x8FD9;&#x91CC;&#x9996;&#x63A8;&#x7684;&#x5C31;&#x662F;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x300B;&#x8FD9;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x7C4D;&#xFF08;&#x82F1;&#x6587;&#x4E3A;&#x300A;Mastering Bitcoin&#x300B;&#xFF09;&#xFF0C;&#x5B83;&#x53EF;&#x4EE5;&#x8BF4;&#x662F;&#x5B66;&#x4E60;&#x533A;&#x5757;&#x94FE;&#x7684;&#x5165;&#x95E8;&#x9996;&#x9009;&#xFF0C;&#x662F;&#x5B9D;&#x5178;&#x7EA7;&#x7684;&#x533A;&#x5757;&#x94FE;&#x4E66;&#x7C4D;&#x3002;&#x53EA;&#x4E0D;&#x8FC7;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7ECF;&#x5386;&#x4E86;&#x51E0;&#x5E74;&#x7684;&#x53D1;&#x5C55;&#xFF0C;&#x4E5F;&#x5F00;&#x59CB;&#x51FA;&#x73B0;&#x4E00;&#x4E9B;&#x53D8;&#x5316;&#xFF0C;&#x6BD4;&#x5982;&#x6BD4;&#x7279;&#x5E01;&#x8FDB;&#x884C;&#x4E86;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x5347;&#x7EA7;&#xFF0C;&#x4E5F;&#x5206;&#x53C9;&#x51FA;&#x4E86;&#x4E00;&#x4E2A;&#x5168;&#x65B0;&#x7684;&#x5E01;&#x79CD;BCC&#xFF0C;&#x56E0;&#x6B64;&#x7B2C;&#x4E00;&#x7248;&#x7684;&#x4E66;&#x7C4D;&#x5F88;&#x591A;&#x5730;&#x65B9;&#x53EF;&#x80FD;&#x9700;&#x8981;&#x66F4;&#x65B0;&#xFF0C;&#x76EE;&#x524D;&#x56FD;&#x5916;&#x867D;&#x7136;&#x6709;&#x300A;Matering Bitcoin 2.0&#x300B;&#x7248;&#x672C;&#x7684;&#x82F1;&#x6587;&#x4E66;&#x7C4D;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#x8FD8;&#x6CA1;&#x6709;&#x770B;&#x5230;&#x4E2D;&#x6587;&#x7248;&#x7684;&#x7FFB;&#x8BD1;&#x3002;</p>
<p>&#x4E54;&#x5EF6;&#x5B8F;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x300A;Matering Bitcoin 2.0&#x300B;&#x7684;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x7248;&#x672C;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x7B2C;&#x4E8C;&#x7248;&#x300B;&#x7684;&#x53D1;&#x8D77;&#x8005;&#x548C;&#x7F16;&#x8BD1;&#x8005;&#xFF0C;&#x6B63;&#x662F;&#x6211;&#x4EEC;&#x533A;&#x5757;&#x94FE;&#x7814;&#x7A76;&#x793E;&#x7684;&#x6838;&#x5FC3;&#x6210;&#x5458;&#xFF0C;&#x4ED6;&#x591A;&#x5E74;&#x90FD;&#x5728;&#x6253;&#x78E8;&#x4E00;&#x4E2A;&#x53EB;&#x505A;&#x201C;&#x8BA4;&#x77E5;&#x5B66;&#x4E60;&#x6CD5;&#x201D;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x6CD5;&#xFF0C;&#x5E76;&#x5C1D;&#x8BD5;&#x5C06;&#x5176;&#x5E94;&#x7528;&#x5230;&#x5404;&#x79CD;&#x65B0;&#x9886;&#x57DF;&#x77E5;&#x8BC6;&#x7684;&#x5B66;&#x4E60;&#x5F53;&#x4E2D;&#xFF0C;&#x6548;&#x679C;&#x9887;&#x4E3A;&#x663E;&#x8457;&#x3002;&#x8FD9;&#x4ECE;&#x4ED6;&#x5FEB;&#x901F;&#x638C;&#x63E1;&#x533A;&#x5757;&#x94FE;&#x77E5;&#x8BC6;&#xFF0C;&#x5E76;&#x5728;&#x7F51;&#x7EDC;&#x64B0;&#x5199;&#x8D85;30&#x4E07;&#x5B57;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x4EE5;&#x53CA;&#x62C5;&#x4EFB;&#x672C;&#x7535;&#x5B50;&#x4E66;&#x7C4D;&#x7684;&#x4E3B;&#x8981;&#x7FFB;&#x8BD1;&#x4E0A;&#x7684;&#x529F;&#x529B;&#xFF0C;&#x53EF;&#x89C1;&#x4E00;&#x6591;&#x3002;&#x4E3A;&#x6B64;&#xFF0C;&#x4ED6;&#x8FD8;&#x4E13;&#x95E8;&#x6210;&#x7ACB;&#x4E86;&#x4E00;&#x4E2A;&#x54C1;&#x724C;&#xFF0C;&#x53EB;&#x505A;&#x201C;&#x4E91;&#x5929;&#x660E;&#x201D;&#xFF0C;&#x5E0C;&#x671B;&#x5C06;&#x6B64;&#x65B9;&#x6CD5;&#x4F20;&#x9012;&#x7ED9;&#x66F4;&#x591A;&#x7684;&#x4EBA;&#x3002;</p>
<p>&#x521A;&#x5F00;&#x59CB;&#x7684;&#x65F6;&#x5019;&#x4ED6;&#x53EA;&#x662F;&#x4E00;&#x5473;&#x5730;&#x8FDB;&#x884C;&#x7FFB;&#x8BD1;&#xFF0C;&#x5728;&#x6709;&#x9650;&#x7684;&#x6E20;&#x9053;&#x8FDB;&#x884C;&#x63A8;&#x5E7F;&#xFF0C;&#x4E3A;&#x4E86;&#x575A;&#x6301;&#xFF0C;&#x4ED6;&#x57FA;&#x672C;&#x4E0A;&#x6BCF;&#x5929;&#x90FD;&#x5728;&#x8FDB;&#x884C;&#x7740;&#x7FFB;&#x8BD1;&#x5DE5;&#x4F5C;&#xFF0C;&#x4ECE;&#x800C;&#x5F62;&#x6210;&#x4E86;&#x7FFB;&#x8BD1;&#x7684;&#x521D;&#x7A3F;&#xFF0C;&#x5BF9;&#x4E8E;&#x4ED6;&#x8FD9;&#x79CD;&#x8FC7;&#x4EBA;&#x7684;&#x6BC5;&#x529B;&#xFF0C;&#x6211;&#x975E;&#x5E38;&#x4F69;&#x670D;&#x3002;&#x4E0D;&#x8FC7;&#x6211;&#x89C9;&#x5F97;&#xFF0C;&#x6211;&#x4EEC;&#x5E94;&#x8BE5;&#x505A;&#x4E00;&#x4EF6;&#x66F4;&#x6709;&#x4EF7;&#x503C;&#x7684;&#x4E8B;&#x60C5;&#x2014;&#x2014;&#x5C06;&#x8FD9;&#x4E9B;&#x7FFB;&#x8BD1;&#x8FDB;&#x884C;&#x5145;&#x5206;&#x6821;&#x8BA2;&#x5E76;&#x5F62;&#x6210;&#x4E2D;&#x6587;&#x9605;&#x8BFB;&#x826F;&#x597D;&#x7684;&#x7535;&#x5B50;&#x4E66;&#x7C4D;&#xFF0C;&#x514D;&#x8D39;&#x4F9B;&#x5E94;&#x7ED9;&#x5168;&#x56FD;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7231;&#x597D;&#x8005;&#x4EEC;&#xFF0C;&#x4E3A;&#x6211;&#x4EEC;&#x56FD;&#x5BB6;&#xFF0C;&#x4E3A;&#x8FD9;&#x4E2A;&#x4E16;&#x754C;&#xFF0C;&#x66F4;&#x597D;&#x5730;&#x666E;&#x53CA;&#x533A;&#x5757;&#x94FE;&#x77E5;&#x8BC6;&#x3002;</p>
<p>&#x4E3A;&#x4E86;&#x5168;&#x529B;&#x4FC3;&#x6210;&#x8FD9;&#x4E2A;&#x4E8B;&#x60C5;&#xFF0C;&#x6211;&#x53C8;&#x4ECE;&#x4EBA;&#x624D;&#x6D4E;&#x6D4E;&#x7684;&#x533A;&#x5757;&#x94FE;&#x7814;&#x7A76;&#x793E;&#x5185;&#x90E8;&#x6311;&#x9009;&#x4E86;&#x5927;&#x91CF;&#x7684;&#x7CBE;&#x82F1;&#x914D;&#x5408;&#x4E54;&#x5EF6;&#x5B8F;&#x7684;&#x7FFB;&#x8BD1;&#x548C;&#x6821;&#x8BA2;&#x5DE5;&#x4F5C;&#xFF0C;&#x8FD9;&#x4E2A;&#x56E2;&#x961F;&#x5386;&#x7ECF;&#x591A;&#x4E2A;&#x65E5;&#x591C;&#x7684;&#x82E6;&#x601D;&#x7422;&#x78E8;&#x548C;&#x4ED4;&#x7EC6;&#x63A8;&#x6572;&#xFF0C;&#x6700;&#x7EC8;&#x4FC3;&#x6210;&#x4E86;&#x672C;&#x7248;&#x4E2D;&#x6587;&#x7FFB;&#x8BD1;&#x4E66;&#x7C4D;&#x7684;&#x95EE;&#x4E16;&#x3002;</p>
<p>&#x76F8;&#x4FE1;&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x7B2C;&#x4E8C;&#x7248;&#x300B;&#x4F1A;&#x6210;&#x4E3A;&#x4F60;&#x6700;&#x597D;&#x7684;&#x5165;&#x95E8;&#x4E66;&#x7C4D;&#xFF0C;&#x5373;&#x4FBF;&#x4F60;&#x6709;&#x4E86;&#x4E00;&#x5B9A;&#x7684;&#x57FA;&#x7840;&#xFF0C;&#x5076;&#x5C14;&#x7FFB;&#x4E00;&#x7FFB;&#x90FD;&#x4F1A;&#x6709;&#x4E0D;&#x4E00;&#x6837;&#x7684;&#x6536;&#x83B7;&#x3002;</p>
<p>&#x73B0;&#x5728;&#x5C06;&#x8FD9;&#x628A;&#x94A5;&#x5319;&#x9001;&#x7ED9;&#x4F60;&#xFF0C;&#x4E00;&#x8D77;&#x6253;&#x5F00;&#x533A;&#x5757;&#x94FE;&#x4E16;&#x754C;&#x7684;&#x5927;&#x95E8;&#xFF0C;&#x5171;&#x521B;&#x7F8E;&#x597D;&#x7684;&#x672A;&#x6765;&#x5427;&#xFF01;</p>
<p>&#x200B;                                                                                                                            higer &#xFF08;&#x533A;&#x5757;&#x94FE;&#x7814;&#x7A76;&#x793E;&#x793E;&#x957F;&#xFF09;</p>
<p>&#x200B;                                                                                                                                               2017.11.12</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="./" class="navigation navigation-prev " aria-label="Previous page: Introduction">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="trans-preface.html" class="navigation navigation-next " aria-label="Next page: 译者序">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"中文版序言","level":"1.2","depth":1,"next":{"title":"译者序","level":"1.3","depth":1,"path":"trans-preface.md","ref":"trans-preface.md","articles":[]},"previous":{"title":"Introduction","level":"1.1","depth":1,"path":"README.md","ref":"README.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"cn-preface.md","mtime":"2018-12-14T06:26:05.585Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

