
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>词汇表 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="ch01.html" />
    
    
    <link rel="prev" href="second_edition_changes.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >词汇表</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p>&#x8BE5;&#x90E8;&#x5206;&#x5305;&#x542B;&#x4E86;&#x5927;&#x90E8;&#x5206;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x5173;&#x7684;&#x672F;&#x8BED;&#x3002;&#x8FD9;&#x4E9B;&#x672F;&#x8BED;&#x7684;&#x4F7F;&#x7528;&#x8D2F;&#x7A7F;&#x4E8E;&#x5168;&#x4E66;&#xFF0C;&#x6240;&#x4EE5;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x6807;&#x6CE8;&#x4EE5;&#x63D0;&#x4F9B;&#x5FEB;&#x901F;&#x53C2;&#x8003;&#x3002;</p>
<p><strong>&#x5730;&#x5740;:</strong></p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#xFF08;&#x4F8B;&#x5982;&#xFF1A;1DSrfJdB2AnWaFNgSbv3MZC2m74996JafV&#xFF09;&#x7531;&#x4E00;&#x4E32;&#x5B57;&#x7B26;&#x548C;&#x6570;&#x5B57;&#x7EC4;&#x6210;&#x3002;&#x5B83;&#x5176;&#x5B9E;&#x662F;&#x901A;&#x8FC7;&#x5BF9;160&#x4F4D;&#x4E8C;&#x8FDB;&#x5236;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x503C;&#x8FDB;&#x884C;base58check&#x7F16;&#x7801;&#x540E;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x5C31;&#x50CF;&#x522B;&#x4EBA;&#x5411;&#x4F60;&#x7684;email&#x5730;&#x5740;&#x53D1;&#x9001;&#x7535;&#x5B50;&#x90AE;&#x4EF6;&#x4E00;&#x6837;&#xFF0C;&#x4ED6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4F60;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x5411;&#x4F60;&#x53D1;&#x9001;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p><strong>bip:</strong></p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x6539;&#x8FDB;&#x63D0;&#x8BAE; &#xFF08;Bitcoin Improvement Proposals&#x7684;&#x7F29;&#x5199;&#xFF09;&#xFF0C;&#x6307;&#x6BD4;&#x7279;&#x5E01;&#x793E;&#x533A;&#x6210;&#x5458;&#x6240;&#x63D0;&#x4EA4;&#x7684;&#x4E00;&#x7CFB;&#x5217;&#x6539;&#x8FDB;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x63D0;&#x8BAE;&#x3002;&#x4F8B;&#x5982;&#xFF0C;BIP0021&#x662F;&#x4E00;&#x9879;&#x6539;&#x8FDB;&#x6BD4;&#x7279;&#x5E01;&#x7EDF;&#x4E00;&#x8D44;&#x6E90;&#x6807;&#x8BC6;&#x7B26;&#xFF08;URI&#xFF09;&#x8BA1;&#x5212;&#x7684;&#x63D0;&#x8BAE;&#x3002;</p>
<p><strong>&#x6BD4;&#x7279;&#x5E01;:</strong></p>
<p>&#x201C;&#x6BD4;&#x7279;&#x5E01;&#x201D;&#x65E2;&#x53EF;&#x4EE5;&#x6307;&#x8FD9;&#x79CD;&#x865A;&#x62DF;&#x8D27;&#x5E01;&#x5355;&#x4F4D;&#xFF0C;&#x4E5F;&#x6307;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6216;&#x8005;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x4F7F;&#x7528;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x8F6F;&#x4EF6;&#x3002;</p>
<p><strong>&#x533A;&#x5757;:</strong></p>
<p>   &#x4E00;&#x4E2A;&#x533A;&#x5757;&#x5C31;&#x662F;&#x82E5;&#x5E72;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x5B83;&#x4F1A;&#x88AB;&#x6807;&#x8BB0;&#x4E0A;&#x65F6;&#x95F4;&#x6233;&#x548C;&#x4E4B;&#x524D;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x7684;&#x72EC;&#x7279;&#x6807;&#x8BB0;&#x3002;&#x533A;&#x5757;&#x5934;&#x7ECF;&#x8FC7;&#x54C8;&#x5E0C;&#x8FD0;&#x7B97;&#x540E;&#x4F1A;&#x751F;&#x6210;&#x4E00;&#x4EFD;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#xFF0C;&#x4ECE;&#x800C;&#x9A8C;&#x8BC1;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x3002;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x7ECF;&#x8FC7;&#x5168;&#x7F51;&#x7EDC;&#x7684;&#x5171;&#x8BC6;&#x540E;&#x4F1A;&#x88AB;&#x8FFD;&#x52A0;&#x5230;&#x4E3B;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;</p>
<p><strong>&#x533A;&#x5757;&#x94FE;:</strong></p>
<p>&#x200B;       &#x533A;&#x5757;&#x94FE;&#x662F;&#x4E00;&#x4E32;&#x901A;&#x8FC7;&#x9A8C;&#x8BC1;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5F53;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x90FD;&#x4E0E;&#x4E0A;&#x4E00;&#x4E2A;&#x76F8;&#x8FDE;&#xFF0C;&#x4E00;&#x76F4;&#x8FDE;&#x5230;&#x521B;&#x4E16;&#x533A;&#x5757;&#x3002;</p>
<p><strong>&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;:</strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x53EF;&#x9760;&#x7684;&#x8BA1;&#x7B97;&#x673A;&#x7CFB;&#x7EDF;&#x5FC5;&#x987B;&#x80FD;&#x591F;&#x5904;&#x7406;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x7EC4;&#x4EF6;&#x4EA7;&#x751F;&#x7684;&#x5931;&#x8D25;&#x3002;&#x4E00;&#x4E2A;&#x5931;&#x8D25;&#x7684;&#x7EC4;&#x4EF6;&#x53EF;&#x80FD;&#x8868;&#x73B0;&#x51FA;&#x901A;&#x5E38;&#x88AB;&#x5FFD;&#x7565;&#x7684;&#x884C;&#x4E3A;&#x7C7B;&#x578B;&#xFF0C;&#x5373;&#x53D1;&#x9001;&#x77DB;&#x76FE;&#x7684;&#x4FE1;&#x606F;&#x5230;&#x7CFB;&#x7EDF;&#x7684;&#x4E0D;&#x540C;&#x90E8;&#x5206;&#x3002;&#x5904;&#x7406;&#x8FD9;&#x7C7B;&#x5931;&#x8D25;&#x7C7B;&#x578B;&#x7684;&#x95EE;&#x9898;&#x62BD;&#x8C61;&#x5730;&#x88AB;&#x8868;&#x8FBE;&#x4E3A;&#x62DC;&#x5360;&#x5EAD;&#x5C06;&#x519B;&#x95EE;&#x9898;&#x3002;</p>
<p><strong>coinbase:</strong></p>
<p>&#x200B;        &#x4E00;&#x4E2A;&#x7528;&#x4E8E;&#x4E3A;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x63D0;&#x4F9B;&#x552F;&#x4E00;&#x8F93;&#x5165;&#x7684;&#x7279;&#x6B8A;&#x5B57;&#x6BB5;&#x3002;coinbase&#x5141;&#x8BB8;&#x58F0;&#x660E;&#x533A;&#x5757;&#x5956;&#x52B1;&#xFF0C;&#x5E76;&#x4E3A;&#x4EFB;&#x610F;&#x6570;&#x636E;&#x63D0;&#x4F9B;&#x591A;&#x8FBE;100&#x5B57;&#x8282;&#x3002;&#x4E0D;&#x8981;&#x4E0E;&#x521B;&#x5E01;&#x4EA4;&#x6613;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>Coinbase&#x4EA4;&#x6613;:</strong></p>
<p>&#x200B;        &#x533A;&#x5757;&#x4E2D;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#x3002;&#x8BE5;&#x4EA4;&#x6613;&#x662F;&#x7531;&#x77FF;&#x5DE5;&#x521B;&#x5EFA;&#x7684;&#xFF0C;&#x5B83;&#x5305;&#x542B;&#x5355;&#x4E2A;coinbase&#x3002;&#x4E0D;&#x8981;&#x4E0E;Coinbase&#x6DF7;&#x6DC6;</p>
<p><strong>&#x51B7;&#x5B58;&#x50A8;:</strong></p>
<p>&#x200B;        &#x8BE5;&#x672F;&#x8BED;&#x6307;&#x7684;&#x662F;&#x79BB;&#x7EBF;&#x4FDD;&#x5B58;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5F53;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x79C1;&#x94A5;&#x88AB;&#x521B;&#x5EFA;&#xFF0C;&#x540C;&#x65F6;&#x5C06;&#x8BE5;&#x79C1;&#x94A5;&#x5B58;&#x50A8;&#x5728;&#x5B89;&#x5168;&#x7684;&#x79BB;&#x7EBF;&#x73AF;&#x5883;&#x65F6;&#xFF0C;&#x5C31;&#x5B9E;&#x73B0;&#x4E86;&#x51B7;&#x5B58;&#x50A8;&#x3002;&#x51B7;&#x5B58;&#x50A8;&#x5BF9;&#x4E8E;&#x4EFB;&#x4F55;&#x6BD4;&#x7279;&#x5E01;&#x6301;&#x6709;&#x8005;&#x6765;&#x8BF4;&#x662F;&#x91CD;&#x8981;&#x7684;&#x3002;&#x5728;&#x7EBF;&#x8BA1;&#x7B97;&#x673A;&#x5728;&#x9ED1;&#x5BA2;&#x9762;&#x524D;&#x662F;&#x8106;&#x5F31;&#x7684;&#xFF0C;&#x4E0D;&#x5E94;&#x8BE5;&#x88AB;&#x7528;&#x4E8E;&#x5B58;&#x50A8;&#x5927;&#x91CF;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p><strong>&#x67D3;&#x8272;&#x5E01;:</strong></p>
<p>&#x200B;        &#x6BD4;&#x7279;&#x5E01;2.0&#x5F00;&#x6E90;&#x534F;&#x8BAE;&#x5141;&#x8BB8;&#x5F00;&#x53D1;&#x8005;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E4B;&#x4E0A;&#xFF0C;&#x5229;&#x7528;&#x5B83;&#x7684;&#x8D85;&#x8D8A;&#x8D27;&#x5E01;&#x7684;&#x529F;&#x80FD;&#x521B;&#x5EFA;&#x6570;&#x5B57;&#x8D44;&#x4EA7;&#x3002;</p>
<p><strong>&#x786E;&#x8BA4;:</strong></p>
<p>&#x5F53;&#x4E00;&#x9879;&#x4EA4;&#x6613;&#x88AB;&#x533A;&#x5757;&#x6536;&#x5F55;&#x65F6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x8BF4;&#x5B83;&#x6709;&#x4E00;&#x6B21;&#x786E;&#x8BA4;&#x3002;&#x77FF;&#x5DE5;&#x4EEC;&#x5728;&#x6B64;&#x533A;&#x5757;&#x4E4B;&#x540E;&#x6BCF;&#x518D;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x6B64;&#x9879;&#x4EA4;&#x6613;&#x7684;&#x786E;&#x8BA4;&#x6570;&#x5C31;&#x518D;&#x52A0;&#x4E00;&#x3002;&#x5F53;&#x786E;&#x8BA4;&#x6570;&#x8FBE;&#x5230;6&#x53CA;&#x4EE5;&#x4E0A;&#x65F6;&#xFF0C;&#x901A;&#x5E38;&#x8BA4;&#x4E3A;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x6BD4;&#x8F83;&#x5B89;&#x5168;&#x5E76;&#x96BE;&#x4EE5;&#x9006;&#x8F6C;&#x3002;</p>
<p><strong>&#x5171;&#x8BC6;:</strong></p>
<p>&#x200B;    &#x5F53;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x8BB8;&#x591A;&#x8282;&#x70B9;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x5927;&#x90E8;&#x5206;&#x8282;&#x70B9;&#xFF0C;&#x5728;&#x5176;&#x672C;&#x5730;&#x9A8C;&#x8BC1;&#x7684;&#x6700;&#x957F;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x90FD;&#x5177;&#x6709;&#x76F8;&#x540C;&#x7684;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x79F0;&#x4E3A;&#x5171;&#x8BC6;&#x3002;&#x4E0D;&#x8981;&#x4E0E;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>&#x5171;&#x8BC6;&#x89C4;&#x5219;:</strong></p>
<p>&#x200B;    &#x5168;&#x8282;&#x70B9;&#x4E0E;&#x5176;&#x4ED6;&#x8282;&#x70B9;&#x4FDD;&#x6301;&#x5171;&#x8BC6;&#x7684;&#x533A;&#x5757;&#x9A8C;&#x8BC1;&#x89C4;&#x5219;&#x3002;&#x4E0D;&#x8981;&#x4E0E;&#x5171;&#x8BC6;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>&#x96BE;&#x5EA6;:</strong></p>
<p>&#x200B;        &#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x4F1A;&#x901A;&#x8FC7;&#x8C03;&#x6574;&#x201C;&#x96BE;&#x5EA6;&#x201D;&#x8FD9;&#x4E2A;&#x53D8;&#x91CF;&#x6765;&#x63A7;&#x5236;&#x751F;&#x6210;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x6240;&#x9700;&#x8981;&#x7684;&#x8BA1;&#x7B97;&#x529B;&#x3002;</p>
<p><strong>&#x96BE;&#x5EA6;&#x91CD;&#x5B9A;:</strong></p>
<p>&#x200B;        &#x5168;&#x7F51;&#x4E2D;&#x6BCF;&#x65B0;&#x589E;2016&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x5168;&#x7F51;&#x96BE;&#x5EA6;&#x5C06;&#x91CD;&#x65B0;&#x8BA1;&#x7B97;&#xFF0C;&#x8BE5;&#x65B0;&#x96BE;&#x5EA6;&#x503C;&#x5C06;&#x4F9D;&#x636E;&#x524D;2016&#x4E2A;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x7B97;&#x529B;&#x800C;&#x5B9A;&#x3002;</p>
<p><strong>&#x96BE;&#x5EA6;&#x76EE;&#x6807;:</strong></p>
<p>&#x200B;    &#x4F7F;&#x6574;&#x4E2A;&#x7F51;&#x7EDC;&#x7684;&#x8BA1;&#x7B97;&#x529B;&#x5927;&#x81F4;&#x6BCF;10&#x5206;&#x949F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x6240;&#x9700;&#x8981;&#x7684;&#x96BE;&#x5EA6;&#x6570;&#x503C;&#x5373;&#x4E3A;&#x96BE;&#x5EA6;&#x76EE;&#x6807;&#x3002;</p>
<p><strong>&#x53CC;&#x91CD;&#x652F;&#x4ED8;:</strong></p>
<p>&#x200B;    &#x53CC;&#x91CD;&#x652F;&#x4ED8;&#x662F;&#x6210;&#x529F;&#x652F;&#x4ED8;&#x4E86;1&#x6B21;&#x4EE5;&#x4E0A;&#x7684;&#x60C5;&#x51B5;&#x3002;&#x6BD4;&#x7279;&#x5E01;&#x901A;&#x8FC7;&#x5BF9;&#x6DFB;&#x52A0;&#x5230;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x6BCF;&#x7B14;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x6765;&#x9632;&#x6B62;&#x53CC;&#x91CD;&#x652F;&#x4ED8;&#xFF0C;&#x786E;&#x4FDD;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x6CA1;&#x6709;&#x88AB;&#x652F;&#x4ED8;&#x8FC7;&#x3002;</p>
<p><strong>ECDSA:</strong></p>
<p>&#x200B;    &#x692D;&#x5706;&#x66F2;&#x7EBF;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x7B97;&#x6CD5;&#xFF08;ECDSA&#xFF09;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x7684;&#x52A0;&#x5BC6;&#x7B97;&#x6CD5;&#xFF0C;&#x4EE5;&#x786E;&#x4FDD;&#x8D44;&#x91D1;&#x53EA;&#x80FD;&#x88AB;&#x5176;&#x6B63;&#x786E;&#x62E5;&#x6709;&#x8005;&#x82B1;&#x8D39;&#x3002;</p>
<p><strong>&#x8D85;&#x989D;&#x968F;&#x673A;&#x6570;:</strong></p>
<p>&#x200B;    &#x968F;&#x7740;&#x96BE;&#x5EA6;&#x589E;&#x52A0;&#xFF0C;&#x77FF;&#x5DE5;&#x901A;&#x5E38;&#x5728;&#x5FAA;&#x73AF;&#x904D;&#x5386;4&#x4EBF;&#x6B21;&#x968F;&#x673A;&#x6570;&#x503C;&#x540E;&#x4ECD;&#x672A;&#x627E;&#x5230;&#x533A;&#x5757;&#x3002;&#x56E0;&#x4E3A;coinbase&#x811A;&#x672C;&#x53EF;&#x4EE5;&#x5B58;&#x50A8;2&#x5230;100&#x5B57;&#x8282;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x77FF;&#x5DE5;&#x5F00;&#x59CB;&#x4F7F;&#x7528;&#x8FD9;&#x4E2A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x4F5C;&#x4E3A;&#x8D85;&#x989D;nonce&#x7A7A;&#x95F4;&#xFF0C;&#x5141;&#x8BB8;&#x4ED6;&#x4EEC;&#x5229;&#x7528;&#x4E00;&#x4E2A;&#x66F4;&#x5927;&#x8303;&#x56F4;&#x7684;&#x533A;&#x5757;&#x5934;&#x54C8;&#x5E0C;&#x503C;&#x6765;&#x5BFB;&#x627E;&#x6709;&#x6548;&#x7684;&#x533A;&#x5757;&#x3002;</p>
<p><strong>&#x77FF;&#x5DE5;&#x8D39;:</strong></p>
<p>&#x200B;      &#x4EA4;&#x6613;&#x7684;&#x53D1;&#x8D77;&#x8005;&#x901A;&#x5E38;&#x4F1A;&#x5411;&#x7F51;&#x7EDC;&#x7F34;&#x7EB3;&#x4E00;&#x7B14;&#x77FF;&#x5DE5;&#x8D39;&#xFF0C;&#x7528;&#x4EE5;&#x5904;&#x7406;&#x8FD9;&#x7B14;&#x4EA4;&#x6613;&#x3002;&#x5927;&#x591A;&#x6570;&#x7684;&#x4EA4;&#x6613;&#x9700;&#x8981;0.5&#x6BEB;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x77FF;&#x5DE5;&#x8D39;&#x3002;</p>
<p><strong>&#x5206;&#x53C9;:</strong></p>
<p>&#x200B;    &#x5206;&#x53C9;&#x4E5F;&#x88AB;&#x79F0;&#x4E3A;&#x610F;&#x5916;&#x5206;&#x53C9;&#xFF0C;&#x662F;&#x5728;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x533A;&#x5757;&#x62E5;&#x6709;&#x540C;&#x4E00;&#x533A;&#x5757;&#x9AD8;&#x5EA6;&#x65F6;&#x53D1;&#x751F;&#x7684;&#xFF0C;&#x6B64;&#x65F6;&#x4F7F;&#x533A;&#x5757;&#x94FE;&#x4EA7;&#x751F;&#x4E86;&#x5206;&#x53C9;&#x3002;&#x5178;&#x578B;&#x60C5;&#x51B5;&#x662F;&#x4E24;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x533A;&#x5757;&#x77FF;&#x5DE5;&#x51E0;&#x4E4E;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x523B;&#x53D1;&#x73B0;&#x4E86;&#x533A;&#x5757;&#x3002;&#x5171;&#x8BC6;&#x653B;&#x51FB;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x4E5F;&#x4F1A;&#x51FA;&#x73B0;&#x5206;&#x53C9;&#x3002;</p>
<p> <strong>&#x521B;&#x4E16;&#x5757;:</strong></p>
<p>&#x200B;        &#x521B;&#x4E16;&#x533A;&#x5757;&#x6307;&#x533A;&#x5757;&#x94FE;&#x4E0A;&#x7684;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#xFF0C;&#x7528;&#x6765;&#x521D;&#x59CB;&#x5316;&#x76F8;&#x5E94;&#x7684;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x3002;</p>
<p> <strong>&#x786C;&#x5206;&#x53C9;:</strong></p>
<p>&#x200B;    &#x786C;&#x5206;&#x53C9;&#xFF0C;&#x4E5F;&#x53EB;&#x786C;&#x5206;&#x53C9;&#x6539;&#x53D8;&#xFF0C;&#x662F;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x4E00;&#x4E2A;&#x6C38;&#x4E45;&#x5206;&#x6B67;&#x3002;&#x901A;&#x5E38;&#x5728;&#x5DF2;&#x6309;&#x7167;&#x65B0;&#x7684;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x8FDB;&#x884C;&#x4E86;&#x7248;&#x672C;&#x5347;&#x7EA7;&#x7684;&#x8282;&#x70B9;&#x4EA7;&#x751F;&#x4E86;&#x65B0;&#x533A;&#x5757;&#x65F6;&#xFF0C;&#x90A3;&#x4E9B;&#x672A;&#x5347;&#x7EA7;&#x8282;&#x70B9;&#x65E0;&#x6CD5;&#x9A8C;&#x8BC1;&#x8FD9;&#x4E9B;&#x65B0;&#x533A;&#x5757;&#x65F6;&#x4EA7;&#x751F;&#x786C;&#x5206;&#x53C9;&#x3002;&#x4E0D;&#x8981;&#x4E0E;&#x5206;&#x53C9;&#x3001;&#x8F6F;&#x5206;&#x53C9;&#x6216;&#x8005;Git&#x5206;&#x53C9;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>&#x786C;&#x4EF6;&#x94B1;&#x5305;:</strong></p>
<p>&#x200B;    &#x786C;&#x4EF6;&#x94B1;&#x5305;&#x662F;&#x4E00;&#x79CD;&#x7279;&#x6B8A;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x94B1;&#x5305;&#xFF0C;&#x786C;&#x4EF6;&#x94B1;&#x5305;&#x53EF;&#x4EE5;&#x5C06;&#x7528;&#x6237;&#x7684;&#x79C1;&#x94A5;&#x5B58;&#x50A8;&#x5728;&#x5B89;&#x5168;&#x7684;&#x786C;&#x4EF6;&#x8BBE;&#x5907;&#x4E2D;&#x3002;</p>
<p><strong>&#x54C8;&#x5E0C;:</strong></p>
<p>&#x200B;    &#x4E8C;&#x8FDB;&#x5236;&#x8F93;&#x5165;&#x6570;&#x636E;&#x7684;&#x4E00;&#x79CD;&#x6570;&#x5B57;&#x6307;&#x7EB9;&#x3002;</p>
<p><strong>&#x54C8;&#x5E0C;&#x9501;:</strong></p>
<p>&#x200B;    &#x54C8;&#x5E0C;&#x9501;&#x662F;&#x9650;&#x5236;&#x4E00;&#x4E2A;&#x8F93;&#x51FA;&#x82B1;&#x8D39;&#x7684;&#x9650;&#x5236;&#x5BF9;&#x8C61;&#xFF0C;&#x5176;&#x4F5C;&#x7528;&#x4E00;&#x76F4;&#x6301;&#x7EED;&#x5230;&#x6307;&#x5B9A;&#x6570;&#x636E;&#x7247;&#x6BB5;&#x516C;&#x5F00;&#x900F;&#x9732;&#x3002;&#x54C8;&#x5E0C;&#x9501;&#x6709;&#x4E00;&#x4E2A;&#x6709;&#x7528;&#x7684;&#x5C5E;&#x6027;&#xFF0C;&#x90A3;&#x5C31;&#x662F;&#x4E00;&#x65E6;&#x4EFB;&#x610F;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x9501;&#x88AB;&#x516C;&#x5F00;&#x6253;&#x5F00;&#xFF0C;&#x4EFB;&#x4F55;&#x5176;&#x4ED6;&#x4F7F;&#x7528;&#x76F8;&#x540C;&#x5BC6;&#x94A5;&#x4FDD;&#x62A4;&#x7684;&#x54C8;&#x5E0C;&#x9501;&#x4E5F;&#x53EF;&#x4EE5;&#x88AB;&#x6253;&#x5F00;&#x3002;&#x8FD9;&#x4F7F;&#x5F97;&#x53EF;&#x80FD;&#x521B;&#x5EFA;&#x591A;&#x4E2A;&#x88AB;&#x540C;&#x4E00;&#x54C8;&#x5E0C;&#x9501;&#x9650;&#x5236;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x8FD9;&#x4E9B;&#x8F93;&#x51FA;&#x5C06;&#x5728;&#x540C;&#x4E00;&#x65F6;&#x95F4;&#x88AB;&#x82B1;&#x8D39;&#x3002;</p>
<p><strong>HD&#x534F;&#x8BAE;:</strong></p>
<p>&#x200B;    &#x5C42;&#x7EA7;&#x786E;&#x5B9A;&#x6027;&#xFF08;HD&#xFF09;&#x5BC6;&#x94A5;&#x521B;&#x5EFA;&#x548C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF08;BIP32&#xFF09;&#xFF0C;&#x8BE5;&#x534F;&#x8BAE;&#x5141;&#x8BB8;&#x6309;&#x5C42;&#x7EA7;&#x65B9;&#x5F0F;&#x4ECE;&#x7236;&#x5BC6;&#x94A5;&#x521B;&#x5EFA;&#x5B50;&#x5BC6;&#x94A5;&#x3002;</p>
<p><strong>HD&#x94B1;&#x5305;:</strong></p>
<p>&#x200B;    &#x4F7F;&#x7528;&#x5C42;&#x7EA7;&#x786E;&#x5B9A;&#x6027;&#xFF08;HD&#xFF09;&#x5BC6;&#x94A5;&#x521B;&#x5EFA;&#x548C;&#x4F20;&#x8F93;&#x534F;&#x8BAE;&#xFF08;BIP32&#xFF09;&#x7684;&#x94B1;&#x5305;&#x3002;</p>
<p><strong>HD&#x94B1;&#x5305;&#x79CD;&#x5B50;:</strong></p>
<p>&#x200B;    HD&#x94B1;&#x5305;&#x79CD;&#x5B50;&#x6216;&#x6839;&#x79CD;&#x5B50;&#x662F;&#x4E00;&#x4E2A;&#x6F5C;&#x5728;&#x7B80;&#x77ED;&#x7684;&#x503C;&#xFF0C;&#x7528;&#x4E8E;&#x4F5C;&#x4E3A;&#x79CD;&#x5B50;&#x4E3A;HD&#x94B1;&#x5305;&#x751F;&#x6210;&#x4E3B;&#x79C1;&#x94A5;&#x548C;&#x4E3B;&#x94FE;&#x7801;&#x3002;</p>
<p><strong>&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5408;&#x7EA6;:</strong></p>
<p>&#x200B;    &#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5408;&#x7EA6;&#xFF08;HTLC&#xFF09;&#x662F;&#x4E00;&#x7C7B;&#x652F;&#x4ED8;&#x65B9;&#x5F0F;&#xFF0C;&#x5176;&#x4F7F;&#x7528;&#x54C8;&#x5E0C;&#x9501;&#x548C;&#x65F6;&#x95F4;&#x9501;&#x6765;&#x9501;&#x5B9A;&#x4EA4;&#x6613;&#x3002;&#x89E3;&#x9501;&#x9700;&#x8981;&#x63A5;&#x6536;&#x65B9;&#x901A;&#x8FC7;&#x52A0;&#x5BC6;&#x652F;&#x4ED8;&#x8BC1;&#x660E;&#x786E;&#x8BA4;&#x5728;&#x622A;&#x6B62;&#x65E5;&#x671F;&#x4E4B;&#x524D;&#x6536;&#x5230;&#x4E86;&#x652F;&#x4ED8;&#xFF0C;&#x6216;&#x8005;&#x63A5;&#x6536;&#x65B9;&#x4E27;&#x5931;&#x4E86;&#x8BA4;&#x9886;&#x652F;&#x4ED8;&#x7684;&#x80FD;&#x529B;&#xFF0C;&#x6B64;&#x65F6;&#x652F;&#x4ED8;&#x91D1;&#x989D;&#x5C06;&#x8FD4;&#x56DE;&#x7ED9;&#x652F;&#x4ED8;&#x65B9;&#x3002;</p>
<p><strong>KYC:</strong></p>
<p>&#x200B;    &#x5145;&#x5206;&#x4E86;&#x89E3;&#x4F60;&#x7684;&#x5BA2;&#x6237;&#xFF08;KYC&#xFF0C;Know yourcustomer&#xFF09;&#x662F;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x8FC7;&#x7A0B;&#xFF0C;&#x7528;&#x4E8E;&#x8BA4;&#x8BC1;&#x548C;&#x9A8C;&#x8BC1;&#x987E;&#x5BA2;&#x7684;&#x8EAB;&#x4EFD;&#x4FE1;&#x606F;&#x3002;&#x4E5F;&#x6307;&#x94F6;&#x884C;&#x5BF9;&#x8FD9;&#x4E9B;&#x6D3B;&#x52A8;&#x7684;&#x76D1;&#x7BA1;&#x3002;</p>
<p><strong>LevelDB:</strong></p>
<p>&#x200B;    LevelDB&#x662F;&#x4E00;&#x4E2A;&#x5F00;&#x6E90;&#x7684;&#x78C1;&#x76D8;&#x952E;&#x503C;&#x5BF9;&#x6570;&#x636E;&#x5E93;&#x3002;LevelDB&#x662F;&#x4E00;&#x4E2A;&#x91CD;&#x91CF;&#x8F7B;&#x3001;&#x529F;&#x80FD;&#x5355;&#x4E00;&#x7684;&#x6301;&#x4E45;&#x6027;&#x5E93;&#xFF0C;&#x53EF;&#x4EE5;&#x7ED1;&#x5B9A;&#x5230;&#x8BB8;&#x591A;&#x5E73;&#x53F0;&#x3002;</p>
<p><strong>&#x95EA;&#x7535;&#x7F51;&#x7EDC;:</strong></p>
<p>&#x200B;    &#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x662F;&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5B9A;&#x5408;&#x7EA6;&#xFF08;HTLCs&#xFF09;&#x7684;&#x4E00;&#x79CD;&#x63A8;&#x8350;&#x5B9E;&#x73B0;&#x65B9;&#x5F0F;&#x3002;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x901A;&#x8FC7;&#x53CC;&#x5411;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x65B9;&#x5F0F;&#x5141;&#x8BB8;&#x652F;&#x4ED8;&#x65B9;&#x901A;&#x8FC7;&#x591A;&#x4E2A;&#x70B9;&#x5BF9;&#x70B9;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x5B89;&#x5168;&#x5730;&#x8DEF;&#x7531;&#x652F;&#x4ED8;&#x3002;&#x8FD9;&#x6837;&#x5C31;&#x53EF;&#x4EE5;&#x5F62;&#x6210;&#x4E00;&#x4E2A;&#x7F51;&#x7EDC;&#xFF0C;&#x8BE5;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E00;&#x65B9;&#x53EF;&#x4EE5;&#x652F;&#x4ED8;&#x7ED9;&#x5176;&#x4ED6;&#x4EFB;&#x4F55;&#x4E00;&#x65B9;&#xFF0C;&#x5373;&#x4F7F;&#x5728;&#x4ED6;&#x4EEC;&#x53CC;&#x65B9;&#x6CA1;&#x6709;&#x76F4;&#x63A5;&#x5EFA;&#x7ACB;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x7684;&#x60C5;&#x51B5;&#x3002;</p>
<p><strong>&#x9501;&#x5B9A;&#x65F6;&#x95F4;:</strong></p>
<p>&#x200B;    &#x9501;&#x5B9A;&#x65F6;&#x95F4;&#xFF08;&#x6280;&#x672F;&#x4E0A;&#x6765;&#x8BF4;&#x662F;nLockTime&#xFF09;&#x662F;&#x4EA4;&#x6613;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x5176;&#x8868;&#x660E;&#x8BE5;&#x4EA4;&#x6613;&#x88AB;&#x6DFB;&#x52A0;&#x81F3;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x6700;&#x65E9;&#x65F6;&#x95F4;&#x6216;&#x533A;&#x5757;&#x3002;</p>
<p><strong>&#x4EA4;&#x6613;&#x6C60;:</strong></p>
<p>&#x200B;   &#x6BD4;&#x7279;&#x5E01;&#x5185;&#x5B58;&#x6C60;&#x662F;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x6570;&#x636E;&#x7684;&#x96C6;&#x5408;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EA4;&#x6613;&#x5DF2;&#x7ECF;&#x88AB;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x9A8C;&#x8BC1;&#xFF0C;&#x4F46;&#x672A;&#x88AB;&#x786E;&#x8BA4;&#x3002;</p>
<p><strong>&#x9ED8;&#x514B;&#x5C14;&#x6839;:</strong></p>
<p>&#x200B;    &#x9ED8;&#x514B;&#x5C14;&#x6811;&#x7684;&#x6839;&#x662F;&#x6811;&#x7684;&#x6839;&#x8282;&#x70B9;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x4E3A;&#x6811;&#x4E2D;&#x6240;&#x6709;&#x8282;&#x70B9;&#x5BF9;&#x7684;&#x591A;&#x6B21;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x7ED3;&#x679C;&#x3002;&#x533A;&#x5757;&#x5934;&#x5FC5;&#x987B;&#x5305;&#x62EC;&#x533A;&#x5757;&#x4E2D;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x6709;&#x6548;&#x9ED8;&#x514B;&#x5C14;&#x6839;&#x3002;</p>
<p> <strong>&#x9ED8;&#x514B;&#x5C14;&#x6811;:</strong></p>
<p>&#x200B;    &#x751F;&#x6210;&#x4E00;&#x68F5;&#x5B8C;&#x6574;&#x7684;Merkle&#x6811;&#x9700;&#x8981;&#x9012;&#x5F52;&#x5730;&#x5BF9;&#x54C8;&#x5E0C;&#x8282;&#x70B9;&#x5BF9;&#x8FDB;&#x884C;&#x54C8;&#x5E0C;&#xFF0C;&#x5E76;&#x5C06;&#x65B0;&#x751F;&#x6210;&#x7684;&#x54C8;&#x5E0C;&#x8282;&#x70B9;&#x63D2;&#x5165;&#x5230;Merkle&#x6811;&#x4E2D;&#xFF0C;&#x76F4;&#x5230;&#x53EA;&#x5269;&#x4E00;&#x4E2A;&#x54C8;&#x5E0C;&#x8282;&#x70B9;&#xFF0C;&#x8BE5;&#x8282;&#x70B9;&#x5C31;&#x662F;Merkle&#x6811;&#x7684;&#x6839;&#x3002;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#xFF0C;&#x53F6;&#x5B50;&#x8282;&#x70B9;&#x6765;&#x81EA;&#x4E8E;&#x5355;&#x4E2A;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p><strong>&#x77FF;&#x5DE5;:</strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x4E3A;&#x65B0;&#x533A;&#x5757;&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x6765;&#x5BFB;&#x627E;&#x6709;&#x6548;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x7F51;&#x7EDC;&#x8282;&#x70B9;&#x3002;</p>
<p><strong>&#x591A;&#x91CD;&#x7B7E;&#x540D;:</strong></p>
<p>&#x200B;    &#x591A;&#x91CD;&#x7B7E;&#x540D;&#x6307;&#x7684;&#x662F;&#x9700;&#x8981;&#x591A;&#x4E8E;&#x4E00;&#x4E2A;&#x5BC6;&#x94A5;&#x6765;&#x9A8C;&#x8BC1;&#x4E00;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x3002;</p>
<p><strong>&#x7F51;&#x7EDC;:</strong></p>
<p>&#x200B;    &#x4F20;&#x64AD;&#x4EA4;&#x6613;&#x548C;&#x533A;&#x5757;&#x81F3;&#x7F51;&#x7EDC;&#x4E2D;&#x6BCF;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x8282;&#x70B9;&#x7684;&#x70B9;&#x5BF9;&#x70B9;&#x7F51;&#x7EDC;&#x3002;</p>
<p><strong>&#x968F;&#x673A;&#x6570;:</strong></p>
<p>&#x968F;&#x673A;&#x6570;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x4E2D;&#x4E00;&#x4E2A;32&#x4F4D;&#xFF08;4&#x5B57;&#x8282;&#xFF09;&#x7684;&#x5B57;&#x6BB5;&#xFF0C;&#x5728;&#x8BBE;&#x5B9A;&#x4E86;&#x8BE5;&#x503C;&#x540E;&#xFF0C;&#x624D;&#x80FD;&#x8BA1;&#x7B97;&#x533A;&#x5757;&#x7684;&#x54C8;&#x5E0C;&#x503C;&#xFF0C;&#x5176;&#x54C8;&#x5E0C;&#x503C;&#x662F;&#x4EE5;&#x591A;&#x4E2A;0&#x5F00;&#x5934;&#x7684;&#x3002;&#x533A;&#x5757;&#x4E2D;&#x7684;&#x5176;&#x4ED6;&#x5B57;&#x6BB5;&#x503C;&#x662F;&#x4E0D;&#x53D8;&#x7684;&#xFF0C;&#x56E0;&#x4E3A;&#x4ED6;&#x4EEC;&#x6709;&#x786E;&#x5B9A;&#x7684;&#x542B;&#x4E49;&#x3002;</p>
<p><strong>&#x79BB;&#x7EBF;&#x4EA4;&#x6613;:</strong></p>
<p>&#x200B;    &#x79BB;&#x7EBF;&#x4EA4;&#x6613;&#x662F;&#x533A;&#x5757;&#x94FE;&#x5916;&#x7684;&#x4EF7;&#x503C;&#x8F6C;&#x79FB;&#x3002;&#x5F53;&#x5728;&#x94FE;&#x4EA4;&#x6613;&#xFF08;&#x901A;&#x5E38;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x4EA4;&#x6613;&#xFF09;&#x4FEE;&#x6539;&#x533A;&#x5757;&#x94FE;&#x5E76;&#x4F9D;&#x8D56;&#x533A;&#x5757;&#x6765;&#x51B3;&#x5B9A;&#x5B83;&#x7684;&#x6709;&#x6548;&#x6027;&#x65F6;&#xFF0C;&#x79BB;&#x7EBF;&#x4EA4;&#x6613;&#x5219;&#x4F9D;&#x8D56;&#x5176;&#x4ED6;&#x65B9;&#x6CD5;&#x6765;&#x6765;&#x8BB0;&#x5F55;&#x548C;&#x9A8C;&#x8BC1;&#x8BE5;&#x4EA4;&#x6613;&#x3002;</p>
<p> <strong>&#x64CD;&#x4F5C;&#x7801;:</strong></p>
<p>&#x200B;    &#x64CD;&#x4F5C;&#x7801;&#x6765;&#x6E90;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x811A;&#x672C;&#x8BED;&#x8A00;&#xFF0C;&#x901A;&#x8FC7;&#x64CD;&#x4F5C;&#x7801;&#x53EF;&#x4EE5;&#x5728;&#x516C;&#x94A5;&#x811A;&#x672C;&#x6216;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x4E2D;&#x5B9E;&#x73B0;&#x538B;&#x5165;&#x6570;&#x636E;&#x6216;&#x6267;&#x884C;&#x51FD;&#x6570;&#x7684;&#x64CD;&#x4F5C;&#x3002;</p>
<p><strong>&#x5F00;&#x653E;&#x8D44;&#x4EA7;&#x534F;&#x8BAE;:</strong></p>
<p>&#x200B;    &#x5F00;&#x653E;&#x8D44;&#x4EA7;&#x534F;&#x8BAE;&#x662F;&#x4E00;&#x4E2A;&#x5EFA;&#x7ACB;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E4B;&#x4E0A;&#x7B80;&#x5355;&#x6709;&#x6548;&#x7684;&#x534F;&#x8BAE;&#x3002;&#x5B83;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x521B;&#x5EFA;&#x8D44;&#x4EA7;&#x7684;&#x53D1;&#x884C;&#x548C;&#x4F20;&#x8F93;&#x3002;&#x5F00;&#x653E;&#x8D44;&#x4EA7;&#x534F;&#x8BAE;&#x662F;&#x989C;&#x8272;&#x5E01;&#x6982;&#x5FF5;&#x7684;&#x4E00;&#x4E2A;&#x8FDB;&#x5316;&#x3002;</p>
<p><strong>OP_RETURN:</strong></p>
<p>&#x200B;    &#x4E00;&#x4E2A;&#x7528;&#x5728;OP_RETURN&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x4E00;&#x79CD;&#x8F93;&#x51FA;&#x64CD;&#x4F5C;&#x7801;&#x3002;&#x4E0D;&#x8981;&#x4E0E;OP_RETURN&#x4EA4;&#x6613;&#x6DF7;&#x6DC6;&#x3002;</p>
<p><strong>OP_RETURN&#x4EA4;&#x6613;:</strong></p>
<p>&#x200B;    OP_RETURN&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;0.9.0&#x4E2D;&#x9ED8;&#x8BA4;&#x7684;&#x4E00;&#x79CD;&#x88AB;&#x4F20;&#x64AD;&#x548C;&#x6316;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#xFF0C;&#x5728;&#x968F;&#x540E;&#x7684;&#x7248;&#x672C;&#x4E2D;&#x6DFB;&#x52A0;&#x4EFB;&#x610F;&#x6570;&#x636E;&#x81F3;&#x53EF;&#x8BC1;&#x660E;&#x7684;&#x672A;&#x82B1;&#x8D39;&#x516C;&#x94A5;&#x811A;&#x672C;&#x4E2D;&#xFF0C;&#x5168;&#x8282;&#x70B9;&#x4E2D;&#x65E0;&#x9700;&#x5C06;&#x8BE5;&#x811A;&#x672C;&#x5B58;&#x50A8;&#x81F3;&#x4ED6;&#x4EEC;&#x7684;UTXO&#x6570;&#x636E;&#x5E93;&#x4E2D;&#x3002;&#x4E0D;&#x8981;&#x4E0E;OP_RETURN&#x64CD;&#x4F5C;&#x7801;&#x6DF7;&#x6DC6;&#x3002;</p>
<p> <strong>&#x5B64;&#x5757;:</strong></p>
<p>&#x200B;    &#x5B64;&#x5757;&#x7531;&#x4E8E;&#x7236;&#x533A;&#x5757;&#x672A;&#x88AB;&#x672C;&#x5730;&#x8282;&#x70B9;&#x5904;&#x7406;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x6240;&#x4EE5;&#x4ED6;&#x4EEC;&#x8FD8;&#x4E0D;&#x80FD;&#x88AB;&#x5B8C;&#x5168;&#x9A8C;&#x8BC1;&#x3002;</p>
<p><strong>&#x5B64;&#x7ACB;&#x4EA4;&#x6613;:</strong></p>
<p>&#x200B;    &#x5B64;&#x7ACB;&#x4EA4;&#x6613;&#x662F;&#x6307;&#x90A3;&#x4E9B;&#x56E0;&#x4E3A;&#x7F3A;&#x5C11;&#x4E00;&#x4E2A;&#x6216;&#x591A;&#x4E2A;&#x8F93;&#x5165;&#x4EA4;&#x6613;&#x800C;&#x65E0;&#x6CD5;&#x8FDB;&#x5165;&#x4EA4;&#x6613;&#x6C60;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p><strong>&#x4EA4;&#x6613;&#x8F93;&#x51FA;:</strong></p>
<p>&#x200B;    &#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF08;TxOut&#xFF09;&#x662F;&#x4EA4;&#x6613;&#x4E2D;&#x7684;&#x8F93;&#x51FA;&#xFF0C;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x4E2D;&#x5305;&#x542B;&#x4E24;&#x4E2A;&#x5B57;&#x6BB5;&#xFF1A;1.&#x8F93;&#x51FA;&#x503C;&#x5B57;&#x6BB5;&#xFF1A;&#x7528;&#x4E8E;&#x4F20;&#x8F93;0&#x6216;&#x66F4;&#x591A;&#x806A;&#xFF1B;2.&#x516C;&#x94A5;&#x811A;&#x672C;&#xFF1A;&#x7528;&#x4E8E;&#x786E;&#x5B9A;&#x8FD9;&#x4E9B;&#x806A;&#x9700;&#x5728;&#x6EE1;&#x8DB3;&#x4EC0;&#x4E48;&#x6761;&#x4EF6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x624D;&#x53EF;&#x82B1;&#x8D39;&#x3002;</p>
<p><strong>P2PKH:</strong></p>
<p>&#x200B;    &#x652F;&#x4ED8;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x7684;&#x4EA4;&#x6613;&#x5305;&#x542B;&#x652F;&#x4ED8;&#x516C;&#x94A5;&#x54C8;&#x5E0C;&#x811A;&#x672C;&#xFF08;P2PKH&#xFF09;&#x3002;&#x7531;P2PKH&#x811A;&#x672C;&#x9501;&#x5B9A;&#x7684;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x7ED9;&#x51FA;&#x7531;&#x76F8;&#x5E94;&#x79C1;&#x94A5;&#x521B;&#x5EFA;&#x7684;&#x516C;&#x94A5;&#x548C;&#x6570;&#x5B57;&#x7B7E;&#x540D;&#x6765;&#x89E3;&#x9501;&#xFF08;&#x6D88;&#x8D39;&#xFF09;&#x3002;</p>
<p><strong>P2SH:</strong></p>
<p>&#x200B;    P2SH&#x662F;&#x4E00;&#x79CD;&#x5F3A;&#x5927;&#x7684;&#x3001;&#x65B0;&#x578B;&#x7684;&#x3001;&#x4E14;&#x80FD;&#x5927;&#x5927;&#x7B80;&#x5316;&#x590D;&#x6742;&#x4EA4;&#x6613;&#x811A;&#x672C;&#x7684;&#x4EA4;&#x6613;&#x7C7B;&#x578B;&#x3002;&#x901A;&#x8FC7;&#x4F7F;&#x7528;P2SH&#xFF0C;&#x8BE6;&#x7EC6;&#x63CF;&#x8FF0;&#x82B1;&#x8D39;&#x8F93;&#x51FA;&#x6761;&#x4EF6;&#x7684;&#x590D;&#x6742;&#x811A;&#x672C;&#xFF08;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#xFF09;&#x5C06;&#x4E0D;&#x4F1A;&#x51FA;&#x73B0;&#x5728;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x4E2D;&#x3002;&#x76F8;&#x53CD;&#xFF0C;&#x53EA;&#x6709;&#x8D4E;&#x56DE;&#x811A;&#x672C;&#x54C8;&#x5E0C;&#x5305;&#x542B;&#x5728;&#x9501;&#x5B9A;&#x811A;&#x672C;&#x4E2D;&#x3002;</p>
<p><strong>P2SH&#x5730;&#x5740;:</strong></p>
<p>&#x200B;    P2SH&#x5730;&#x5740;&#x662F;&#x57FA;&#x4E8E;Base58&#x7F16;&#x7801;&#x7684;&#x4E00;&#x4E2A;&#x542B;&#x6709;20&#x4E2A;&#x5B57;&#x8282;&#x54C8;&#x5E0C;&#x7684;&#x811A;&#x672C;&#x3002;P2SH&#x5730;&#x5740;&#x91C7;&#x7528;&#x201C;5&#x201D;&#x524D;&#x7F00;&#x3002;&#x8FD9;&#x5BFC;&#x81F4;&#x57FA;&#x4E8E;Base58&#x7F16;&#x7801;&#x7684;&#x5730;&#x5740;&#x4EE5;&#x201C;3&#x201D;&#x5F00;&#x5934;&#x3002;P2SH &#x5730;&#x5740;&#x9690;&#x85CF;&#x4E86;&#x6240;&#x6709;&#x7684;&#x590D;&#x6742;&#x6027;&#xFF0C;&#x56E0;&#x6B64;&#xFF0C;&#x8FD0;&#x7528;&#x5176;&#x8FDB;&#x884C;&#x652F;&#x4ED8;&#x7684;&#x4EBA;&#x5C06;&#x4E0D;&#x4F1A;&#x770B;&#x5230;&#x811A;&#x672C;&#x3002;</p>
<p><strong>P2WPKH:</strong></p>
<p>&#x200B;    P2WPKH&#x7B7E;&#x540D;&#x5305;&#x542B;&#x4E86;&#x4E0E;P2PKH&#x82B1;&#x8D39;&#x76F8;&#x540C;&#x7684;&#x4FE1;&#x606F;&#x3002;&#x4F46;&#x662F;&#x7B7E;&#x540D;&#x4FE1;&#x606F;&#x653E;&#x7F6E;&#x4E8E;&#x89C1;&#x8BC1;&#x5B57;&#x6BB5;&#xFF0C;&#x800C;&#x4E0D;&#x662F;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x5B57;&#x6BB5;&#x4E2D;&#x3002;&#x516C;&#x94A5;&#x811A;&#x672C;&#x4E5F;&#x88AB;&#x4FEE;&#x6539;&#x4E86;&#x3002;</p>
<p><strong>P2WSH:</strong></p>
<p>&#x200B;    P2WSH&#x4E0E;P2SH&#x7684;&#x4E0D;&#x540C;&#x4E4B;&#x5904;&#x5728;&#x4E8E;&#x52A0;&#x5BC6;&#x8BC1;&#x636E;&#x5B58;&#x653E;&#x4F4D;&#x7F6E;&#x4ECE;&#x811A;&#x672C;&#x7B7E;&#x540D;&#x5B57;&#x6BB5;&#x8F6C;&#x53D8;&#x81F3;&#x89C1;&#x8BC1;&#x5B57;&#x6BB5;&#xFF0C;&#x516C;&#x94A5;&#x811A;&#x672C;&#x5B57;&#x6BB5;&#x4E5F;&#x88AB;&#x6539;&#x53D8;&#x3002;</p>
<p><strong>&#x7EB8;&#x94B1;&#x5305;:</strong></p>
<p>&#x200B;    &#x5728;&#x5927;&#x591A;&#x6570;&#x7279;&#x5B9A;&#x542B;&#x4E49;&#x4E0B;&#xFF0C;&#x7EB8;&#x94B1;&#x5305;&#x662F;&#x4E00;&#x4E2A;&#x5305;&#x542B;&#x6240;&#x6709;&#x5FC5;&#x8981;&#x6570;&#x636E;&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E9B;&#x6570;&#x636E;&#x7528;&#x4E8E;&#x751F;&#x6210;&#x6BD4;&#x7279;&#x5E01;&#x79C1;&#x94A5;&#xFF0C;&#x5F62;&#x6210;&#x5BC6;&#x94A5;&#x94B1;&#x5305;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x4EBA;&#x4EEC;&#x901A;&#x5E38;&#x4F7F;&#x7528;&#x8BE5;&#x672F;&#x8BED;&#x6765;&#x8868;&#x8FBE;&#x4EE5;&#x7269;&#x7406;&#x6587;&#x4EF6;&#x5F62;&#x5F0F;&#x79BB;&#x7EBF;&#x5B58;&#x50A8;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x65B9;&#x5F0F;&#x3002;&#x7B2C;&#x4E8C;&#x4E2A;&#x5B9A;&#x4E49;&#x4E5F;&#x5305;&#x62EC;&#x7EB8;&#x5BC6;&#x94A5;&#x548C;&#x53EF;&#x8D4E;&#x56DE;&#x7F16;&#x7801;&#x3002;</p>
<p><strong>&#x652F;&#x4ED8;&#x901A;&#x9053;:</strong></p>
<p>&#x200B;    &#x5FAE;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x548C;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x662F;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x5141;&#x8BB8;&#x7528;&#x6237;&#x751F;&#x6210;&#x591A;&#x4E2A;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#xFF0C;&#x4E14;&#x65E0;&#x9700;&#x63D0;&#x4EA4;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x81F3;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x3002;&#x5728;&#x4E00;&#x4E2A;&#x5178;&#x578B;&#x7684;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x4E2D;&#xFF0C;&#x53EA;&#x6709;&#x4E24;&#x4E2A;&#x4EA4;&#x6613;&#x88AB;&#x6DFB;&#x52A0;&#x81F3;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x4F46;&#x53C2;&#x4E0E;&#x53CC;&#x65B9;&#x53EF;&#x4EE5;&#x751F;&#x6210;&#x65E0;&#x9650;&#x5236;&#x6216;&#x63A5;&#x8FD1;&#x65E0;&#x9650;&#x5236;&#x6570;&#x91CF;&#x7684;&#x652F;&#x4ED8;&#x3002;</p>
<p><strong>&#x77FF;&#x6C60;:</strong></p>
<p>&#x200B;    &#x77FF;&#x6C60;&#x4E00;&#x79CD;&#x6316;&#x77FF;&#x65B9;&#x5F0F;&#xFF0C;&#x5728;&#x77FF;&#x6C60;&#x4E2D;&#x591A;&#x4E2A;&#x5BA2;&#x6237;&#x7AEF;&#x5171;&#x540C;&#x8D21;&#x732E;&#x7B97;&#x529B;&#x6765;&#x4EA7;&#x751F;&#x533A;&#x5757;&#xFF0C;&#x7136;&#x540E;&#x6839;&#x636E;&#x8D21;&#x732E;&#x7B97;&#x529B;&#x5927;&#x5C0F;&#x6765;&#x5206;&#x914D;&#x533A;&#x5757;&#x5956;&#x52B1;&#x3002;</p>
<p><strong>&#x6743;&#x76CA;&#x8BC1;&#x660E;:</strong></p>
<p>&#x200B;    &#x6743;&#x76CA;&#x8BC1;&#x660E;&#xFF08;POS&#xFF09;&#x662F;&#x4E00;&#x79CD;&#x65B9;&#x6CD5;&#xFF0C;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x7F51;&#x7EDC;&#x83B7;&#x5F97;&#x5206;&#x53D1;&#x5171;&#x8BC6;&#x3002;POS&#x4F1A;&#x8BA9;&#x7528;&#x6237;&#x8BC1;&#x660E;&#x5176;&#x62E5;&#x6709;&#x7684;&#x8D44;&#x4EA7;&#x603B;&#x91CF;(&#x4ED6;&#x4EEC;&#x5728;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x4E2D;&#x7684;&#x6743;&#x76CA;)&#x3002;</p>
<p><strong>&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;:</strong></p>
<p>&#x200B;        &#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x6307;&#x901A;&#x8FC7;&#x6709;&#x6548;&#x8BA1;&#x7B97;&#x5F97;&#x5230;&#x7684;&#x4E00;&#x5C0F;&#x5757;&#x6570;&#x636E;&#x3002;&#x5177;&#x4F53;&#x5230;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x77FF;&#x5DE5;&#x5FC5;&#x987B;&#x8981;&#x5728;&#x6EE1;&#x8DB3;&#x5168;&#x7F51;&#x76EE;&#x6807;&#x96BE;&#x5EA6;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#x6C42;&#x89E3;SHA256&#x7B97;&#x6CD5;&#x3002;</p>
<p> <strong>&#x5956;&#x52B1;:</strong></p>
<p>&#x200B;    &#x6BCF;&#x4E00;&#x4E2A;&#x65B0;&#x533A;&#x5757;&#x4E2D;&#x90FD;&#x6709;&#x4E00;&#x5B9A;&#x91CF;&#x65B0;&#x521B;&#x9020;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x7528;&#x6765;&#x5956;&#x52B1;&#x7B97;&#x51FA;&#x5DE5;&#x4F5C;&#x91CF;&#x8BC1;&#x660E;&#x7684;&#x77FF;&#x5DE5;&#x3002;&#x73B0;&#x9636;&#x6BB5;&#x6BCF;&#x4E00;&#x533A;&#x5757;&#x6709;12.5&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5956;&#x52B1;&#x3002;</p>
<p><strong>RIPEMD-160:</strong></p>
<p>&#x200B;    RIPEMD-160&#x662F;&#x4E00;&#x4E2A;160&#x4F4D;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x3002;RIPEMD-160&#x662F;RIPEMD&#x7684;&#x52A0;&#x5F3A;&#x7248;&#xFF0C;&#x5176;&#x54C8;&#x5E0C;&#x8BA1;&#x7B97;&#x540E;&#x7684;&#x7ED3;&#x679C;&#x662F;160&#x4F4D;&#x54C8;&#x5E0C;&#x503C;&#x3002;&#x901A;&#x8FC7;RIPEMD-160&#x52A0;&#x5BC6;&#x671F;&#x671B;&#x80FD;&#x5B9E;&#x73B0;&#x5728;&#x672A;&#x6765;&#x7684;10&#x5E74;&#x6216;&#x66F4;&#x957F;&#x65F6;&#x95F4;&#x90FD;&#x662F;&#x5B89;&#x5168;&#x7684;&#x3002;</p>
<p> <strong>&#x4E2D;&#x672C;&#x806A;:</strong></p>
<p>&#x200B;    &#x4E2D;&#x672C;&#x806A;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x4E00;&#x4E2A;&#x4EBA;&#x6216;&#x4E00;&#x7FA4;&#x4EBA;&#x7684;&#x540D;&#x5B57;&#x3002;&#x4E2D;&#x672C;&#x806A;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BBE;&#x8BA1;&#x8005;&#xFF0C;&#x540C;&#x65F6;&#x4E5F;&#x521B;&#x5EFA;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6700;&#x521D;&#x5B9E;&#x73B0;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x3002;&#x4F5C;&#x4E3A;&#x5B9E;&#x73B0;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x53D1;&#x660E;&#x4E86;&#x7B2C;&#x4E00;&#x4E2A;&#x533A;&#x5757;&#x94FE;&#x6570;&#x636E;&#x5E93;&#x3002;&#x5728;&#x8FD9;&#x4E2A;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x4ED6;&#x4EEC;&#x662F;&#x7B2C;&#x4E00;&#x4E2A;&#x4E3A;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x89E3;&#x51B3;&#x4E86;&#x53CC;&#x82B1;&#x95EE;&#x9898;&#x7684;&#x4EBA;&#x6216;&#x7EC4;&#x7EC7;&#x3002;&#x4F46;&#x4ED6;&#x4EEC;&#x7684;&#x771F;&#x5B9E;&#x8EAB;&#x4EFD;&#x4ECD;&#x7136;&#x672A;&#x77E5;&#x3002;</p>
<p> <strong>&#x811A;&#x672C;:</strong></p>
<p>&#x200B;    &#x6BD4;&#x7279;&#x5E01;&#x4F7F;&#x7528;&#x811A;&#x672C;&#x7CFB;&#x7EDF;&#x6765;&#x5904;&#x7406;&#x4EA4;&#x6613;&#x3002;&#x811A;&#x672C;&#x6709;&#x7740;&#x7C7B;Forth&#x8BED;&#x8A00;&#x3001;&#x7B80;&#x5355;&#x3001;&#x57FA;&#x4E8E;&#x5806;&#x6808;&#x4EE5;&#x53CA;&#x4ECE;&#x5DE6;&#x5411;&#x53F3;&#x5904;&#x7406;&#x7684;&#x7279;&#x70B9;&#x3002;&#x811A;&#x672C;&#x6545;&#x610F;&#x9650;&#x5B9A;&#x4E3A;&#x975E;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x7684;&#xFF0C;&#x6CA1;&#x6709;&#x5FAA;&#x73AF;&#x8BA1;&#x7B97;&#x529F;&#x80FD;&#x3002;</p>
<p> <strong>ScriptPubKey (&#x516C;&#x94A5;&#x811A;&#x672C;):</strong></p>
<p>&#x200B;    &#x811A;&#x672C;&#x516C;&#x94A5;&#x6216;&#x8005;&#x516C;&#x94A5;&#x811A;&#x672C;&#x662F;&#x5305;&#x542B;&#x5728;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#x4E2D;&#x7684;&#x811A;&#x672C;&#x3002;&#x8BE5;&#x811A;&#x672C;&#x8BBE;&#x7F6E;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#x82B1;&#x8D39;&#x9700;&#x6EE1;&#x8DB3;&#x7684;&#x6761;&#x4EF6;&#x3002;&#x6EE1;&#x8DB3;&#x6761;&#x4EF6;&#x7684;&#x6570;&#x636E;&#x53EF;&#x4EE5;&#x7531;&#x7B7E;&#x540D;&#x811A;&#x672C;&#x63D0;&#x4F9B;&#x3002;</p>
<p><strong>ScriptSig (&#x7B7E;&#x540D;&#x811A;&#x672C;):</strong></p>
<p>&#x200B;    &#x7B7E;&#x540D;&#x811A;&#x672C;&#x662F;&#x6709;&#x652F;&#x4ED8;&#x7AEF;&#x751F;&#x6210;&#x7684;&#x6570;&#x636E;&#xFF0C;&#x8BE5;&#x6570;&#x636E;&#x51E0;&#x4E4E;&#x603B;&#x662F;&#x88AB;&#x7528;&#x4F5C;&#x6EE1;&#x8DB3;&#x516C;&#x94A5;&#x811A;&#x672C;&#x7684;&#x53D8;&#x91CF;&#x3002;</p>
<p> <strong>&#x79D8;&#x94A5; (&#x79C1;&#x94A5;):</strong></p>
<p>&#x200B;        &#x7528;&#x6765;&#x89E3;&#x9501;&#x5BF9;&#x5E94;&#xFF08;&#x94B1;&#x5305;&#xFF09;&#x5730;&#x5740;&#x7684;&#x4E00;&#x4E32;&#x5B57;&#x7B26;&#xFF0C;&#x4F8B;&#x5982;5J76sF8L5jTtzE96r66Sf8cka9y44wdpJjMwCxR3tzLh3ibVPxh+&#x3002;</p>
<p> <strong>&#x9694;&#x79BB;&#x89C1;&#x8BC1;:</strong></p>
<p>&#x200B;    &#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x7684;&#x4E00;&#x4E2A;&#x5347;&#x7EA7;&#x5EFA;&#x8BAE;&#xFF0C;&#x8BE5;&#x5EFA;&#x8BAE;&#x6280;&#x672F;&#x521B;&#x65B0;&#x6027;&#x5730;&#x5C06;&#x7B7E;&#x540D;&#x6570;&#x636E;&#x4ECE;&#x6BD4;&#x7279;&#x5E01;&#x4EA4;&#x6613;&#x4E2D;&#x5206;&#x79BB;&#x51FA;&#x6765;&#x3002;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x662F;&#x4E00;&#x4E2A;&#x63A8;&#x8350;&#x7684;&#x8F6F;&#x5206;&#x53C9;&#x65B9;&#x6848;&#xFF1B;&#x8BE5;&#x53D8;&#x5316;&#x5C06;&#x4ECE;&#x6280;&#x672F;&#x4E0A;&#x4F7F;&#x5F97;&#x6BD4;&#x7279;&#x5E01;&#x534F;&#x8BAE;&#x89C4;&#x5219;&#x66F4;&#x4E25;&#x8C28;&#x3002;</p>
<p> <strong>SHA:</strong></p>
<p>&#x5B89;&#x5168;&#x54C8;&#x5E0C;&#x662F;&#x6709;NIST&#xFF08;&#x56FD;&#x5BB6;&#x6807;&#x51C6;&#x6280;&#x672F;&#x7814;&#x7A76;&#x6240;&#xFF09;&#x53D1;&#x5E03;&#x7684;&#x52A0;&#x5BC6;&#x54C8;&#x5E0C;&#x51FD;&#x6570;&#x65CF;&#x3002;</p>
<p> <strong>&#x8F6F;&#x5206;&#x53C9;:</strong></p>
<p>&#x200B;    &#x8F6F;&#x5206;&#x53C9;&#x662F;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x7684;&#x4E00;&#x4E2A;&#x77ED;&#x6682;&#x5206;&#x53C9;&#xFF0C;&#x901A;&#x5E38;&#x662F;&#x7531;&#x4E8E;&#x77FF;&#x5DE5;&#x5728;&#x4E0D;&#x77E5;&#x9053;&#x65B0;&#x5171;&#x8BC6;&#x89C4;&#x5219;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x672A;&#x5BF9;&#x5176;&#x4F7F;&#x7528;&#x8282;&#x70B9;&#x8FDB;&#x884C;&#x5347;&#x7EA7;&#x800C;&#x4EA7;&#x751F;&#x7684;&#x3002;&#x4E0D;&#x8981;&#x4E0E;&#x5206;&#x53C9;&#x3001;&#x786C;&#x5206;&#x53C9;&#x3001;&#x8F6F;&#x5206;&#x53C9;&#x6216;&#x8005;Git&#x5206;&#x53C9;&#x6DF7;&#x6DC6;&#x3002;</p>
<p> <strong>SPV (&#x7B80;&#x5316;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;):</strong></p>
<p>&#x200B;    &#x7B80;&#x5316;&#x652F;&#x4ED8;&#x9A8C;&#x8BC1;&#x662F;&#x5728;&#x65E0;&#x9700;&#x4E0B;&#x8F7D;&#x6240;&#x6709;&#x533A;&#x5757;&#x7684;&#x60C5;&#x51B5;&#x5BF9;&#x7279;&#x5B9A;&#x4EA4;&#x6613;&#x8FDB;&#x884C;&#x9A8C;&#x8BC1;&#x7684;&#x65B9;&#x6CD5;&#x3002;&#x8BE5;&#x65B9;&#x6CD5;&#x88AB;&#x7528;&#x5728;&#x4E00;&#x4E9B;&#x6BD4;&#x7279;&#x5E01;&#x8F7B;&#x91CF;&#x7EA7;&#x5BA2;&#x6237;&#x7AEF;&#x4E2D;&#x3002;</p>
<p><strong>&#x65E7;&#x5757;:</strong></p>
<p>&#x200B;    &#x65E7;&#x5757;&#x662F;&#x90A3;&#x4E9B;&#x88AB;&#x6210;&#x529F;&#x6316;&#x51FA;&#xFF0C;&#x4F46;&#x662F;&#x6CA1;&#x6709;&#x5305;&#x542B;&#x5728;&#x5F53;&#x524D;&#x4E3B;&#x94FE;&#x4E0A;&#x7684;&#x533A;&#x5757;&#xFF0C;&#x5F88;&#x6709;&#x53EF;&#x80FD;&#x662F;&#x540C;&#x4E00;&#x9AD8;&#x5EA6;&#x7684;&#x5176;&#x4ED6;&#x533A;&#x5757;&#x4F18;&#x5148;&#x6269;&#x5C55;&#x4E86;&#x533A;&#x5757;&#x94FE;&#x957F;&#x5EA6;&#x5BFC;&#x81F4;&#x7684;&#x3002;</p>
<p> <strong>&#x65F6;&#x95F4;&#x9501;:</strong></p>
<p>&#x200B;    &#x65F6;&#x95F4;&#x9501;&#x662F;&#x4E00;&#x79CD;&#x963B;&#x788D;&#x7C7B;&#x578B;&#xFF0C;&#x7528;&#x4E8E;&#x4E25;&#x683C;&#x63A7;&#x5236;&#x4E00;&#x4E9B;&#x6BD4;&#x7279;&#x5E01;&#x53EA;&#x80FD;&#x5728;&#x5C06;&#x6765;&#x67D0;&#x4E2A;&#x7279;&#x5B9A;&#x65F6;&#x95F4;&#x548C;&#x533A;&#x5757;&#x624D;&#x80FD;&#x88AB;&#x652F;&#x51FA;&#x3002;&#x65F6;&#x95F4;&#x9501;&#x5728;&#x5F88;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x5408;&#x7EA6;&#x4E2D;&#x8D77;&#x5230;&#x4E86;&#x663E;&#x8457;&#x7684;&#x4F5C;&#x7528;&#xFF0C;&#x5305;&#x62EC;&#x652F;&#x4ED8;&#x901A;&#x9053;&#x548C;&#x54C8;&#x5E0C;&#x65F6;&#x95F4;&#x9501;&#x5408;&#x7EA6;&#x3002;</p>
<p> <strong>&#x4EA4;&#x6613;:</strong></p>
<p>&#x200B;    &#x7B80;&#x5355;&#x5730;&#x8BF4;&#xFF0C;&#x4EA4;&#x6613;&#x6307;&#x628A;&#x6BD4;&#x7279;&#x5E01;&#x4ECE;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x8F6C;&#x5230;&#x53E6;&#x4E00;&#x4E2A;&#x5730;&#x5740;&#x3002;&#x66F4;&#x51C6;&#x786E;&#x5730;&#x8BF4;&#xFF0C;&#x4E00;&#x7B14;&#x201C;&#x4EA4;&#x6613;&#x201D;&#x6307;&#x4E00;&#x4E2A;&#x7ECF;&#x8FC7;&#x7B7E;&#x540D;&#x8FD0;&#x7B97;&#x7684;&#xFF0C;&#x8868;&#x8FBE;&#x4EF7;&#x503C;&#x8F6C;&#x79FB;&#x7684;&#x6570;&#x636E;&#x7ED3;&#x6784;&#x3002;&#x6BCF;&#x4E00;&#x7B14;&#x201C;&#x4EA4;&#x6613;&#x201D;&#x90FD;&#x7ECF;&#x8FC7;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x4F20;&#x8F93;&#xFF0C;&#x7531;&#x77FF;&#x5DE5;&#x8282;&#x70B9;&#x6536;&#x96C6;&#x5E76;&#x6253;&#x5305;&#x81F3;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x6C38;&#x4E45;&#x4FDD;&#x5B58;&#x5728;&#x533A;&#x5757;&#x94FE;&#x67D0;&#x5904;&#x3002;</p>
<p> <strong>&#x4EA4;&#x6613;&#x6C60;:</strong></p>
<p>&#x4E00;&#x4E2A;&#x65E0;&#x5E8F;&#x7684;&#x4EA4;&#x6613;&#x96C6;&#x5408;&#xFF0C;&#x8BE5;&#x96C6;&#x5408;&#x672A;&#x5728;&#x4E3B;&#x94FE;&#x7684;&#x533A;&#x5757;&#x4E2D;&#xFF0C;&#x4F46;&#x5176;&#x6709;&#x8F93;&#x5165;&#x4EA4;&#x6613;&#x3002;</p>
<p> <strong>&#x56FE;&#x7075;&#x5B8C;&#x5907;:</strong></p>
<p>&#x200B;     &#x5728;&#x7ED9;&#x5B9A;&#x8DB3;&#x591F;&#x65F6;&#x95F4;&#x4E0E;&#x5185;&#x5B58;&#x7684;&#x60C5;&#x51B5;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x4E00;&#x4E2A;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5F00;&#x53D1;&#x7684;&#x7A0B;&#x5E8F;&#x80FD;&#x8FD0;&#x884C;&#x5728;&#x56FE;&#x7075;&#x673A;&#x4E0A;&#xFF0C;&#x8BE5;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x5C31;&#x88AB;&#x79F0;&#x4E3A;&#x201C;&#x56FE;&#x7075;&#x5B8C;&#x5907;&#x201D;&#x7684;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;</p>
<p><strong>UTXO (&#x672A;&#x82B1;&#x8D39;&#x4EA4;&#x6613;&#x8F93;&#x51FA;):</strong></p>
<p>&#x200B;    UTXO&#x662F;&#x672A;&#x82B1;&#x8D39;&#x4EA4;&#x6613;&#x8F93;&#x51FA;&#xFF0C;UTXO&#x53EF;&#x4EE5;&#x4F5C;&#x4E3A;&#x65B0;&#x4EA4;&#x6613;&#x7684;&#x8F93;&#x5165;&#x3002; </p>
<p> <strong>&#x94B1;&#x5305;:</strong></p>
<p>&#x200B;    &#x94B1;&#x5305;&#x6307;&#x4FDD;&#x5B58;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x548C;&#x79C1;&#x94A5;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x53EF;&#x4EE5;&#x7528;&#x5B83;&#x6765;&#x63A5;&#x53D7;&#x3001;&#x53D1;&#x9001;&#x3001;&#x50A8;&#x5B58;&#x4F60;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x3002;</p>
<p> <strong>WIF (&#x94B1;&#x5305;&#x5BFC;&#x5165;&#x683C;&#x5F0F;):</strong></p>
<p>&#x200B;    &#x94B1;&#x5305;&#x5BFC;&#x5165;&#x683C;&#x5F0F;&#x662F;&#x4E00;&#x4E2A;&#x6570;&#x636E;&#x4EA4;&#x6362;&#x683C;&#x5F0F;&#xFF0C;&#x8BBE;&#x8BA1;&#x7528;&#x4E8E;&#x5141;&#x8BB8;&#x5BFC;&#x51FA;&#x548C;&#x5BFC;&#x5165;&#x5355;&#x4E2A;&#x79C1;&#x94A5;&#xFF0C;&#x8BE5;&#x79C1;&#x94A5;&#x901A;&#x8FC7;&#x6807;&#x5FD7;&#x6807;&#x660E;&#x662F;&#x5426;&#x4F7F;&#x7528;&#x538B;&#x7F29;&#x516C;&#x94A5;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="second_edition_changes.html" class="navigation navigation-prev " aria-label="Previous page: 第二版更新内容">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="ch01.html" class="navigation navigation-next " aria-label="Next page: 第一章介绍">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"词汇表","level":"1.6","depth":1,"next":{"title":"第一章介绍","level":"1.7","depth":1,"path":"ch01.md","ref":"ch01.md","articles":[]},"previous":{"title":"第二版更新内容","level":"1.5","depth":1,"path":"second_edition_changes.md","ref":"second_edition_changes.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"glossary.md","mtime":"2018-12-14T06:26:05.587Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

