
<!DOCTYPE HTML>
<html lang="" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>序言 · GitBook</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    
        
    
        
    
        
    
        
    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="second_edition_changes.html" />
    
    
    <link rel="prev" href="trans-preface.html" />
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="Type to search" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter " data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    Introduction
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="cn-preface.html">
            
                <a href="cn-preface.html">
            
                    
                    中文版序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="trans-preface.html">
            
                <a href="trans-preface.html">
            
                    
                    译者序
            
                </a>
            

            
        </li>
    
        <li class="chapter active" data-level="1.4" data-path="preface.html">
            
                <a href="preface.html">
            
                    
                    序言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="second_edition_changes.html">
            
                <a href="second_edition_changes.html">
            
                    
                    第二版更新内容
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.6" data-path="glossary.html">
            
                <a href="glossary.html">
            
                    
                    词汇表
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.7" data-path="ch01.html">
            
                <a href="ch01.html">
            
                    
                    第一章介绍
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.8" data-path="ch02.html">
            
                <a href="ch02.html">
            
                    
                    第二章比特币原理
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.9" data-path="ch03.html">
            
                <a href="ch03.html">
            
                    
                    第三章比特币核心
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.10" data-path="ch04.html">
            
                <a href="ch04.html">
            
                    
                    第四章密钥和地址
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.11" data-path="ch05.html">
            
                <a href="ch05.html">
            
                    
                    第五章钱包
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.12" data-path="ch06.html">
            
                <a href="ch06.html">
            
                    
                    第六章交易
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.13" data-path="ch07.html">
            
                <a href="ch07.html">
            
                    
                    第七章高级交易和脚本
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.14" data-path="ch08.html">
            
                <a href="ch08.html">
            
                    
                    第八章比特币网络
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.15" data-path="ch09.html">
            
                <a href="ch09.html">
            
                    
                    第九章区块链
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.16" data-path="ch10.html">
            
                <a href="ch10.html">
            
                    
                    第十章挖矿和共识
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.17" data-path="ch11.html">
            
                <a href="ch11.html">
            
                    
                    第十一章比特币安全
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.18" data-path="ch12.html">
            
                <a href="ch12.html">
            
                    
                    第十二章比特币应用
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.19" data-path="appdx-bips.html">
            
                <a href="appdx-bips.html">
            
                    
                    附录1：比特币改进提案（BIP）
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.20" data-path="appdx-bitcore.html">
            
                <a href="appdx-bitcore.html">
            
                    
                    附录2：Bitcore
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.21" data-path="appdx-bx.html">
            
                <a href="appdx-bx.html">
            
                    
                    附录3：Bitcoin Explorer（bx）命令
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.22" data-path="fappdx-pycoin.md">
            
                <span>
            
                    
                    附录4：pycoin库、实用密钥程序ku和交易程序tx
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.23" data-path="appdx-scriptops.html">
            
                <a href="appdx-scriptops.html">
            
                    
                    附录5 交易脚本的操作符、常量和符号
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.24" data-path="appdx-bitcoinwhitepaper.html">
            
                <a href="appdx-bitcoinwhitepaper.html">
            
                    
                    附录6 比特币白皮书
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.25" data-path="appdx-segwit.html">
            
                <a href="appdx-segwit.html">
            
                    
                    附录7 隔离见证
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.26" data-path="appdx-colored_coins.html">
            
                <a href="appdx-colored_coins.html">
            
                    
                    附录8 染色币
            
                </a>
            

            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            Published with GitBook
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >序言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <p><strong>&#x5173;&#x4E8E;&#x672C;&#x4E66;</strong></p>
<p> &#x6211;&#x7B2C;&#x4E00;&#x6B21;&#x5076;&#x9047;&#x6BD4;&#x7279;&#x5E01;&#x662F;&#x5728;2011&#x5E74;&#x5E74;&#x4E2D;&#xFF0C;&#x5F53;&#x65F6;&#x7684;&#x53CD;&#x5E94;&#x5927;&#x6982;&#x662F;&#x201C;&#x54C8;&#xFF01;&#x4E66;&#x5446;&#x5B50;&#x7684;&#x94B1;&#x561B;&#xFF01;&#x201D;&#x56E0;&#x4E3A;&#x6CA1;&#x80FD;&#x9886;&#x4F1A;&#x5B83;&#x7684;&#x91CD;&#x8981;&#x6027;&#xFF0C;&#x6211;&#x5FFD;&#x89C6;&#x5B83;&#x957F;&#x8FBE;&#x516D;&#x4E2A;&#x6708;&#x4E4B;&#x4E45;&#xFF0C;&#x800C;&#x8BA9;&#x6211;&#x7A0D;&#x611F;&#x5BBD;&#x6170;&#x7684;&#x662F;&#xFF0C;&#x8BB8;&#x591A;&#x6211;&#x8BA4;&#x8BC6;&#x7684;&#x4E00;&#x4E9B;&#x806A;&#x660E;&#x7EDD;&#x9876;&#x7684;&#x4EBA;&#x4E5F;&#x662F;&#x8FD9;&#x79CD;&#x53CD;&#x5E94;&#x3002;&#x5728;&#x4E00;&#x6B21;&#x90AE;&#x4EF6;&#x5217;&#x8868;&#x8BA8;&#x8BBA;&#x65F6;&#xFF0C;&#x6211;&#x518D;&#x6B21;&#x63A5;&#x89E6;&#x5230;&#x4E86;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x4E8E;&#x662F;&#x51B3;&#x5B9A;&#x9605;&#x8BFB;&#x4E2D;&#x672C;&#x806A;&#xFF08;Satoshi Nakamoto&#xFF09;&#x5199;&#x7684;&#x767D;&#x76AE;&#x4E66;&#xFF0C;&#x7814;&#x7A76;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6743;&#x5A01;&#x89E3;&#x91CA;&#xFF0C;&#x770B;&#x770B;&#x5230;&#x5E95;&#x662F;&#x600E;&#x4E48;&#x4E00;&#x56DE;&#x4E8B;&#x3002;&#x6211;&#x4ECD;&#x8BB0;&#x5F97;&#x521A;&#x521A;&#x8BFB;&#x5B8C;&#x90A3;&#x4E5D;&#x9875;&#x5185;&#x5BB9;&#x7684;&#x90A3;&#x4E00;&#x523B;&#xFF0C;&#x90A3;&#x65F6;&#x6211;&#x624D;&#x7EC8;&#x4E8E;&#x660E;&#x767D;&#x4E86;&#xFF1A;&#x6BD4;&#x7279;&#x5E01;&#x4E0D;&#x5355;&#x5355;&#x662F;&#x4E00;&#x79CD;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#xFF0C;&#x8FD8;&#x662F;&#x4E00;&#x79CD;&#x7ED9;&#x8D27;&#x5E01;&#x53CA;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x4E1C;&#x897F;&#x63D0;&#x4F9B;&#x57FA;&#x7840;&#x7684;&#x4FE1;&#x4EFB;&#x7F51;&#x7EDC;&#x3002;&#x5BF9;&#x201C;&#x4E0D;&#x662F;&#x8D27;&#x5E01;&#xFF0C;&#x800C;&#x662F;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x4FE1;&#x4EFB;&#x7F51;&#x7EDC;&#x201D;&#x7684;&#x9886;&#x609F;&#xFF0C;&#x8BA9;&#x6211;&#x5F00;&#x542F;&#x4E86;&#x4E3A;&#x671F;&#x56DB;&#x4E2A;&#x6708;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x6C89;&#x9189;&#x4E4B;&#x65C5;&#x3002;&#x6211;&#x5982;&#x9965;&#x4F3C;&#x6E34;&#x5730;&#x5BFB;&#x627E;&#x4EFB;&#x4F55;&#x5173;&#x4E8E;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x70B9;&#x6EF4;&#x4FE1;&#x606F;&#xFF0C;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x7740;&#x8FF7;&#xFF0C;&#x6BCF;&#x5929;&#x90FD;&#x82B1;&#x4E0A;12 &#x4E2A;&#x5C0F;&#x65F6;&#x4EE5;&#x4E0A;&#x7D27;&#x76EF;&#x5C4F;&#x5E55;&#xFF0C;&#x7AED;&#x5C3D;&#x6240;&#x80FD;&#x5730;&#x4E0D;&#x65AD;&#x9605;&#x8BFB;&#x3001;&#x5199;&#x4F5C;&#x3001;&#x5B66;&#x4E60;&#x548C;&#x7F16;&#x7A0B;&#x3002;&#x4ECE;&#x8FD9;&#x6BB5;&#x7740;&#x9B54;&#x7684;&#x72B6;&#x6001;&#x4E2D;&#x8D70;&#x51FA;&#x6765;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x6211;&#x7684;&#x4F53;&#x91CD;&#x7531;&#x4E8E;&#x524D;&#x671F;&#x6CA1;&#x6709;&#x89C4;&#x5F8B;&#x996E;&#x98DF;&#x8F7B;&#x4E86;20 &#x591A;&#x78C5;&#xFF0C;&#x540C;&#x65F6;&#x6211;&#x4E5F;&#x575A;&#x5B9A;&#x4E86;&#x8981;&#x5168;&#x5FC3;&#x6295;&#x5165;&#x6BD4;&#x7279;&#x5E01;&#x4E8B;&#x4E1A;&#x7684;&#x51B3;&#x5FC3;&#x3002;</p>
<p> &#x968F;&#x540E;&#x7684;&#x4E24;&#x5E74;&#xFF0C;&#x6211;&#x521B;&#x7ACB;&#x4E86;&#x4E00;&#x7CFB;&#x5217;&#x5F00;&#x53D1;&#x6BD4;&#x7279;&#x5E01;&#x76F8;&#x5173;&#x670D;&#x52A1;&#x548C;&#x4EA7;&#x54C1;&#x7684;&#x516C;&#x53F8;&#xFF0C;&#x4E4B;&#x540E;&#x6211;&#x51B3;&#x5B9A;&#x5199;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x4E66;&#x7684;&#x4E3B;&#x9898;&#x5C31;&#x662F;&#x6FC0;&#x53D1;&#x4E86;&#x6211;&#x75AF;&#x72C2;&#x7684;&#x521B;&#x9020;&#x529B;&#x5E76;&#x8BA9;&#x6211;&#x51A5;&#x601D;&#x82E6;&#x60F3;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;&#x5B83;&#x662F;&#x6211;&#x5728;&#x7EE7;&#x4E92;&#x8054;&#x7F51;&#x4E4B;&#x540E;&#x9047;&#x5230;&#x7684;&#x6700;&#x4E3A;&#x632F;&#x594B;&#x4EBA;&#x5FC3;&#x7684;&#x6280;&#x672F;&#x3002;&#x73B0;&#x5728;&#x662F;&#x65F6;&#x5019;&#x8DDF;&#x66F4;&#x5E7F;&#x5927;&#x7684;&#x8BFB;&#x8005;&#x5206;&#x4EAB;&#x6211;&#x5BF9;&#x8FD9;&#x9879;&#x60CA;&#x4EBA;&#x6280;&#x672F;&#x7684;&#x70ED;&#x60C5;&#x4E86;&#x3002;</p>
<p><strong>&#x9605;&#x8BFB;&#x5BF9;&#x8C61;</strong></p>
<p>&#x672C;&#x4E66;&#x4E3B;&#x8981;&#x9762;&#x5411;&#x7A0B;&#x5E8F;&#x5458;&#x3002;&#x5982;&#x679C;&#x4F60;&#x80FD;&#x4F7F;&#x7528;&#x4E00;&#x95E8;&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#xFF0C;&#x672C;&#x4E66;&#x5C06;&#x4F1A;&#x544A;&#x8BC9;&#x4F60;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x7684;&#x539F;&#x7406;&#x3001;&#x4F7F;&#x7528;&#x65B9;&#x6CD5;&#xFF0C;&#x4EE5;&#x53CA;&#x5982;&#x4F55;&#x5F00;&#x53D1;&#x4E0E;&#x4E4B;&#x76F8;&#x5173;&#x7684;&#x8F6F;&#x4EF6;&#x3002;&#x5BF9;&#x5E0C;&#x671B;&#x7406;&#x89E3;&#x6BD4;&#x7279;&#x5E01;&#x53CA;&#x52A0;&#x5BC6;&#x8D27;&#x5E01;&#x5185;&#x5728;&#x5DE5;&#x4F5C;&#x673A;&#x5236;&#x7684;&#x975E;&#x7A0B;&#x5E8F;&#x5458;&#x8BFB;&#x8005;&#x4EEC;&#xFF0C;&#x672C;&#x4E66;&#x524D;&#x51E0;&#x7AE0;&#x4F5C;&#x4E3A;&#x5BF9;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6DF1;&#x5165;&#x4ECB;&#x7ECD;&#x4F9D;&#x7136;&#x9002;&#x7528;&#x3002;</p>
<p><strong>&#x5C01;&#x9762;&#x6545;&#x4E8B;</strong></p>
<p> &#x5728;&#x7FA4;&#x5C45;&#x751F;&#x7269;&#x7269;&#x79CD;&#x4E2D;&#xFF0C;&#x5207;&#x53F6;&#x8681;&#x8868;&#x73B0;&#x51FA;&#x4E86;&#x9AD8;&#x5EA6;&#x590D;&#x6742;&#x884C;&#x4E3A;&#x7684;&#x7269;&#x79CD;&#x7279;&#x5F81;&#x3002;&#x4F46;&#x662F;&#xFF0C;&#x7FA4;&#x843D;&#x4E2D;&#x7684;&#x6BCF;&#x4E00;&#x53EA;&#x8682;&#x8681;&#x4E2A;&#x4F53;&#x4EC5;&#x4EC5;&#x9075;&#x5FAA;&#x4E00;&#x4E9B;&#x793E;&#x4F1A;&#x4E92;&#x52A8;&#x548C;&#x5316;&#x5B66;&#x6C14;&#x5473;&#xFF08;&#x5373;&#x4FE1;&#x606F;&#x7D20;&#xFF09;&#x4EA4;&#x6362;&#x7684;&#x7B80;&#x5355;&#x89C4;&#x5219;&#x3002;&#x7EF4;&#x57FA;&#x767E;&#x79D1;&#x63D0;&#x5230;&#xFF1A;&#x201C;&#x5207;&#x53F6;&#x8681;&#x5F62;&#x6210;&#x5730;&#x7403;&#x4E0A;&#x4EC5;&#x6B21;&#x4E8E;&#x4EBA;&#x7C7B;&#x7684;&#x6700;&#x4E3A;&#x5E9E;&#x5927;&#x4E14;&#x590D;&#x6742;&#x7684;&#x52A8;&#x7269;&#x793E;&#x4F1A;&#x3002;&#x201D;&#x5B9E;&#x9645;&#x4E0A;&#xFF0C;&#x5207;&#x53F6;&#x8681;&#x4E0D;&#x5403;&#x53F6;&#x5B50;&#xFF0C;&#x800C;&#x662F;&#x4F7F;&#x7528;&#x53F6;&#x5B50;&#x5236;&#x9020;&#x4E00;&#x79CD;&#x771F;&#x83CC;&#x6765;&#x5145;&#x5F53;&#x8681;&#x7FA4;&#x4E3B;&#x8981;&#x98DF;&#x7269;&#x6765;&#x6E90;&#x3002;&#x610F;&#x8BC6;&#x5230;&#x4E86;&#x5417;&#xFF1F;&#x5B83;&#x4EEC;&#x5728;&#x8015;&#x4F5C;&#xFF01;</p>
<p> &#x867D;&#x7136;&#x5207;&#x53F6;&#x8681;&#x5F62;&#x6210;&#x7684;&#x662F;&#x9636;&#x7EA7;&#x793E;&#x4F1A;&#xFF0C;&#x4E14;&#x4F9D;&#x9760;&#x8681;&#x540E;&#x7E41;&#x884D;&#x540E;&#x4EE3;&#xFF0C;&#x4F46;&#x662F;&#x5728;&#x8681;&#x7FA4;&#x4E2D;&#x4E0D;&#x5B58;&#x5728;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x4F53;&#x5236;&#x6216;&#x9886;&#x5BFC;&#x4EBA;&#x3002;&#x901A;&#x8FC7;&#x5207;&#x53F6;&#x8681;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#xFF0C;&#x7FA4;&#x843D;&#x4E2D;&#x6570;&#x767E;&#x4E07;&#x6210;&#x5458;&#x6240;&#x5C55;&#x73B0;&#x7684;&#x9AD8;&#x5EA6;&#x667A;&#x80FD;&#x4E14;&#x590D;&#x6742;&#x7684;&#x884C;&#x4E3A;&#x662F;&#x793E;&#x4F1A;&#x7F51;&#x7EDC;&#x4E2D;&#x7684;&#x4E2A;&#x4F53;&#x4E92;&#x52A8;&#x8FD9;&#x4E00;&#x6027;&#x8D28;&#x7684;&#x51F8;&#x663E;&#x3002;</p>
<p> &#x5927;&#x81EA;&#x7136;&#x5411;&#x6211;&#x4EEC;&#x8BC1;&#x660E;&#xFF0C;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x4F53;&#x5236;&#x5177;&#x6709;&#x5F39;&#x6027;&#x5E76;&#x80FD;&#x521B;&#x9020;&#x51FA;&#x610F;&#x60F3;&#x4E0D;&#x5230;&#x7684;&#x590D;&#x6742;&#x6027;&#x548C;&#x96BE;&#x4EE5;&#x60F3;&#x8C61;&#x7684;&#x7CBE;&#x5999;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4E2D;&#x592E;&#x96C6;&#x6743;&#x4F53;&#x5236;&#x3001;&#x7B49;&#x7EA7;&#x5236;&#x5EA6;&#x6216;&#x590D;&#x6742;&#x7684;&#x7EC4;&#x7EC7;&#x7ED3;&#x6784;&#x3002;</p>
<p>&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x6B63;&#x662F;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x9AD8;&#x5EA6;&#x590D;&#x6742;&#x7684;&#x53BB;&#x4E2D;&#x5FC3;&#x5316;&#x7684;&#x53EF;&#x4FE1;&#x7F51;&#x7EDC;&#xFF0C;&#x80FD;&#x591F;&#x652F;&#x6491;&#x65E0;&#x6570;&#x8D22;&#x52A1;&#x6D41;&#x7A0B;&#x3002;&#x7136;&#x800C;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7F51;&#x7EDC;&#x7684;&#x6BCF;&#x4E00;&#x4E2A;&#x8282;&#x70B9;&#x90FD;&#x9075;&#x5FAA;&#x7740;&#x4E00;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x6570;&#x5B66;&#x51C6;&#x5219;&#x3002;&#x8282;&#x70B9;&#x95F4;&#x7684;&#x76F8;&#x4E92;&#x4F5C;&#x7528;&#x4FC3;&#x6210;&#x4E86;&#x7EC4;&#x7EC7;&#x7684;&#x590D;&#x6742;&#x884C;&#x4E3A;&#xFF0C;&#x800C;&#x5E76;&#x4E0D;&#x662F;&#x4EFB;&#x4F55;&#x67D0;&#x4E2A;&#x5355;&#x4E00;&#x8282;&#x70B9;&#x81EA;&#x8EAB;&#x5177;&#x6709;&#x590D;&#x6742;&#x6027;&#x548C;&#x53EF;&#x4FE1;&#x6027;&#x3002;&#x5C31;&#x50CF;&#x8681;&#x7FA4;&#x4E00;&#x6837;&#xFF0C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#x662F;&#x4E00;&#x4E2A;&#x7531;&#x4F17;&#x591A;&#x9075;&#x5FAA;&#x7B80;&#x5355;&#x51C6;&#x5219;&#x7684;&#x7B80;&#x5355;&#x8282;&#x70B9;&#x6240;&#x7EC4;&#x6210;&#x7684;&#x5F39;&#x6027;&#x7F51;&#x7EDC;&#xFF0C;&#x8FD9;&#x4E9B;&#x7B80;&#x5355;&#x7684;&#x8282;&#x70B9;&#x51C6;&#x5219;&#x805A;&#x5408;&#x5728;&#x4E00;&#x8D77;&#x53EF;&#x4EE5;&#x5B8C;&#x6210;&#x60CA;&#x4EBA;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x800C;&#x4E0D;&#x9700;&#x8981;&#x4EFB;&#x4F55;&#x4E2D;&#x67A2;&#x534F;&#x8C03;&#x3002;</p>
<p> <strong>&#x672C;&#x4E66;&#x60EF;&#x4F8B;</strong></p>
<p> &#x672C;&#x4E66;&#x91C7;&#x7528;&#x4EE5;&#x4E0B;&#x6392;&#x7248;&#x4E0A;&#x7684;&#x7EA6;&#x5B9A;:</p>
<p>&#x659C;&#x4F53;:&#x6307;&#x793A;&#x65B0;&#x7684;&#x672F;&#x8BED;&#x3001;URL&#x94FE;&#x63A5;&#x3001;email&#x5730;&#x5740;&#x3001;&#x6587;&#x4EF6;&#x540D;&#x548C;&#x6587;&#x4EF6;&#x6269;&#x5C55;&#x540D;</p>
<p>&#x7B49;&#x5BBD;&#x5B57;:&#x7528;&#x4E8E;&#x7A0B;&#x5E8F;&#x6E05;&#x5355;&#x7684;&#x663E;&#x793A;&#xFF0C;&#x4E5F;&#x7528;&#x4E8E;&#x6BB5;&#x843D;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x7A0B;&#x5E8F;&#x8981;&#x7D20;&#xFF0C;&#x5982;&#x53D8;&#x91CF;&#x6216;&#x51FD;&#x6570;&#x540D;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x6570;&#x636E;&#x7C7B;&#x578B;&#x3001;&#x73AF;&#x5883;&#x53D8;&#x91CF;&#x3001;&#x8BED;&#x53E5;&#x548C;&#x5173;&#x952E;&#x5B57;&#x3002;</p>
<p> &#x7B49;&#x5BBD;&#x7C97;&#x4F53;:&#x663E;&#x793A;&#x9700;&#x8981;&#x7531;&#x7528;&#x6237;&#x8F93;&#x5165;&#x7684;&#x547D;&#x4EE4;&#x548C;&#x5176;&#x4ED6;&#x6587;&#x5B57;&#x3002;</p>
<p> &#x7B49;&#x5BBD;&#x659C;&#x4F53;:&#x663E;&#x793A;&#x9700;&#x8981;&#x7531;&#x7528;&#x6237;&#x63D0;&#x4F9B;&#x7684;&#x6216;&#x6839;&#x636E;&#x4E0A;&#x4E0B;&#x6587;&#x73AF;&#x5883;&#x4FEE;&#x6539;&#x7684;&#x503C;&#x3002;</p>
<p>[TIP]&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#x8868;&#x793A;&#x63D0;&#x793A;&#x6216;&#x5EFA;&#x8BAE;&#x3002;</p>
<p> [NOTE]&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#x8868;&#x793A;&#x901A;&#x7528;&#x6CE8;&#x91CA;&#x3002;</p>
<p> [WARNING]&#x8FD9;&#x4E2A;&#x6807;&#x5FD7;&#x8868;&#x793A;&#x8B66;&#x544A;&#x6216;&#x63D0;&#x9192;&#x3002;</p>
<p> <strong>&#x4EE3;&#x7801;&#x793A;&#x4F8B;</strong></p>
<p>&#x672C;&#x4E66;&#x793A;&#x4F8B;&#x662F;&#x57FA;&#x4E8E;&#x7C7B;Unix &#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#xFF08;&#x4F8B;&#x5982;Linux &#x6216;Mac OS X&#xFF09;&#x7684;&#x547D;&#x4EE4;&#x884C;&#xFF0C;&#x7528;Python&#xFF0C;C++&#x7F16;&#x7A0B;&#x8BED;&#x8A00;&#x6765;&#x8BF4;&#x660E;&#x7684;&#x3002;&#x5168;&#x90E8;&#x4EE3;&#x7801;&#x6BB5;&#x5747;&#x53EF;&#x5728;Github &#x4E3B;&#x4EE3;&#x7801;&#x5E93;&#x4E2D;&#x7684;code &#x5B50;&#x76EE;&#x5F55;&#x83B7;&#x5F97;&#x3002;&#x8BFB;&#x8005;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;GitHub &#x521B;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x4EE3;&#x7801;&#x5206;&#x652F;&#xFF0C;&#x5C1D;&#x8BD5;&#x4E66;&#x4E2D;&#x793A;&#x4F8B;&#xFF0C;&#x6216;&#x8005;&#x63D0;&#x4EA4;&#x4EE3;&#x7801;&#x66F4;&#x6B63;&#x3002;</p>
<p> &#x6240;&#x6709;&#x4EE3;&#x7801;&#x6BB5;&#x5728;&#x5927;&#x591A;&#x6570;&#x64CD;&#x4F5C;&#x7CFB;&#x7EDF;&#x4E0A;&#x90FD;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x6700;&#x5C0F;&#x5316;&#x5B89;&#x88C5;&#x5BF9;&#x5E94;&#x8BED;&#x8A00;&#x7684;&#x7F16;&#x8BD1;&#x5668;&#x548C;&#x89E3;&#x91CA;&#x5668;&#x6765;&#x91CD;&#x73B0;&#x3002;&#x5728;&#x5FC5;&#x8981;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x672C;&#x4E66;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x57FA;&#x672C;&#x7684;&#x5B89;&#x88C5;&#x6307;&#x4EE4;&#x4EE5;&#x53CA;&#x6BCF;&#x6B65;&#x6307;&#x4EE4;&#x8F93;&#x51FA;&#x7684;&#x7ED3;&#x679C;&#x3002;</p>
<p> &#x4E3A;&#x4E86;&#x4FBF;&#x4E8E;&#x6253;&#x5370;&#xFF0C;&#x672C;&#x4E66;&#x91CD;&#x65B0;&#x683C;&#x5F0F;&#x5316;&#x4E86;&#x90E8;&#x5206;&#x4EE3;&#x7801;&#x6BB5;&#x548C;&#x4EE3;&#x7801;&#x8F93;&#x51FA;&#x3002;&#x5728;&#x6240;&#x6709;&#x6B64;&#x7C7B;&#x4F8B;&#x5B50;&#x4E2D;&#xFF0C;&#x6BCF;&#x884C;&#x4EE3;&#x7801;&#x4EE5;&#x53CD;&#x659C;&#x6760;&#xFF08;\&#xFF09;&#x5B57;&#x7B26;&#x548C;&#x6362;&#x884C;&#x7B26;&#x5206;&#x5F00;&#x3002;&#x5F53;&#x4F60;&#x9700;&#x8981;&#x5C1D;&#x8BD5;&#x8FD9;&#x4E9B;&#x793A;&#x4F8B;&#x65F6;&#xFF0C;&#x8BF7;&#x5220;&#x9664;&#x8FD9;&#x4E24;&#x4E2A;&#x5B57;&#x7B26;&#xFF0C;&#x628A;&#x88AB;&#x5206;&#x9694;&#x7684;&#x4E24;&#x884C;&#x91CD;&#x8FDE;&#x8D77;&#x6765;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x770B;&#x5230;&#x4E0E;&#x4F8B;&#x5B50;&#x4E2D;&#x4E00;&#x81F4;&#x7684;&#x7ED3;&#x679C;&#x4E86;&#x3002;</p>
<p> &#x672C;&#x4E66;&#x6240;&#x6709;&#x4EE3;&#x7801;&#x6BB5;&#x5C3D;&#x53EF;&#x80FD;&#x5730;&#x91C7;&#x7528;&#x5B9E;&#x503C;&#x8BA1;&#x7B97;&#xFF0C;&#x56E0;&#x6B64;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x91CD;&#x590D;&#x6784;&#x5EFA;&#x672C;&#x4E66;&#x63D0;&#x4F9B;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#xFF0C;&#x7528;&#x4F60;&#x81EA;&#x5DF1;&#x5199;&#x7684;&#x4EE3;&#x7801;&#x8BA1;&#x7B97;&#x51FA;&#x76F8;&#x540C;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8B6C;&#x5982;&#xFF0C;&#x4E66;&#x4E2D;&#x51FA;&#x73B0;&#x7684;&#x79C1;&#x94A5;&#x548C;&#x5BF9;&#x5E94;&#x7684;&#x516C;&#x94A5;&#x53CA;&#x5730;&#x5740;&#x4E5F;&#x90FD;&#x662F;&#x771F;&#x5B9E;&#x5B58;&#x5728;&#x7684;&#x3002;&#x793A;&#x4F8B;&#x4E2D;&#x7684;&#x6240;&#x6709;&#x4EA4;&#x6613;&#x3001;&#x533A;&#x5757;&#x548C;&#x533A;&#x5757;&#x94FE;&#x5747;&#x88AB;&#x8BB0;&#x5F55;&#x5728;&#x5B9E;&#x9645;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#xFF0C;&#x662F;&#x516C;&#x5171;&#x8D26;&#x76EE;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x800C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x6BD4;&#x7279;&#x5E01;&#x7CFB;&#x7EDF;&#x4E2D;&#x68C0;&#x67E5;&#x5B83;&#x4EEC;&#x3002;</p>
<p> <strong>&#x4F7F;&#x7528;&#x4EE3;&#x7801;&#x793A;&#x4F8B;</strong></p>
<p> &#x672C;&#x4E66;&#x7684;&#x76EE;&#x7684;&#x662F;&#x5E2E;&#x52A9;&#x4F60;&#x5B8C;&#x6210;&#x5DE5;&#x4F5C;&#x3002;&#x603B;&#x7684;&#x6765;&#x8BF4;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x4F60;&#x7684;&#x7A0B;&#x5E8F;&#x548C;&#x6587;&#x6863;&#x4E2D;&#x4F7F;&#x7528;&#x672C;&#x4E66;&#x7684;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x3002;&#x9664;&#x975E;&#x4F60;&#x8981;&#x590D;&#x5236;&#x4EE3;&#x7801;&#x7684;&#x5173;&#x952E;&#x90E8;&#x5206;&#xFF0C;&#x5426;&#x5219;&#x4E0D;&#x9700;&#x8981;&#x8054;&#x7CFB;&#x6211;&#x4EEC;&#x83B7;&#x5F97;&#x8BB8;&#x53EF;&#x3002;&#x4F8B;&#x5982;&#xFF0C;&#x4F7F;&#x7528;&#x7A0B;&#x5E8F;&#x4E2D;&#x7684;&#x51E0;&#x6BB5;&#x4EE3;&#x7801;&#xFF0C;&#x6216;&#x8005;&#x5F15;&#x7528;&#x672C;&#x4E66;&#x53CA;&#x4EE3;&#x7801;&#x6765;&#x56DE;&#x7B54;&#x95EE;&#x9898;&#x662F;&#x4E0D;&#x9700;&#x8981;&#x83B7;&#x51C6;&#x7684;&#xFF1B;&#x800C;&#x552E;&#x5356;&#x6216;&#x5206;&#x53D1;&#x5305;&#x542B;O&apos;Reilly&#x4E66;&#x4E2D;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x7684;&#x5149;&#x76D8;&#xFF0C;&#x6216;&#x8005;&#x5C06;&#x5927;&#x91CF;&#x4E66;&#x4E2D;&#x4EE3;&#x7801;&#x5408;&#x5E76;&#x4E8E;&#x4F60;&#x7684;&#x4EA7;&#x54C1;&#x6216;&#x6587;&#x6863;&#x5219;&#x5FC5;&#x987B;&#x83B7;&#x5F97;&#x6211;&#x4EEC;&#x7684;&#x8BB8;&#x53EF;&#x3002;</p>
<p> &#x6211;&#x4EEC;&#x9F13;&#x52B1;&#x3001;&#x4F46;&#x4E0D;&#x5F3A;&#x5236;&#x8981;&#x6C42;&#x60A8;&#x5728;&#x5F15;&#x7528;&#x672C;&#x4E66;&#x65F6;&#x8868;&#x660E;&#x51FA;&#x5904;&#x3002;&#x4E66;&#x76EE;&#x5F15;&#x7528;&#x683C;&#x5F0F;&#x901A;&#x5E38;&#x5305;&#x62EC;&#x4E66;&#x540D;&#x3001;&#x4F5C;&#x8005;&#x3001;&#x51FA;&#x7248;&#x5546;&#x3001;ISBN&#x3002;&#x4F8B;&#x5982;:&#x201C;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#xFF0C;Andreas&#x2022;M&#x2022;Antonopoulos(O&apos;Reilly)&#x3002;&#x7248;&#x6743;2017 Andreas&#x2022;M&#x2022;Antonopoulos, 978-1-491-95438-6.&#x201D;</p>
<p> &#x672C;&#x4E66;&#x67D0;&#x4E9B;&#x7248;&#x672C;&#x63D0;&#x4F9B;&#x4E86;&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#xFF0C;&#x5982;CC-BY-NC&#xFF0C;&#x8FD9;&#x79CD;&#x60C5;&#x51B5;&#x4E0B;,&#x5F00;&#x6E90;&#x8BB8;&#x53EF;&#x6761;&#x6B3E;&#x9002;&#x7528;&#x3002;&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x4F60;&#x5BF9;&#x672C;&#x4E66;&#x4EE3;&#x7801;&#x793A;&#x4F8B;&#x7684;&#x4F7F;&#x7528;&#x8D85;&#x51FA;&#x4E86;&#x5408;&#x7406;&#x8303;&#x56F4;&#x6216;&#x4E0A;&#x8FF0;&#x8BB8;&#x53EF;&#xFF0C;&#x8BF7;&#x968F;&#x65F6;&#x4E0E;&#x6211;&#x4EEC;&#x8054;&#x7CFB;:permissions@oreilly.com&#x3002;</p>
<p><strong>&#x4E66;&#x4E2D;&#x6D89;&#x53CA;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x4E0E;&#x4EA4;&#x6613;</strong></p>
<p>&#x4E66;&#x4E2D;&#x7684;&#x6BD4;&#x7279;&#x5E01;&#x5730;&#x5740;&#x3001;&#x4EA4;&#x6613;&#x3001;&#x5BC6;&#x94A5;&#x3001;&#x4E8C;&#x7EF4;&#x7801;&#x3001;&#x533A;&#x5757;&#x94FE;&#x6570;&#x636E;&#x5927;&#x90E8;&#x5206;&#x90FD;&#x662F;&#x771F;&#x5B9E;&#x7684;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x811A;&#x672C;&#x6216;&#x7A0B;&#x5E8F;&#x7B49;&#x65B9;&#x5F0F;&#x5728;&#x6BD4;&#x7279;&#x5E01;&#x533A;&#x5757;&#x94FE;&#x4E2D;&#x67E5;&#x770B;&#x793A;&#x4F8B;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x4EA4;&#x6613;&#x3002;</p>
<p> &#x7136;&#x800C;&#xFF0C;&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;&#x521B;&#x5EFA;&#x5730;&#x5740;&#x7684;&#x8FD9;&#x4E9B;&#x79C1;&#x94A5;&#x8981;&#x4E48;&#x5199;&#x5165;&#x4E66;&#x4E2D;&#xFF0C;&#x8981;&#x4E48;&#x5DF2;&#x7ECF;&#x88AB;&#x201C;&#x711A;&#x6BC1;&#x201D;&#x3002;&#x8FD9;&#x5C31;&#x610F;&#x5473;&#x7740;&#x5982;&#x679C;&#x4F60;&#x5F80;&#x8FD9;&#x4E9B;&#x5730;&#x5740;&#x4E2D;&#x8F6C;&#x5165;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x8BDD;&#xFF0C;&#x8FD9;&#x4E9B;&#x6BD4;&#x7279;&#x5E01;&#x8981;&#x4E48;&#x6C38;&#x8FDC;&#x4E22;&#x5931;&#xFF0C;&#x8981;&#x4E48;&#x88AB;&#x672C;&#x4E66;&#x7684;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x901A;&#x8FC7;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x79C1;&#x94A5;&#x62FF;&#x8D70;&#x3002;</p>
<p>[&#x8B66;&#x544A;]</p>
<p>&#x4E0D;&#x8981;&#x7ED9;&#x4E66;&#x4E2D;&#x7ED9;&#x51FA;&#x7684;&#x4EFB;&#x4F55;&#x5730;&#x5740;&#x8F6C;&#x6BD4;&#x7279;&#x5E01;&#x3002;&#x5426;&#x5219;&#x4F60;&#x7684;&#x94B1;&#x5C06;&#x6C38;&#x8FDC;&#x6D88;&#x5931;&#x6216;&#x88AB;&#x672C;&#x4E66;&#x5176;&#x4ED6;&#x8BFB;&#x8005;&#x62FF;&#x8D70;&#x3002;</p>
<p> O&apos;Reilly Safari(&#x6B63;&#x5F0F;&#x540D;&#x79F0;&#x4E3A;Safari&#x5728;&#x7EBF;&#x4E66;&#x5E97;) &#x662F;&#x4E00;&#x4E2A;&#x4E3A;&#x4F01;&#x4E1A;&#x3001;&#x653F;&#x5E9C;&#x3001;&#x6559;&#x80B2;&#x5BB6;&#x4EE5;&#x53CA;&#x4E2A;&#x4EBA;&#x63D0;&#x4F9B;&#x4F1A;&#x5458;&#x5236;&#x7684;&#x57F9;&#x8BAD;&#x4E0E;&#x53C2;&#x8003;&#x7684;&#x5E73;&#x53F0;&#x3002;</p>
<p>&#x4F1A;&#x5458;&#x53EF;&#x4EE5;&#x5728;&#x8BE5;&#x5E73;&#x53F0;&#x83B7;&#x53D6;&#x6765;&#x81EA;&#x8D85;&#x8FC7;250&#x5BB6;&#x51FA;&#x7248;&#x793E;&#x63D0;&#x4F9B;&#x7684;&#x6210;&#x5343;&#x4E0A;&#x4E07;&#x7684;&#x4E66;&#x7C4D;&#x3001;&#x57F9;&#x8BAD;&#x89C6;&#x9891;&#x3001;&#x5B66;&#x4E60;&#x8DEF;&#x5F84;&#x3001;&#x4EA4;&#x4E92;&#x6559;&#x7A0B;&#x3001;&#x7B56;&#x5212;&#x64AD;&#x653E;&#x5217;&#x8868;&#xFF0C;&#x8FD9;&#x4E9B;&#x516C;&#x53F8;&#x5305;&#x62EC;&#xFF1A;Prentice Hall Professional, Addison-Wesley Professional, MicrosoftPress, Sams, Que, Peachpit Press, Adobe, Focal Press, Cisco Press, John Wiley&amp; Sons, Syngress, Morgan Kaufmann, IBM Redbooks, Packt, Adobe Press, FTPress, Apress, Manning, New Riders, McGraw-Hill, Jones &amp; Bartlett&#x4EE5;&#x53CA;CourseTechnology&#xFF0C;&#x9664;&#x6B64;&#x4E4B;&#x5916;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x3002;</p>
<p> &#x8981;&#x83B7;&#x53D6;&#x66F4;&#x591A;&#x4FE1;&#x606F;&#xFF0C;&#x8BF7;&#x8BBF;&#x95EE;:<a href="http://oreilly.com/safari" target="_blank">http://oreilly.com/safari</a></p>
<p> &#x8981;&#x60F3;&#x66F4;&#x591A;&#x4E86;&#x89E3;&#x6211;&#x4EEC;&#x4E66;&#x7C4D;&#x3001;&#x8BFE;&#x7A0B;&#x3001;&#x4F1A;&#x8BAE;&#x548C;&#x65B0;&#x95FB;&#x7684;&#x4FE1;&#x606F;&#xFF0C;&#x53EF;&#x4EE5;&#x767B;&#x5F55;&#x6211;&#x4EEC;&#x7684;&#x5B98;&#x7F51;:<a href="http://www.oreilly.com" target="_blank">http://www.oreilly.com</a></p>
<p>&#x6211;&#x4EEC;Facebook&#x8D26;&#x53F7;: <a href="http://facebook.com/oreilly" target="_blank">http://facebook.com/oreilly</a></p>
<p>&#x5173;&#x6CE8;&#x6211;&#x4EEC;&#x7684;Twitter&#x8D26;&#x53F7;:  <a href="http://twitter.com/oreillymedia" target="_blank">http://twitter.com/oreillymedia</a></p>
<p>&#x6211;&#x4EEC;&#x5728;YouTube&#x4E0A;&#x7684;&#x89C6;&#x9891;&#x1F517;<a href="http://www.youtube.com/oreillymedia" target="_blank">http://www.youtube.com/oreillymedia</a></p>
<p>&#x8054;&#x7CFB;&#x4F5C;&#x8005;</p>
<p>&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x6211;&#x7684;&#x4E2A;&#x4EBA;&#x7F51;&#x7AD9;&#x8054;&#x7CFB;&#x6211;&#xFF08;Andreas M. Antonopoulos&#xFF09;:</p>
<p><a href="https://antonopoulos.com/" target="_blank">https://antonopoulos.com/</a></p>
<p>&#x300A;&#x7CBE;&#x901A;&#x6BD4;&#x7279;&#x5E01;&#x300B;&#x7684;&#x4FE1;&#x606F;&#x4EE5;&#x53CA;&#x5F00;&#x653E;&#x7248;&#x672C;&#x4E0E;&#x7FFB;&#x8BD1;&#x7684;&#x4FE1;&#x606F;&#x53EF;&#x4EE5;&#x5728;&#x6B64;&#x7F51;&#x5740;&#x83B7;&#x53D6;:</p>
<p><a href="https://bitcoinbook.info/" target="_blank">https://bitcoinbook.info/</a></p>
<p>&#x8BF7;&#x5173;&#x6CE8;&#x6211;Facebook&#x8D26;&#x53F7;:</p>
<p><a href="https://facebook.com/AndreasMAntonopoulos" target="_blank">https://facebook.com/AndreasMAntonopoulos</a></p>
<p>&#x8BF7;&#x5173;&#x6CE8;&#x6211;Twitter&#x8D26;&#x53F7;:</p>
<p><a href="https://twitter.com/aantonop" target="_blank">https://twitter.com/aantonop</a></p>
<p>&#x8BF7;&#x5173;&#x6CE8;&#x6211;&#x9886;&#x82F1;&#x8D26;&#x53F7;:</p>
<p><a href="https://linkedin.com/company/aantonop" target="_blank">https://linkedin.com/company/aantonop</a></p>
<p>&#x7279;&#x522B;&#x611F;&#x8C22;&#x6240;&#x6709;&#x7684;&#x8D5E;&#x52A9;&#x4EBA;&#xFF0C;&#x662F;&#x4ED6;&#x4EEC;&#x652F;&#x6301;&#x6211;&#x4E86;&#x6570;&#x6708;&#x7684;&#x5DE5;&#x4F5C;&#x3002;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x6211;&#x7684;&#x8D5E;&#x52A9;&#x4EBA;&#x7F51;&#x7AD9;&#xFF1A;</p>
<p><a href="https://patreon.com/aantonop" target="_blank">https://patreon.com/aantonop</a></p>
<p> <strong>&#x9E23;&#x8C22;</strong></p>
<p>&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x51FA;&#x7248;&#x6D53;&#x7F29;&#x4E86;&#x5F88;&#x591A;&#x4EBA;&#x7684;&#x52AA;&#x529B;&#x4E0E;&#x4ED8;&#x51FA;&#x3002;&#x5728;&#x5199;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5F88;&#x611F;&#x6FC0;&#x6765;&#x81EA;&#x4ECE;&#x670B;&#x53CB;&#x3001;&#x540C;&#x4E8B;&#x3001;&#x751A;&#x81F3;&#x964C;&#x751F;&#x4EBA;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x662F;&#x4ED6;&#x4EEC;&#x7684;&#x52A0;&#x5165;&#x4E0E;&#x52AA;&#x529B;&#x5E2E;&#x52A9;&#x6211;&#x5B8C;&#x6210;&#x4E86;&#x8FD9;&#x672C;&#x5173;&#x4E8E;&#x6570;&#x5B57;&#x8D27;&#x5E01;&#x548C;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x7EAF;&#x6280;&#x672F;&#x7C7B;&#x4E66;&#x7C4D;&#x3002;</p>
<p>&#x6211;&#x4EEC;&#x4E0D;&#x53EF;&#x80FD;&#x5C06;&#x6BD4;&#x7279;&#x5E01;&#x6280;&#x672F;&#x4E0E;&#x6BD4;&#x7279;&#x5E01;&#x793E;&#x533A;&#x533A;&#x5206;&#x5F00;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x672C;&#x4E66;&#x4E0D;&#x4EC5;&#x662F;&#x793E;&#x533A;&#x7684;&#x4EA7;&#x54C1;&#xFF0C;&#x4E5F;&#x662F;&#x6BD4;&#x7279;&#x5E01;&#x6280;&#x672F;&#x3002;&#x6211;&#x5199;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5DE5;&#x4F5C;&#x4ECE;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x5F97;&#x5230;&#x4E86;&#x6574;&#x4E2A;&#x793E;&#x533A;&#x7684;&#x9F13;&#x52B1;&#x3001;&#x6B22;&#x547C;&#x3001;&#x652F;&#x6301;&#x4E0E;&#x5956;&#x52B1;&#x3002;&#x6700;&#x91CD;&#x8981;&#x7684;&#x662F;&#xFF0C;&#x8FD9;&#x672C;&#x4E66;&#x8BA9;&#x6211;2&#x5E74;&#x6765;&#x6210;&#x4E3A;&#x8FD9;&#x4E2A;&#x6781;&#x597D;&#x793E;&#x533A;&#x7684;&#x4E00;&#x90E8;&#x5206;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x7528;&#x8A00;&#x8BED;&#x8868;&#x8FBE;&#x4F60;&#x4EEC;&#x63A5;&#x7EB3;&#x6211;&#x6210;&#x4E3A;&#x793E;&#x533A;&#x6210;&#x5458;&#x7684;&#x611F;&#x8C22;&#x4E4B;&#x60C5;&#x3002;&#x8FD9;&#x5199;&#x4E66;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#x6709;&#x592A;&#x591A;&#x7684;&#x4EBA;&#x9700;&#x8981;&#x611F;&#x8C22;&#xFF0C;&#x4EE5;&#x81F3;&#x65E0;&#x6CD5;&#x4E00;&#x4E00;&#x5217;&#x4E3E;&#xFF0C;&#x8FD9;&#x4E9B;&#x4EBA;&#x5305;&#x62EC;&#x6211;&#x5728;&#x4F1A;&#x8BAE;&#x3001;&#x91CD;&#x5927;&#x4E8B;&#x4EF6;&#x3001;&#x7814;&#x8BA8;&#x4F1A;&#x3001;&#x805A;&#x4F1A;&#x3001;&#x6BD4;&#x8428;&#x805A;&#x4F1A;&#x4EE5;&#x53CA;&#x5C0F;&#x578B;&#x79C1;&#x4EBA;&#x96C6;&#x4F1A;&#x9047;&#x5230;&#x7684;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x6709;&#x90A3;&#x4E9B;&#x5728;Twitter&#x3001;reddit&#x3001;bitcointalk.org&#x4EE5;&#x53CA;GitHub&#x4E0A;&#x4E0E;&#x6211;&#x8054;&#x7CFB;&#xFF0C;&#x5E76;&#x5BF9;&#x672C;&#x4E66;&#x6210;&#x7A3F;&#x6709;&#x5F71;&#x54CD;&#x7684;&#x4EBA;&#x3002;&#x4F60;&#x5728;&#x672C;&#x4E66;&#x4E2D;&#x627E;&#x5230;&#x7684;&#x6BCF;&#x4E2A;&#x60F3;&#x6CD5;&#x3001;&#x7C7B;&#x6BD4;&#x3001;&#x95EE;&#x9898;&#x3001;&#x56DE;&#x7B54;&#x4EE5;&#x53CA;&#x89E3;&#x91CA;&#xFF0C;&#x90FD;&#x662F;&#x5728;&#x6211;&#x4E0E;&#x793E;&#x533A;&#x4EBA;&#x5458;&#x6C9F;&#x901A;&#x4EA4;&#x6D41;&#x65F6;&#x4EA7;&#x751F;&#x7684;&#xFF0C;&#x5E76;&#x5F97;&#x5230;&#x9A8C;&#x8BC1;&#x548C;&#x4F18;&#x5316;&#x7684;&#x7ED3;&#x679C;&#x3002;&#x8C22;&#x8C22;&#x6240;&#x6709;&#x652F;&#x6301;&#x8FC7;&#x6211;&#x7684;&#x4EBA;&#xFF0C;&#x6CA1;&#x6709;&#x4F60;&#x4EEC;&#x7684;&#x652F;&#x6301;&#x5C06;&#x4E0D;&#x4F1A;&#x6709;&#x8FD9;&#x672C;&#x4E66;&#x7684;&#x5B58;&#x5728;&#x3002;&#x5BF9;&#x6B64;&#xFF0C;&#x6211;&#x5C06;&#x6C38;&#x8FDC;&#x5FC3;&#x5B58;&#x611F;&#x6FC0;&#x3002;</p>
<p>&#x5F53;&#x7136;&#xFF0C;&#x6211;&#x662F;&#x7ECF;&#x8FC7;&#x4E86;&#x5F88;&#x957F;&#x4E00;&#x6BB5;&#x65F6;&#x95F4;&#x624D;&#x6210;&#x4E3A;&#x4F5C;&#x5BB6;&#x5E76;&#x7F16;&#x5199;&#x4E86;&#x7B2C;&#x4E00;&#x672C;&#x4E66;&#x3002;&#x6211;&#x7684;&#x7B2C;&#x4E00;&#x8BED;&#x8A00;&#x662F;&#xFF08;&#x5B66;&#x6821;&#x6559;&#x80B2;&#xFF09;&#x5E0C;&#x814A;&#x8BED;&#xFF0C;&#x56E0;&#x6B64;&#x6211;&#x9700;&#x8981;&#x5728;&#x5927;&#x5B66;&#x4E00;&#x5E74;&#x7EA7;&#x65F6;&#x63A5;&#x53D7;&#x82F1;&#x8BED;&#x5199;&#x4F5C;&#x8865;&#x4E60;&#x8BFE;&#x7A0B;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x82F1;&#x8BED;&#x5199;&#x4F5C;&#x8001;&#x5E08;Diana Kordas&#xFF0C;&#x90A3;&#x5E74;&#x662F;&#x4ED6;&#x5E2E;&#x52A9;&#x6211;&#x5EFA;&#x7ACB;&#x4E86;&#x81EA;&#x4FE1;&#x548C;&#x5199;&#x4F5C;&#x6280;&#x80FD;&#x3002;&#x968F;&#x540E;&#xFF0C;&#x4F5C;&#x4E3A;&#x6559;&#x6388;&#xFF0C;&#x5728;&#x4E3A;&#x300A;<em>NetworkWor</em>ld&#x300B;&#x6742;&#x5FD7;&#x64B0;&#x7A3F;&#x65F6;&#xFF0C;&#x6211;&#x63D0;&#x5347;&#x4E86;&#x81EA;&#x5DF1;&#x5728;&#x6570;&#x636E;&#x4E2D;&#x5FC3;&#x65B9;&#x9762;&#x7684;&#x5199;&#x4F5C;&#x6280;&#x80FD;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;John Dix and John Gallant&#xFF0C;&#x4ED6;&#x4EEC;&#x7ED9;&#x4E86;&#x6211;&#x7B2C;&#x4E00;&#x4EFD;&#x5199;&#x4F5C;&#x65B9;&#x9762;&#x7684;&#x5DE5;&#x4F5C;&#xFF0C;&#x8BA9;&#x6211;&#x6210;&#x4E3A;&#x300A;<em>Network Wor</em>ld&#x300B;&#x6742;&#x5FD7;&#x7684;&#x4E13;&#x680F;&#x4F5C;&#x8005;&#xFF0C;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x7F16;&#x8F91;Michael Cooney&#x548C;&#x6211;&#x7684;&#x540C;&#x4E8B;Johna Till Johnson&#xFF0C;&#x662F;&#x4ED6;&#x4EEC;&#x5E2E;&#x6211;&#x7F16;&#x8F91;&#x6211;&#x7684;&#x4E13;&#x680F;&#x6587;&#x7AE0;&#xFF0C;&#x8BA9;&#x5B83;&#x4EEC;&#x5F97;&#x4EE5;&#x53D1;&#x8868;&#x3002;&#x56DB;&#x5E74;&#x6BCF;&#x5468;500&#x5B57;&#x7684;&#x5199;&#x4F5C;&#x7ECF;&#x9A8C;&#x6700;&#x7EC8;&#x7ED9;&#x4E86;&#x6211;&#x8DB3;&#x591F;&#x7684;&#x4FE1;&#x5FC3;&#x6210;&#x4E3A;&#x4E00;&#x540D;&#x4F5C;&#x5BB6;&#x3002;</p>
<p> &#x8FD8;&#x8981;&#x611F;&#x8C22;&#x90A3;&#x4E9B;&#x5728;&#x6211;&#x63D0;&#x4EA4;&#x672C;&#x4E66;&#x7A3F;&#x4EF6;&#x81F3; O&#x2019;Reilly&#x51FA;&#x7248;&#x793E;&#x65F6;&#x90A3;&#x4E9B;&#x5E2E;&#x52A9;&#x8FC7;&#x6211;&#x7684;&#x4EBA;&#xFF0C;&#x4ED6;&#x4EEC;&#x4E3A;&#x6211;&#x63D0;&#x4F9B;&#x53C2;&#x8003;&#x548C;&#x7A3F;&#x4EF6;&#x5BA1;&#x9605;&#x3002;&#x7279;&#x522B;&#x8981;&#x611F;&#x8C22;JohnGallant&#x3001;Gregory Ness&#x3001;Richard Stiennon&#x3001;Joel Snyder&#x3001;Adam B. Levine&#x3001;Sandra Gittlen&#x3001;John Dix&#x3001;Johna Till Johnson&#x3001;Roger Ver&#x4EE5;&#x53CA;Jon Matonis&#x3002;&#x7279;&#x522B;&#x611F;&#x8C22;Richard Kagan&#x3001;Tymon Mattoszko&#x548C;Matthew Taylor&#xFF0C;Richard Kagan&#x3001;Tymon Mattoszko&#x5E2E;&#x6211;&#x5BA1;&#x9605;&#x4E86;&#x672C;&#x4E66;&#x65E9;&#x671F;&#x7A3F;&#x4EF6;&#xFF0C;MatthewTaylor&#x5E2E;&#x6211;&#x4FEE;&#x6539;&#x4E86;&#x7A3F;&#x4EF6;&#x3002;</p>
<p> &#x611F;&#x8C22;&#x300A;<em>DNS and BIND</em>&#x300B;&#x7684;&#x4F5C;&#x8005;Cricket Liu&#xFF0C;&#x662F;&#x4ED6;&#x5C06;&#x6211;&#x4ECB;&#x7ECD;&#x7ED9;&#x4E86;O&#x2019;Reilly&#x51FA;&#x7248;&#x793E;&#x3002;&#x8FD8;&#x8981;&#x611F;&#x8C22;O&#x2019;Reilly &#x7684;Michael Loukides&#x548C;Allyson MacDonald&#xFF0C;&#x662F;&#x4ED6;&#x4EEC;&#x82B1;&#x8D39;&#x6570;&#x6708;&#x65F6;&#x95F4;&#x5E2E;&#x52A9;&#x51FA;&#x7248;&#x672C;&#x4E66;&#x3002;&#x5F53;&#x6700;&#x7EC8;&#x7A3F;&#x4EF6;&#x56E0;&#x4E3A;&#x79CD;&#x79CD;&#x539F;&#x56E0;&#x672A;&#x6309;&#x8BA1;&#x5212;&#x63D0;&#x4EA4;&#x800C;&#x9519;&#x8FC7;&#x51FA;&#x7248;&#x622A;&#x6B62;&#x65E5;&#x671F;&#x65F6;&#xFF0C;Allyson&#x8868;&#x73B0;&#x5730;&#x7279;&#x522B;&#x8010;&#x5FC3;&#x3002;&#x5BF9;&#x4E8E;&#x7B2C;2&#x7248;&#xFF0C;&#x6211;&#x8981;&#x611F;&#x8C22;Timothy McGovern&#x7684;&#x5168;&#x7A0B;&#x6307;&#x5BFC;&#x3001;Kim Cofer&#x7684;&#x8010;&#x5FC3;&#x7F16;&#x8F91;&#x4EE5;&#x53CA; RebeccaPanzer&#x5E2E;&#x52A9;&#x63D2;&#x5165;&#x4E86;&#x8BB8;&#x591A;&#x65B0;&#x56FE;&#x8868;&#x3002;</p>
<p> &#x6700;&#x521D;&#x7684;&#x4E00;&#x4E9B;&#x7AE0;&#x8282;&#x7684;&#x8349;&#x7A3F;&#x662F;&#x6700;&#x96BE;&#x5199;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x56E0;&#x4E3A;&#x6BD4;&#x7279;&#x5E01;&#x4E00;&#x4E2A;&#x5F88;&#x96BE;&#x8BF4;&#x6E05;&#x695A;&#x7684;&#x4E3B;&#x9898;&#x3002;&#x6BCF;&#x6B21;&#x6211;&#x7814;&#x7A76;&#x6BD4;&#x7279;&#x5E01;&#x4E2D;&#x67D0;&#x4E2A;&#x4E3B;&#x9898;&#x65F6;&#xFF0C;&#x6211;&#x8FD8;&#x5F97;&#x8003;&#x8651;&#x6574;&#x4F53;&#x7684;&#x6280;&#x672F;&#x5185;&#x5BB9;&#x3002;&#x5F53;&#x6211;&#x52AA;&#x529B;&#x60F3;&#x5C06;&#x4E3B;&#x9898;&#x8BF4;&#x5F97;&#x7B80;&#x5355;&#x6613;&#x61C2;&#xFF0C;&#x56F4;&#x7ED5;&#x8FD9;&#x6837;&#x4E00;&#x4E2A;&#x5BC6;&#x96C6;&#x578B;&#x6280;&#x672F;&#x4E3B;&#x9898;&#x5C55;&#x5F00;&#x53D9;&#x8FF0;&#x65F6;&#xFF0C;&#x6211;&#x4E0D;&#x65AD;&#x5730;&#x88AB;&#x5361;&#x4F4F;&#x5E76;&#x6709;&#x70B9;&#x6CAE;&#x4E27;&#x3002;&#x6700;&#x7EC8;&#xFF0C;&#x6211;&#x51B3;&#x5B9A;&#x4EE5;&#x8BB2;&#x8FF0;&#x4EBA;&#x4EEC;&#x4F7F;&#x7528;&#x6BD4;&#x7279;&#x5E01;&#x7684;&#x6545;&#x4E8B;&#x4E3A;&#x4E3B;&#x7EBF;&#x6765;&#x7F16;&#x5199;&#x672C;&#x4E66;&#xFF0C;&#x4ECE;&#x800C;&#x8BA9;&#x6211;&#x53EF;&#x4EE5;&#x8F7B;&#x677E;&#x5730;&#x7F16;&#x5199;&#x672C;&#x4E66;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;&#x6211;&#x7684;&#x5BFC;&#x5E08;&#x517C;&#x670B;&#x53CB;&#xFF0C;Richard Kagan&#xFF0C;&#x662F;&#x4ED6;&#x5E2E;&#x52A9;&#x6211;&#x60F3;&#x5230;&#x4E86;&#x4EE5;&#x6545;&#x4E8B;&#x65B9;&#x5F0F;&#x6765;&#x7F16;&#x5199;&#x6B64;&#x4E66;&#xFF0C;&#x8BA9;&#x6211;&#x8DE8;&#x8FC7;&#x4E86;&#x7F16;&#x8005;&#x7684;&#x963B;&#x788D;&#x3002;&#x6211;&#x8981;&#x611F;&#x8C22;PamelaMorgan&#xFF0C;&#x4ED6;&#x5BA1;&#x9605;&#x4E86;&#x672C;&#x4E66;&#x7B2C;&#x4E00;&#x7248;&#x4E0E;&#x7B2C;&#x4E8C;&#x7248;&#x7684;&#x65E9;&#x671F;&#x8349;&#x7A3F;&#x7684;&#x6BCF;&#x4E2A;&#x7AE0;&#x8282;&#xFF0C;&#x5E76;&#x4E14;&#x63D0;&#x51FA;&#x4E86;&#x5F88;&#x597D;&#x7684;&#x6539;&#x8FDB;&#x610F;&#x89C1;&#xFF0C;&#x8BA9;&#x672C;&#x4E66;&#x5185;&#x5BB9;&#x8D28;&#x91CF;&#x66F4;&#x9AD8;&#x3002;&#x540C;&#x65F6;&#xFF0C;&#x8FD8;&#x8981;&#x611F;&#x8C22;San Francisco&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x53D1;&#x8005;&#x7EC4;&#x7EC7;&#x5C0F;&#x7EC4;&#xFF0C;&#x8FD8;&#x8981;&#x611F;&#x8C22;&#x5E2E;&#x52A9;&#x6D4B;&#x8BD5;&#x65E9;&#x671F;&#x6750;&#x6599;&#x7684;TaariqLewis&#x548C;Denise Terry&#x3002;&#x611F;&#x8C22;Andrew Naugler&#x5E2E;&#x52A9;&#x8BBE;&#x8BA1;&#x4FE1;&#x606F;&#x56FE;&#x6807;&#x3002;</p>
<p> &#x5728;&#x672C;&#x4E66;&#x7F16;&#x5199;&#x7684;&#x8FC7;&#x7A0B;&#x4E2D;&#xFF0C;&#x6211;&#x5728;GitHub&#x4E0A;&#x5236;&#x4F5C;&#x4E86;&#x65E9;&#x671F;&#x8349;&#x7A3F;&#xFF0C;&#x7136;&#x540E;&#x9080;&#x8BF7;&#x516C;&#x4F17;&#x5BF9;&#x5176;&#x8FDB;&#x884C;&#x8BC4;&#x8BBA;&#x3002;&#x6536;&#x5230;&#x4E86;100&#x591A;&#x6761;&#x8BC4;&#x8BBA;&#x3001;&#x5EFA;&#x8BAE;&#x3001;&#x4FEE;&#x6539;&#x548C;&#x6350;&#x8D60;&#x7B49;&#x65B9;&#x9762;&#x7684;&#x56DE;&#x5E94;&#x3002;&#x90A3;&#x4E9B;&#x6350;&#x52A9;&#x8005;&#x5728;&#x6587;&#x672B;&#x7684;&#x65E9;&#x671F;&#x53D1;&#x5E03;&#x8349;&#x7A3F;&#x7684;GitHub&#x6350;&#x52A9;&#x8005;&#x4E2D;&#x8FDB;&#x884C;&#x4E86;&#x516C;&#x5E03;&#xFF0C;&#x5E76;&#x8868;&#x8FBE;&#x4E86;&#x6211;&#x7684;&#x611F;&#x8C22;&#x4E4B;&#x60C5;&#x3002;&#x771F;&#x8BDA;&#x5730;&#x611F;&#x8C22;&#x6211;&#x7684;GiuHub&#x81EA;&#x613F;&#x8005;&#x7F16;&#x8F91;Ming T. Nguyen (&#x7B2C;1&#x7248;&#x7F16;&#x8F91;) and Will Binns (&#x7B2C;2&#x7248;&#x7F16;&#x8F91;)&#xFF0C;&#x4ED6;&#x4EEC;&#x4E0D;&#x8F9E;&#x8F9B;&#x52B3;&#x5730;&#x7EC4;&#x7EC7;&#x3001;&#x7BA1;&#x7406;&#x548C;&#x89E3;&#x51B3;GitHub&#x4E0A;&#x7684;pull requests&#x3001;issue reports&#xFF0C;&#x5E76;&#x4E14;&#x6267;&#x884C;bug&#x4FEE;&#x590D;&#x5DE5;&#x4F5C;&#x3002;</p>
<p> &#x5F53;&#x5B8C;&#x6210;&#x8349;&#x7A3F;&#x64B0;&#x5199;&#x540E;&#xFF0C;&#x672C;&#x4E66;&#x7ECF;&#x5386;&#x4E86;&#x591A;&#x8F6E;&#x6280;&#x672F;&#x5BA1;&#x9605;&#x4E0E;&#x4FEE;&#x6539;&#x3002;&#x611F;&#x8C22;Cricket Liu&#x548C;Lorne Lantz&#x7684;&#x5168;&#x7A0B;&#x5BA1;&#x9605;&#x3001;&#x8BC4;&#x8BBA;&#x548C;&#x652F;&#x6301;&#x3002;</p>
<p> &#x8BB8;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x5F00;&#x53D1;&#x8005;&#x8D21;&#x732E;&#x4E86;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x3001;&#x5BA1;&#x9605;&#x3001;&#x8BC4;&#x8BBA;&#x548C;&#x9F13;&#x52B1;&#x3002;&#x611F;&#x8C22;Amir Taaki&#x548C;Eric Voskuil&#x63D0;&#x4F9B;&#x4E86;&#x793A;&#x4F8B;&#x4EE3;&#x7801;&#x7247;&#x6BB5;&#x548C;&#x8BB8;&#x591A;&#x5F88;&#x597D;&#x7684;&#x8BC4;&#x8BBA;&#x3002;Chris Kleeschulte&#x7F16;&#x5199;&#x4E86;BitCore&#x9644;&#x5F55;&#x90E8;&#x5206;&#xFF1B;Vitalik Buterin&#x548C;Richard Kiss&#x5E2E;&#x52A9;&#x63D0;&#x4F9B;&#x692D;&#x5706;&#x66F2;&#x7EBF;&#x6570;&#x5B66;&#x89E3;&#x6790;&#x548C;&#x5B9E;&#x73B0;&#x4EE3;&#x7801;&#xFF1B;&#x611F;&#x8C22;GavinAndresen&#x5BF9;&#x672C;&#x4E66;&#x7684;&#x4FEE;&#x8BA2;&#x3001;&#x8BC4;&#x8BBA;&#x548C;&#x652F;&#x6301;&#xFF1B;&#x611F;&#x8C22; Michalis Kargakis&#x7684;&#x8BC4;&#x8BBA;&#x3001;&#x6350;&#x8D60;&#x548C;btcd&#x7B80;&#x4ECB;&#xFF1B;&#x611F;&#x8C22;Robin Inge&#x5BF9;&#x672C;&#x4E66;&#x7684;&#x52D8;&#x8BEF;&#xFF0C;&#x6539;&#x8FDB;&#x4E86;&#x7B2C;2&#x7248;&#x7684;&#x5370;&#x5237;&#x6548;&#x679C;&#x3002;&#x5728;&#x7B2C;2&#x7248;&#x4E2D;&#xFF0C;&#x6211;&#x518D;&#x6B21;&#x6536;&#x5230;&#x4E86;&#x5F88;&#x591A;&#x6BD4;&#x7279;&#x5E01;&#x6838;&#x5FC3;&#x5F00;&#x53D1;&#x4EBA;&#x5458;&#x7684;&#x5E2E;&#x52A9;&#xFF0C;&#x5305;&#x62EC;&#x8BA9;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x901A;&#x4FD7;&#x6613;&#x61C2;&#x7684;Eric Lombrozo&#xFF0C;&#x5E2E;&#x52A9;&#x6539;&#x8FDB;&#x4EA4;&#x6613;&#x7AE0;&#x8282;&#x7684;Luke-Jr&#xFF0C;&#x5E2E;&#x52A9;&#x5BA1;&#x9605;&#x9694;&#x79BB;&#x89C1;&#x8BC1;&#x548C;&#x5176;&#x4ED6;&#x7AE0;&#x8282;&#x7684;JohnsonLau&#xFF0C;&#x8FD8;&#x6709;&#x5176;&#x4ED6;&#x5F88;&#x591A;&#x8981;&#x611F;&#x8C22;&#x7684;&#x5F00;&#x53D1;&#x8005;&#x3002;&#x6211;&#x6DF1;&#x6DF1;&#x5730;&#x611F;&#x8C22;&#x5E2E;&#x52A9;&#x89E3;&#x91CA;&#x95EA;&#x7535;&#x7F51;&#x7EDC;&#x7684;Joseph Poon&#x3001;Tadge Dryja&#x548C;Olaoluwa Osuntokun&#xFF0C;&#x4ED6;&#x4EEC;&#x8FD8;&#x5E2E;&#x52A9;&#x6211;&#x5BA1;&#x9605;&#x4E86;&#x6211;&#x7684;&#x6587;&#x7AE0;&#xFF0C;&#x5E2E;&#x52A9;&#x6211;&#x89E3;&#x7B54;&#x4E86;&#x6211;&#x65E0;&#x6CD5;&#x56DE;&#x7B54;&#x7684;&#x95EE;&#x9898;&#x3002;</p>
<p> &#x6211;&#x5C06;&#x6211;&#x7684;&#x4E66;&#x548C;&#x6DF1;&#x7231;&#x4E4B;&#x8BCD;&#x732E;&#x7ED9;&#x6211;&#x4EB2;&#x7231;&#x7684;&#x6BCD;&#x4EB2;Theresa&#xFF0C;&#x5979;&#x5728;&#x6211;&#x4EEC;&#x4F4F;&#x7684;&#x623F;&#x5B50;&#x4E2D;&#x7684;&#x6BCF;&#x9762;&#x5899;&#x4E0A;&#x653E;&#x6EE1;&#x4E86;&#x4E66;&#x7C4D;&#x3002;&#x5C3D;&#x7BA1;&#x81EA;&#x8BA4;&#x4E3A;&#x662F;&#x79D1;&#x6280;&#x4EA7;&#x54C1;&#x6392;&#x65A5;&#x7740;&#xFF0C;&#x6211;&#x6BCD;&#x4EB2;&#x8FD8;&#x5728;1982&#x5E74;&#x7ED9;&#x6211;&#x4E70;&#x4E86;&#x7B2C;&#x4E00;&#x53F0;&#x7535;&#x8111;&#x3002;&#x6211;&#x7684;&#x7236;&#x4EB2;Menelaos&#x662F;&#x4E00;&#x540D;&#x571F;&#x6728;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x521A;&#x5728;80&#x5C81;&#x65F6;&#x51FA;&#x7248;&#x4E86;&#x4ED6;&#x7684;&#x7B2C;&#x4E00;&#x672C;&#x4E66;&#xFF0C;&#x6211;&#x7684;&#x7236;&#x4EB2;&#x662F;&#x4E00;&#x540D;&#x79D1;&#x6280;&#x548C;&#x5DE5;&#x7A0B;&#x6280;&#x672F;&#x7231;&#x597D;&#x8005;&#xFF0C;&#x4ED6;&#x6559;&#x4F1A;&#x4E86;&#x6211;&#x903B;&#x8F91;&#x601D;&#x8003;&#x4E0E;&#x5206;&#x6790;&#x3002;</p>
<p> &#x611F;&#x8C22;&#x5728;&#x5199;&#x4E66;&#x8FC7;&#x7A0B;&#x4E2D;&#x6240;&#x6709;&#x652F;&#x6301;&#x6211;&#x7684;&#x4EBA;&#x3002;</p>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                <a href="trans-preface.html" class="navigation navigation-prev " aria-label="Previous page: 译者序">
                    <i class="fa fa-angle-left"></i>
                </a>
                
                
                <a href="second_edition_changes.html" class="navigation navigation-next " aria-label="Next page: 第二版更新内容">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"序言","level":"1.4","depth":1,"next":{"title":"第二版更新内容","level":"1.5","depth":1,"path":"second_edition_changes.md","ref":"second_edition_changes.md","articles":[]},"previous":{"title":"译者序","level":"1.3","depth":1,"path":"trans-preface.md","ref":"trans-preface.md","articles":[]},"dir":"ltr"},"config":{"gitbook":"*","theme":"default","variables":{},"plugins":["livereload"],"pluginsConfig":{"livereload":{},"highlight":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"sharing":{"facebook":true,"twitter":true,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"fontsettings":{"theme":"white","family":"sans","size":2},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"}},"file":{"path":"preface.md","mtime":"2018-12-14T06:26:05.590Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2018-12-14T06:30:25.129Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

